[
    {
        "start": 0.16,
        "end": 12.32,
        "text": "Welcome to my channel, The English Grammar Doctor. Have you ever felt like nobody understands your heart? Have you ever looked at the stars and felt",
        "textdich": ""
    },
    {
        "start": 9.04,
        "end": 19.76,
        "text": "something you can't explain? Today, I will tell you a story that teaches us how to see with the heart, not with the",
        "textdich": ""
    },
    {
        "start": 16.72,
        "end": 27.039,
        "text": "eyes. It's called the little prince, and it will help you learn English in a way that also helps you understand life.",
        "textdich": ""
    },
    {
        "start": 24.64,
        "end": 39.36,
        "text": "Tell me in the comments, do you believe children see the world better than adults? Chapter one hat. When I was 6 years old, I saw a picture in a book.",
        "textdich": ""
    },
    {
        "start": 36.719,
        "end": 47.76,
        "text": "The picture was of a big snake. The snake ate a whole animal. The book said, \"Snakes eat the animal and then sleep",
        "textdich": ""
    },
    {
        "start": 44.559,
        "end": 49.92,
        "text": "for 6 months.\" I looked at the picture.",
        "textdich": ""
    },
    {
        "start": 47.76,
        "end": 61.12,
        "text": "I thought it was very interesting. I like to imagine life in the jungle. I wanted to draw something too. So I made my first drawing. In my drawing, the",
        "textdich": ""
    },
    {
        "start": 58.719,
        "end": 70.159,
        "text": "snake ate an elephant. The shape was long and round. I showed my picture to adults. I asked them, \"Does this picture",
        "textdich": ""
    },
    {
        "start": 67.2,
        "end": 76.24,
        "text": "scare you?\" But they said, \"Why should we be scared of a hat?\" I was confused.",
        "textdich": ""
    },
    {
        "start": 73.6,
        "end": 85.04,
        "text": "My drawing was not a hat. It was a snake who ate an elephant. But adults did not see it. They only saw a hat. I wanted to",
        "textdich": ""
    },
    {
        "start": 82.08,
        "end": 93.119,
        "text": "help them understand. So, I made another drawing. In this picture, I drew the inside of the snake. You could see the",
        "textdich": ""
    },
    {
        "start": 90.32,
        "end": 98.88,
        "text": "elephant inside. I called this picture number two. But the adults did not care.",
        "textdich": ""
    },
    {
        "start": 96.56,
        "end": 106.88,
        "text": "They told me to stop drawing. They said it was better to study geography, math, history, and grammar. I was very sad. I",
        "textdich": ""
    },
    {
        "start": 104.799,
        "end": 116.64,
        "text": "stopped drawing. I wanted to be an artist, but the adults didn't understand my pictures. So I listened to them. I",
        "textdich": ""
    },
    {
        "start": 113.52,
        "end": 125.04,
        "text": "chose another job. I became a pilot. I flew planes. I flew in many countries. I saw many places. I met many people. I",
        "textdich": ""
    },
    {
        "start": 122.56,
        "end": 134.959,
        "text": "had to learn geography. It helped me fly my plane in the right direction. Even after many years, I still met many adults. I talked to them. But I saw",
        "textdich": ""
    },
    {
        "start": 132.0,
        "end": 137.36,
        "text": "something. Most adults were serious.",
        "textdich": ""
    },
    {
        "start": 134.959,
        "end": 145.68,
        "text": "They talked about numbers and work. They didn't talk about stars or forests or love. When I met an adult who seemed",
        "textdich": ""
    },
    {
        "start": 142.4,
        "end": 148.319,
        "text": "normal, I showed them my old picture.",
        "textdich": ""
    },
    {
        "start": 145.68,
        "end": 155.519,
        "text": "Picture number one. I always kept it with me. I wanted to see if the person could really understand something deep.",
        "textdich": ""
    },
    {
        "start": 152.959,
        "end": 163.04,
        "text": "But every time the person said, \"It's a hat.\" Then I knew that this person was not someone I could talk to. I did not",
        "textdich": ""
    },
    {
        "start": 160.319,
        "end": 171.04,
        "text": "speak about big snakes or stars. I just talked about simple things like money, golf or bridges. And then the adult was",
        "textdich": ""
    },
    {
        "start": 168.4,
        "end": 181.44,
        "text": "happy because I talked like an adult, like a reasonable man. So for many years, I lived alone. I didn't have anyone to really talk to. I kept my",
        "textdich": ""
    },
    {
        "start": 178.16,
        "end": 186.879,
        "text": "thoughts inside. But one day everything changed. I was flying over the desert.",
        "textdich": ""
    },
    {
        "start": 184.159,
        "end": 189.12,
        "text": "Suddenly my plane had a problem.",
        "textdich": ""
    },
    {
        "start": 186.879,
        "end": 196.879,
        "text": "Something in the engine broke. I was alone. There was no mechanic with me. no other person. I had to fix the plane by",
        "textdich": ""
    },
    {
        "start": 194.48,
        "end": 207.04,
        "text": "myself. It was very difficult. I was in the Sahara Desert. There were no people, no houses, no roads, just sand. I only",
        "textdich": ""
    },
    {
        "start": 203.76,
        "end": 210.08,
        "text": "had a little water, enough for one week.",
        "textdich": ""
    },
    {
        "start": 207.04,
        "end": 219.12,
        "text": "I had to work fast. If I didn't fix the plane, I could die. I felt scared. I was alone in the middle of the desert. That",
        "textdich": ""
    },
    {
        "start": 216.56,
        "end": 230.239,
        "text": "night, I slept on the sand. It was very quiet. I was far from everything, a thousand miles away from any city or village. It felt like I was on another",
        "textdich": ""
    },
    {
        "start": 226.319,
        "end": 241.92,
        "text": "planet. I closed my eyes and slept. I didn't know that my life was going to change forever. The next morning, chapter 2. Sheep. The sun was just",
        "textdich": ""
    },
    {
        "start": 239.28,
        "end": 249.12,
        "text": "rising. I was still sleeping on the sand. I was alone in the big desert.",
        "textdich": ""
    },
    {
        "start": 245.2,
        "end": 251.439,
        "text": "There was no village, no road, no house.",
        "textdich": ""
    },
    {
        "start": 249.12,
        "end": 261.04,
        "text": "I was more alone than a man in a small boat in the middle of the ocean. But then something very strange happened. A",
        "textdich": ""
    },
    {
        "start": 257.28,
        "end": 270.24,
        "text": "quiet voice woke me up. It said, \"Please draw me a sheep.\" I opened my eyes quickly. I was shocked. I looked around",
        "textdich": ""
    },
    {
        "start": 267.199,
        "end": 279.44,
        "text": "and I saw a little boy, a very small boy. He had golden hair. He was standing in front of me. He looked calm. He",
        "textdich": ""
    },
    {
        "start": 276.479,
        "end": 281.199,
        "text": "didn't look scared. He didn't look lost.",
        "textdich": ""
    },
    {
        "start": 279.44,
        "end": 293.6,
        "text": "He was just standing there and looking at me. He said again, \"Draw me a sheep.\" His voice was soft. His eyes were serious. I stared at him. I was a",
        "textdich": ""
    },
    {
        "start": 290.56,
        "end": 304.08,
        "text": "thousand miles away from any person. I didn't understand. I asked him, \"What are you doing here?\" But he didn't answer my question. He only said, \"Draw",
        "textdich": ""
    },
    {
        "start": 302.479,
        "end": 310.479,
        "text": "me a sheep.\" I felt surprised, but I didn't know why.",
        "textdich": ""
    },
    {
        "start": 308.24,
        "end": 318.24,
        "text": "Something in his face was different. It was not like other people. I wanted to say more, but I remembered. I am not an",
        "textdich": ""
    },
    {
        "start": 315.919,
        "end": 328.0,
        "text": "artist. I stopped drawing when I was six. I could only draw two things. A snake from the outside and a snake from the inside. So, I showed him my old",
        "textdich": ""
    },
    {
        "start": 325.6,
        "end": 331.039,
        "text": "picture, the one that looked like a hat.",
        "textdich": ""
    },
    {
        "start": 328.0,
        "end": 335.44,
        "text": "He looked at it and said, \"No, no, no. I don't want a snake who ate an elephant.",
        "textdich": ""
    },
    {
        "start": 332.96,
        "end": 347.039,
        "text": "That's too scary. And an elephant is too big. I want a sheep. Where I live, everything is very small. So I tried again. I drew a sheep. He looked at it",
        "textdich": ""
    },
    {
        "start": 344.4,
        "end": 357.6,
        "text": "and said, \"This sheep looks very sick. I don't want a sick sheep.\" So I drew another one. He said, \"This one has horns. That's not a sheep. That's a",
        "textdich": ""
    },
    {
        "start": 353.68,
        "end": 365.52,
        "text": "ram.\" I tried again. He said, \"This sheep is too old. I want a young sheep that can live a long time. I didn't know",
        "textdich": ""
    },
    {
        "start": 363.039,
        "end": 375.44,
        "text": "what to do. I was tired. I wanted to fix my engine. So, I quickly drew a small box. I said, \"This is a box. Your sheep",
        "textdich": ""
    },
    {
        "start": 372.56,
        "end": 383.84,
        "text": "is inside the box.\" He looked at the box for a moment. Then his face lit up. He was very happy. He said, \"Yes, this is",
        "textdich": ""
    },
    {
        "start": 380.96,
        "end": 394.319,
        "text": "perfect. This is just what I wanted. Do you think this sheep will need a lot of grass?\" I said, \"Why do you ask?\" He answered, \"Because where I live",
        "textdich": ""
    },
    {
        "start": 391.36,
        "end": 404.08,
        "text": "everything is very small.\" I smiled and said, \"Don't worry. I gave you a very small sheep.\" He looked at the picture",
        "textdich": ""
    },
    {
        "start": 400.24,
        "end": 415.039,
        "text": "again and said, \"It's sleeping now.\" And I looked at him. I didn't understand what was happening, but I knew this moment was special. I felt something",
        "textdich": ""
    },
    {
        "start": 411.52,
        "end": 424.4,
        "text": "warm in my heart. That is how I met the little prince. Chapter 3. Planet I didn't know where the little prince came",
        "textdich": ""
    },
    {
        "start": 421.52,
        "end": 433.36,
        "text": "from, but I wanted to know. He didn't answer questions directly. He asked many questions, but he almost never answered",
        "textdich": ""
    },
    {
        "start": 429.599,
        "end": 441.12,
        "text": "mine. Still, little by little, I started to understand him. He said something one day that helped me learn more. He looked",
        "textdich": ""
    },
    {
        "start": 438.4,
        "end": 450.4,
        "text": "at my airplane and said, \"What is this thing?\" I told him, \"It's not just a thing. It's my plane. It flies in the",
        "textdich": ""
    },
    {
        "start": 447.44,
        "end": 463.759,
        "text": "sky. I felt a little proud when I said that. He looked at me and asked, \"Oh, you fell from the sky?\" \"Yes,\" I answered. He laughed a soft, clear",
        "textdich": ""
    },
    {
        "start": 459.919,
        "end": 470.72,
        "text": "laugh. He said, \"So, you also came from the sky like me?\" \"That made me stop.",
        "textdich": ""
    },
    {
        "start": 467.36,
        "end": 482.0,
        "text": "That sentence like me was important. It was different. It was a clue.\" I asked quickly, \"Do you come from another planet?\" But he didn't answer.",
        "textdich": ""
    },
    {
        "start": 479.36,
        "end": 484.0,
        "text": "He just looked down and nodded a little.",
        "textdich": ""
    },
    {
        "start": 482.0,
        "end": 492.56,
        "text": "Then he looked again at my plane and said, \"Of course, with that thing, you couldn't have come very far. He became",
        "textdich": ""
    },
    {
        "start": 490.0,
        "end": 500.72,
        "text": "quiet again. He took the picture of the box with the sheep from his pocket. He looked at it for a long time. He was",
        "textdich": ""
    },
    {
        "start": 497.599,
        "end": 510.56,
        "text": "thinking, I could see it.\" Then I asked him very gently, \"Where do you come from? Where's your home? Where do you want to take the sheep?\" He didn't",
        "textdich": ""
    },
    {
        "start": 507.52,
        "end": 519.039,
        "text": "answer at once, but then he said, \"It's good that the sheep has a box. At night, it can be its house.\" I said, \"Yes, of",
        "textdich": ""
    },
    {
        "start": 515.919,
        "end": 521.44,
        "text": "course, and I will also give you a rope.",
        "textdich": ""
    },
    {
        "start": 519.039,
        "end": 527.36,
        "text": "You can tie the sheep during the day.\" But the little prince looked shocked.",
        "textdich": ""
    },
    {
        "start": 523.599,
        "end": 539.839,
        "text": "Tie the sheep? That's funny. I said, \"If you don't tie the sheep, it will run away. It will get lost.\" The little prince laughed again. A sweet, soft",
        "textdich": ""
    },
    {
        "start": 536.08,
        "end": 541.519,
        "text": "laugh. \"Where would it go?\" he said.",
        "textdich": ""
    },
    {
        "start": 539.839,
        "end": 543.279,
        "text": "\"Anywhere.",
        "textdich": ""
    },
    {
        "start": 541.519,
        "end": 554.88,
        "text": "It could walk left or right or straight.\" He looked down again and said quietly. \"It's okay. Where I live, everything is so small. The sheep can't",
        "textdich": ""
    },
    {
        "start": 552.32,
        "end": 564.399,
        "text": "go far.\" And when he said that, I understood something very important. His planet was very small. It was no bigger than a house. But that was not",
        "textdich": ""
    },
    {
        "start": 561.92,
        "end": 572.56,
        "text": "surprising. I already knew about very small planets. Scientists sometimes find them with big telescopes. They don't",
        "textdich": ""
    },
    {
        "start": 569.839,
        "end": 579.04,
        "text": "give them names, just numbers. They call them things like asteroid 3-251.",
        "textdich": ""
    },
    {
        "start": 576.48,
        "end": 585.6,
        "text": "And now I was sure the little prince came from one of those small planets.",
        "textdich": ""
    },
    {
        "start": 581.44,
        "end": 589.04,
        "text": "Maybe the one called asteroid B612.",
        "textdich": ""
    },
    {
        "start": 585.6,
        "end": 595.839,
        "text": "Chapter 4. Asteroid. I believe the little prince came from a small planet called asteroid B612.",
        "textdich": ""
    },
    {
        "start": 593.839,
        "end": 603.44,
        "text": "This planet was seen only once by a man with a telescope. It was a Turkish scientist. He saw it in the year 1909.",
        "textdich": ""
    },
    {
        "start": 601.44,
        "end": 609.68,
        "text": "He told other scientists about it at a big meeting, but no one believed him.",
        "textdich": ""
    },
    {
        "start": 606.08,
        "end": 614.16,
        "text": "Why? Because he wore Turkish clothes. He looked different. Adults are like that.",
        "textdich": ""
    },
    {
        "start": 612.48,
        "end": 625.839,
        "text": "They don't believe the truth if it doesn't look the way they want. Many years later, the same man spoke again, but this time he wore European clothes.",
        "textdich": ""
    },
    {
        "start": 623.12,
        "end": 632.24,
        "text": "He looked normal. And now everyone believed him. That is how adults think.",
        "textdich": ""
    },
    {
        "start": 628.8,
        "end": 638.72,
        "text": "It's strange, but it happens often. I'm telling you all this because adults love numbers. They don't care about feelings",
        "textdich": ""
    },
    {
        "start": 636.399,
        "end": 645.12,
        "text": "or beauty. When you tell them, \"I met a friend,\" they ask, \"How old is he? How many brothers does he have? How much",
        "textdich": ""
    },
    {
        "start": 642.959,
        "end": 653.2,
        "text": "does he weigh? How much money does his father make?\" If you say, \"He has a nice voice, he likes butterflies, he loves to",
        "textdich": ""
    },
    {
        "start": 650.64,
        "end": 661.12,
        "text": "laugh,\" they don't listen. They only care about numbers. They think numbers are more real than love or laughter. If",
        "textdich": ""
    },
    {
        "start": 658.8,
        "end": 669.04,
        "text": "you say, \"I saw a red house with flowers in the window and birds on the roof,\" they don't understand. But if you say,",
        "textdich": ""
    },
    {
        "start": 665.76,
        "end": 675.76,
        "text": "\"I saw a house that cost $100,000.\" Then they say, \"Wow, that's a beautiful house.\" This is how they think. So when",
        "textdich": ""
    },
    {
        "start": 673.839,
        "end": 688.8,
        "text": "I tell them about the little prince, I don't say, \"He laughed and wanted a sheep.\" They won't care. But if I say he came from asteroid B612,",
        "textdich": ""
    },
    {
        "start": 685.519,
        "end": 696.24,
        "text": "then they listen. Then they believe. But we who understand life, we don't care about numbers. We like stories. We know",
        "textdich": ""
    },
    {
        "start": 694.399,
        "end": 705.36,
        "text": "that stories tell the truth better than facts. So I tell this story like a fairy tale. I say once upon a time there was a",
        "textdich": ""
    },
    {
        "start": 703.12,
        "end": 719.44,
        "text": "little prince. He lived on a small planet. He had a flower and he was looking for a friend. If you understand what that means, then this story is for",
        "textdich": ""
    },
    {
        "start": 714.56,
        "end": 722.079,
        "text": "you. Chapter 5. Elephants.",
        "textdich": ""
    },
    {
        "start": 719.44,
        "end": 733.04,
        "text": "It has been six years since I met the little prince. But when I think about our time together, I still feel something deep inside my heart. I",
        "textdich": ""
    },
    {
        "start": 729.92,
        "end": 741.36,
        "text": "remember each word, each drawing, and each quiet moment in the desert. I don't want to forget any of it. That's why I",
        "textdich": ""
    },
    {
        "start": 738.8,
        "end": 750.079,
        "text": "am telling you this story now. I want to keep it safe. I want to keep the little prince alive in my memory. Because when",
        "textdich": ""
    },
    {
        "start": 746.72,
        "end": 759.92,
        "text": "we forget a friend, it is very sad and not everyone has a real friend. So I bought some pencils and started drawing again. Even though I had not drawn",
        "textdich": ""
    },
    {
        "start": 757.04,
        "end": 768.399,
        "text": "anything since I was a child, I try to make my drawings look true, but it is not easy. Sometimes the little prince",
        "textdich": ""
    },
    {
        "start": 764.399,
        "end": 776.079,
        "text": "looks too tall, sometimes too short. I don't even know if I got the color of his clothes right, but I try my best. I",
        "textdich": ""
    },
    {
        "start": 773.36,
        "end": 783.12,
        "text": "hope you can forgive my mistakes. The little prince never explained much. He thought I could understand everything",
        "textdich": ""
    },
    {
        "start": 780.16,
        "end": 788.72,
        "text": "like him, but I couldn't. Maybe because I was already becoming like the adults.",
        "textdich": ""
    },
    {
        "start": 785.839,
        "end": 793.839,
        "text": "Maybe I was already old. Every day I learned something new about his planet.",
        "textdich": ""
    },
    {
        "start": 791.2,
        "end": 800.48,
        "text": "He didn't tell me everything at once. He told me little by little when something reminded him of his past.",
        "textdich": ""
    },
    {
        "start": 798.24,
        "end": 809.36,
        "text": "On the third day, I learned about the danger of baobobs. It was during a conversation about sheep. He asked me, \"Is it true that sheep eat little",
        "textdich": ""
    },
    {
        "start": 806.8,
        "end": 820.72,
        "text": "bushes?\" I said, \"Yes, of course.\" He said, \"Ah, I'm glad.\" I didn't understand why this was important. Then he added, \"So they also eat baobobs.\"",
        "textdich": ""
    },
    {
        "start": 817.68,
        "end": 827.68,
        "text": "Now I was surprised. I told him, \"Baoabs are not like little bushes. Baababs are very big trees. They are as big as",
        "textdich": ""
    },
    {
        "start": 825.519,
        "end": 838.24,
        "text": "churches. Even if you had a group of nine elephants, they could not eat a single baobab.\" I laughed when I said this. nine elephants on a tiny planet.",
        "textdich": ""
    },
    {
        "start": 835.6,
        "end": 841.36,
        "text": "They would have to stand on each other.",
        "textdich": ""
    },
    {
        "start": 838.24,
        "end": 853.519,
        "text": "The little prince laughed too. But then he became serious again. He said something very important. Before baobobabs grow big, they are small, very",
        "textdich": ""
    },
    {
        "start": 850.399,
        "end": 862.959,
        "text": "small. And then I understood. Baababs start as small seeds. They are like little plants at first, but if you don't pull them out early, they grow fast.",
        "textdich": ""
    },
    {
        "start": 860.48,
        "end": 870.72,
        "text": "Then they become too strong. Their roots go deep into the ground. On the little prince's planet, the ground is very",
        "textdich": ""
    },
    {
        "start": 867.6,
        "end": 879.04,
        "text": "small. If too many baobobs grow, they can break the whole planet. Their roots can tear the planet into pieces. That's",
        "textdich": ""
    },
    {
        "start": 876.16,
        "end": 885.68,
        "text": "why the prince wanted a sheep. He needed it to eat the small bushes before they became dangerous trees. I could now",
        "textdich": ""
    },
    {
        "start": 883.839,
        "end": 888.32,
        "text": "imagine the life of the little prince.",
        "textdich": ""
    },
    {
        "start": 885.68,
        "end": 896.32,
        "text": "Every morning he would wake up, clean his volcanoes, and look for small baobob plants. Then he would pull them out",
        "textdich": ""
    },
    {
        "start": 893.68,
        "end": 903.68,
        "text": "quickly before they could grow. It was like a daily duty, a quiet fight against disaster. He said, \"It's a question of",
        "textdich": ""
    },
    {
        "start": 901.519,
        "end": 912.0,
        "text": "discipline. Sometimes there are good plants and sometimes there are bad ones, but the seeds look the same. You have to",
        "textdich": ""
    },
    {
        "start": 909.199,
        "end": 919.199,
        "text": "watch them carefully. When you see a bad one growing, you must remove it immediately.",
        "textdich": ""
    },
    {
        "start": 916.32,
        "end": 928.399,
        "text": "This lesson touched me deeply. I thought about our world. Maybe we also have baobobs. Bad habits, bad thoughts, bad",
        "textdich": ""
    },
    {
        "start": 925.44,
        "end": 936.8,
        "text": "feelings. If we don't stop them early, they grow and take over our lives. If we let anger, jealousy, or lies grow, they",
        "textdich": ""
    },
    {
        "start": 934.56,
        "end": 945.839,
        "text": "can destroy everything, just like the baobabs on the prince's planet. But if we are careful, if we take time each day",
        "textdich": ""
    },
    {
        "start": 942.32,
        "end": 948.72,
        "text": "to clean our hearts, then we are safe.",
        "textdich": ""
    },
    {
        "start": 945.839,
        "end": 956.48,
        "text": "We need our own discipline, too. The little prince asked me to draw a picture of the baobabs for children. He said,",
        "textdich": ""
    },
    {
        "start": 953.44,
        "end": 964.48,
        "text": "\"Sometimes children wait too long. Then it's too late.\" He was right. When a baobab is big, it's hard to remove.",
        "textdich": ""
    },
    {
        "start": 962.399,
        "end": 975.68,
        "text": "That's why I made a serious drawing of three huge baobobs. Their roots are deep. They are heavy and strong. I wanted this picture to be a warning, a",
        "textdich": ""
    },
    {
        "start": 972.8,
        "end": 983.839,
        "text": "simple but important message. Pull the baobobs when they are small. The prince spoke quietly that day. He looked into",
        "textdich": ""
    },
    {
        "start": 981.6,
        "end": 994.24,
        "text": "the sky as he talked. I could see that he wasn't just speaking about trees. He was thinking about his planet, his flower, and maybe about something he",
        "textdich": ""
    },
    {
        "start": 990.639,
        "end": 1000.16,
        "text": "didn't say. And I was listening, not just with my ears, but with my heart.",
        "textdich": ""
    },
    {
        "start": 998.0,
        "end": 1002.24,
        "text": "Chapter 6.",
        "textdich": ""
    },
    {
        "start": 1000.16,
        "end": 1004.56,
        "text": "Trees.",
        "textdich": ""
    },
    {
        "start": 1002.24,
        "end": 1011.12,
        "text": "After learning about the Baobabs, I started to understand more about the little prince's planet. He did not tell",
        "textdich": ""
    },
    {
        "start": 1008.56,
        "end": 1018.959,
        "text": "me everything at once. He spoke in short sentences, but each sentence had meaning. Each little word helped me see",
        "textdich": ""
    },
    {
        "start": 1016.0,
        "end": 1027.039,
        "text": "his world more clearly. I saw that his planet was small but full of life. It had volcanoes, sunsets, and seeds. There",
        "textdich": ""
    },
    {
        "start": 1024.959,
        "end": 1035.679,
        "text": "were many seeds in the ground, some good and some bad. And that is how I began to understand about the trees. He told me",
        "textdich": ""
    },
    {
        "start": 1032.72,
        "end": 1044.72,
        "text": "that on his planet, just like on earth, seeds fall into the ground. The ground doesn't choose the seed. It accepts all",
        "textdich": ""
    },
    {
        "start": 1041.28,
        "end": 1054.96,
        "text": "seeds, good ones and bad ones. Then the seed sleeps. It sleeps deep in the soil, sometimes for a long time. But one day",
        "textdich": ""
    },
    {
        "start": 1050.96,
        "end": 1059.039,
        "text": "it wakes up. Slowly the seed begins to grow.",
        "textdich": ""
    },
    {
        "start": 1056.48,
        "end": 1069.44,
        "text": "At first the plant is very small. You cannot tell what kind of plant it is. It might be a rose. It might be a weed. It might be something beautiful or",
        "textdich": ""
    },
    {
        "start": 1066.88,
        "end": 1074.16,
        "text": "something dangerous. The little prince said that this is the important moment.",
        "textdich": ""
    },
    {
        "start": 1071.919,
        "end": 1082.32,
        "text": "When the plant is small, it is easy to pull out. But when it grows, it becomes harder. Some plants grow fast, some grow",
        "textdich": ""
    },
    {
        "start": 1079.76,
        "end": 1090.48,
        "text": "slowly. But if the plant is bad and you don't pull it out soon, it becomes a big problem. That is what happens with",
        "textdich": ""
    },
    {
        "start": 1087.52,
        "end": 1098.64,
        "text": "baobobs. At first they look like all the other little plants. You don't know they are baobobs. You think they are just",
        "textdich": ""
    },
    {
        "start": 1094.799,
        "end": 1109.36,
        "text": "small leaves. But then they grow. They grow tall. Their roots go deep. Their trunks become thick. If you wait too long, it is too late. They become too",
        "textdich": ""
    },
    {
        "start": 1106.32,
        "end": 1111.679,
        "text": "strong. And they can break your planet.",
        "textdich": ""
    },
    {
        "start": 1109.36,
        "end": 1117.36,
        "text": "I listened carefully and I started thinking. This is not just about trees.",
        "textdich": ""
    },
    {
        "start": 1114.4,
        "end": 1126.16,
        "text": "It is about everything in life. A small bad thing can become a big problem. If you fix it early, it's easy. But if you",
        "textdich": ""
    },
    {
        "start": 1122.799,
        "end": 1135.6,
        "text": "wait, it becomes very hard. A small lie, a little anger, a bit of laziness. If you don't stop it when it's small, it",
        "textdich": ""
    },
    {
        "start": 1131.039,
        "end": 1142.88,
        "text": "grows. It spreads. It takes your joy. It breaks your heart. Just like Beaabs break a planet.",
        "textdich": ""
    },
    {
        "start": 1140.72,
        "end": 1147.6,
        "text": "I looked at the little prince and I understood.",
        "textdich": ""
    },
    {
        "start": 1144.4,
        "end": 1155.12,
        "text": "His planet was like his heart. He had to take care of it. Every morning he watched it. Every day he worked to keep",
        "textdich": ""
    },
    {
        "start": 1152.0,
        "end": 1161.28,
        "text": "it safe and that's how he lived. He told me that some days it was hard to get up.",
        "textdich": ""
    },
    {
        "start": 1157.679,
        "end": 1171.039,
        "text": "Some days he felt lazy. But he said it is a question of discipline. Even if he was tired, he would get up. He would check his planet. He would look for",
        "textdich": ""
    },
    {
        "start": 1168.72,
        "end": 1183.76,
        "text": "small baobobs. He would pull them out before they grew big. It is easy, he said. But you must do it every day. I thought about my own life. I thought",
        "textdich": ""
    },
    {
        "start": 1180.4,
        "end": 1186.4,
        "text": "about my thoughts, my habits, my heart.",
        "textdich": ""
    },
    {
        "start": 1183.76,
        "end": 1188.88,
        "text": "Maybe I had my own baobobs.",
        "textdich": ""
    },
    {
        "start": 1186.4,
        "end": 1200.24,
        "text": "Maybe we all do. We all have small things inside us. Jealousy, fear, sadness. If we are not careful, they grow. They take space. They become hard",
        "textdich": ""
    },
    {
        "start": 1197.039,
        "end": 1206.559,
        "text": "to remove. But if we see them early, we can pull them out. We can be free.",
        "textdich": ""
    },
    {
        "start": 1203.84,
        "end": 1209.679,
        "text": "The little prince didn't say much more.",
        "textdich": ""
    },
    {
        "start": 1206.559,
        "end": 1222.24,
        "text": "He looked up at the stars. I stayed quiet, too. There was nothing more to say. I just looked at him. His face was calm. He was small, but he had a big",
        "textdich": ""
    },
    {
        "start": 1218.88,
        "end": 1232.159,
        "text": "heart. He was serious, but kind. He was just a boy, but also more than a boy. I didn't know everything about his planet,",
        "textdich": ""
    },
    {
        "start": 1227.679,
        "end": 1242.4,
        "text": "but I knew one thing. It was small. It was fragile. And it was beautiful, just like a heart.",
        "textdich": ""
    },
    {
        "start": 1238.24,
        "end": 1250.24,
        "text": "Chapter 7. Sun. The little prince loved the sun. And he told me this one morning while we were sitting in the sand. He",
        "textdich": ""
    },
    {
        "start": 1247.44,
        "end": 1262.72,
        "text": "said, \"On my planet, I can see the sunset many times a day.\" I looked at him and smiled. He was not joking. He really meant it. He said, \"All I have to",
        "textdich": ""
    },
    {
        "start": 1260.0,
        "end": 1271.6,
        "text": "do is move my chair a little. Then I can see the sun go down again. I thought that was beautiful. On Earth, we have to",
        "textdich": ""
    },
    {
        "start": 1268.48,
        "end": 1278.88,
        "text": "wait the whole day for one sunset.\" But the little prince could watch many. He told me one time he watched the sunset",
        "textdich": ""
    },
    {
        "start": 1276.48,
        "end": 1285.36,
        "text": "44 times. I was surprised and I asked him why did you watch it so many times.",
        "textdich": ""
    },
    {
        "start": 1282.64,
        "end": 1290.88,
        "text": "He looked at me and said because I was very sad. That touched my heart.",
        "textdich": ""
    },
    {
        "start": 1288.799,
        "end": 1297.28,
        "text": "Sometimes when we are sad we look at beautiful things. We want to feel peace.",
        "textdich": ""
    },
    {
        "start": 1294.64,
        "end": 1307.919,
        "text": "The little prince didn't cry. He didn't talk much. But he watched the sunset again and again. He sat and waited. He",
        "textdich": ""
    },
    {
        "start": 1304.96,
        "end": 1317.2,
        "text": "moved his chair. He looked at the sky and he felt the warm orange light. It gave him comfort. It gave him hope.",
        "textdich": ""
    },
    {
        "start": 1314.4,
        "end": 1327.44,
        "text": "Maybe he was thinking of home or maybe of someone he loved. I didn't ask. I just listened. The sun was special to",
        "textdich": ""
    },
    {
        "start": 1324.159,
        "end": 1335.6,
        "text": "him. He said it made him feel calm. It made his small planet feel big. When the light touched the ground, everything",
        "textdich": ""
    },
    {
        "start": 1332.24,
        "end": 1347.6,
        "text": "looked golden. He said, \"The sun helps flowers. The sun wakes me up. The sun makes me feel alive.\" I looked at his face. It was soft and",
        "textdich": ""
    },
    {
        "start": 1344.72,
        "end": 1356.4,
        "text": "quiet. He wasn't just talking about the sun in the sky. He was talking about something deeper. The sun in his heart.",
        "textdich": ""
    },
    {
        "start": 1354.4,
        "end": 1365.28,
        "text": "The light that gives you strength when you are tired. The warmth that makes you smile even when you are alone.",
        "textdich": ""
    },
    {
        "start": 1362.0,
        "end": 1374.4,
        "text": "I remembered my own childhood. I also loved the sunset. I used to sit on the roof of our house. I waited for the",
        "textdich": ""
    },
    {
        "start": 1370.72,
        "end": 1381.919,
        "text": "light to change. The sky turned yellow, then orange, then pink, then purple.",
        "textdich": ""
    },
    {
        "start": 1378.64,
        "end": 1390.24,
        "text": "Then the stars came out. It always felt like magic. I never told anyone how much I loved it. But when the little prince",
        "textdich": ""
    },
    {
        "start": 1387.76,
        "end": 1402.32,
        "text": "spoke, I remembered that feeling. I remembered the silence, the soft wind, the slow fading of the day. And I understood him better. He said, \"People",
        "textdich": ""
    },
    {
        "start": 1399.6,
        "end": 1412.64,
        "text": "on your planet are always busy. They forget to look at the sun.\" He was right. We run from place to place. We look at our phones. We think about work,",
        "textdich": ""
    },
    {
        "start": 1411.12,
        "end": 1419.52,
        "text": "money, problems, but we forget the sky.",
        "textdich": ""
    },
    {
        "start": 1416.559,
        "end": 1430.559,
        "text": "We forget the light. We forget the joy of simple things like a sunset. The little prince taught me something important. He taught me that looking at",
        "textdich": ""
    },
    {
        "start": 1427.2,
        "end": 1440.08,
        "text": "the sun is also a way of feeling, a way of remembering, a way of healing. He didn't have much, just a tiny planet, a",
        "textdich": ""
    },
    {
        "start": 1436.24,
        "end": 1448.799,
        "text": "flower, and a chair. But he had the sun, and he used it. He watched it with love, with care, with heart.",
        "textdich": ""
    },
    {
        "start": 1446.4,
        "end": 1459.679,
        "text": "That day in the desert, we both looked at the sunset. The sky was wide. The colors changed slowly. No words were needed.",
        "textdich": ""
    },
    {
        "start": 1456.799,
        "end": 1468.48,
        "text": "The little prince didn't speak. He just watched. And I watched with him. In that moment, we were both quiet. We were both",
        "textdich": ""
    },
    {
        "start": 1465.919,
        "end": 1478.32,
        "text": "human. We were both full of something very old and very deep. When the sun finally disappeared, he looked at me. He",
        "textdich": ""
    },
    {
        "start": 1475.039,
        "end": 1486.88,
        "text": "said, \"The sun always goes down, but it also comes back.\" And I knew he was not just talking about the sun.",
        "textdich": ""
    },
    {
        "start": 1484.0,
        "end": 1489.44,
        "text": "Chapter 8. Flower.",
        "textdich": ""
    },
    {
        "start": 1486.88,
        "end": 1497.76,
        "text": "One day, the little prince told me about a flower. His voice became soft when he spoke about her. His eyes looked far",
        "textdich": ""
    },
    {
        "start": 1495.12,
        "end": 1509.44,
        "text": "away, as if he was back on his planet again. he said. One morning a new flower appeared. She came slowly. The seed had",
        "textdich": ""
    },
    {
        "start": 1506.24,
        "end": 1513.6,
        "text": "slept in the ground for a long time.",
        "textdich": ""
    },
    {
        "start": 1509.44,
        "end": 1525.12,
        "text": "Then one day it woke up. The flower grew inside a bud. She took her time. She wanted to be perfect. She prepared herself quietly. She chose her colors",
        "textdich": ""
    },
    {
        "start": 1522.32,
        "end": 1537.279,
        "text": "carefully. She wanted her petals to be just right. And finally, one morning, just as the sun rose, she opened. The little prince was amazed.",
        "textdich": ""
    },
    {
        "start": 1533.84,
        "end": 1544.48,
        "text": "She was beautiful. She was soft. She was full of color and light. He had never seen anything like her. All the other",
        "textdich": ""
    },
    {
        "start": 1542.0,
        "end": 1551.36,
        "text": "flowers on his planet were simple. But this one was different. She was proud.",
        "textdich": ""
    },
    {
        "start": 1547.679,
        "end": 1562.0,
        "text": "She was delicate. She was special. At first, the little prince didn't understand her. She started speaking in a slow and graceful voice. She said, \"I",
        "textdich": ""
    },
    {
        "start": 1559.2,
        "end": 1570.559,
        "text": "just woke up. I'm sorry. My hair is messy.\" She had a kind of pride, but it was not cruel. It was soft and quiet.",
        "textdich": ""
    },
    {
        "start": 1567.919,
        "end": 1579.6,
        "text": "She wanted to be loved. The little prince said, \"You are very beautiful.\" And she smiled. But then she said, \"Do",
        "textdich": ""
    },
    {
        "start": 1577.52,
        "end": 1588.64,
        "text": "you have a screen to protect me from the wind?\" The little prince didn't know. He had never taken care of a flower like",
        "textdich": ""
    },
    {
        "start": 1585.2,
        "end": 1597.279,
        "text": "this before. He felt shy. He didn't know what to do. Then she asked, \"And what about breakfast? Can you bring me",
        "textdich": ""
    },
    {
        "start": 1594.559,
        "end": 1605.76,
        "text": "something?\" The little prince ran to get water. He tried his best. He brought her a glass dome to protect her from the",
        "textdich": ""
    },
    {
        "start": 1602.24,
        "end": 1614.4,
        "text": "cold. He gave her love. But sometimes she said things that confused him. She talked about tigers. She talked about",
        "textdich": ""
    },
    {
        "start": 1611.039,
        "end": 1626.799,
        "text": "her thorns. She tried to be strong, but she was not. She was soft inside. She was afraid, and she didn't know how to say, \"I love you.\"",
        "textdich": ""
    },
    {
        "start": 1623.76,
        "end": 1634.72,
        "text": "The little prince became sad. He didn't understand her words. He didn't see the love hidden behind her pride. He thought",
        "textdich": ""
    },
    {
        "start": 1632.32,
        "end": 1644.4,
        "text": "she didn't care about him. He felt alone. He started to feel unhappy on his planet. That's when he decided to leave.",
        "textdich": ""
    },
    {
        "start": 1641.2,
        "end": 1656.48,
        "text": "He said to me, \"I didn't understand flowers then. I was too young to understand love.\" When he left, he looked at her one last time. She said,",
        "textdich": ""
    },
    {
        "start": 1653.679,
        "end": 1665.12,
        "text": "\"I was wrong. I didn't know how to show my feelings. I love you, but you didn't understand me. And I didn't understand",
        "textdich": ""
    },
    {
        "start": 1661.2,
        "end": 1679.2,
        "text": "you. That is my fault. Please go be free. Try to be happy.\" She was not proud anymore. She was gentle. She didn't cry. She didn't ask him to stay.",
        "textdich": ""
    },
    {
        "start": 1675.76,
        "end": 1682.64,
        "text": "She let him go. That is true love.",
        "textdich": ""
    },
    {
        "start": 1679.2,
        "end": 1690.64,
        "text": "Letting someone go if they need to. The little prince was surprised. He didn't expect that. She looked beautiful in the",
        "textdich": ""
    },
    {
        "start": 1688.0,
        "end": 1696.159,
        "text": "morning light. The wind touched her petals. She stood quietly in the breeze.",
        "textdich": ""
    },
    {
        "start": 1694.0,
        "end": 1705.52,
        "text": "The little prince didn't want to leave, but he had already decided. He wanted to see other places. He wanted to learn.",
        "textdich": ""
    },
    {
        "start": 1702.24,
        "end": 1716.0,
        "text": "And now he carried her in his heart. As he told me this story, he looked at the sky. His voice was low. He missed her. I",
        "textdich": ""
    },
    {
        "start": 1713.12,
        "end": 1724.0,
        "text": "could feel it. He didn't say the word love, but it was there in every sentence, in every pause, in every look.",
        "textdich": ""
    },
    {
        "start": 1721.36,
        "end": 1732.24,
        "text": "He had loved that flower, and maybe she had loved him, too. But sometimes when we are young, we don't know how to show",
        "textdich": ""
    },
    {
        "start": 1729.76,
        "end": 1742.24,
        "text": "it. And that is why the little prince left his planet. Not because he stopped caring, but because he wanted to understand.",
        "textdich": ""
    },
    {
        "start": 1738.399,
        "end": 1751.84,
        "text": "Chapter nine. Glass. The little prince stayed with the flower for some time before he left his planet. But during those days, things were not easy. The",
        "textdich": ""
    },
    {
        "start": 1749.52,
        "end": 1757.919,
        "text": "flower, who had once opened so gently, became difficult. She asked many things.",
        "textdich": ""
    },
    {
        "start": 1754.96,
        "end": 1765.12,
        "text": "She spoke in a strange way and slowly the little prince felt confused. She started to cough, he told me, looking",
        "textdich": ""
    },
    {
        "start": 1762.399,
        "end": 1773.279,
        "text": "down at the sand. But I don't think she was really sick. I think she just wanted attention. He wasn't angry when he said",
        "textdich": ""
    },
    {
        "start": 1770.399,
        "end": 1782.72,
        "text": "this. He was sad. The kind of sadness that comes when love feels too hard. The flower would say, \"The night was cold.",
        "textdich": ""
    },
    {
        "start": 1780.08,
        "end": 1793.919,
        "text": "You didn't cover me. I could die from this.\" or sometimes she would sigh and say, \"You don't really care about me. If you did, you would never leave me",
        "textdich": ""
    },
    {
        "start": 1791.279,
        "end": 1801.919,
        "text": "alone.\" The little prince didn't understand. He tried to help. He watered her every morning. He protected her with",
        "textdich": ""
    },
    {
        "start": 1799.12,
        "end": 1811.44,
        "text": "a glass dome. He even cleaned around her so the wind wouldn't hurt her. But the more he tried, the more she complained.",
        "textdich": ""
    },
    {
        "start": 1807.12,
        "end": 1819.44,
        "text": "And slowly, he felt tired. He loved her, but he didn't know how to show it. And she loved him, but she didn't know how",
        "textdich": ""
    },
    {
        "start": 1816.559,
        "end": 1829.84,
        "text": "to say it in simple words. She was proud, he said softly. And I was too young to understand that pride hides pain. He told me she would say things",
        "textdich": ""
    },
    {
        "start": 1827.44,
        "end": 1840.72,
        "text": "that hurt him, like, \"You should have done this.\" Or, \"Why don't you ever say kind things to me?\" But he was quiet. He",
        "textdich": ""
    },
    {
        "start": 1837.36,
        "end": 1845.039,
        "text": "didn't know how to say I love you with words.",
        "textdich": ""
    },
    {
        "start": 1842.24,
        "end": 1852.08,
        "text": "So he gave her water. He brought her the glass cover. He showed love in his actions. But she wanted love in words.",
        "textdich": ""
    },
    {
        "start": 1850.48,
        "end": 1860.0,
        "text": "One day the flower said, \"I don't need the glass. I am strong. I can take care of myself.\" But she wasn't strong. She",
        "textdich": ""
    },
    {
        "start": 1857.76,
        "end": 1870.799,
        "text": "was afraid. She just didn't want to seem weak. She didn't want him to see her soft heart. So she pretended to be brave. She said, \"You can go if you",
        "textdich": ""
    },
    {
        "start": 1868.399,
        "end": 1879.52,
        "text": "want.\" And the little prince thought she meant it. So he decided to leave. He prepared everything. He cleaned his",
        "textdich": ""
    },
    {
        "start": 1876.559,
        "end": 1888.48,
        "text": "volcanoes. He pulled out the last baobab shoots. He put his planet in order. And then he looked at the flower. She was",
        "textdich": ""
    },
    {
        "start": 1884.64,
        "end": 1891.84,
        "text": "standing in the wind looking at the sky.",
        "textdich": ""
    },
    {
        "start": 1888.48,
        "end": 1903.36,
        "text": "He said goodbye. She didn't move. Then she said, \"I was wrong. I'm sorry. I want you to be happy. I love you.",
        "textdich": ""
    },
    {
        "start": 1900.48,
        "end": 1913.919,
        "text": "He was surprised. Her voice was different, soft, honest. She was not coughing anymore and she was not complaining. She was just quiet. He",
        "textdich": ""
    },
    {
        "start": 1911.76,
        "end": 1922.88,
        "text": "almost didn't leave. But something inside told him it was time. He had to go. He had to learn more. Maybe one day",
        "textdich": ""
    },
    {
        "start": 1920.399,
        "end": 1926.96,
        "text": "he could come back. He looked at her one last time.",
        "textdich": ""
    },
    {
        "start": 1924.399,
        "end": 1938.399,
        "text": "He wanted to remember her like this, calm, peaceful, standing in the sun. He put the glass dome over her gently, like a kiss.",
        "textdich": ""
    },
    {
        "start": 1936.159,
        "end": 1945.679,
        "text": "She didn't want me to see her cry, he said. Flowers are so mysterious.",
        "textdich": ""
    },
    {
        "start": 1942.559,
        "end": 1954.48,
        "text": "I said nothing. I just listened because I understood. Sometimes we love people, but we don't know how to show it.",
        "textdich": ""
    },
    {
        "start": 1951.6,
        "end": 1963.039,
        "text": "Sometimes we wait too long to say I'm sorry or I care. And sometimes when we finally say it, the person is already",
        "textdich": ""
    },
    {
        "start": 1960.72,
        "end": 1973.76,
        "text": "leaving. But the little prince didn't hate the flower. He carried her in his heart. Even when he left, even as he traveled to other planets, even as he",
        "textdich": ""
    },
    {
        "start": 1970.96,
        "end": 1983.12,
        "text": "sat beside me in the desert telling this story, she was still with him. Chapter 10. volcanoes.",
        "textdich": ""
    },
    {
        "start": 1981.44,
        "end": 1995.519,
        "text": "Before the little prince left his planet, he did something important. He cleaned his volcanoes. He told me about it with care in his voice. I had three",
        "textdich": ""
    },
    {
        "start": 1992.48,
        "end": 2005.12,
        "text": "volcanoes on my planet, he said. Two were active, one was not, but I cleaned all of them. He used a small rake. He",
        "textdich": ""
    },
    {
        "start": 2002.64,
        "end": 2007.519,
        "text": "cleaned around the top of each volcano.",
        "textdich": ""
    },
    {
        "start": 2005.12,
        "end": 2016.48,
        "text": "He made sure nothing blocked them. He said, \"When volcanoes are clean, they burn gently. They don't explode.\" He",
        "textdich": ""
    },
    {
        "start": 2013.76,
        "end": 2018.08,
        "text": "smiled. \"It's like brushing your teeth.",
        "textdich": ""
    },
    {
        "start": 2016.48,
        "end": 2027.039,
        "text": "If you do it every day, you stay healthy.\" I listened. I could see him, a small boy with golden hair, standing on",
        "textdich": ""
    },
    {
        "start": 2024.399,
        "end": 2036.08,
        "text": "his tiny planet, cleaning his volcanoes with love. It was not a big job, but it was his job, and he did it with care.",
        "textdich": ""
    },
    {
        "start": 2034.0,
        "end": 2047.2,
        "text": "Even the volcano that didn't erupt, the sleeping one, he cleaned that too. He said, \"You never know. Maybe one day it",
        "textdich": ""
    },
    {
        "start": 2043.36,
        "end": 2054.079,
        "text": "will wake up.\" That touched me. How many things in life do we leave because they are quiet, because they are silent?",
        "textdich": ""
    },
    {
        "start": 2052.56,
        "end": 2065.2,
        "text": "But the little prince didn't forget anything. He didn't say, \"This one is useless.\" He said, \"This one might wake up someday.\" And so he cared for it,",
        "textdich": ""
    },
    {
        "start": 2061.679,
        "end": 2077.2,
        "text": "too. I thought about my own life. How many things I forgot to clean. Not just rooms or dishes, but friendships, promises, dreams. Some of them were",
        "textdich": ""
    },
    {
        "start": 2073.359,
        "end": 2086.32,
        "text": "quiet, like the third volcano sleeping, but still there, still waiting. The little prince understood something deep.",
        "textdich": ""
    },
    {
        "start": 2083.359,
        "end": 2095.28,
        "text": "He knew that love means care, even for small things, even for silent things. He didn't rush. He didn't skip steps. He",
        "textdich": ""
    },
    {
        "start": 2092.8,
        "end": 2107.119,
        "text": "cleaned each volcano with patience. He looked around his planet slowly. It was his home and he wanted to leave it clean. Then he pulled out the last",
        "textdich": ""
    },
    {
        "start": 2102.56,
        "end": 2109.52,
        "text": "baobab shoots. Baababs are bad plants.",
        "textdich": ""
    },
    {
        "start": 2107.119,
        "end": 2111.76,
        "text": "If you let them grow, they become huge.",
        "textdich": ""
    },
    {
        "start": 2109.52,
        "end": 2120.32,
        "text": "They break the planet. But when they are small, you can remove them easily. So the little prince checked his ground. He",
        "textdich": ""
    },
    {
        "start": 2117.44,
        "end": 2130.0,
        "text": "pulled each one carefully. He said, \"Sometimes bad things grow quietly. If you wait too long, they get too big.",
        "textdich": ""
    },
    {
        "start": 2127.119,
        "end": 2140.72,
        "text": "Then it's hard to stop them.\" He looked serious when he said this. I thought of bad habits, angry thoughts, sadness.",
        "textdich": ""
    },
    {
        "start": 2137.92,
        "end": 2142.96,
        "text": "All these things are like baobobs.",
        "textdich": ""
    },
    {
        "start": 2140.72,
        "end": 2149.839,
        "text": "If you don't watch them, they grow. If you don't act early, they take over. The little prince knew this and that's why",
        "textdich": ""
    },
    {
        "start": 2147.76,
        "end": 2158.079,
        "text": "he checked every day, cleaning his volcanoes, pulling the baobabs, saying goodbye to his flower. He told me it was",
        "textdich": ""
    },
    {
        "start": 2155.599,
        "end": 2167.599,
        "text": "a peaceful morning. I did everything I always do. But I knew this time I would not come back soon. He didn't cry. He",
        "textdich": ""
    },
    {
        "start": 2164.96,
        "end": 2177.76,
        "text": "didn't rush. He just did what he always did. That was his way of saying goodbye with action, with love. I asked him,",
        "textdich": ""
    },
    {
        "start": 2175.04,
        "end": 2187.599,
        "text": "\"Was it hard to leave?\" He looked at me for a moment. Then he said, \"Yes, but I wanted to understand things. I had to",
        "textdich": ""
    },
    {
        "start": 2183.92,
        "end": 2196.64,
        "text": "go.\" That's when I realized sometimes we leave home not because we stop loving it, but because we want to understand it",
        "textdich": ""
    },
    {
        "start": 2192.96,
        "end": 2208.48,
        "text": "better. We go far so we can see what it really means to us. And when we come back, we love it more. That morning before he left, the little prince gave",
        "textdich": ""
    },
    {
        "start": 2205.839,
        "end": 2221.92,
        "text": "one last look at his planet. It was small. It had a flower, three volcanoes, and some stars above. But for him, it was the whole world. Then he stepped",
        "textdich": ""
    },
    {
        "start": 2218.8,
        "end": 2225.52,
        "text": "into the wind and left.",
        "textdich": ""
    },
    {
        "start": 2221.92,
        "end": 2227.359,
        "text": "Chapter 11. King.",
        "textdich": ""
    },
    {
        "start": 2225.52,
        "end": 2232.4,
        "text": "After the little prince left his own planet, he began to visit other planets.",
        "textdich": ""
    },
    {
        "start": 2230.16,
        "end": 2239.599,
        "text": "He wanted to learn. He wanted to meet new people. He wanted to understand grown-ups. The first planet he visited",
        "textdich": ""
    },
    {
        "start": 2237.2,
        "end": 2246.72,
        "text": "was very small, but it was not empty. It had a king. The king was sitting on a big chair. He wore a purple robe and had",
        "textdich": ""
    },
    {
        "start": 2244.4,
        "end": 2257.52,
        "text": "a crown on his head. He looked very serious. When he saw the little prince, he said, \"Ah, a subject.\" His voice was loud, like a person who gives many",
        "textdich": ""
    },
    {
        "start": 2254.4,
        "end": 2260.0,
        "text": "orders. The little prince looked around.",
        "textdich": ""
    },
    {
        "start": 2257.52,
        "end": 2262.0,
        "text": "There was no one else, just the king.",
        "textdich": ""
    },
    {
        "start": 2260.0,
        "end": 2267.04,
        "text": "The planet was too small for more than one person.",
        "textdich": ""
    },
    {
        "start": 2263.839,
        "end": 2276.32,
        "text": "A subject? The little prince asked. But who do you rule? The king raised his chin. I rule over everything, he said.",
        "textdich": ""
    },
    {
        "start": 2273.52,
        "end": 2287.92,
        "text": "Over this planet, over the stars, and even over you. The little prince was surprised. You rule the stars? Yes, the king said, \"And they obey me. I give",
        "textdich": ""
    },
    {
        "start": 2285.44,
        "end": 2295.68,
        "text": "orders, and they listen.\" The little prince wanted to see how powerful this king really was. So he asked, \"Can you",
        "textdich": ""
    },
    {
        "start": 2293.04,
        "end": 2304.079,
        "text": "order the sun to set?\" The king looked confused. Then he answered carefully, \"Yes, of course, but I must wait for the",
        "textdich": ""
    },
    {
        "start": 2301.44,
        "end": 2311.839,
        "text": "right time.\" I only give orders that make sense. I order the sun to set. At sunset, the little prince laughed.",
        "textdich": ""
    },
    {
        "start": 2309.839,
        "end": 2320.48,
        "text": "That's not a real order, then. But the king didn't laugh. He was serious. He believed he had great power. But really",
        "textdich": ""
    },
    {
        "start": 2317.359,
        "end": 2330.0,
        "text": "he had no one to rule. He just liked giving orders. Then the king said, \"Stay with me. I will make you a minister.\" \"A",
        "textdich": ""
    },
    {
        "start": 2327.92,
        "end": 2341.52,
        "text": "minister of what?\" asked the little prince. \"Of justice,\" the king said proudly. \"But there is no one here,\" the little prince replied. \"Then judge",
        "textdich": ""
    },
    {
        "start": 2338.96,
        "end": 2349.92,
        "text": "yourself,\" the king said. \"That is the hardest task. Judging others is easy, but judging yourself is real wisdom. The",
        "textdich": ""
    },
    {
        "start": 2347.44,
        "end": 2361.2,
        "text": "little prince thought for a moment. That was actually a good idea. It is true we are often hard on others, but we don't always see our own mistakes.",
        "textdich": ""
    },
    {
        "start": 2358.4,
        "end": 2368.56,
        "text": "Then the little prince asked, \"May I go now?\" The king didn't want him to leave.",
        "textdich": ""
    },
    {
        "start": 2365.119,
        "end": 2374.48,
        "text": "\"I order you to stay,\" he said. But the little prince had already made up his mind. He didn't want to live on that",
        "textdich": ""
    },
    {
        "start": 2372.4,
        "end": 2383.68,
        "text": "planet. There was no one to talk to, no one to help, just a lonely man giving orders to the stars. So the king thought",
        "textdich": ""
    },
    {
        "start": 2380.16,
        "end": 2394.4,
        "text": "quickly, \"If you must go, then I order you to go,\" he said. \"Yes, I order it now.\" \"As your king?\" The little prince",
        "textdich": ""
    },
    {
        "start": 2391.44,
        "end": 2404.16,
        "text": "smiled kindly. He knew the king just didn't want to be alone. As the little prince left, he thought about what he had learned.",
        "textdich": ""
    },
    {
        "start": 2400.96,
        "end": 2411.92,
        "text": "Some grown-ups love power. They want to feel important. They give orders even when no one listens. They wear crowns",
        "textdich": ""
    },
    {
        "start": 2409.599,
        "end": 2418.56,
        "text": "and sit on chairs and speak with big voices. But inside they are just lonely.",
        "textdich": ""
    },
    {
        "start": 2415.92,
        "end": 2421.44,
        "text": "The little prince felt a little sad.",
        "textdich": ""
    },
    {
        "start": 2418.56,
        "end": 2432.0,
        "text": "Grown-ups are strange, he whispered. But he was also curious. He wanted to visit the next planet. Maybe he would meet someone different. maybe he would",
        "textdich": ""
    },
    {
        "start": 2429.28,
        "end": 2437.44,
        "text": "understand the grown-up world more. And so the journey continued.",
        "textdich": ""
    },
    {
        "start": 2435.119,
        "end": 2439.359,
        "text": "Chapter 12.",
        "textdich": ""
    },
    {
        "start": 2437.44,
        "end": 2441.119,
        "text": "Mouse.",
        "textdich": ""
    },
    {
        "start": 2439.359,
        "end": 2449.28,
        "text": "After the little prince left the planet of the lonely king, he visited another tiny planet. This one was quiet, almost",
        "textdich": ""
    },
    {
        "start": 2446.8,
        "end": 2458.319,
        "text": "too quiet. At first, he thought it was empty. But soon, he saw something small and fast, a little gray mouse. It stood",
        "textdich": ""
    },
    {
        "start": 2455.92,
        "end": 2469.68,
        "text": "on a rock, staring at him with tiny black eyes. \"Hello,\" said the little prince politely. The mouse jumped. \"Who",
        "textdich": ""
    },
    {
        "start": 2465.68,
        "end": 2472.48,
        "text": "are you?\" it asked in a thin soft voice.",
        "textdich": ""
    },
    {
        "start": 2469.68,
        "end": 2482.64,
        "text": "\"I am the little prince.\" \"I'm traveling to learn things,\" he said. \"Oh,\" said the mouse, slowly coming closer. \"Nobody",
        "textdich": ""
    },
    {
        "start": 2479.68,
        "end": 2493.119,
        "text": "visits my planet. I've been alone for a very long time.\" The little prince sat down on the soft dirt. You live here all",
        "textdich": ""
    },
    {
        "start": 2488.319,
        "end": 2494.88,
        "text": "alone? Yes, said the mouse. Just me.",
        "textdich": ""
    },
    {
        "start": 2493.119,
        "end": 2502.88,
        "text": "There used to be two of us, but one day he disappeared. Maybe he went to look for cheese somewhere better. Or maybe he",
        "textdich": ""
    },
    {
        "start": 2500.24,
        "end": 2510.4,
        "text": "got tired of me. The little prince looked gently at the mouse. I'm sorry.",
        "textdich": ""
    },
    {
        "start": 2506.48,
        "end": 2513.599,
        "text": "That must feel lonely. The mouse nodded.",
        "textdich": ""
    },
    {
        "start": 2510.4,
        "end": 2525.92,
        "text": "Yes, at first I didn't mind. I had peace. I had time to think. But after many days, I forgot how to talk to others. I forgot how to listen. I",
        "textdich": ""
    },
    {
        "start": 2523.28,
        "end": 2527.76,
        "text": "started talking only to myself.",
        "textdich": ""
    },
    {
        "start": 2525.92,
        "end": 2537.359,
        "text": "Sometimes I talk to the wind or the stars, but they don't answer. The little prince felt something soft in his heart.",
        "textdich": ""
    },
    {
        "start": 2534.48,
        "end": 2539.44,
        "text": "He knew that kind of silence.",
        "textdich": ""
    },
    {
        "start": 2537.359,
        "end": 2549.44,
        "text": "Even though he had a flower, even though he had volcanoes, he too had felt alone on his planet. The mouse asked shily,",
        "textdich": ""
    },
    {
        "start": 2546.48,
        "end": 2557.68,
        "text": "\"Will you talk to me for a while?\" \"Just until the stars come out.\" \"Of course,\" said the little prince, and they began",
        "textdich": ""
    },
    {
        "start": 2554.72,
        "end": 2565.92,
        "text": "to talk. They talked about many things, about planets, about flowers, about crumbs, and cheese.",
        "textdich": ""
    },
    {
        "start": 2562.96,
        "end": 2575.52,
        "text": "The mouse asked many questions. Do you miss your flower? Do you think stars can hear us? Why do people leave? The little",
        "textdich": ""
    },
    {
        "start": 2571.599,
        "end": 2586.319,
        "text": "prince answered simply, \"Yes, maybe. I don't know.\" Then the mouse asked, \"Are you afraid to be alone?\" The little prince thought for a moment, \"Not",
        "textdich": ""
    },
    {
        "start": 2582.4,
        "end": 2598.48,
        "text": "really, but sometimes, yes. When the stars are quiet, I feel very small.\" The mouse looked at the sky. That's why I",
        "textdich": ""
    },
    {
        "start": 2593.28,
        "end": 2601.52,
        "text": "talk. I talk so the sky feels less big.",
        "textdich": ""
    },
    {
        "start": 2598.48,
        "end": 2605.76,
        "text": "That made the little prince smile. He understood.",
        "textdich": ""
    },
    {
        "start": 2603.2,
        "end": 2608.64,
        "text": "Sometimes we don't talk to get answers.",
        "textdich": ""
    },
    {
        "start": 2605.76,
        "end": 2615.599,
        "text": "We talked just to feel alive. He stayed with the mouse for a while. They shared a piece of bread the prince had in his",
        "textdich": ""
    },
    {
        "start": 2612.88,
        "end": 2625.839,
        "text": "pocket. They watched the stars come out slowly, one by one. Before he left, the mouse gave the little prince a tiny",
        "textdich": ""
    },
    {
        "start": 2621.359,
        "end": 2636.8,
        "text": "gift. A small round seed. \"It's a quiet seed,\" said the mouse. \"Plant it somewhere on your journey. Maybe it will grow, maybe it won't, but it will not",
        "textdich": ""
    },
    {
        "start": 2633.599,
        "end": 2648.079,
        "text": "forget that you came.\" The little prince put the seed in his pocket. He said goodbye to the mouse. The mouse waved with its tiny paw. \"Thank you for",
        "textdich": ""
    },
    {
        "start": 2645.04,
        "end": 2657.839,
        "text": "talking,\" it said. Sometimes words are the best food. The little prince flew off to the next planet, the wind behind",
        "textdich": ""
    },
    {
        "start": 2653.599,
        "end": 2666.319,
        "text": "him. But he felt something new inside, a kind of peace. Talking to the mouse had reminded him that even small voices",
        "textdich": ""
    },
    {
        "start": 2663.28,
        "end": 2677.68,
        "text": "matter. Even tiny lives are full of meaning. And deep in his heart, he understood something important. Real connection does not need a big crowd. It",
        "textdich": ""
    },
    {
        "start": 2675.119,
        "end": 2688.079,
        "text": "only needs one heart listening to another. Chapter 13. People. The little prince visited the next planet. It was",
        "textdich": ""
    },
    {
        "start": 2685.119,
        "end": 2690.96,
        "text": "not big, but it had many strange things.",
        "textdich": ""
    },
    {
        "start": 2688.079,
        "end": 2697.92,
        "text": "The prince saw three people. Each one lived alone on his own little piece of land. The first man was wearing a big",
        "textdich": ""
    },
    {
        "start": 2695.52,
        "end": 2706.64,
        "text": "hat. He stood in the middle of his land and kept bowing again and again. He bowed when no one was there. But when he",
        "textdich": ""
    },
    {
        "start": 2704.079,
        "end": 2715.04,
        "text": "saw the little prince, he smiled proudly and bowed deeply. The prince asked him, \"Why do you bow like that?\" The man",
        "textdich": ""
    },
    {
        "start": 2712.8,
        "end": 2727.599,
        "text": "said, \"Because I am a very important person. I bow to thank people when they clap for me.\" The little prince was confused, but I did not clap, he said.",
        "textdich": ""
    },
    {
        "start": 2723.599,
        "end": 2736.079,
        "text": "The man said, \"Please clap for me.\" The little prince clapped a little. The man smiled again, lifted his hat, and bowed",
        "textdich": ""
    },
    {
        "start": 2733.04,
        "end": 2747.359,
        "text": "many times. The prince asked him, \"Do you only care about people clapping?\" The man said, \"Yes, I want to be admired. I want to be the most handsome,",
        "textdich": ""
    },
    {
        "start": 2744.4,
        "end": 2758.64,
        "text": "the richest, the smartest man on my planet.\" The little prince looked around. There was no one else. He was the only man on this small planet. There",
        "textdich": ""
    },
    {
        "start": 2756.16,
        "end": 2760.8,
        "text": "was no one to compare with.",
        "textdich": ""
    },
    {
        "start": 2758.64,
        "end": 2769.44,
        "text": "How can you be the best?\" asked the little prince. \"If you are the only one here,\" the man didn't answer. He was too",
        "textdich": ""
    },
    {
        "start": 2766.8,
        "end": 2780.8,
        "text": "busy bowing and admiring himself in a small broken mirror. The prince felt something strange in his heart. He thought, \"Grown-ups really are very",
        "textdich": ""
    },
    {
        "start": 2777.76,
        "end": 2789.119,
        "text": "strange.\" He left that man and walked to another place. There he saw a man with red eyes. He was sitting next to a few",
        "textdich": ""
    },
    {
        "start": 2786.24,
        "end": 2801.119,
        "text": "empty bottles. Some were full, some were empty. The man looked very tired. The little prince asked, \"What are you doing?\" The man said, \"I'm drinking.\"",
        "textdich": ""
    },
    {
        "start": 2798.96,
        "end": 2813.04,
        "text": "The little prince said, \"Why are you drinking?\" The man answered, \"To forget.\" The prince asked, \"To forget what?\" The man looked down and said, \"To",
        "textdich": ""
    },
    {
        "start": 2810.4,
        "end": 2822.56,
        "text": "forget that I am ashamed.\" The prince asked softly, \"Ashamed of what?\" the man said, ashamed of drinking. Then he said",
        "textdich": ""
    },
    {
        "start": 2819.52,
        "end": 2830.48,
        "text": "nothing more. He just drank and looked sad. The little prince sat there for a minute. He watched the man drink from",
        "textdich": ""
    },
    {
        "start": 2827.68,
        "end": 2839.44,
        "text": "one bottle and then look at the sky. The man had tears in his eyes. He was not a bad person, just lost. The prince didn't",
        "textdich": ""
    },
    {
        "start": 2836.88,
        "end": 2848.16,
        "text": "know what to say. He stood up slowly and continued walking. Then he met the third man. He looked very serious. He sat at a",
        "textdich": ""
    },
    {
        "start": 2845.76,
        "end": 2862.24,
        "text": "desk with paper and a pencil. He was counting 1 2 3 4 500 1,200,000 stars. He looked tired but excited. The little prince asked, \"Why are you",
        "textdich": ""
    },
    {
        "start": 2859.52,
        "end": 2868.88,
        "text": "counting stars?\" The man said, \"Because I own them.\" The prince was surprised.",
        "textdich": ""
    },
    {
        "start": 2865.119,
        "end": 2876.24,
        "text": "\"You own the stars?\" The man said, \"Yes, I count them and write the number on paper. That means they belong to me. The",
        "textdich": ""
    },
    {
        "start": 2874.16,
        "end": 2886.0,
        "text": "prince said, \"But the stars are in the sky. How can you own them?\" The man replied, \"I saw them first.\" \"I thought",
        "textdich": ""
    },
    {
        "start": 2882.72,
        "end": 2895.04,
        "text": "of owning them, so I wrote it down. That makes me the owner.\" The little prince asked, \"What do you do with the stars?\"",
        "textdich": ""
    },
    {
        "start": 2891.92,
        "end": 2905.04,
        "text": "The man answered, \"Nothing. I just own them. That is enough.\" The little prince became quiet. Then he said, \"I have a",
        "textdich": ""
    },
    {
        "start": 2901.68,
        "end": 2912.559,
        "text": "flower. I water her. I protect her. I listen to her. That is how I care for her. But you don't care for the stars.",
        "textdich": ""
    },
    {
        "start": 2910.48,
        "end": 2924.079,
        "text": "You only count them. That's not the same.\" The man didn't understand. He went back to counting. The little prince walked away slowly. He was thinking,",
        "textdich": ""
    },
    {
        "start": 2921.119,
        "end": 2930.16,
        "text": "\"All three people lived alone. All three were adults. One wanted to be admired.",
        "textdich": ""
    },
    {
        "start": 2927.52,
        "end": 2936.559,
        "text": "One wanted to forget. One wanted to own things, but none of them truly lived.",
        "textdich": ""
    },
    {
        "start": 2933.68,
        "end": 2944.72,
        "text": "None of them loved. None of them looked at the stars with joy. They were busy with strange things. The little prince",
        "textdich": ""
    },
    {
        "start": 2942.48,
        "end": 2956.319,
        "text": "looked up at the sky and whispered, \"Grown-ups are very, very strange.\" But he also felt something heavy in his chest. He thought about his flower. He",
        "textdich": ""
    },
    {
        "start": 2953.44,
        "end": 2962.24,
        "text": "had left her behind. Was he just like the others now, walking but not feeling?",
        "textdich": ""
    },
    {
        "start": 2959.599,
        "end": 2970.24,
        "text": "He wasn't sure, but he knew he had to keep going. Maybe the next planet would help him understand what truly matters.",
        "textdich": ""
    },
    {
        "start": 2968.24,
        "end": 2971.92,
        "text": "Chapter 14.",
        "textdich": ""
    },
    {
        "start": 2970.24,
        "end": 2974.559,
        "text": "Businessman.",
        "textdich": ""
    },
    {
        "start": 2971.92,
        "end": 2985.119,
        "text": "The little prince kept walking. He arrived at another part of the small planet. There he saw a man who looked very, very busy. He was wearing a gray",
        "textdich": ""
    },
    {
        "start": 2982.72,
        "end": 2994.0,
        "text": "suit. He was sitting at a table full of papers. He had a big notebook in front of him. He was writing numbers and looking up at the sky. The man didn't",
        "textdich": ""
    },
    {
        "start": 2991.68,
        "end": 3002.8,
        "text": "even look at the prince. His eyes were serious. His hands were fast. He was counting. He didn't smile. He didn't",
        "textdich": ""
    },
    {
        "start": 3000.16,
        "end": 3012.0,
        "text": "stop. The little prince stood there for a while. Then he asked, \"Hello, what are you doing?\" The man replied quickly,",
        "textdich": ""
    },
    {
        "start": 3009.359,
        "end": 3015.44,
        "text": "\"I'm very busy. I don't have time to talk.",
        "textdich": ""
    },
    {
        "start": 3013.2,
        "end": 3027.04,
        "text": "The little prince waited. He asked again, \"What are you doing?\" The man finally looked at him and said, \"I am a businessman. I am counting stars.\" The",
        "textdich": ""
    },
    {
        "start": 3024.48,
        "end": 3035.359,
        "text": "little prince was surprised. \"You count stars?\" he asked. \"Yes,\" said the businessman. \"I count them.\" \"I write",
        "textdich": ""
    },
    {
        "start": 3032.96,
        "end": 3045.52,
        "text": "the number in my notebook. Then I locked the notebook in a drawer. That way, I know I own them.\" The little prince sat down and looked at",
        "textdich": ""
    },
    {
        "start": 3041.92,
        "end": 3056.88,
        "text": "the stars above. He said, \"You own the stars?\" The man nodded. \"Yes, I was the first to think about owning them. That makes them mine.\"",
        "textdich": ""
    },
    {
        "start": 3054.16,
        "end": 3065.68,
        "text": "The little prince was quiet. Then he asked, \"And what do you do with the stars?\" The man replied, \"I do nothing.",
        "textdich": ""
    },
    {
        "start": 3063.2,
        "end": 3075.2,
        "text": "I just own them.\" The prince didn't understand. He said, \"I have a flower. I water her. I protect her from the wind.",
        "textdich": ""
    },
    {
        "start": 3072.079,
        "end": 3082.64,
        "text": "I listen to her. That's what I do because she is mine. The businessman looked confused.",
        "textdich": ""
    },
    {
        "start": 3080.079,
        "end": 3094.4,
        "text": "That's not the same, he said. I'm serious. I do important work. I'm a man of logic. I don't waste time on small things. The little prince looked down.",
        "textdich": ""
    },
    {
        "start": 3092.079,
        "end": 3102.079,
        "text": "He didn't like what he heard. Owning something is not the same as caring for it, he said softly. The businessman",
        "textdich": ""
    },
    {
        "start": 3099.28,
        "end": 3106.079,
        "text": "didn't listen. He kept writing numbers.",
        "textdich": ""
    },
    {
        "start": 3102.079,
        "end": 3114.48,
        "text": "I own 5001 million stars, he said. Maybe more. I need to recount them. I don't want to lose track. The prince watched",
        "textdich": ""
    },
    {
        "start": 3111.2,
        "end": 3122.4,
        "text": "him. The man seemed tired. His eyes were dull. His hands were shaking from writing so much. He wasn't smiling. He",
        "textdich": ""
    },
    {
        "start": 3119.44,
        "end": 3130.319,
        "text": "wasn't happy. He was just working. The little prince stood up. You are not rich, he said. You are poor. You don't",
        "textdich": ""
    },
    {
        "start": 3128.079,
        "end": 3140.64,
        "text": "enjoy the stars. You don't even look at them. You only count them. That's not living. That's just writing numbers. The man didn't respond. He just kept",
        "textdich": ""
    },
    {
        "start": 3138.319,
        "end": 3150.96,
        "text": "counting. The prince turned away and looked at the sky. The stars were bright. They looked beautiful. He thought about his flower. She was far",
        "textdich": ""
    },
    {
        "start": 3148.559,
        "end": 3157.119,
        "text": "away now. She might be looking at the same sky. He wondered if she was okay.",
        "textdich": ""
    },
    {
        "start": 3154.72,
        "end": 3164.0,
        "text": "He missed her voice. He missed her little cough. He missed her silly words.",
        "textdich": ""
    },
    {
        "start": 3160.4,
        "end": 3174.88,
        "text": "She was not perfect, but she was real and she was his. The businessman had stars, but he didn't know them. He didn't touch them. He didn't love them.",
        "textdich": ""
    },
    {
        "start": 3172.48,
        "end": 3182.8,
        "text": "The little prince had a flower, and he missed her. He knew now that caring was more important than owning, that love",
        "textdich": ""
    },
    {
        "start": 3180.079,
        "end": 3193.52,
        "text": "was not about control. It was about giving time, giving attention, giving part of your heart. The little prince felt something warm and sad inside his",
        "textdich": ""
    },
    {
        "start": 3191.28,
        "end": 3203.92,
        "text": "chest. He said goodbye to the businessman, but the man didn't hear him. He was still counting. The prince looked at the stars one last time before",
        "textdich": ""
    },
    {
        "start": 3201.359,
        "end": 3214.16,
        "text": "leaving. They were free. They were shining. And they belong to no one. Or maybe maybe they belong to the people who looked at them with love.",
        "textdich": ""
    },
    {
        "start": 3212.0,
        "end": 3218.0,
        "text": "Chapter 15.",
        "textdich": ""
    },
    {
        "start": 3214.16,
        "end": 3226.72,
        "text": "Lamp. The little prince walked on. He felt quiet inside. The last planet made him think a lot. Then he saw a small",
        "textdich": ""
    },
    {
        "start": 3223.76,
        "end": 3234.559,
        "text": "planet with only one man. This man was standing next to a tall street lamp. The lamp was old but strong. The man had a",
        "textdich": ""
    },
    {
        "start": 3232.0,
        "end": 3240.16,
        "text": "long coat and a hat. He held a stick in his hand. The little prince watched him.",
        "textdich": ""
    },
    {
        "start": 3237.839,
        "end": 3243.76,
        "text": "Every minute the man would turn on the lamp.",
        "textdich": ""
    },
    {
        "start": 3241.44,
        "end": 3251.52,
        "text": "Then one minute later, he would turn it off, then on, then off, again and again.",
        "textdich": ""
    },
    {
        "start": 3248.64,
        "end": 3264.4,
        "text": "The prince was confused, but also curious. \"Good morning,\" said the little prince. \"Why do you keep turning the lamp on and off?\" The man stopped for a",
        "textdich": ""
    },
    {
        "start": 3260.24,
        "end": 3273.52,
        "text": "second. He looked kind but tired. \"It is the order,\" he said. Long ago, the rule was to turn on the lamp when night comes",
        "textdich": ""
    },
    {
        "start": 3270.72,
        "end": 3283.28,
        "text": "and turn it off when day comes. It was easy then. One turn in the morning, one turn in the evening. But now the planet",
        "textdich": ""
    },
    {
        "start": 3280.4,
        "end": 3294.319,
        "text": "spins faster and faster, so day and night come every minute, and I must turn the lamp on and off, on and off again and again. The little prince was",
        "textdich": ""
    },
    {
        "start": 3290.559,
        "end": 3297.44,
        "text": "surprised. \"That sounds hard,\" he said.",
        "textdich": ""
    },
    {
        "start": 3294.319,
        "end": 3306.88,
        "text": "The man nodded. It is, but I must follow the rule. The little prince sat down and watched. The man moved with care. He",
        "textdich": ""
    },
    {
        "start": 3303.92,
        "end": 3315.92,
        "text": "didn't complain. He didn't rest. He just worked. He turned the lamp on, then he turned it off. He never stopped. His",
        "textdich": ""
    },
    {
        "start": 3313.359,
        "end": 3325.28,
        "text": "face was serious. But his eyes were kind. He was different from the king, different from the businessman. He didn't want power. He didn't want",
        "textdich": ""
    },
    {
        "start": 3322.96,
        "end": 3333.76,
        "text": "numbers. He just wanted to do his job well. I like this man, thought the little prince. He is the only one I met",
        "textdich": ""
    },
    {
        "start": 3331.119,
        "end": 3343.28,
        "text": "who does something for others. The light from the lamp helped no one else. But the man still kept his promise. Even when it was hard, even when he was",
        "textdich": ""
    },
    {
        "start": 3341.04,
        "end": 3353.52,
        "text": "tired, the prince saw something beautiful in this man. The beauty of keeping your word. The beauty of simple work done with heart.",
        "textdich": ""
    },
    {
        "start": 3350.559,
        "end": 3360.799,
        "text": "After a while, the little prince asked, \"Why don't you rest?\" The man smiled.",
        "textdich": ""
    },
    {
        "start": 3357.52,
        "end": 3370.72,
        "text": "\"Because I have no time,\" he said. \"The planet turns too fast. I must keep working.\" The prince thought for a moment. Then he said, \"Maybe you can",
        "textdich": ""
    },
    {
        "start": 3368.4,
        "end": 3379.52,
        "text": "walk very slowly. Then you can stay in the sunlight. You won't need to light the lamp.\" The man laughed a little.",
        "textdich": ""
    },
    {
        "start": 3376.16,
        "end": 3386.4,
        "text": "\"That is smart,\" he said. But I don't have the strength. I am too tired now.",
        "textdich": ""
    },
    {
        "start": 3383.52,
        "end": 3394.16,
        "text": "The prince felt sad. He wanted to help, but he didn't know how. Before leaving, the little prince said, \"Your work is",
        "textdich": ""
    },
    {
        "start": 3391.68,
        "end": 3406.64,
        "text": "simple, but you are the best grown-up I have met so far. You care. You do your job even when it's not easy. That is special.\" The man smiled again. He",
        "textdich": ""
    },
    {
        "start": 3403.76,
        "end": 3409.76,
        "text": "turned the lamp on one more time.",
        "textdich": ""
    },
    {
        "start": 3406.64,
        "end": 3418.88,
        "text": "Thank you, little one,\" he said. \"Safe travels.\" The little prince walked away slowly. The light behind him flickered",
        "textdich": ""
    },
    {
        "start": 3415.68,
        "end": 3427.52,
        "text": "on, then off again. He thought about what he just saw. The man didn't talk much. He didn't dream big dreams. But he",
        "textdich": ""
    },
    {
        "start": 3425.119,
        "end": 3430.24,
        "text": "did something small with great love.",
        "textdich": ""
    },
    {
        "start": 3427.52,
        "end": 3438.4,
        "text": "That made him great. As the little prince looked up at the stars, he thought, \"Maybe doing one thing with love is better than having everything",
        "textdich": ""
    },
    {
        "start": 3435.839,
        "end": 3448.0,
        "text": "and doing nothing.\" That thought made him smile, even though he felt a little tired, too. Chapter 16. Geographer. The",
        "textdich": ""
    },
    {
        "start": 3445.52,
        "end": 3455.92,
        "text": "little prince came to another planet. It was bigger than the last ones. There was a man sitting at a high desk. He wore",
        "textdich": ""
    },
    {
        "start": 3453.2,
        "end": 3462.88,
        "text": "glasses and looked very serious. Books were stacked around him. big books with thick covers. The man did not look up at",
        "textdich": ""
    },
    {
        "start": 3460.72,
        "end": 3472.4,
        "text": "first. He was busy writing something in a notebook. The little prince stood quietly, then softly said. Good morning.",
        "textdich": ""
    },
    {
        "start": 3469.52,
        "end": 3484.96,
        "text": "The man looked up and nodded. Good morning, said the man. Are you a traveler? The little prince smiled. Yes, he said. What do you do here? The man",
        "textdich": ""
    },
    {
        "start": 3481.839,
        "end": 3492.96,
        "text": "sat up straight. I am a geographer, he said. I study places. I write about rivers, mountains, oceans, and cities.",
        "textdich": ""
    },
    {
        "start": 3490.64,
        "end": 3501.2,
        "text": "The prince's eyes lit up. That sounds exciting. You must travel a lot and see many things. But the geographer shook",
        "textdich": ""
    },
    {
        "start": 3497.44,
        "end": 3504.0,
        "text": "his head. No, he said, \"I don't travel.",
        "textdich": ""
    },
    {
        "start": 3501.2,
        "end": 3512.24,
        "text": "I stay here. I wait for explorers. They go out and see the world. Then they come back and tell me. I write it all down.\"",
        "textdich": ""
    },
    {
        "start": 3509.599,
        "end": 3524.4,
        "text": "The little prince was quiet. He didn't understand. So, you never see the rivers or the mountains yourself? The geographer shook his head again. Number:",
        "textdich": ""
    },
    {
        "start": 3520.88,
        "end": 3532.88,
        "text": "That's not my job. I only write. I need to be exact. I don't have time to explore.\" The prince thought about that.",
        "textdich": ""
    },
    {
        "start": 3530.16,
        "end": 3540.319,
        "text": "It sounded strange. How could someone write about the world without touching it? The prince walked slowly around the",
        "textdich": ""
    },
    {
        "start": 3537.599,
        "end": 3550.16,
        "text": "room. He looked at the books. So many maps, so many lines, but no feeling, no warmth. Do you write about flowers? He",
        "textdich": ""
    },
    {
        "start": 3546.88,
        "end": 3553.68,
        "text": "asked. The geographer looked surprised.",
        "textdich": ""
    },
    {
        "start": 3550.16,
        "end": 3562.24,
        "text": "\"No,\" he said. \"Flowers don't last. They are not important. They disappear too quickly.\" The little prince looked down.",
        "textdich": ""
    },
    {
        "start": 3559.2,
        "end": 3573.52,
        "text": "His heart became heavy. \"My flower is important,\" he whispered. \"She may disappear, but she matters.\" The geographer heard his voice change. \"Why",
        "textdich": ""
    },
    {
        "start": 3570.319,
        "end": 3584.799,
        "text": "is your flower important?\" he asked. The prince didn't answer right away. Then he said, \"Because I love her.\" The geographer closed his book. He",
        "textdich": ""
    },
    {
        "start": 3582.24,
        "end": 3594.079,
        "text": "looked at the prince. Then she is important to you. But I only write about things that last forever. I write facts.",
        "textdich": ""
    },
    {
        "start": 3591.76,
        "end": 3596.64,
        "text": "The little prince walked to the window.",
        "textdich": ""
    },
    {
        "start": 3594.079,
        "end": 3598.24,
        "text": "He looked out into the stars.",
        "textdich": ""
    },
    {
        "start": 3596.64,
        "end": 3611.76,
        "text": "So, you only write about things that don't change?\" he asked. The geographer nodded. \"Yes, mountains, oceans, deserts, not flowers, not people.\" The",
        "textdich": ""
    },
    {
        "start": 3609.28,
        "end": 3620.48,
        "text": "prince felt something soft break inside him. The world of grown-ups felt colder on this planet. There was knowledge",
        "textdich": ""
    },
    {
        "start": 3616.559,
        "end": 3629.599,
        "text": "here, but not heart. He turned back to the man. \"Can you tell me where to go next?\" The geographer opened a map and",
        "textdich": ""
    },
    {
        "start": 3625.76,
        "end": 3638.559,
        "text": "pointed. \"Go to Earth,\" he said. \"It's a large planet.\" \"Very interesting.\" The prince nodded. \"Thank you.\" He was",
        "textdich": ""
    },
    {
        "start": 3636.0,
        "end": 3648.0,
        "text": "already thinking about his flower. She was alone. She was not in any book, but she was in his heart. As he flew away,",
        "textdich": ""
    },
    {
        "start": 3645.04,
        "end": 3655.44,
        "text": "he thought, \"Books are useful, but they don't tell you everything. They can't tell you if someone is kind. They can't",
        "textdich": ""
    },
    {
        "start": 3652.559,
        "end": 3658.319,
        "text": "tell you if a flower laughs or cries.",
        "textdich": ""
    },
    {
        "start": 3655.44,
        "end": 3665.04,
        "text": "Only your heart can know that. The stars above him looked like pages in a book, but brighter and alive. The prince",
        "textdich": ""
    },
    {
        "start": 3663.04,
        "end": 3674.24,
        "text": "decided that even if the flower was not in any book, he would keep her in his memory. That would be his story. Chapter",
        "textdich": ""
    },
    {
        "start": 3670.72,
        "end": 3685.359,
        "text": "19. Fox. The little prince walked away from the rose garden. His heart was still sad. His steps were slow. He did not know what to do. He did not know",
        "textdich": ""
    },
    {
        "start": 3681.839,
        "end": 3698.319,
        "text": "what to believe. He felt lost. He walked through the trees. He listened to the wind. Then he heard a voice. A small",
        "textdich": ""
    },
    {
        "start": 3693.359,
        "end": 3710.799,
        "text": "soft voice. It said, \"Good morning.\" The prince looked around. He saw something orange hiding in the grass. It was a fox. The fox had kind eyes and a",
        "textdich": ""
    },
    {
        "start": 3706.799,
        "end": 3715.28,
        "text": "calm face. The prince smiled.",
        "textdich": ""
    },
    {
        "start": 3710.799,
        "end": 3726.0,
        "text": "Good morning, he said. Who are you? I am a fox, said the animal. Will you play with me? The prince asked. I'm so sad. I",
        "textdich": ""
    },
    {
        "start": 3723.119,
        "end": 3736.16,
        "text": "cannot play with you, said the fox. I am not tamed. The prince was confused. What does that mean, tamed? The fox looked at",
        "textdich": ""
    },
    {
        "start": 3732.799,
        "end": 3744.48,
        "text": "him. It means to create ties, to need each other, to become special to each other. The little prince thought for a",
        "textdich": ""
    },
    {
        "start": 3741.119,
        "end": 3757.28,
        "text": "moment. I'm not sure I understand, he said. Explain it to me. The fox sat down. His voice was gentle. Right now, you are just a little boy to me like a",
        "textdich": ""
    },
    {
        "start": 3754.079,
        "end": 3766.799,
        "text": "100,000 other little boys. I do not need you and you do not need me. But if you take me, then we will need each other.",
        "textdich": ""
    },
    {
        "start": 3763.839,
        "end": 3771.52,
        "text": "You will be special to me. I will be special to you.",
        "textdich": ""
    },
    {
        "start": 3768.72,
        "end": 3774.799,
        "text": "The little prince listened carefully.",
        "textdich": ""
    },
    {
        "start": 3771.52,
        "end": 3777.359,
        "text": "I think I understand, he said slowly.",
        "textdich": ""
    },
    {
        "start": 3774.799,
        "end": 3784.24,
        "text": "There was a flower. She was special to me. The fox smiled.",
        "textdich": ""
    },
    {
        "start": 3780.64,
        "end": 3795.44,
        "text": "Yes, he said. That is how it starts, the prince asked. How do I tame you? The fox said. You must be patient. Sit down. Far",
        "textdich": ""
    },
    {
        "start": 3791.92,
        "end": 3804.48,
        "text": "from me. Don't speak. I will watch you with the corner of my eye. Each day, sit a little closer. The little prince",
        "textdich": ""
    },
    {
        "start": 3801.599,
        "end": 3808.48,
        "text": "visited the fox every day. He sat close.",
        "textdich": ""
    },
    {
        "start": 3804.48,
        "end": 3816.079,
        "text": "He smiled. He said kind words. The fox started to wait for him. His heart was happy when he saw the prince. He knew",
        "textdich": ""
    },
    {
        "start": 3813.28,
        "end": 3824.64,
        "text": "the prince's footsteps. The sound was music to him. He felt joy when the little prince came. He felt sadness when",
        "textdich": ""
    },
    {
        "start": 3821.599,
        "end": 3835.76,
        "text": "he left. One day the fox looked at the little prince. I must go now, said the boy. The fox was quiet. Then he said, \"I",
        "textdich": ""
    },
    {
        "start": 3832.24,
        "end": 3847.599,
        "text": "will cry.\" The prince felt sorry. It is your fault, said the fox gently. \"You tamed me.\" The little prince looked down. \"But you wanted me to.\" \"Yes,\"",
        "textdich": ""
    },
    {
        "start": 3844.88,
        "end": 3859.92,
        "text": "said the fox. \"And I am happy even if I cry.\" The wind moved through the grass. The sky was soft. The fox said, \"Here is my",
        "textdich": ""
    },
    {
        "start": 3856.24,
        "end": 3871.359,
        "text": "secret.\" It is very simple. You can only see clearly with your heart. What is important is invisible to the eyes. The prince repeated the words slowly,",
        "textdich": ""
    },
    {
        "start": 3868.64,
        "end": 3883.119,
        "text": "carefully. \"What is important is invisible to the eyes.\" The fox said, \"You are responsible forever for what you have tamed. You are responsible for",
        "textdich": ""
    },
    {
        "start": 3880.16,
        "end": 3895.839,
        "text": "your rose. The prince thought about the rose garden. He thought about his flower. She was the only one he had tamed. She was his rose. She was not",
        "textdich": ""
    },
    {
        "start": 3891.68,
        "end": 3899.039,
        "text": "just a rose. She was his rose.",
        "textdich": ""
    },
    {
        "start": 3895.839,
        "end": 3909.599,
        "text": "The little prince hugged the fox. Then he said goodbye. He walked away. His heart felt heavy, but also full. He had",
        "textdich": ""
    },
    {
        "start": 3906.0,
        "end": 3912.559,
        "text": "learned something true, something deep.",
        "textdich": ""
    },
    {
        "start": 3909.599,
        "end": 3921.92,
        "text": "The wind felt different now. The stars above looked softer. He was still sad, but also stronger.",
        "textdich": ""
    },
    {
        "start": 3919.68,
        "end": 3923.68,
        "text": "Chapter 20.",
        "textdich": ""
    },
    {
        "start": 3921.92,
        "end": 3926.64,
        "text": "Secret.",
        "textdich": ""
    },
    {
        "start": 3923.68,
        "end": 3935.52,
        "text": "The little prince walked quietly. His steps were slow. His heart was full of thoughts. The wind touched his face. The",
        "textdich": ""
    },
    {
        "start": 3932.319,
        "end": 3943.839,
        "text": "fox's words stayed in his mind. You are responsible for your rose. You can only see clearly with your heart. These words",
        "textdich": ""
    },
    {
        "start": 3941.119,
        "end": 3952.88,
        "text": "were like light in a dark room. They made him feel something deep, something hard to explain. He stopped and looked",
        "textdich": ""
    },
    {
        "start": 3948.88,
        "end": 3964.64,
        "text": "up at the sky. The clouds were soft. The sun was gentle. The world felt big. But the prince didn't feel small anymore. He",
        "textdich": ""
    },
    {
        "start": 3960.559,
        "end": 3975.839,
        "text": "felt connected to the fox, to the rose, to something more. He didn't know what to call it, but it was there. A feeling",
        "textdich": ""
    },
    {
        "start": 3971.52,
        "end": 3981.52,
        "text": "like love, a feeling like truth. He sat down under a tree and closed his eyes.",
        "textdich": ""
    },
    {
        "start": 3978.559,
        "end": 3991.599,
        "text": "He remembered the fox's face. The fox was wise. The fox was kind. He remembered the way the fox said the word secret, like it was something very",
        "textdich": ""
    },
    {
        "start": 3989.359,
        "end": 3997.76,
        "text": "important, like it could change everything. The prince opened his eyes.",
        "textdich": ""
    },
    {
        "start": 3995.359,
        "end": 4008.88,
        "text": "I want to remember that secret forever, he whispered. What is important is invisible. He touched his chest. It's",
        "textdich": ""
    },
    {
        "start": 4004.16,
        "end": 4017.76,
        "text": "here, he said. In my heart. He stood up again. He started walking. The grass moved around his feet. The sun followed",
        "textdich": ""
    },
    {
        "start": 4014.24,
        "end": 4031.92,
        "text": "him. He walked for a long time. Then he saw something in the distance. It was a railway track. He stood near it. He saw the lines go far, far away.",
        "textdich": ""
    },
    {
        "start": 4028.559,
        "end": 4041.28,
        "text": "He thought about people. Always moving, always rushing. The prince thought about what the fox said. \"People forget the",
        "textdich": ""
    },
    {
        "start": 4038.0,
        "end": 4053.44,
        "text": "truth,\" he said softly. \"But I will not forget.\" He smiled to himself. I will remember my rose. I will remember my friend. And then something wonderful",
        "textdich": ""
    },
    {
        "start": 4050.72,
        "end": 4063.2,
        "text": "happened. The prince felt a soft warmth in his heart like a flame. A little light. It didn't come from outside. It",
        "textdich": ""
    },
    {
        "start": 4059.839,
        "end": 4066.559,
        "text": "came from inside him. It was the secret.",
        "textdich": ""
    },
    {
        "start": 4063.2,
        "end": 4074.96,
        "text": "It was now part of him. The secret said, \"You are responsible for what you love.\" The prince stopped walking. That's it,",
        "textdich": ""
    },
    {
        "start": 4072.319,
        "end": 4083.52,
        "text": "he said. That's the meaning. That's why the fox gave me this secret. He sat down again and whispered to the wind. Even if",
        "textdich": ""
    },
    {
        "start": 4081.039,
        "end": 4095.44,
        "text": "I am far from my rose, I still care for her. Even if I am on another planet, I am still her friend. His voice was gentle. This is what love means. He",
        "textdich": ""
    },
    {
        "start": 4092.48,
        "end": 4106.48,
        "text": "looked at the sky. Maybe I was too young to understand my flower, he said. But now I know she was not just a flower.",
        "textdich": ""
    },
    {
        "start": 4103.199,
        "end": 4115.679,
        "text": "She was my flower. The prince felt the secret grow stronger inside him. He was not just a traveler now. He was someone",
        "textdich": ""
    },
    {
        "start": 4111.759,
        "end": 4121.199,
        "text": "who had tamed, someone who had loved and someone who would never forget.",
        "textdich": ""
    },
    {
        "start": 4118.48,
        "end": 4130.799,
        "text": "The sun began to set. The light turned golden. The wind was quiet. The prince closed his eyes. He felt peace.",
        "textdich": ""
    },
    {
        "start": 4128.719,
        "end": 4134.319,
        "text": "Chapter 21.",
        "textdich": ""
    },
    {
        "start": 4130.799,
        "end": 4136.719,
        "text": "Trains. The little prince kept walking.",
        "textdich": ""
    },
    {
        "start": 4134.319,
        "end": 4139.12,
        "text": "His heart was full of the fox's secret.",
        "textdich": ""
    },
    {
        "start": 4136.719,
        "end": 4147.92,
        "text": "He held it gently, like a gift that cannot break, but still must be protected. He was thinking about love, about being responsible for someone, and",
        "textdich": ""
    },
    {
        "start": 4146.08,
        "end": 4151.92,
        "text": "about the things that cannot be seen with the eyes.",
        "textdich": ""
    },
    {
        "start": 4150.0,
        "end": 4160.48,
        "text": "As he walked across the earth, he heard a loud sound in the distance. It was a train. The tracks were shaking. The air",
        "textdich": ""
    },
    {
        "start": 4157.6,
        "end": 4172.799,
        "text": "moved fast. The noise came closer and closer. Then the train passed. So many cars. So many windows, but not many faces inside. Just a blur of people",
        "textdich": ""
    },
    {
        "start": 4169.44,
        "end": 4174.56,
        "text": "rushing. The prince stood and watched.",
        "textdich": ""
    },
    {
        "start": 4172.799,
        "end": 4185.759,
        "text": "He looked at the train until it disappeared. He looked left. Another train came from the other direction. It was just as fast, just as loud, and it",
        "textdich": ""
    },
    {
        "start": 4183.199,
        "end": 4194.8,
        "text": "also disappeared quickly. Then a third train came and again it rushed by like wind. The little prince was quiet. He",
        "textdich": ""
    },
    {
        "start": 4192.08,
        "end": 4205.44,
        "text": "did not understand. Why do these trains move so fast? Why are people always going somewhere else? He saw a man standing by the station. The man looked",
        "textdich": ""
    },
    {
        "start": 4202.48,
        "end": 4214.08,
        "text": "tired. His suitcase was heavy. The little prince walked up to him and asked, \"Where are they going?\" The man looked at him and said, \"They don't",
        "textdich": ""
    },
    {
        "start": 4211.679,
        "end": 4224.64,
        "text": "know.\" Then the man walked away without saying more. The little prince stood there thinking, \"People are always running, always searching, always",
        "textdich": ""
    },
    {
        "start": 4221.04,
        "end": 4233.199,
        "text": "leaving, but they don't know why.\" That made the prince feel a little sad. He thought of the fox and the rose and the",
        "textdich": ""
    },
    {
        "start": 4230.32,
        "end": 4235.44,
        "text": "joy of knowing something truly matters.",
        "textdich": ""
    },
    {
        "start": 4233.199,
        "end": 4243.76,
        "text": "The people in the train seemed not to know that feeling. Children ran nearby laughing. They were not going anywhere.",
        "textdich": ""
    },
    {
        "start": 4241.44,
        "end": 4253.92,
        "text": "They were just playing. They had no suitcases, no watches, no tickets, but their eyes were full of joy. The little",
        "textdich": ""
    },
    {
        "start": 4250.88,
        "end": 4262.719,
        "text": "prince smiled. He sat down and watched the children play. One boy had a toy train. He was not in a hurry. He made it",
        "textdich": ""
    },
    {
        "start": 4259.76,
        "end": 4272.0,
        "text": "go in circles, forward and back, and he laughed every time. The prince thought, \"This is different. This train has a",
        "textdich": ""
    },
    {
        "start": 4268.64,
        "end": 4277.199,
        "text": "reason. It brings happiness. The little prince understood something new.",
        "textdich": ""
    },
    {
        "start": 4274.48,
        "end": 4282.719,
        "text": "Grown-ups make trains, build tracks, sell tickets. They spend time and money.",
        "textdich": ""
    },
    {
        "start": 4280.159,
        "end": 4284.88,
        "text": "But sometimes they forget why they move.",
        "textdich": ""
    },
    {
        "start": 4282.719,
        "end": 4288.08,
        "text": "They forget what they are looking for.",
        "textdich": ""
    },
    {
        "start": 4284.88,
        "end": 4294.08,
        "text": "They think going fast is the answer. But speed without purpose is just noise.",
        "textdich": ""
    },
    {
        "start": 4291.92,
        "end": 4300.0,
        "text": "The little prince watched the train toy again. The boy smiled as it moved.",
        "textdich": ""
    },
    {
        "start": 4297.84,
        "end": 4309.36,
        "text": "Only children know what they are looking for. The prince whispered to himself. He felt that truth deep in his heart. Only",
        "textdich": ""
    },
    {
        "start": 4307.6,
        "end": 4322.32,
        "text": "children remember to look with the heart. He looked at the sky again. The clouds were pink. The sun was going down. The light was soft. He remembered",
        "textdich": ""
    },
    {
        "start": 4318.719,
        "end": 4330.8,
        "text": "the fox. He remembered the rose. He remembered the secret. You are responsible for what you love.",
        "textdich": ""
    },
    {
        "start": 4327.44,
        "end": 4340.96,
        "text": "He repeated that again softly. The wind blew. It was a kind wind, like a friend, like someone saying, \"Keep going. You're",
        "textdich": ""
    },
    {
        "start": 4338.0,
        "end": 4342.96,
        "text": "learning.\" The little prince stood up.",
        "textdich": ""
    },
    {
        "start": 4340.96,
        "end": 4350.8,
        "text": "He started to walk again, but slower now. He had no train. He had no suitcase. But he had something better.",
        "textdich": ""
    },
    {
        "start": 4347.92,
        "end": 4358.239,
        "text": "He had love. He had memories. He had a purpose. And he would not forget it.",
        "textdich": ""
    },
    {
        "start": 4354.0,
        "end": 4368.32,
        "text": "Chapter 22. desert. The little prince kept walking. Now he was walking with the narrator, the pilot. They were in the desert together. The sun was hot.",
        "textdich": ""
    },
    {
        "start": 4365.6,
        "end": 4374.239,
        "text": "The ground was dry. There were no trees, no water, no people, just sand and sky.",
        "textdich": ""
    },
    {
        "start": 4371.52,
        "end": 4385.6,
        "text": "And they were very thirsty. The pilot felt tired. His lips were dry. His eyes looked around but saw nothing. No village, no house, not even a shadow.",
        "textdich": ""
    },
    {
        "start": 4382.48,
        "end": 4391.44,
        "text": "Only sand and more sand. He wanted to rest, but he also wanted to find water.",
        "textdich": ""
    },
    {
        "start": 4389.28,
        "end": 4399.92,
        "text": "The prince looked up at him and said, \"It is good to have a friend even when you are about to die.\" The pilot stopped",
        "textdich": ""
    },
    {
        "start": 4396.719,
        "end": 4408.32,
        "text": "walking. He looked at the boy. He felt something move inside his chest. Even though they were lost and thirsty, those",
        "textdich": ""
    },
    {
        "start": 4405.36,
        "end": 4416.0,
        "text": "words gave him comfort. They sat down on the sand. The wind touched their faces.",
        "textdich": ""
    },
    {
        "start": 4412.08,
        "end": 4424.0,
        "text": "It was quiet. too quiet. The pilot thought of his plane broken far away. He thought of home. He thought of all the",
        "textdich": ""
    },
    {
        "start": 4421.199,
        "end": 4431.84,
        "text": "people who don't understand children. He looked at the prince again. This small boy with golden hair had changed his",
        "textdich": ""
    },
    {
        "start": 4429.12,
        "end": 4442.4,
        "text": "world, not with loud words, not with power, but with soft questions, and with a heart that could see what was invisible. The little prince smiled. He",
        "textdich": ""
    },
    {
        "start": 4439.36,
        "end": 4450.96,
        "text": "was not afraid. Not even now. He looked at the sky. He said, \"The desert is beautiful.\" The pilot looked around. He",
        "textdich": ""
    },
    {
        "start": 4448.8,
        "end": 4460.32,
        "text": "didn't understand. There was nothing beautiful here. No flowers, no rivers, just empty space. He asked, \"Why do you",
        "textdich": ""
    },
    {
        "start": 4457.92,
        "end": 4468.8,
        "text": "say it's beautiful?\" The little prince answered, \"Because somewhere it hides a well.\" That sentence was like a light in",
        "textdich": ""
    },
    {
        "start": 4466.4,
        "end": 4479.04,
        "text": "the dark. The pilot understood what he meant. Even when you cannot see something, the hope that it exists makes everything feel different. They sat for",
        "textdich": ""
    },
    {
        "start": 4476.56,
        "end": 4492.159,
        "text": "a while, not speaking, just listening to the silence. And in that silence, something felt soft, not scary, not empty, but peaceful. The little prince",
        "textdich": ""
    },
    {
        "start": 4489.84,
        "end": 4502.239,
        "text": "looked at the sand, then at the stars above. He said, \"What is important is invisible.\" The pilot nodded. His heart felt full,",
        "textdich": ""
    },
    {
        "start": 4500.239,
        "end": 4514.159,
        "text": "not with water, but with something warmer, something like love or understanding or being seen. The prince leaned against him. The sky turned",
        "textdich": ""
    },
    {
        "start": 4510.64,
        "end": 4522.08,
        "text": "darker. Night was coming, but the fear was less now. Even without water, even without a map, the pilot knew something",
        "textdich": ""
    },
    {
        "start": 4519.6,
        "end": 4529.6,
        "text": "was growing between them, something that was stronger than thirst. He thought again about the prince's words. It is",
        "textdich": ""
    },
    {
        "start": 4527.36,
        "end": 4538.4,
        "text": "good to have a friend even when you are about to die. Yes, it was true. A true friend makes pain smaller. A friend",
        "textdich": ""
    },
    {
        "start": 4536.4,
        "end": 4546.48,
        "text": "makes you feel alive even in the middle of a desert. Even when you don't know what tomorrow will bring. They looked at",
        "textdich": ""
    },
    {
        "start": 4543.52,
        "end": 4557.84,
        "text": "the stars together. The prince said, \"Sometimes when you feel very small, you understand big things.\" The pilot did not speak. He just",
        "textdich": ""
    },
    {
        "start": 4554.0,
        "end": 4564.0,
        "text": "listened. And in that quiet, they became even closer, not in words, but in heart.",
        "textdich": ""
    },
    {
        "start": 4562.08,
        "end": 4567.6,
        "text": "And that kind of closeness needs no explanation.",
        "textdich": ""
    },
    {
        "start": 4565.6,
        "end": 4578.8,
        "text": "The desert had taken everything from them. Water, strength, direction. But it had also given them something more, a deep connection, a gentle peace, a",
        "textdich": ""
    },
    {
        "start": 4576.48,
        "end": 4584.239,
        "text": "moment of truth that would live forever in the pilot's memory.",
        "textdich": ""
    },
    {
        "start": 4581.6,
        "end": 4586.56,
        "text": "Chapter 23.",
        "textdich": ""
    },
    {
        "start": 4584.239,
        "end": 4594.719,
        "text": "Well, the night passed slowly in the desert. The stars moved across the sky like silent friends. The little prince",
        "textdich": ""
    },
    {
        "start": 4591.92,
        "end": 4599.199,
        "text": "slept quietly near the pilot. The air was cool now, and the world was quiet.",
        "textdich": ""
    },
    {
        "start": 4597.28,
        "end": 4609.84,
        "text": "The pilot looked at the boy's face in the moonlight. It was peaceful, like a child dreaming of something kind. And the pilot thought again about how",
        "textdich": ""
    },
    {
        "start": 4606.96,
        "end": 4616.32,
        "text": "strange this journey had become. He had come to fix his plane, but he had found something more important.",
        "textdich": ""
    },
    {
        "start": 4614.239,
        "end": 4621.44,
        "text": "He had found someone who reminded him how to see with the heart.",
        "textdich": ""
    },
    {
        "start": 4619.199,
        "end": 4631.28,
        "text": "When morning came, the sun touched the sand with golden light. The little prince stood up and smiled. He looked into the distance and said, \"Let's find",
        "textdich": ""
    },
    {
        "start": 4629.52,
        "end": 4644.159,
        "text": "a well.\" The pilot stood too. He didn't ask where or how or why. He simply walked beside the prince. Because when someone you",
        "textdich": ""
    },
    {
        "start": 4640.239,
        "end": 4653.44,
        "text": "trust says, \"Let's go,\" you follow. Even if there's only sand in every direction, even if it feels impossible, they walked",
        "textdich": ""
    },
    {
        "start": 4649.76,
        "end": 4663.28,
        "text": "for a long time. The sun grew hot. The pilot's body felt tired, but something inside him felt strong. The little prince walked like someone who already",
        "textdich": ""
    },
    {
        "start": 4660.8,
        "end": 4672.56,
        "text": "knew where they were going. And then, when the pilot was almost too tired to go on, the prince stopped. Look, he",
        "textdich": ""
    },
    {
        "start": 4669.36,
        "end": 4683.92,
        "text": "said, down there. And in front of them, the sand was shaped like a smile. It was not just sand. It was the edge of something, a stone wall, a circle, a",
        "textdich": ""
    },
    {
        "start": 4681.199,
        "end": 4692.64,
        "text": "real well. The pilot felt his heart jump. He knelt down beside it. The well was old but beautiful. It had a rope and",
        "textdich": ""
    },
    {
        "start": 4689.92,
        "end": 4700.88,
        "text": "a wooden wheel. There was a bucket, too, the kind of well you read about in stories. He pulled the rope. The wheel",
        "textdich": ""
    },
    {
        "start": 4697.52,
        "end": 4709.04,
        "text": "turned slowly. It made a soft sound. It was like music after silence. The bucket rose heavy with water. The little prince",
        "textdich": ""
    },
    {
        "start": 4706.4,
        "end": 4716.32,
        "text": "watched with wide eyes. The pilot gave him the bucket. The prince drank. He drank with his eyes closed slowly like",
        "textdich": ""
    },
    {
        "start": 4714.32,
        "end": 4720.64,
        "text": "it was the best thing in the world. And then he gave the bucket to the pilot.",
        "textdich": ""
    },
    {
        "start": 4718.719,
        "end": 4729.6,
        "text": "The water was cool, but it was more than that. It tasted like walking in the desert, like silence, like stars. It",
        "textdich": ""
    },
    {
        "start": 4726.56,
        "end": 4737.44,
        "text": "tasted like hope. And the pilot realized something. This water was special. Not because of the well, but because of the",
        "textdich": ""
    },
    {
        "start": 4734.64,
        "end": 4746.56,
        "text": "journey. Because they had walked and waited and hoped. That made the water sweeter than anything else. The little",
        "textdich": ""
    },
    {
        "start": 4743.36,
        "end": 4752.719,
        "text": "prince said, \"People forget this. They look at things fast. They don't see the secret inside. But when you work for",
        "textdich": ""
    },
    {
        "start": 4750.719,
        "end": 4765.12,
        "text": "something, when you wait and walk and hope, it becomes beautiful.\" The pilot nodded. He looked at the water again. It really was beautiful. They sat",
        "textdich": ""
    },
    {
        "start": 4762.48,
        "end": 4772.88,
        "text": "beside the well. The pilot thought about people who drink water every day and never feel this kind of joy. He thought",
        "textdich": ""
    },
    {
        "start": 4769.84,
        "end": 4781.76,
        "text": "about cities and machines and busy lives. He thought about how simple things like a glass of water can become magic when you look at them with your",
        "textdich": ""
    },
    {
        "start": 4780.4,
        "end": 4784.159,
        "text": "heart.",
        "textdich": ""
    },
    {
        "start": 4781.76,
        "end": 4792.96,
        "text": "The little prince looked up and said, \"I'm going home soon.\" The pilot didn't speak. He just listened. He knew now",
        "textdich": ""
    },
    {
        "start": 4790.719,
        "end": 4801.6,
        "text": "that the prince's home was not a city or a street. It was a planet far away, a place with a rose, a volcano, a chair",
        "textdich": ""
    },
    {
        "start": 4798.8,
        "end": 4810.4,
        "text": "for sunsets. And something inside, the pilot began to feel heavy. But the prince smiled. \"Don't be sad,\" he said.",
        "textdich": ""
    },
    {
        "start": 4807.76,
        "end": 4820.239,
        "text": "\"You found the well, didn't you?\" The pilot smiled too. He understood. The desert had not taken everything. It had",
        "textdich": ""
    },
    {
        "start": 4816.239,
        "end": 4821.92,
        "text": "given him something more. Chapter 24.",
        "textdich": ""
    },
    {
        "start": 4820.239,
        "end": 4824.64,
        "text": "Water.",
        "textdich": ""
    },
    {
        "start": 4821.92,
        "end": 4833.199,
        "text": "They sat quietly beside the well. The sun was high now, but it didn't feel hot. The little prince smiled and looked at the bucket. He touched the wood",
        "textdich": ""
    },
    {
        "start": 4831.199,
        "end": 4844.0,
        "text": "gently as if it was something very precious. The pilot looked at him and felt something in his heart. It was a strange feeling. It was love. Not the",
        "textdich": ""
    },
    {
        "start": 4841.6,
        "end": 4851.44,
        "text": "kind of love you read in stories. Not the kind that is loud and full of drama, but the quiet kind. The kind you feel",
        "textdich": ""
    },
    {
        "start": 4849.44,
        "end": 4860.08,
        "text": "when someone changes the way you see the world. The little prince said, \"People on earth grow thousands of roses in one",
        "textdich": ""
    },
    {
        "start": 4857.84,
        "end": 4866.239,
        "text": "garden, but they do not find what they are looking for.\" The pilot listened.",
        "textdich": ""
    },
    {
        "start": 4863.52,
        "end": 4874.0,
        "text": "And yet, the prince continued, what they are looking for could be found in a single rose or a little water. He picked",
        "textdich": ""
    },
    {
        "start": 4871.12,
        "end": 4876.96,
        "text": "up the bucket again and looked inside.",
        "textdich": ""
    },
    {
        "start": 4874.0,
        "end": 4887.6,
        "text": "But people don't see, he said. They look with their eyes, but not with their hearts. The pilot said nothing. He understood now. He thought of all the",
        "textdich": ""
    },
    {
        "start": 4885.28,
        "end": 4897.679,
        "text": "things people chase. Big houses, expensive cars, important jobs, so much noise, so much running, but very little",
        "textdich": ""
    },
    {
        "start": 4894.08,
        "end": 4906.88,
        "text": "feeling, very little quiet, very little heart. He remembered something the prince said before. What is important is",
        "textdich": ""
    },
    {
        "start": 4903.44,
        "end": 4914.719,
        "text": "invisible to the eyes. And now, sitting beside a simple well with a child from another planet, he knew it was true.",
        "textdich": ""
    },
    {
        "start": 4912.88,
        "end": 4920.56,
        "text": "The little prince leaned back and looked at the sky.",
        "textdich": ""
    },
    {
        "start": 4916.719,
        "end": 4929.92,
        "text": "My rose is alone, he said. I left her behind. I didn't understand her. I didn't know how to love her. She looked",
        "textdich": ""
    },
    {
        "start": 4926.32,
        "end": 4937.92,
        "text": "proud, but she was soft inside. She only had her four thorns, and I left her. The wind moved gently through the air. The",
        "textdich": ""
    },
    {
        "start": 4935.84,
        "end": 4944.719,
        "text": "pilot looked at the boy and saw sadness in his face, not the kind that cries, but the kind that lives quietly in the",
        "textdich": ""
    },
    {
        "start": 4942.239,
        "end": 4953.6,
        "text": "heart. The pilot wanted to say something to help, but he didn't know what words to use. Sometimes silence is better than",
        "textdich": ""
    },
    {
        "start": 4950.4,
        "end": 4962.48,
        "text": "words, so he just sat with the boy. And in that silence, they both thought about love. Real love, the kind that is not",
        "textdich": ""
    },
    {
        "start": 4960.08,
        "end": 4972.719,
        "text": "perfect, the kind that is sometimes difficult, but also the kind that stays in your heart even when you are far away. Then the little prince said",
        "textdich": ""
    },
    {
        "start": 4969.36,
        "end": 4982.159,
        "text": "something very soft. The stars are beautiful because of a flower you cannot see. The pilot smiled. He understood now",
        "textdich": ""
    },
    {
        "start": 4979.6,
        "end": 4990.32,
        "text": "that the stars were not just stars. They were lights filled with meaning. They were reminders of love, of friendship,",
        "textdich": ""
    },
    {
        "start": 4987.679,
        "end": 5001.04,
        "text": "of quiet moments like this one. The desert was still. There was no sound except the wind. And in that quiet, everything felt full.",
        "textdich": ""
    },
    {
        "start": 4998.719,
        "end": 5008.0,
        "text": "The little prince said, \"I will give you a gift. When you look up at the sky, you will see the stars. And because I will",
        "textdich": ""
    },
    {
        "start": 5006.0,
        "end": 5019.76,
        "text": "be living on one of them, it will be like all the stars are laughing.\" He laughed a little when he said this. \"You will have stars that can laugh,\" he",
        "textdich": ""
    },
    {
        "start": 5016.4,
        "end": 5029.52,
        "text": "said. The pilot laughed, too. He imagined looking up at the stars and hearing laughter. And for the first time, the sky felt alive. The pilot",
        "textdich": ""
    },
    {
        "start": 5027.92,
        "end": 5037.679,
        "text": "helped the little prince carry the bucket. They walked slowly, side by side with the quiet joy that only comes when",
        "textdich": ""
    },
    {
        "start": 5034.96,
        "end": 5046.719,
        "text": "your heart is full. They did not speak much. They didn't need to. The well had given them more than water. It had given",
        "textdich": ""
    },
    {
        "start": 5043.28,
        "end": 5053.76,
        "text": "them a moment, a memory, a feeling they would never forget. Chapter 25.",
        "textdich": ""
    },
    {
        "start": 5050.719,
        "end": 5061.679,
        "text": "Wall. The sun was starting to set. The sky slowly changed its colors. It was golden at first, then pink, then soft",
        "textdich": ""
    },
    {
        "start": 5058.719,
        "end": 5068.719,
        "text": "purple. The desert was quiet again, but this time it felt different. There was a strange kind of peace in the air, like",
        "textdich": ""
    },
    {
        "start": 5066.159,
        "end": 5071.28,
        "text": "the whole world was holding its breath.",
        "textdich": ""
    },
    {
        "start": 5068.719,
        "end": 5073.84,
        "text": "The pilot walked with the little prince.",
        "textdich": ""
    },
    {
        "start": 5071.28,
        "end": 5081.52,
        "text": "They didn't talk much. The little prince looked thoughtful, like he had made a big decision, a quiet one, a decision",
        "textdich": ""
    },
    {
        "start": 5078.88,
        "end": 5088.8,
        "text": "from the heart. They walked until they reached a low stone wall. It stood there alone in the middle of the desert. It",
        "textdich": ""
    },
    {
        "start": 5086.639,
        "end": 5097.199,
        "text": "looked like a place where something ends or maybe begins. The little prince stopped and looked at the wall. He stood",
        "textdich": ""
    },
    {
        "start": 5094.0,
        "end": 5099.44,
        "text": "very still. The pilot stood beside him.",
        "textdich": ""
    },
    {
        "start": 5097.199,
        "end": 5107.04,
        "text": "He didn't ask questions, but something inside him felt heavy, like a shadow growing longer. The little prince turned",
        "textdich": ""
    },
    {
        "start": 5104.639,
        "end": 5114.639,
        "text": "his head slowly and said, \"This is the place.\" The pilot didn't understand.",
        "textdich": ""
    },
    {
        "start": 5110.639,
        "end": 5122.0,
        "text": "\"What place?\" he asked gently. The boy didn't answer right away. He walked closer to the wall and looked down.",
        "textdich": ""
    },
    {
        "start": 5119.6,
        "end": 5132.96,
        "text": "There was nothing there, just sand and silence. But then something moved, a soft noise, a hiss. The pilot's heart",
        "textdich": ""
    },
    {
        "start": 5129.76,
        "end": 5140.0,
        "text": "jumped. He remembered the snake, the one they met when the prince first arrived on Earth. The snake that said it could",
        "textdich": ""
    },
    {
        "start": 5137.199,
        "end": 5146.08,
        "text": "send him home with a bite, a fast, soft bite. The pilot's voice shook a little.",
        "textdich": ""
    },
    {
        "start": 5143.36,
        "end": 5158.48,
        "text": "\"What are you doing?\" he asked. But the little prince didn't look afraid. His face was calm. Very calm, but also very sad. \"I have to go back,\" he said",
        "textdich": ""
    },
    {
        "start": 5154.639,
        "end": 5168.639,
        "text": "quietly. \"To my planet, to my rose. She is waiting for me.\" The wind blew through the boy's hair. His eyes looked distant like he was already far away.",
        "textdich": ""
    },
    {
        "start": 5165.44,
        "end": 5177.44,
        "text": "The pilot said, \"I fixed my plane. You can stay with me now. You don't have to go. But the little prince smiled. It was",
        "textdich": ""
    },
    {
        "start": 5173.6,
        "end": 5186.08,
        "text": "a kind smile. You don't understand, he said. My body is too heavy. I can't take it with me. It's just a shell. I must",
        "textdich": ""
    },
    {
        "start": 5183.36,
        "end": 5194.0,
        "text": "leave it behind like an old coat. The pilot felt tears in his eyes. He didn't want to say goodbye. Not like this. But",
        "textdich": ""
    },
    {
        "start": 5191.92,
        "end": 5200.239,
        "text": "it will look like I'm dead. The little prince said, \"Don't be sad. Don't watch.",
        "textdich": ""
    },
    {
        "start": 5197.84,
        "end": 5212.96,
        "text": "It will hurt you. I don't want to see you cry. The pilot's throat was dry. He wanted to stop it, but he knew he couldn't. He knew this was the prince's",
        "textdich": ""
    },
    {
        "start": 5209.44,
        "end": 5222.56,
        "text": "choice. A quiet goodbye with no anger, only love. The little prince looked up at the sky. \"It's just one moment,\" he",
        "textdich": ""
    },
    {
        "start": 5219.12,
        "end": 5230.8,
        "text": "whispered. \"And then I'll be home.\" The snake moved slowly. It was almost beautiful the way it slid over the sand.",
        "textdich": ""
    },
    {
        "start": 5228.239,
        "end": 5238.32,
        "text": "The pilot wanted to scream, to grab the prince and run, but he didn't. He stood still because sometimes love means",
        "textdich": ""
    },
    {
        "start": 5235.44,
        "end": 5246.32,
        "text": "letting go. The little prince walked to the wall. The snake was waiting. The sun had almost set. The shadows were long.",
        "textdich": ""
    },
    {
        "start": 5244.32,
        "end": 5255.12,
        "text": "The little prince turned one last time and looked at the pilot. His eyes were full of stars. \"I will be there,\" he",
        "textdich": ""
    },
    {
        "start": 5252.0,
        "end": 5264.639,
        "text": "said, pointing up. on one of them. You won't know which one, but when you look at the sky at night, you'll hear laughter, and it will be me.\" The pilot",
        "textdich": ""
    },
    {
        "start": 5262.4,
        "end": 5277.84,
        "text": "covered his face with his hands. He didn't want to see. He didn't want to feel this goodbye, but he did. Every part of him did. There was a soft sound,",
        "textdich": ""
    },
    {
        "start": 5273.28,
        "end": 5283.84,
        "text": "a hiss, a breath, a fall. The sand moved a little, and then it was still again.",
        "textdich": ""
    },
    {
        "start": 5280.719,
        "end": 5293.04,
        "text": "The desert became quiet. very very quiet. The stars started to come out one by one as if they were arriving for the",
        "textdich": ""
    },
    {
        "start": 5288.719,
        "end": 5294.8,
        "text": "prince to take him home. Chapter 26.",
        "textdich": ""
    },
    {
        "start": 5293.04,
        "end": 5297.6,
        "text": "Present.",
        "textdich": ""
    },
    {
        "start": 5294.8,
        "end": 5305.52,
        "text": "The stars were quiet now. The night had fully come. The wind whispered gently across the sand. The pilot sat beside",
        "textdich": ""
    },
    {
        "start": 5302.639,
        "end": 5316.0,
        "text": "the wall for a long time. He did not move. He could not move. His heart was heavy, full of silence, full of questions. The little prince was gone.",
        "textdich": ""
    },
    {
        "start": 5313.679,
        "end": 5323.199,
        "text": "The boy with golden hair, soft voice, and deep eyes, who had come from a tiny planet, who had asked for a sheep, who",
        "textdich": ""
    },
    {
        "start": 5320.88,
        "end": 5332.719,
        "text": "had spoken about flowers and volcanoes and love, was gone. The desert around the pilot felt bigger than ever, colder.",
        "textdich": ""
    },
    {
        "start": 5330.08,
        "end": 5343.679,
        "text": "He looked up at the sky, but it only made his heart ache. Somewhere up there was the star. Somewhere the little prince had gone home, but the pilot",
        "textdich": ""
    },
    {
        "start": 5340.88,
        "end": 5350.96,
        "text": "could not see which one. All the stars looked the same, and yet all of them looked different now. He remembered what",
        "textdich": ""
    },
    {
        "start": 5348.639,
        "end": 5362.88,
        "text": "the prince had said. \"When you look at the stars, they will laugh. You will have stars that can laugh.\" The pilot smiled through his tears. It sounded",
        "textdich": ""
    },
    {
        "start": 5360.0,
        "end": 5370.719,
        "text": "silly. It sounded like a child's game, but it didn't feel silly now. It felt real. It felt like the only truth in the",
        "textdich": ""
    },
    {
        "start": 5368.0,
        "end": 5381.6,
        "text": "whole wide desert. His star was not quiet anymore. It was alive. Not because it made a sound, but because it held a",
        "textdich": ""
    },
    {
        "start": 5376.96,
        "end": 5389.12,
        "text": "memory, a boy, a voice, a laugh. The next day, the pilot walked back to his plane. His legs felt weak, but his heart",
        "textdich": ""
    },
    {
        "start": 5386.719,
        "end": 5398.32,
        "text": "had a strange kind of strength now. He worked slowly. He touched every part of the engine with care. And finally, the",
        "textdich": ""
    },
    {
        "start": 5394.88,
        "end": 5408.8,
        "text": "plane worked. It made a sound again. A sound that meant life. A sound that said, \"You can go now.\" But before he left, the pilot turned to look at the",
        "textdich": ""
    },
    {
        "start": 5406.56,
        "end": 5418.88,
        "text": "desert one more time at that little wall, that little place where something ended and something began. He took off",
        "textdich": ""
    },
    {
        "start": 5415.44,
        "end": 5428.719,
        "text": "and flew into the sky. The clouds passed below. The wind touched his face. He was flying again, but everything had",
        "textdich": ""
    },
    {
        "start": 5424.8,
        "end": 5436.08,
        "text": "changed. He was not the same man. The desert had given him something he could never explain, something invisible, a",
        "textdich": ""
    },
    {
        "start": 5433.28,
        "end": 5439.84,
        "text": "quiet truth, a feeling that lived deep inside.",
        "textdich": ""
    },
    {
        "start": 5437.679,
        "end": 5450.159,
        "text": "And when night came and the stars began to appear, he looked up. At first, he tried to guess which star was the prince's star, but then he stopped",
        "textdich": ""
    },
    {
        "start": 5448.0,
        "end": 5460.56,
        "text": "because it didn't matter. The little prince had said, \"It will be one of them, and when you look at the sky, you will hear me laugh.\"",
        "textdich": ""
    },
    {
        "start": 5457.76,
        "end": 5470.239,
        "text": "The pilot looked again. The stars looked brighter than before. And for a moment, just a small moment, he heard it, not",
        "textdich": ""
    },
    {
        "start": 5466.8,
        "end": 5479.6,
        "text": "with his ears, but with his heart, a soft laugh, a gentle sound hidden between the stars. He smiled. It was the",
        "textdich": ""
    },
    {
        "start": 5476.8,
        "end": 5490.48,
        "text": "kind of smile that holds joy and sadness together. The kind that says, \"I miss you. But I'm okay.\" He whispered, \"Thank",
        "textdich": ""
    },
    {
        "start": 5487.04,
        "end": 5496.96,
        "text": "you.\" Not to the stars, but to the boy who had changed his life, a boy who had come from far away, who had asked for a",
        "textdich": ""
    },
    {
        "start": 5495.12,
        "end": 5502.239,
        "text": "sheep, who had taught him how to look with his heart. That was the present.",
        "textdich": ""
    },
    {
        "start": 5499.84,
        "end": 5513.04,
        "text": "Not a gift in a box, but a gift that stayed forever. A memory that turned sadness into joy. A laugh that turned stars into friends. A goodbye that",
        "textdich": ""
    },
    {
        "start": 5510.32,
        "end": 5526.96,
        "text": "didn't feel like the end. Because when you love someone, they never really leave. They stay in the sky, in your heart, in the way you see the world.",
        "textdich": ""
    },
    {
        "start": 5522.4,
        "end": 5529.36,
        "text": "Chapter 27. Bells. The pilot flew home.",
        "textdich": ""
    },
    {
        "start": 5526.96,
        "end": 5534.32,
        "text": "He was alone in the plane, but his heart was not empty. He was full of memories.",
        "textdich": ""
    },
    {
        "start": 5532.159,
        "end": 5542.0,
        "text": "He did not forget the little prince. He remembered every word, every smile, every story. The stars were not the same",
        "textdich": ""
    },
    {
        "start": 5538.8,
        "end": 5543.84,
        "text": "anymore. They were full of feeling now.",
        "textdich": ""
    },
    {
        "start": 5542.0,
        "end": 5554.0,
        "text": "Every time he looked up, he remembered the boy with the golden hair, the boy who asked for a sheep, the boy who laughed like no one else in the world.",
        "textdich": ""
    },
    {
        "start": 5550.56,
        "end": 5562.96,
        "text": "His laugh was special, software, bright, full of joy, full of mystery. It was like music, like little bells. One day,",
        "textdich": ""
    },
    {
        "start": 5560.96,
        "end": 5570.4,
        "text": "after many weeks, the pilot was standing outside at night. The sky was dark, but the stars were shining. He looked up and",
        "textdich": ""
    },
    {
        "start": 5568.239,
        "end": 5578.239,
        "text": "closed his eyes. He remembered the prince's words again. \"When you look at the stars, they will sound like little",
        "textdich": ""
    },
    {
        "start": 5574.639,
        "end": 5587.28,
        "text": "bells.\" The pilot smiled. He didn't hear anything with his ears, but in his heart something moved. He felt a sound, not",
        "textdich": ""
    },
    {
        "start": 5583.199,
        "end": 5596.88,
        "text": "loud, not clear, but soft, sweet, like a laugh, like bells in the wind. It was not noise, it was feeling. He laughed",
        "textdich": ""
    },
    {
        "start": 5594.08,
        "end": 5607.76,
        "text": "quietly to himself. The stars made him laugh now. They were not just lights in the sky. They were a memory, a connection, a message. They were alive.",
        "textdich": ""
    },
    {
        "start": 5606.0,
        "end": 5615.28,
        "text": "And when he looked at them, he felt the prince was still there. Maybe on one of those stars, maybe smiling, maybe",
        "textdich": ""
    },
    {
        "start": 5612.239,
        "end": 5623.52,
        "text": "watching, maybe laughing, or maybe the stars were his voice. Maybe they were his gift, a present that never ends. A",
        "textdich": ""
    },
    {
        "start": 5620.719,
        "end": 5631.12,
        "text": "sound that never goes away. Other people looked at the stars, too, but they did not hear bells. They only saw lights,",
        "textdich": ""
    },
    {
        "start": 5628.239,
        "end": 5642.239,
        "text": "dots in the sky. But the pilot knew something more. He knew the truth. Not because of science, not because of books, but because of love. The little",
        "textdich": ""
    },
    {
        "start": 5639.199,
        "end": 5647.36,
        "text": "prince had shown him a secret, a secret that only hearts can understand.",
        "textdich": ""
    },
    {
        "start": 5645.199,
        "end": 5652.96,
        "text": "The most important things, the prince had said, are invisible.",
        "textdich": ""
    },
    {
        "start": 5650.32,
        "end": 5664.0,
        "text": "And now, every night, the pilot looked up. He didn't search for one star. He looked at all of them because all the stars were the little prince. All of",
        "textdich": ""
    },
    {
        "start": 5661.36,
        "end": 5674.96,
        "text": "them could laugh. All of them could sing. All of them could remind him love is real. Even when someone is far away,",
        "textdich": ""
    },
    {
        "start": 5672.0,
        "end": 5685.84,
        "text": "even when someone is gone, even when you don't understand everything. When you love someone, the goodbye is never complete. The little prince had left,",
        "textdich": ""
    },
    {
        "start": 5682.96,
        "end": 5694.719,
        "text": "but he was not really gone. He lived in the stars, in the sky, in the pilot's heart, and in the sound of bells that no one else could hear.",
        "textdich": ""
    },
    {
        "start": 5692.56,
        "end": 5705.12,
        "text": "The pilot sat with this feeling for a long time. It was not a sad feeling. It was quiet, gentle, a little happy, a little sad. It was the feeling of",
        "textdich": ""
    },
    {
        "start": 5702.88,
        "end": 5712.159,
        "text": "remembering someone you love, someone who changed you, someone who helped you see the world in a new way. It was the",
        "textdich": ""
    },
    {
        "start": 5710.0,
        "end": 5722.159,
        "text": "feeling of keeping that person close even when they are far. So the next time you look up at the stars, try to listen.",
        "textdich": ""
    },
    {
        "start": 5718.48,
        "end": 5729.6,
        "text": "Be quiet. Be still. Maybe if you are open, you will hear something. Maybe you will hear a laugh or a soft ring or a",
        "textdich": ""
    },
    {
        "start": 5727.28,
        "end": 5740.0,
        "text": "feeling that touches your heart. Maybe you will hear the bells. And if you do, smile because you are not alone.",
        "textdich": ""
    },
    {
        "start": 5735.92,
        "end": 5742.239,
        "text": "Chapter 28. Departure.",
        "textdich": ""
    },
    {
        "start": 5740.0,
        "end": 5744.48,
        "text": "The little prince had made a decision.",
        "textdich": ""
    },
    {
        "start": 5742.239,
        "end": 5755.28,
        "text": "He had to go back to his planet. He missed his flower. He missed her soft voice, her petals, her silly words, and her pride. But most of all, he missed",
        "textdich": ""
    },
    {
        "start": 5752.32,
        "end": 5765.92,
        "text": "the feeling of being needed. He knew now that she was not perfect, but she loved him. And love is not about being perfect. Love is about caring, about",
        "textdich": ""
    },
    {
        "start": 5763.04,
        "end": 5775.36,
        "text": "being responsible, about staying even when it's hard. The pilot was with the prince. They had found water. They had",
        "textdich": ""
    },
    {
        "start": 5772.0,
        "end": 5777.92,
        "text": "shared moments. They had become friends.",
        "textdich": ""
    },
    {
        "start": 5775.36,
        "end": 5789.44,
        "text": "But now something had changed. The prince looked quiet. His eyes were calm, but there was something deep inside them, something far away. That evening,",
        "textdich": ""
    },
    {
        "start": 5786.8,
        "end": 5797.6,
        "text": "he walked alone. He went to the place where the snake was, the same snake who could help him go home. The pilot",
        "textdich": ""
    },
    {
        "start": 5794.88,
        "end": 5808.48,
        "text": "followed him. He saw the prince standing near a low wall. He looked small and beautiful under the stars. The pilot felt afraid. He didn't understand.",
        "textdich": ""
    },
    {
        "start": 5806.639,
        "end": 5815.679,
        "text": "\"You're not going to leave now, are you?\" he asked. The prince smiled softly.",
        "textdich": ""
    },
    {
        "start": 5813.36,
        "end": 5824.08,
        "text": "It will look like I'm going away, he said. But don't be sad. It will only be my body. My body is too heavy to take",
        "textdich": ""
    },
    {
        "start": 5821.04,
        "end": 5826.56,
        "text": "with me. You know that's not really me.",
        "textdich": ""
    },
    {
        "start": 5824.08,
        "end": 5835.36,
        "text": "The pilot felt his heart shake. He didn't want to say goodbye. Not now. Not like this. I'll look at the stars, the",
        "textdich": ""
    },
    {
        "start": 5831.92,
        "end": 5842.8,
        "text": "prince said. And you will, too. I will be on one of them. And when you look at the sky, it will be like all the stars",
        "textdich": ""
    },
    {
        "start": 5840.239,
        "end": 5851.6,
        "text": "are laughing. You will have stars that laugh. And I will be happy because you will remember me. That is my present to",
        "textdich": ""
    },
    {
        "start": 5848.159,
        "end": 5860.0,
        "text": "you. The prince looked at the snake. It was quiet. It did not move. Then the prince took one step. He was not afraid.",
        "textdich": ""
    },
    {
        "start": 5857.679,
        "end": 5870.639,
        "text": "He was peaceful. The snake bit him quickly and he fell slowly to the ground, very slowly, like a leaf falling, like a whisper. There was no",
        "textdich": ""
    },
    {
        "start": 5866.719,
        "end": 5876.4,
        "text": "sound, no pain, no cry, just silence, just the soft wind and the stars above.",
        "textdich": ""
    },
    {
        "start": 5874.159,
        "end": 5884.4,
        "text": "The next morning, the pilot went to the place again. The body was gone. There was no trace, no footprints, nothing as",
        "textdich": ""
    },
    {
        "start": 5882.159,
        "end": 5893.199,
        "text": "if the prince had never been there. But the pilot knew he had been there. He had spoken, he had laughed, he had loved,",
        "textdich": ""
    },
    {
        "start": 5890.48,
        "end": 5901.119,
        "text": "and he had gone home. The pilot fixed his plane and flew away. But everything had changed. The world looked different",
        "textdich": ""
    },
    {
        "start": 5898.4,
        "end": 5911.199,
        "text": "now. Every sound reminded him of the prince. Every sky, every quiet moment, and every star, especially the stars.",
        "textdich": ""
    },
    {
        "start": 5908.88,
        "end": 5918.56,
        "text": "He remembered the prince's laugh, the sound of bells, the feeling of something small and true and full of light. The",
        "textdich": ""
    },
    {
        "start": 5916.48,
        "end": 5923.36,
        "text": "pilot never told many people about the little prince. They wouldn't understand.",
        "textdich": ""
    },
    {
        "start": 5921.36,
        "end": 5932.639,
        "text": "They would think it was just a dream or a story. But he knew it was real. He remembered his voice. He remembered his",
        "textdich": ""
    },
    {
        "start": 5929.76,
        "end": 5940.56,
        "text": "eyes. He remembered the drawing of the sheep. And he remembered the question the prince had asked. Did the sheep eat",
        "textdich": ""
    },
    {
        "start": 5937.76,
        "end": 5950.159,
        "text": "the flower? The pilot didn't know the answer. Maybe the flower was safe. Maybe the sheep was kind. Or maybe not. But",
        "textdich": ""
    },
    {
        "start": 5947.36,
        "end": 5958.08,
        "text": "that question stayed in his heart. He thought about it every time he looked at the sky. He still wondered and he still",
        "textdich": ""
    },
    {
        "start": 5955.199,
        "end": 5968.8,
        "text": "hoped because if the flower was alive then the little prince was happy and if the little prince was happy then everything was okay. The pilot looked up",
        "textdich": ""
    },
    {
        "start": 5965.28,
        "end": 5979.92,
        "text": "at the sky. The stars looked the same but now they had meaning. They were full of love, full of memory, full of magic.",
        "textdich": ""
    },
    {
        "start": 5976.48,
        "end": 5981.6,
        "text": "He smiled. He was not alone.",
        "textdich": ""
    },
    {
        "start": 5979.92,
        "end": 5992.56,
        "text": "The little prince was somewhere out there laughing, shining, watching, and maybe one day they would meet again under the same stars. The story is over,",
        "textdich": ""
    },
    {
        "start": 5989.679,
        "end": 6002.4,
        "text": "but maybe it's not really over because this story lives in your heart now. The little prince came from a star, but he touched the earth. He met strange",
        "textdich": ""
    },
    {
        "start": 5999.44,
        "end": 6013.44,
        "text": "adults. He asked big questions. And he gave love to a small flower. Maybe he reminds you of someone. Or maybe he reminds you of yourself. Now when you",
        "textdich": ""
    },
    {
        "start": 6010.96,
        "end": 6023.199,
        "text": "look at the stars, you might smile. You might listen for a sound, a laugh, a memory, a little bell. So now I ask you,",
        "textdich": ""
    },
    {
        "start": 6020.56,
        "end": 6026.239,
        "text": "did the sheep eat the flower or not?",
        "textdich": ""
    },
    {
        "start": 6023.199,
        "end": 6033.679,
        "text": "Comment your answer below. I really want to hear what you believe. And if this story touched your heart, please like",
        "textdich": ""
    },
    {
        "start": 6030.88,
        "end": 6039.36,
        "text": "the video, subscribe to the channel, and share it with someone who needs a little light in their life. Because the world",
        "textdich": ""
    },
    {
        "start": 6037.44,
        "end": 6048.639,
        "text": "is full of adults, but we need more little princes, and maybe maybe you are one of them. Thank you for listening.",
        "textdich": ""
    },
    {
        "start": 6045.44,
        "end": 6048.639,
        "text": "I'll see you in the stars.",
        "textdich": ""
    }
]