[
    {
        "start": 0.16,
        "end": 9.599,
        "text": "Well, Sandra, President Trump is now giving a dire warning to Iranian leadership, writing on Truth Social this morning that a massive armada is heading",
        "textdich": ""
    },
    {
        "start": 7.839,
        "end": 16.64,
        "text": "towards Iran and is ready to quote, \"Fulfill its mission with speed and violence if necessary.\" Chief national security correspondent Jennifer Griffin",
        "textdich": ""
    },
    {
        "start": 15.2,
        "end": 18.16,
        "text": "is tracking the latest for us on this.",
        "textdich": ""
    },
    {
        "start": 16.64,
        "end": 22.88,
        "text": "And Jennifer, it sounds like Iranian leaders are now responding with their own warning. What can you tell us?",
        "textdich": ""
    },
    {
        "start": 21.439,
        "end": 32.16,
        "text": " That's right, Bill. In fact, the rhetoric is getting increasingly heated from the leaders in Iran. We have a statement from one of those leaders in",
        "textdich": ""
    },
    {
        "start": 29.199,
        "end": 43.2,
        "text": "which he said that any US strike would be met with an immediate response unprecedented. He described uh we also heard from Iran's foreign minister uh",
        "textdich": ""
    },
    {
        "start": 40.48,
        "end": 53.92,
        "text": "that that the armed forces in Iran have their fingers on the trigger and the Ayatollah Ali himself said that any illusion that the US any US strikes",
        "textdich": ""
    },
    {
        "start": 51.2,
        "end": 55.92,
        "text": "would be limited is an illusion at that.",
        "textdich": ""
    },
    {
        "start": 53.92,
        "end": 63.44,
        "text": "The president however is deploying a clear carrot and stick strategy toward Iran. The USS Abraham Lincoln aircraft",
        "textdich": ""
    },
    {
        "start": 60.96,
        "end": 71.439,
        "text": "carrier strike group is now in sinkcom control with its three guided missile destroyers and dozens of combat aircraft",
        "textdich": ""
    },
    {
        "start": 68.08,
        "end": 79.119,
        "text": "including stealth F35 fighter jets and FA18 fighter jets and literally hundreds of Tomahawk cruise missiles capable of",
        "textdich": ""
    },
    {
        "start": 76.96,
        "end": 86.08,
        "text": "reaching Iranian targets. President Trump also offering an olive branch.",
        "textdich": ""
    },
    {
        "start": 82.64,
        "end": 94.88,
        "text": "There's another beautiful armada floating beautifully toward Iran right now. So, we'll see.",
        "textdich": ""
    },
    {
        "start": 92.0,
        "end": 100.96,
        "text": "I hope I hope they make a deal. I hope they make a deal. They should have made a deal the first time to have a country.",
        "textdich": ""
    },
    {
        "start": 99.119,
        "end": 108.479,
        "text": "The protests may have ebbed, but they will spark up again in the future because this regime, unless they are willing to change and/or leave, have no",
        "textdich": ""
    },
    {
        "start": 106.64,
        "end": 114.0,
        "text": "way of addressing the legitimate and consistent complaints of the people of Iran who deserve better.",
        "textdich": ""
    },
    {
        "start": 111.84,
        "end": 121.36,
        "text": " The US Air Force is running regional military exercises this week to signal readiness. Officials see a real chance",
        "textdich": ""
    },
    {
        "start": 119.28,
        "end": 129.759,
        "text": "President Trump acts, but an equal chance Iran blinks. He's setting the theater in a way that gives him lots of options in the near term and probably",
        "textdich": ""
    },
    {
        "start": 127.6,
        "end": 139.04,
        "text": "even for a little bit of a a longer runway looking out into the future. So if tomorrow or a week from now or a month from now there were a strike on",
        "textdich": ""
    },
    {
        "start": 136.959,
        "end": 146.08,
        "text": "Iran by the United States or in concert with others, I wouldn't be a bit surprised. I think if you are the Ayatollah",
        "textdich": ""
    },
    {
        "start": 143.92,
        "end": 153.76,
        "text": "and you look at the military buildup in the region, he has to wonder whether he will suffer the same fate as Madura or",
        "textdich": ""
    },
    {
        "start": 151.52,
        "end": 161.92,
        "text": "something worse if he doesn't come to the negotiating table. Iran's ambassador to the UN responded. Last time the US",
        "textdich": ""
    },
    {
        "start": 159.92,
        "end": 170.72,
        "text": "blundered into wars in Afghanistan and Iraq, it squandered over 7 trillion dollars and lost more than 7,000 American lives. Iran stands ready for",
        "textdich": ""
    },
    {
        "start": 168.72,
        "end": 178.239,
        "text": "dialogue based on mutual respect and interests, but if pushed, it will defend itself and respond like never before.",
        "textdich": ""
    },
    {
        "start": 176.16,
        "end": 184.72,
        "text": "Saudi Arabia, meanwhile, Bill, said publicly it would not let anyone use its bases to attack Iran. Bill?",
        "textdich": ""
    },
    {
        "start": 183.2,
        "end": 190.879,
        "text": " Yeah. At this point, Iran has to know the president is not bluffing. Jennifer Griffin live here in Washington. Jen, thank you.",
        "textdich": ""
    },
    {
        "start": 189.04,
        "end": 192.48,
        "text": " I'm Steve Ducey. I'm Brian Kilme.",
        "textdich": ""
    },
    {
        "start": 190.879,
        "end": 200.519,
        "text": " And I'm Anley Airheart. And click here to subscribe to the Fox News YouTube page to catch our hottest interviews and most compelling analysis.",
        "textdich": ""
    }
]