[
    {
        "start": 0.4,
        "end": 5.6,
        "text": "Hello everyone.",
        "textdich": ""
    },
    {
        "start": 2.96,
        "end": 16.24,
        "text": "Today we will talk about something special. We will talk about how to talk in your brain. Yes, you can talk in your",
        "textdich": ""
    },
    {
        "start": 12.8,
        "end": 25.84,
        "text": "brain. And when you do this, you can learn English better. It can help you speak faster. It can help you think in",
        "textdich": ""
    },
    {
        "start": 22.08,
        "end": 34.64,
        "text": "English. So today, I will tell you how to do it. And I will tell you some tips that helped me too. When I started",
        "textdich": ""
    },
    {
        "start": 31.76,
        "end": 42.32,
        "text": "learning English, I did not talk in my brain. I always tried to translate.",
        "textdich": ""
    },
    {
        "start": 37.76,
        "end": 54.8,
        "text": "First I thought in my language. Then I tried to find the English words. This took a lot of time. It made me slow and I felt tired.",
        "textdich": ""
    },
    {
        "start": 51.92,
        "end": 67.439,
        "text": "But then I learned to talk in my brain in English. It helped me a lot. It made everything easier. So, let's learn how to do it. First, start with small",
        "textdich": ""
    },
    {
        "start": 65.68,
        "end": 70.799,
        "text": "sentences.",
        "textdich": ""
    },
    {
        "start": 67.439,
        "end": 80.08,
        "text": "Very small sentences. You do not need to think big words. You do not need to make long sentences.",
        "textdich": ""
    },
    {
        "start": 76.08,
        "end": 91.119,
        "text": "Just start small. For example, when you see a cup, say in your brain, \"This is a cup.\" When you see the sun, say the sun",
        "textdich": ""
    },
    {
        "start": 86.24,
        "end": 97.36,
        "text": "is bright. When you feel happy, say I am happy.",
        "textdich": ""
    },
    {
        "start": 93.04,
        "end": 107.439,
        "text": "This is the first step. Small sentences, easy words. When I started, I talked to myself in my brain like this. I looked",
        "textdich": ""
    },
    {
        "start": 104.0,
        "end": 111.68,
        "text": "around and said small things in English.",
        "textdich": ""
    },
    {
        "start": 107.439,
        "end": 118.399,
        "text": "At first, it felt strange, but soon it felt normal. My brain got used to it.",
        "textdich": ""
    },
    {
        "start": 115.68,
        "end": 129.28,
        "text": "Next, try to do this many times every day. When you wake up, start talking in your brain. Say, I am waking up. When",
        "textdich": ""
    },
    {
        "start": 126.159,
        "end": 140.48,
        "text": "you brush your teeth, say I am brushing my teeth. When you eat, say, I am eating rice or I am drinking tea.",
        "textdich": ""
    },
    {
        "start": 137.52,
        "end": 154.239,
        "text": "Every small thing you do, say it in your brain. You do not need to say it out loud, just think it. Talking in your brain helps your brain learn to use",
        "textdich": ""
    },
    {
        "start": 150.64,
        "end": 158.959,
        "text": "English. It helps your brain think in English.",
        "textdich": ""
    },
    {
        "start": 156.0,
        "end": 171.68,
        "text": "I remember when I started, I did this all day. I talked in my brain when I walked. I talked in my brain when I washed dishes. I talked in my brain when",
        "textdich": ""
    },
    {
        "start": 168.64,
        "end": 176.959,
        "text": "I went to the market. It helped me so much.",
        "textdich": ""
    },
    {
        "start": 173.28,
        "end": 179.36,
        "text": "Another tip is to use easy words.",
        "textdich": ""
    },
    {
        "start": 176.959,
        "end": 191.599,
        "text": "When you talk in your brain, do not worry about hard words. Do not try to speak like a book. Just use easy simple words.",
        "textdich": ""
    },
    {
        "start": 188.56,
        "end": 202.4,
        "text": "For example, instead of saying I am feeling very joyful today, just say I am happy today. Easy words are good. Easy",
        "textdich": ""
    },
    {
        "start": 199.599,
        "end": 210.239,
        "text": "words are powerful. They help you talk more. They help you think faster.",
        "textdich": ""
    },
    {
        "start": 206.239,
        "end": 213.28,
        "text": "When I started, I only used easy words.",
        "textdich": ""
    },
    {
        "start": 210.239,
        "end": 225.68,
        "text": "And I learned that it was enough. You can say many things with easy words. You can also try to ask questions in your brain. When you see something, ask",
        "textdich": ""
    },
    {
        "start": 221.68,
        "end": 231.36,
        "text": "yourself, \"What is this?\" Then answer in English.",
        "textdich": ""
    },
    {
        "start": 227.2,
        "end": 233.92,
        "text": "This is a bag. This is a dog.",
        "textdich": ""
    },
    {
        "start": 231.36,
        "end": 236.959,
        "text": "This is a car.",
        "textdich": ""
    },
    {
        "start": 233.92,
        "end": 241.519,
        "text": "When you do this, you practice talking and answering.",
        "textdich": ""
    },
    {
        "start": 238.879,
        "end": 251.84,
        "text": "You practice making small conversations with yourself. I did this, too. I asked myself small questions all the time. It",
        "textdich": ""
    },
    {
        "start": 249.04,
        "end": 260.799,
        "text": "was like playing a game in my head. And I enjoyed it. It made learning fun. So, try it.",
        "textdich": ""
    },
    {
        "start": 257.199,
        "end": 267.28,
        "text": "Ask questions. Answer them. Talk to yourself in your brain like a friend.",
        "textdich": ""
    },
    {
        "start": 264.56,
        "end": 279.919,
        "text": "Another good idea is to repeat what you hear. When you listen to someone speaking English, try to repeat their words in your brain. If you hear good",
        "textdich": ""
    },
    {
        "start": 276.32,
        "end": 288.8,
        "text": "morning, say it again in your brain. If you hear how are you, say it again in your brain. This helps your brain",
        "textdich": ""
    },
    {
        "start": 285.919,
        "end": 295.68,
        "text": "remember the sounds. It helps your brain learn how to say the words.",
        "textdich": ""
    },
    {
        "start": 292.16,
        "end": 298.4,
        "text": "When I was learning, I watched cartoons.",
        "textdich": ""
    },
    {
        "start": 295.68,
        "end": 310.479,
        "text": "I heard the characters talk and I repeated their words in my brain. It helped me remember the words. It helped me speak better. Also, do not worry",
        "textdich": ""
    },
    {
        "start": 307.6,
        "end": 318.0,
        "text": "about mistakes. When you talk in your brain, you will make mistakes.",
        "textdich": ""
    },
    {
        "start": 313.919,
        "end": 329.039,
        "text": "That is okay. Nobody can hear you. You can try again. You can fix it. When I talked in my brain, I made mistakes,",
        "textdich": ""
    },
    {
        "start": 324.56,
        "end": 340.16,
        "text": "too. I sometimes use the wrong word. But I learned from my mistakes. I tried again and I got better. So, do not be afraid.",
        "textdich": ""
    },
    {
        "start": 337.84,
        "end": 349.44,
        "text": "Talking in your brain is your practice time. It is your safe place. You can make as many mistakes as you want.",
        "textdich": ""
    },
    {
        "start": 347.039,
        "end": 359.919,
        "text": "Sometimes you can also picture the words in your mind. For example, if you say cat in your brain, try to see a cat in",
        "textdich": ""
    },
    {
        "start": 356.16,
        "end": 370.88,
        "text": "your mind. If you say tree, try to see a tree. This helps your brain connect the word and the picture. It helps you remember better.",
        "textdich": ""
    },
    {
        "start": 367.36,
        "end": 380.8,
        "text": "I always did this. When I said apple, I saw a red apple in my mind. When I said car, I saw a small car.",
        "textdich": ""
    },
    {
        "start": 378.16,
        "end": 384.72,
        "text": "This made learning fun.",
        "textdich": ""
    },
    {
        "start": 380.8,
        "end": 388.96,
        "text": "It made the words stay in my memory.",
        "textdich": ""
    },
    {
        "start": 384.72,
        "end": 393.039,
        "text": "And remember, you can do this anytime, anywhere.",
        "textdich": ""
    },
    {
        "start": 390.72,
        "end": 403.28,
        "text": "You can talk in your brain when you are walking, when you are sitting, when you are waiting. You do not need anything.",
        "textdich": ""
    },
    {
        "start": 400.24,
        "end": 415.919,
        "text": "You just need your mind. And the more you do it, the easier it gets. When I started, I had to try hard to talk in my",
        "textdich": ""
    },
    {
        "start": 410.72,
        "end": 425.039,
        "text": "brain. But soon it became easy. My brain started to think in English without trying. And this is the goal. You want your brain to think in English",
        "textdich": ""
    },
    {
        "start": 423.28,
        "end": 427.759,
        "text": "naturally.",
        "textdich": ""
    },
    {
        "start": 425.039,
        "end": 438.479,
        "text": "So today we talked about how to talk in your brain. We talked about using small sentences. We talked about using easy",
        "textdich": ""
    },
    {
        "start": 434.479,
        "end": 447.84,
        "text": "words. We talked about asking questions, answering, repeating what you hear and picturing the words. We talked about not",
        "textdich": ""
    },
    {
        "start": 444.88,
        "end": 453.759,
        "text": "worrying about mistakes. And we talked about practicing anywhere, anytime.",
        "textdich": ""
    },
    {
        "start": 451.759,
        "end": 462.24,
        "text": "This is how you can start to talk in your brain and this is how you can start to think in English.",
        "textdich": ""
    },
    {
        "start": 459.84,
        "end": 471.36,
        "text": "Chapter 2, the easy way to practice talking in your brain.",
        "textdich": ""
    },
    {
        "start": 468.96,
        "end": 481.599,
        "text": "We talked about what it means to talk in your brain. Now, let's talk about how you can practice it in a simple way. I",
        "textdich": ""
    },
    {
        "start": 477.84,
        "end": 485.68,
        "text": "will show you how to do it step by step.",
        "textdich": ""
    },
    {
        "start": 481.599,
        "end": 488.96,
        "text": "It is easy and you can start today.",
        "textdich": ""
    },
    {
        "start": 485.68,
        "end": 500.08,
        "text": "You do not need a book, a teacher or a friend to help you. You just need yourself, your brain, and your love for learning English.",
        "textdich": ""
    },
    {
        "start": 498.16,
        "end": 502.479,
        "text": "Let's begin.",
        "textdich": ""
    },
    {
        "start": 500.08,
        "end": 512.399,
        "text": "The first thing to do is to choose something simple to think about. It can be anything. You can think about your room. You can think about your",
        "textdich": ""
    },
    {
        "start": 510.0,
        "end": 524.56,
        "text": "breakfast. You can think about your school or your work. Choose something that is easy for you. This way you will not feel worried. You will feel happy",
        "textdich": ""
    },
    {
        "start": 522.08,
        "end": 528.48,
        "text": "and ready to practice.",
        "textdich": ""
    },
    {
        "start": 524.56,
        "end": 531.92,
        "text": "When I started, I thought about my cat.",
        "textdich": ""
    },
    {
        "start": 528.48,
        "end": 537.68,
        "text": "My cat was small and funny. I like to think about what my cat was doing.",
        "textdich": ""
    },
    {
        "start": 535.12,
        "end": 552.08,
        "text": "I said in my brain, \"My cat is sleeping.\" \"My cat is on the sofa. My cat is cute.\" It was easy and it helped me start talking in my brain.",
        "textdich": ""
    },
    {
        "start": 549.279,
        "end": 564.16,
        "text": "Next, try to make short sentences in your brain. Do not worry about big sentences at first. Small and easy sentences are best.",
        "textdich": ""
    },
    {
        "start": 561.6,
        "end": 578.08,
        "text": "For example, you can think, I am sitting. I am drinking tea. The tea is hot. The window is open. These short sentences help you build your English",
        "textdich": ""
    },
    {
        "start": 574.56,
        "end": 582.88,
        "text": "slowly. Every small sentence is like a small brick.",
        "textdich": ""
    },
    {
        "start": 580.0,
        "end": 592.88,
        "text": "When you put many bricks together, you build a strong house. Your English will be your strong house one day. Now, let's",
        "textdich": ""
    },
    {
        "start": 589.68,
        "end": 595.44,
        "text": "talk about another easy way to practice.",
        "textdich": ""
    },
    {
        "start": 592.88,
        "end": 603.04,
        "text": "Look around you and name things in English. You can do this in your brain.",
        "textdich": ""
    },
    {
        "start": 599.04,
        "end": 606.8,
        "text": "If you see a chair, think chair.",
        "textdich": ""
    },
    {
        "start": 603.04,
        "end": 611.6,
        "text": "If you see a book, think book.",
        "textdich": ""
    },
    {
        "start": 606.8,
        "end": 614.399,
        "text": "If you see the sun, think sun.",
        "textdich": ""
    },
    {
        "start": 611.6,
        "end": 625.68,
        "text": "This is fun and it helps you learn new words, too. I used to do this every morning. When I woke up, I looked at things and named them in English. It",
        "textdich": ""
    },
    {
        "start": 623.04,
        "end": 631.279,
        "text": "helped me wake up my brain and start my day with English.",
        "textdich": ""
    },
    {
        "start": 628.16,
        "end": 640.399,
        "text": "When you feel good with short sentences, you can try to make your sentences a little longer. You can add more words.",
        "textdich": ""
    },
    {
        "start": 636.8,
        "end": 647.2,
        "text": "For example, instead of the tea is hot, you can think the tea is hot and sweet.",
        "textdich": ""
    },
    {
        "start": 644.32,
        "end": 655.04,
        "text": "Instead of the window is open, you can think the window is open because it is warm outside.",
        "textdich": ""
    },
    {
        "start": 652.079,
        "end": 663.839,
        "text": "Slowly you will see that your sentences can grow. Your brain will get used to making bigger sentences in English.",
        "textdich": ""
    },
    {
        "start": 661.2,
        "end": 674.0,
        "text": "Another fun thing you can do is make a small story in your brain. The story can be about your day. For example, when you",
        "textdich": ""
    },
    {
        "start": 670.24,
        "end": 687.04,
        "text": "wake up, you can think, \"I wake up. I open my eyes. I see the sun. I get out of bed. I go to the kitchen. This is like telling yourself a small story",
        "textdich": ""
    },
    {
        "start": 683.76,
        "end": 696.8,
        "text": "about what you do. It helps you practice English. And it also helps you remember words. I used to tell myself small",
        "textdich": ""
    },
    {
        "start": 693.6,
        "end": 705.04,
        "text": "stories about my morning. It made me feel good because I was using English in my brain.",
        "textdich": ""
    },
    {
        "start": 701.2,
        "end": 716.64,
        "text": "Sometimes you will not know a word. That is okay. Do not stop. Try to use another word or think of another sentence. The",
        "textdich": ""
    },
    {
        "start": 713.6,
        "end": 729.6,
        "text": "most important thing is to keep talking in your brain. You can also write down the word you do not know. Later you can look it up in a dictionary.",
        "textdich": ""
    },
    {
        "start": 726.639,
        "end": 739.6,
        "text": "Then the next time you will know the word. I did this many times. When I could not think of a word, I wrote it in",
        "textdich": ""
    },
    {
        "start": 736.32,
        "end": 748.72,
        "text": "my small notebook. Later I learned the word and used it in my brain. Another good tip is to use your feelings in your",
        "textdich": ""
    },
    {
        "start": 745.519,
        "end": 760.56,
        "text": "brain sentences. For example, you can think I am happy because the sun is shining or I am tired because I worked hard. This helps you connect your",
        "textdich": ""
    },
    {
        "start": 758.079,
        "end": 771.6,
        "text": "English with your real life. It makes your English stronger. It also makes it easier to remember the words because you feel them. Remember",
        "textdich": ""
    },
    {
        "start": 768.959,
        "end": 774.0,
        "text": "you can do this anytime.",
        "textdich": ""
    },
    {
        "start": 771.6,
        "end": 784.72,
        "text": "When you are walking, when you are waiting, when you are sitting quietly, you can talk in your brain. Nobody knows and you can practice as much as you",
        "textdich": ""
    },
    {
        "start": 783.2,
        "end": 787.279,
        "text": "want.",
        "textdich": ""
    },
    {
        "start": 784.72,
        "end": 798.0,
        "text": "I used to talk in my brain when I was on the bus. I looked at the people and I made small sentences about what I saw. I",
        "textdich": ""
    },
    {
        "start": 794.639,
        "end": 805.44,
        "text": "thought the man is reading a newspaper, the woman is talking on the phone.",
        "textdich": ""
    },
    {
        "start": 801.36,
        "end": 814.88,
        "text": "It was fun and it helped me a lot. So my dear friends, talking in your brain is easy. You can start with small sentences.",
        "textdich": ""
    },
    {
        "start": 812.399,
        "end": 823.92,
        "text": "You can name things around you. You can make small stories. You can use your feelings. And you can do it anytime,",
        "textdich": ""
    },
    {
        "start": 820.56,
        "end": 834.56,
        "text": "anywhere. The most important thing is to keep going. The more you practice, the better you will get. Your brain will",
        "textdich": ""
    },
    {
        "start": 830.32,
        "end": 840.959,
        "text": "learn to think in English and one day it will feel easy and natural.",
        "textdich": ""
    },
    {
        "start": 838.56,
        "end": 851.519,
        "text": "I am so happy to share these tips with you. Now you can try them today. Start with just one small sentence in your",
        "textdich": ""
    },
    {
        "start": 848.32,
        "end": 867.199,
        "text": "brain. You will see it will help you a lot and in the next chapter we will talk about how to make your brain English stronger every day. See you soon.",
        "textdich": ""
    },
    {
        "start": 862.56,
        "end": 874.56,
        "text": "Chapter 3. How to make your brain English stronger every day.",
        "textdich": ""
    },
    {
        "start": 872.48,
        "end": 887.92,
        "text": "You have already learned how to talk in your brain with small sentences. Now let's see how you can make your brain English stronger every day. This is",
        "textdich": ""
    },
    {
        "start": 884.639,
        "end": 896.959,
        "text": "simple but you must do it often. Think of it like a plant. If you give the plant water every day, it will grow. If",
        "textdich": ""
    },
    {
        "start": 894.56,
        "end": 906.079,
        "text": "you stop giving water, the plant will become weak. Your English is like that plant. You need to give it small drops",
        "textdich": ""
    },
    {
        "start": 903.36,
        "end": 911.04,
        "text": "of practice every day so it can grow strong.",
        "textdich": ""
    },
    {
        "start": 907.519,
        "end": 920.959,
        "text": "One easy way is to set a small time each day for talking in your brain. It can be just 5 minutes. Maybe when you wake up",
        "textdich": ""
    },
    {
        "start": 917.68,
        "end": 930.72,
        "text": "or when you go to bed or when you take a walk. 5 minutes is not long, but if you do it every day, your brain will get",
        "textdich": ""
    },
    {
        "start": 927.36,
        "end": 946.32,
        "text": "used to English. When I was learning, I talked in my brain before sleeping. I closed my eyes and thought, \"Today was a good day. I worked hard. I",
        "textdich": ""
    },
    {
        "start": 941.44,
        "end": 958.639,
        "text": "ate tasty food. I am happy.\" These small sentences helped me sleep with English in my mind. Another good idea is to choose a special time to",
        "textdich": ""
    },
    {
        "start": 955.12,
        "end": 972.72,
        "text": "think about one topic. For example, today you can think about food. In your brain, you can say, \"I like rice. Rice is soft. I eat rice with chicken.",
        "textdich": ""
    },
    {
        "start": 969.839,
        "end": 976.56,
        "text": "Tomorrow, you can choose a new topic.",
        "textdich": ""
    },
    {
        "start": 972.72,
        "end": 987.68,
        "text": "Like the weather. It is sunny today. The sky is blue. I feel warm.\" When you do this, you learn words for many things.",
        "textdich": ""
    },
    {
        "start": 984.8,
        "end": 994.32,
        "text": "Your brain will become stronger because it will remember more words and sentences.",
        "textdich": ""
    },
    {
        "start": 992.0,
        "end": 1002.079,
        "text": "When you do this brain talking every day, try to speak clearly in your mind.",
        "textdich": ""
    },
    {
        "start": 998.48,
        "end": 1009.12,
        "text": "Do not just think fast words. Say the words slowly and clearly in your brain.",
        "textdich": ""
    },
    {
        "start": 1005.68,
        "end": 1012.24,
        "text": "This helps you learn the right sounds.",
        "textdich": ""
    },
    {
        "start": 1009.12,
        "end": 1021.279,
        "text": "If you can, you can also move your lips a little, but very small so nobody sees.",
        "textdich": ""
    },
    {
        "start": 1017.44,
        "end": 1023.92,
        "text": "This connects your brain to your mouth.",
        "textdich": ""
    },
    {
        "start": 1021.279,
        "end": 1032.559,
        "text": "One day the words will come out of your mouth easily because you already said them many times in your brain.",
        "textdich": ""
    },
    {
        "start": 1030.079,
        "end": 1045.919,
        "text": "You can also help your brain English grow by listening to simple English during the day. When you hear simple English, try to repeat it in your brain.",
        "textdich": ""
    },
    {
        "start": 1042.24,
        "end": 1058.96,
        "text": "If you hear it's a beautiful day, say it again in your brain. It's a beautiful day. If you hear I like coffee, repeat in your brain, I like coffee.",
        "textdich": ""
    },
    {
        "start": 1056.96,
        "end": 1071.84,
        "text": "This is like giving food to your brain English. The more you feed it, the stronger it gets. Don't forget to smile when you practice. Smiling helps you",
        "textdich": ""
    },
    {
        "start": 1068.16,
        "end": 1081.6,
        "text": "feel good. When you feel good, your brain learns faster. When I practiced brain talking, I often smiled because I",
        "textdich": ""
    },
    {
        "start": 1078.16,
        "end": 1092.64,
        "text": "felt proud. I was using English all by myself and that made me happy. You can feel happy too. Every small step is a",
        "textdich": ""
    },
    {
        "start": 1088.96,
        "end": 1104.799,
        "text": "big success. If you ever feel tired, that is okay. Just do one small sentence in your brain. Even one small sentence",
        "textdich": ""
    },
    {
        "start": 1100.32,
        "end": 1115.44,
        "text": "is good. The key is to do it every day like giving water to your plant. Your English will grow slowly but surely.",
        "textdich": ""
    },
    {
        "start": 1112.0,
        "end": 1124.96,
        "text": "One day you will look back and see how strong your brain English has become. In the next chapter, we will see how you",
        "textdich": ""
    },
    {
        "start": 1121.84,
        "end": 1139.44,
        "text": "can start using your brain talking to speak with people. Keep practicing and let's continue together. Chapter 4. How to use brain talking to speak with",
        "textdich": ""
    },
    {
        "start": 1136.48,
        "end": 1148.96,
        "text": "people. Now that you know how to talk in your brain every day, it is time to take a new step. We will talk about how to",
        "textdich": ""
    },
    {
        "start": 1146.0,
        "end": 1154.799,
        "text": "use brain talking to help you speak with people.",
        "textdich": ""
    },
    {
        "start": 1151.52,
        "end": 1157.76,
        "text": "This is a very exciting step.",
        "textdich": ""
    },
    {
        "start": 1154.799,
        "end": 1164.799,
        "text": "When you can speak to people, you feel more confident. You feel proud.",
        "textdich": ""
    },
    {
        "start": 1161.76,
        "end": 1168.64,
        "text": "But I know it can feel scary at first.",
        "textdich": ""
    },
    {
        "start": 1164.799,
        "end": 1175.2,
        "text": "That is why brain is so helpful. It is like practice before the real speaking.",
        "textdich": ""
    },
    {
        "start": 1171.919,
        "end": 1185.76,
        "text": "When you use brain talking well, you are ready to speak. You are ready to share your ideas and it will feel easier.",
        "textdich": ""
    },
    {
        "start": 1182.72,
        "end": 1189.28,
        "text": "Let me tell you how you can do this.",
        "textdich": ""
    },
    {
        "start": 1185.76,
        "end": 1199.52,
        "text": "First, when you see a person, start by talking in your brain. You do not have to speak out loud yet. Just look at the",
        "textdich": ""
    },
    {
        "start": 1195.44,
        "end": 1210.72,
        "text": "person and think, \"What can I say?\" For example, you see your friend. In your brain, you say, \"Hi, how are you? I",
        "textdich": ""
    },
    {
        "start": 1207.2,
        "end": 1219.919,
        "text": "am happy to see you.\" You practice the words first in your mind. This gives your brain a chance to get ready.",
        "textdich": ""
    },
    {
        "start": 1217.039,
        "end": 1231.6,
        "text": "When you feel ready, you can say the words out loud. Your brain has already done the work, so your mouth will find the words more easily.",
        "textdich": ""
    },
    {
        "start": 1228.64,
        "end": 1244.24,
        "text": "You can also use this idea before a meeting or before a phone call. I remember when I had to call someone in English for the first time. I was nervous.",
        "textdich": ""
    },
    {
        "start": 1241.44,
        "end": 1258.159,
        "text": "So I closed my eyes and practiced in my brain. I said, \"Hello, my name is your name. I am calling about the job.\" I said it again and again in",
        "textdich": ""
    },
    {
        "start": 1256.4,
        "end": 1260.96,
        "text": "my brain.",
        "textdich": ""
    },
    {
        "start": 1258.159,
        "end": 1271.12,
        "text": "When I picked up the phone, my brain had the words ready. I spoke slowly and clearly and it worked. The other person",
        "textdich": ""
    },
    {
        "start": 1267.44,
        "end": 1280.96,
        "text": "understood me. I felt proud. You can do this, too. Another way brain talking helps is when you don't know what to say",
        "textdich": ""
    },
    {
        "start": 1277.039,
        "end": 1291.6,
        "text": "next. Sometimes we stop in the middle of speaking because we cannot find the word. That is okay. When that happens, take a small second to talk in your",
        "textdich": ""
    },
    {
        "start": 1290.0,
        "end": 1296.32,
        "text": "brain.",
        "textdich": ""
    },
    {
        "start": 1291.6,
        "end": 1309.52,
        "text": "Ask your brain, \"What do I want to say?\" Your brain will try to find the words for you. This small pause is very powerful. It gives you time. It helps",
        "textdich": ""
    },
    {
        "start": 1305.919,
        "end": 1315.6,
        "text": "you stay calm and soon the words will come to you. Try this.",
        "textdich": ""
    },
    {
        "start": 1313.12,
        "end": 1326.72,
        "text": "When you talk to a person and you finish saying something, use your brain to plan the next thing. For example, you say, \"I",
        "textdich": ""
    },
    {
        "start": 1322.48,
        "end": 1336.0,
        "text": "like tea.\" Then in your brain you think now I can ask do you like tea and then you say it.",
        "textdich": ""
    },
    {
        "start": 1333.2,
        "end": 1342.4,
        "text": "This is how brainalking helps you build a real conversation.",
        "textdich": ""
    },
    {
        "start": 1338.88,
        "end": 1349.919,
        "text": "You use your brain to guide you. The more you practice this, the easier it becomes.",
        "textdich": ""
    },
    {
        "start": 1347.2,
        "end": 1354.32,
        "text": "Here is a small game you can play with yourself.",
        "textdich": ""
    },
    {
        "start": 1351.6,
        "end": 1364.4,
        "text": "When you see people talking in English, maybe on a video, maybe in real life, stop for a moment and ask your brain,",
        "textdich": ""
    },
    {
        "start": 1361.44,
        "end": 1371.28,
        "text": "\"If I were in that talk, what would I say?\" Make your brain give you an answer.",
        "textdich": ""
    },
    {
        "start": 1369.36,
        "end": 1382.159,
        "text": "Maybe the people are talking about the weather. Your brain can say, \"Yes, it is hot today.\" Or maybe they are talking",
        "textdich": ""
    },
    {
        "start": 1378.08,
        "end": 1392.4,
        "text": "about food. Your brain can say, \"I like pizza.\" This game helps you practice brain talking in real life situations.",
        "textdich": ""
    },
    {
        "start": 1390.08,
        "end": 1403.52,
        "text": "You are teaching your brain to be ready at any time. When you use brain before speaking, you feel less afraid of mistakes.",
        "textdich": ""
    },
    {
        "start": 1401.28,
        "end": 1414.24,
        "text": "You have already said the words in your mind. You know they sound okay. And if you make a small mistake, that is okay",
        "textdich": ""
    },
    {
        "start": 1410.799,
        "end": 1426.24,
        "text": "too. Remember, mistakes are part of learning. Your brain learns from mistakes. Every time you talk in your brain or out loud, you get better. You",
        "textdich": ""
    },
    {
        "start": 1424.32,
        "end": 1428.96,
        "text": "become stronger.",
        "textdich": ""
    },
    {
        "start": 1426.24,
        "end": 1434.72,
        "text": "Sometimes people worry that others will laugh at them if they make a mistake.",
        "textdich": ""
    },
    {
        "start": 1431.84,
        "end": 1445.919,
        "text": "But I want you to remember this. Most people are kind. Most people will be happy that you are trying to speak English. They will help you. And when",
        "textdich": ""
    },
    {
        "start": 1443.44,
        "end": 1459.36,
        "text": "you practice brain talking, you make fewer mistakes because your brain is ready. So do not be afraid. Speak. Use your brain talking to help you. Also,",
        "textdich": ""
    },
    {
        "start": 1456.96,
        "end": 1473.76,
        "text": "when you speak with people, listen carefully to what they say. Then in your brain, repeat their words. This is a great way to learn.",
        "textdich": ""
    },
    {
        "start": 1470.64,
        "end": 1485.2,
        "text": "If they say, \"I went to the park yesterday.\" Say in your brain, \"I went to the park yesterday.\" This helps you remember the sentence. It",
        "textdich": ""
    },
    {
        "start": 1482.559,
        "end": 1496.799,
        "text": "helps you hear the right sounds. It helps you speak better next time. You can also use brain talking after you finish speaking.",
        "textdich": ""
    },
    {
        "start": 1493.76,
        "end": 1505.36,
        "text": "Think about what you said. Think about what you can say better next time. This is how you grow.",
        "textdich": ""
    },
    {
        "start": 1502.96,
        "end": 1507.76,
        "text": "I used to do this.",
        "textdich": ""
    },
    {
        "start": 1505.36,
        "end": 1516.64,
        "text": "After I spoke with someone, I thought in my brain, did I say that right? Could I say it in a better way? This made me",
        "textdich": ""
    },
    {
        "start": 1513.279,
        "end": 1522.24,
        "text": "better every day. And soon my speaking became strong.",
        "textdich": ""
    },
    {
        "start": 1518.799,
        "end": 1524.88,
        "text": "So use brain talking before you speak.",
        "textdich": ""
    },
    {
        "start": 1522.24,
        "end": 1530.32,
        "text": "Use it during the conversation. Use it after the conversation.",
        "textdich": ""
    },
    {
        "start": 1527.12,
        "end": 1544.96,
        "text": "Your brain is your best helper. It is always with you. And when you use it well, it helps you speak better, think faster, and feel more confident.",
        "textdich": ""
    },
    {
        "start": 1541.279,
        "end": 1557.76,
        "text": "Every small step counts. Every small sentence you say in your brain is a big step forward. So keep going, keep practicing. In the next chapter, we will",
        "textdich": ""
    },
    {
        "start": 1555.2,
        "end": 1568.48,
        "text": "learn how to make your brain thinking in English faster so you can speak without stopping too much. Keep practicing brain",
        "textdich": ""
    },
    {
        "start": 1564.88,
        "end": 1574.159,
        "text": "talking and you will see how strong your English can become.",
        "textdich": ""
    },
    {
        "start": 1571.36,
        "end": 1576.799,
        "text": "Chapter 5.",
        "textdich": ""
    },
    {
        "start": 1574.159,
        "end": 1581.6,
        "text": "How to make your brain think in English faster?",
        "textdich": ""
    },
    {
        "start": 1578.72,
        "end": 1586.96,
        "text": "When you want to speak English well, one of the most important things is this.",
        "textdich": ""
    },
    {
        "start": 1584.799,
        "end": 1600.0,
        "text": "Your brain must start thinking in English faster. Maybe now your brain first thinks in your language. Then it tries to find the English words. And",
        "textdich": ""
    },
    {
        "start": 1596.4,
        "end": 1607.44,
        "text": "this takes time. Sometimes you stop and the words do not come. You feel slow.",
        "textdich": ""
    },
    {
        "start": 1603.76,
        "end": 1616.64,
        "text": "You feel shy. But I want to tell you, you can change this. You can teach your brain to think in English first. And",
        "textdich": ""
    },
    {
        "start": 1613.679,
        "end": 1623.52,
        "text": "when you do this, your speaking becomes faster and smoother. You feel more free.",
        "textdich": ""
    },
    {
        "start": 1620.72,
        "end": 1635.279,
        "text": "You feel more confident. Let me share how you can do this. First, we must understand why the brain is slow at first. When you learn a new language,",
        "textdich": ""
    },
    {
        "start": 1632.88,
        "end": 1644.799,
        "text": "your brain tries to help you by using what it knows, your first language. It is like your brain is trying to give you",
        "textdich": ""
    },
    {
        "start": 1641.2,
        "end": 1655.039,
        "text": "support. But for English speaking, this support is not always helpful. You need to make your brain take a new path, the",
        "textdich": ""
    },
    {
        "start": 1651.039,
        "end": 1664.32,
        "text": "English path. This takes practice and it starts with simple steps. The first step is to see English everywhere. When you",
        "textdich": ""
    },
    {
        "start": 1661.84,
        "end": 1676.88,
        "text": "look at something, try to name it in English, not your first language. For example, you see a cup. In your brain,",
        "textdich": ""
    },
    {
        "start": 1671.12,
        "end": 1684.72,
        "text": "say cup. You see the sky. Say sky. You see a chair. Say chair.",
        "textdich": ""
    },
    {
        "start": 1681.279,
        "end": 1697.039,
        "text": "Do this every day. Every time you see something, make your brain say the English word. You can do this quietly in your mind. No one will hear you, but",
        "textdich": ""
    },
    {
        "start": 1694.48,
        "end": 1700.24,
        "text": "your brain will learn.",
        "textdich": ""
    },
    {
        "start": 1697.039,
        "end": 1710.96,
        "text": "Slowly, your brain will stop using your first language for these words. English will come first. Next, when you want to",
        "textdich": ""
    },
    {
        "start": 1707.2,
        "end": 1713.76,
        "text": "say a sentence, try not to translate.",
        "textdich": ""
    },
    {
        "start": 1710.96,
        "end": 1719.279,
        "text": "This is hard at first, but it is very powerful.",
        "textdich": ""
    },
    {
        "start": 1715.279,
        "end": 1729.36,
        "text": "Start with easy sentences. For example, I am happy today or it is cold or I like apples.",
        "textdich": ""
    },
    {
        "start": 1726.88,
        "end": 1740.0,
        "text": "Say these in your brain without thinking of your first language. If you cannot do it at first, that is okay. But keep",
        "textdich": ""
    },
    {
        "start": 1736.24,
        "end": 1749.76,
        "text": "trying. The more you do this, the faster your brain will learn to think directly in English. It is like building a new",
        "textdich": ""
    },
    {
        "start": 1745.679,
        "end": 1760.559,
        "text": "road in your mind. At first, the road is small, but when you use it every day, it becomes wide and smooth.",
        "textdich": ""
    },
    {
        "start": 1757.12,
        "end": 1768.399,
        "text": "Another way is to listen to easy English and repeat it in your mind at the same time.",
        "textdich": ""
    },
    {
        "start": 1764.96,
        "end": 1771.919,
        "text": "This is called shadowing.",
        "textdich": ""
    },
    {
        "start": 1768.399,
        "end": 1780.399,
        "text": "When you hear someone say good morning, your brain says good morning too at the same time.",
        "textdich": ""
    },
    {
        "start": 1776.799,
        "end": 1786.08,
        "text": "When you hear how are you, your brain says how are you?",
        "textdich": ""
    },
    {
        "start": 1783.679,
        "end": 1796.72,
        "text": "This teaches your brain to follow English sounds and English thinking. It is like dancing with the words and with",
        "textdich": ""
    },
    {
        "start": 1792.799,
        "end": 1803.52,
        "text": "practice your brain becomes faster. You can also try to think about your day in English.",
        "textdich": ""
    },
    {
        "start": 1800.799,
        "end": 1811.76,
        "text": "When you wake up, tell yourself in English, I am waking up now.",
        "textdich": ""
    },
    {
        "start": 1807.6,
        "end": 1817.44,
        "text": "When you eat breakfast, say I am eating breakfast.",
        "textdich": ""
    },
    {
        "start": 1813.679,
        "end": 1822.64,
        "text": "When you go to work, say I am going to work.",
        "textdich": ""
    },
    {
        "start": 1819.279,
        "end": 1833.679,
        "text": "This is simple but it is magic for your brain. You are teaching your brain to live in English. The more you do this, the faster your English thinking",
        "textdich": ""
    },
    {
        "start": 1830.96,
        "end": 1836.0,
        "text": "becomes.",
        "textdich": ""
    },
    {
        "start": 1833.679,
        "end": 1849.52,
        "text": "Another great way is to ask simple questions in your brain in English and then answer them in English too. For example, ask yourself, \"What time is",
        "textdich": ""
    },
    {
        "start": 1844.96,
        "end": 1853.84,
        "text": "it?\" Then answer it is 8:00.",
        "textdich": ""
    },
    {
        "start": 1849.52,
        "end": 1865.76,
        "text": "Or ask, \"What am I doing now?\" Answer, \"I am reading.\" This is a game you can play all day and it works. Your brain starts to think in English more and",
        "textdich": ""
    },
    {
        "start": 1862.399,
        "end": 1874.72,
        "text": "more. Many people say, \"But I don't know many English words. How can I think in English?",
        "textdich": ""
    },
    {
        "start": 1870.64,
        "end": 1878.08,
        "text": "My answer is start with what you know.",
        "textdich": ""
    },
    {
        "start": 1874.72,
        "end": 1888.64,
        "text": "Even if you know only 50 words, use those 50 words. Use them again and again. Your brain will get stronger. And",
        "textdich": ""
    },
    {
        "start": 1885.6,
        "end": 1904.159,
        "text": "as you learn new words, add them to your brain talking. Do not wait until you know 1,000 words. Start now. Small steps become big steps.",
        "textdich": ""
    },
    {
        "start": 1900.88,
        "end": 1910.399,
        "text": "Let me share one more idea. When you do not know an English word, do not stop.",
        "textdich": ""
    },
    {
        "start": 1908.24,
        "end": 1921.84,
        "text": "Try to explain it with the words you know. For example, maybe you do not know the word pillow, but you know bed and",
        "textdich": ""
    },
    {
        "start": 1917.519,
        "end": 1932.159,
        "text": "soft. So you can think it is soft. It is on my bed. This helps your brain stay in English. It helps your brain find a way",
        "textdich": ""
    },
    {
        "start": 1928.08,
        "end": 1935.44,
        "text": "to speak and this is very good practice.",
        "textdich": ""
    },
    {
        "start": 1932.159,
        "end": 1941.279,
        "text": "Also, do not worry if your English is simple. Simple English is good English.",
        "textdich": ""
    },
    {
        "start": 1939.2,
        "end": 1955.44,
        "text": "When your brain thinks in simple English, it thinks faster. You do not need big words to speak well. You need clear words. You need words that come",
        "textdich": ""
    },
    {
        "start": 1951.2,
        "end": 1965.84,
        "text": "quickly. And this comes from practice every day. Give your brain this practice. So remember, see English everywhere.",
        "textdich": ""
    },
    {
        "start": 1962.799,
        "end": 1970.88,
        "text": "Name things in English. Think easy English sentences.",
        "textdich": ""
    },
    {
        "start": 1967.84,
        "end": 1978.72,
        "text": "Use shadowing. Think about your day in English. Ask and answer easy questions.",
        "textdich": ""
    },
    {
        "start": 1975.6,
        "end": 1988.64,
        "text": "Use what you know. Explain things with the words you have. and be proud of your small steps. Your brain will learn, your",
        "textdich": ""
    },
    {
        "start": 1985.76,
        "end": 1998.159,
        "text": "brain will think faster and you will speak better. In the next chapter, we will talk about how to keep your English",
        "textdich": ""
    },
    {
        "start": 1994.24,
        "end": 2004.88,
        "text": "brain strong every day. We will learn small habits that give you big results.",
        "textdich": ""
    },
    {
        "start": 2001.6,
        "end": 2012.0,
        "text": "So, keep going. Your English brain is growing stronger with every word you think.",
        "textdich": ""
    },
    {
        "start": 2010.0,
        "end": 2014.559,
        "text": "Chapter six.",
        "textdich": ""
    },
    {
        "start": 2012.0,
        "end": 2019.279,
        "text": "How to keep your English brain strong every day.",
        "textdich": ""
    },
    {
        "start": 2016.96,
        "end": 2030.96,
        "text": "Now you have learned how to start brain talking, how to use it before you speak with people, and how to make your brain think in English faster.",
        "textdich": ""
    },
    {
        "start": 2027.679,
        "end": 2034.0,
        "text": "But there is one more important part.",
        "textdich": ""
    },
    {
        "start": 2030.96,
        "end": 2039.039,
        "text": "You must keep your English brain strong every day.",
        "textdich": ""
    },
    {
        "start": 2036.0,
        "end": 2048.72,
        "text": "Just like your body needs food and water to stay healthy, your English brain needs practice and care to stay strong.",
        "textdich": ""
    },
    {
        "start": 2045.679,
        "end": 2059.2,
        "text": "When you do small things every day, your brain becomes better at English. It becomes faster, clearer, and more confident.",
        "textdich": ""
    },
    {
        "start": 2056.72,
        "end": 2063.679,
        "text": "Let me show you how you can do this in simple ways.",
        "textdich": ""
    },
    {
        "start": 2061.119,
        "end": 2071.04,
        "text": "The first way to keep your English brain strong is to give it daily English food.",
        "textdich": ""
    },
    {
        "start": 2067.52,
        "end": 2084.24,
        "text": "What is English food for the brain? It is the English words, sentences, and sounds that you hear, read, think, and say. Every day, feed your brain",
        "textdich": ""
    },
    {
        "start": 2082.0,
        "end": 2087.839,
        "text": "something in English.",
        "textdich": ""
    },
    {
        "start": 2084.24,
        "end": 2099.92,
        "text": "It can be very small. For example, listen to a short English video. It can be only 2 or 3 minutes or read a small English sentence.",
        "textdich": ""
    },
    {
        "start": 2097.76,
        "end": 2113.119,
        "text": "Or look at an English word and think about it. When you give your brain this food every day, it stays strong. It stays ready to help you speak.",
        "textdich": ""
    },
    {
        "start": 2110.56,
        "end": 2119.76,
        "text": "You can also keep your English brain strong by repeating what you already know.",
        "textdich": ""
    },
    {
        "start": 2117.04,
        "end": 2133.28,
        "text": "Many people think they must always learn something new. But the truth is your brain grows strong when you use what you know again and again.",
        "textdich": ""
    },
    {
        "start": 2130.24,
        "end": 2146.64,
        "text": "For example, if you know the sentence, how are you? Say it in your brain every day. If you know my name is your name, say it again and again.",
        "textdich": ""
    },
    {
        "start": 2143.76,
        "end": 2156.64,
        "text": "This makes your brain quick. It makes your brain sure and when your brain is sure, you feel confident to speak.",
        "textdich": ""
    },
    {
        "start": 2153.76,
        "end": 2170.64,
        "text": "Another way is to make small English habits. A habit is something you do without thinking too much like brushing your teeth or drinking water in the",
        "textdich": ""
    },
    {
        "start": 2166.24,
        "end": 2173.359,
        "text": "morning. Make English a habit like this.",
        "textdich": ""
    },
    {
        "start": 2170.64,
        "end": 2184.32,
        "text": "For example, every morning when you wake up, think one English sentence. You can say, \"Good morning. I feel happy today.\"",
        "textdich": ""
    },
    {
        "start": 2181.839,
        "end": 2196.56,
        "text": "or when you go to sleep at night, think, \"Today I spoke English in my brain.\" These small habits add power to your English brain. They make English a",
        "textdich": ""
    },
    {
        "start": 2193.92,
        "end": 2210.24,
        "text": "normal part of your day. And when English is normal for your brain, it feels easy to use. Also, remember to play with English. When you play, your",
        "textdich": ""
    },
    {
        "start": 2206.88,
        "end": 2220.72,
        "text": "brain learns faster. You can play simple games with yourself. For example, choose a color each day. When you see something",
        "textdich": ""
    },
    {
        "start": 2216.88,
        "end": 2230.64,
        "text": "with that color, name it in English. If you choose blue, you can say blue sky, blue car, blue shirt. Or you can choose",
        "textdich": ""
    },
    {
        "start": 2227.92,
        "end": 2244.4,
        "text": "a number. Every time you see that number, say an English word you know. If you choose the number three and you see it, say apple or happy or cat.",
        "textdich": ""
    },
    {
        "start": 2241.839,
        "end": 2255.68,
        "text": "These small games keep your brain active. They make English fun. And when learning is fun, your brain becomes strong.",
        "textdich": ""
    },
    {
        "start": 2252.8,
        "end": 2268.079,
        "text": "Another way is to use English with your feelings. When you feel something happy, sad, excited, tired, tell your brain in",
        "textdich": ""
    },
    {
        "start": 2263.68,
        "end": 2282.88,
        "text": "English. If you feel happy, say, \"I feel happy.\" If you feel tired, say, \"I feel tired.\" If you feel nervous, say, \"I feel nervous, but I will try.\"",
        "textdich": ""
    },
    {
        "start": 2280.64,
        "end": 2294.8,
        "text": "When you connect English with your feelings, your brain remembers better and your brain starts to feel that English is a part of your real life.",
        "textdich": ""
    },
    {
        "start": 2292.48,
        "end": 2308.56,
        "text": "You can also keep your English brain strong by talking to yourself in the mirror. Stand in front of the mirror and say simple English sentences.",
        "textdich": ""
    },
    {
        "start": 2303.76,
        "end": 2321.359,
        "text": "Look at yourself. Smile at yourself. Say I can speak English. I am learning every day. Say today is a good day for English.",
        "textdich": ""
    },
    {
        "start": 2318.16,
        "end": 2330.16,
        "text": "This helps your brain feel positive. It helps you feel proud and it gives your brain good energy to keep learning.",
        "textdich": ""
    },
    {
        "start": 2327.68,
        "end": 2340.96,
        "text": "Do not forget to give your English brain rest, too. Your brain needs time to relax and remember what you learn.",
        "textdich": ""
    },
    {
        "start": 2338.16,
        "end": 2344.64,
        "text": "After you practice English, take a small rest.",
        "textdich": ""
    },
    {
        "start": 2342.56,
        "end": 2347.04,
        "text": "Close your eyes.",
        "textdich": ""
    },
    {
        "start": 2344.64,
        "end": 2351.119,
        "text": "Breathe slowly.",
        "textdich": ""
    },
    {
        "start": 2347.04,
        "end": 2353.52,
        "text": "Say to yourself, \"My brain is learning.",
        "textdich": ""
    },
    {
        "start": 2351.119,
        "end": 2362.16,
        "text": "My brain is strong.\" This rest helps your brain keep the English words inside.",
        "textdich": ""
    },
    {
        "start": 2358.4,
        "end": 2369.92,
        "text": "It helps you feel calm. A calm brain is a strong brain. And always be kind to your brain.",
        "textdich": ""
    },
    {
        "start": 2367.04,
        "end": 2372.88,
        "text": "Sometimes you will forget words.",
        "textdich": ""
    },
    {
        "start": 2369.92,
        "end": 2383.92,
        "text": "Sometimes you will make mistakes. That is okay. Your brain is learning. Your brain is growing. Say to yourself, \"It",
        "textdich": ""
    },
    {
        "start": 2380.4,
        "end": 2396.32,
        "text": "is okay. I am learning. I am getting better.\" When you are kind to your brain, it feels safe. And a safe brain learns",
        "textdich": ""
    },
    {
        "start": 2391.599,
        "end": 2403.839,
        "text": "faster. Finally, remember this. Small steps every day make a big change.",
        "textdich": ""
    },
    {
        "start": 2400.72,
        "end": 2409.76,
        "text": "You do not need to study for hours. You do not need to know many hard words.",
        "textdich": ""
    },
    {
        "start": 2407.04,
        "end": 2422.88,
        "text": "Just give your English brain small simple practice every day. Talk in your brain. Listen to English. Read one sentence. Play a small game. Think about",
        "textdich": ""
    },
    {
        "start": 2420.079,
        "end": 2435.28,
        "text": "your feelings in English. These small things give your brain power. And one day you will see your brain speaks English with no fear. Your brain thinks",
        "textdich": ""
    },
    {
        "start": 2432.079,
        "end": 2445.28,
        "text": "in English with no stop. Your brain is strong and you are ready to use your English with the world. So keep going.",
        "textdich": ""
    },
    {
        "start": 2441.92,
        "end": 2459.28,
        "text": "Feed your English brain every day. Be kind to it. Play with it. Rest it. And watch it grow strong. You are doing great and every day your English brain",
        "textdich": ""
    },
    {
        "start": 2455.76,
        "end": 2463.04,
        "text": "is getting better and better.",
        "textdich": ""
    },
    {
        "start": 2459.28,
        "end": 2471.2,
        "text": "Chapter 7. How to use brain talking to become a confident English speaker. Now that you have learned how to keep your",
        "textdich": ""
    },
    {
        "start": 2468.319,
        "end": 2482.8,
        "text": "English brain strong every day, it is time to take the next step. It is time to use brainalking to become a confident English speaker.",
        "textdich": ""
    },
    {
        "start": 2480.0,
        "end": 2489.52,
        "text": "You see, many people can understand English. Many people can read English.",
        "textdich": ""
    },
    {
        "start": 2486.64,
        "end": 2498.72,
        "text": "But when it is time to speak, they feel nervous. They feel shy. They are afraid to make mistakes.",
        "textdich": ""
    },
    {
        "start": 2495.76,
        "end": 2505.359,
        "text": "But I want you to know this. Confidence does not come from perfect English.",
        "textdich": ""
    },
    {
        "start": 2501.92,
        "end": 2514.88,
        "text": "Confidence comes from practice. It comes from teaching your brain to feel safe when you speak. And brain talking is one",
        "textdich": ""
    },
    {
        "start": 2511.68,
        "end": 2522.72,
        "text": "of the best ways to do this. Let's see how you can use it to build your speaking confidence.",
        "textdich": ""
    },
    {
        "start": 2519.28,
        "end": 2525.2,
        "text": "First, understand this simple truth.",
        "textdich": ""
    },
    {
        "start": 2522.72,
        "end": 2537.92,
        "text": "Your brain needs to feel that English is normal. When something is normal for your brain, it feels safe. It feels easy. Think about this.",
        "textdich": ""
    },
    {
        "start": 2534.56,
        "end": 2541.52,
        "text": "When you walk, you do not feel nervous.",
        "textdich": ""
    },
    {
        "start": 2537.92,
        "end": 2543.28,
        "text": "When you eat, you do not feel nervous.",
        "textdich": ""
    },
    {
        "start": 2541.52,
        "end": 2545.28,
        "text": "Why?",
        "textdich": ""
    },
    {
        "start": 2543.28,
        "end": 2552.24,
        "text": "Because these things are normal for your brain. You have done them many times.",
        "textdich": ""
    },
    {
        "start": 2549.119,
        "end": 2555.76,
        "text": "Speaking English can feel the same way.",
        "textdich": ""
    },
    {
        "start": 2552.24,
        "end": 2566.8,
        "text": "But for that, your brain needs to do English many times. And brain talking gives your brain this safe practice. You",
        "textdich": ""
    },
    {
        "start": 2562.72,
        "end": 2578.079,
        "text": "can brain talk anytime, anywhere. You do not need a partner. You do not need a teacher. You do not need to feel shy. It",
        "textdich": ""
    },
    {
        "start": 2574.0,
        "end": 2582.72,
        "text": "is just you and your brain. And this is powerful.",
        "textdich": ""
    },
    {
        "start": 2580.16,
        "end": 2587.2,
        "text": "So, how do you use brain talking for confidence?",
        "textdich": ""
    },
    {
        "start": 2584.56,
        "end": 2600.96,
        "text": "One simple way is to practice common speaking situations in your mind. For example, imagine that you meet a new person. In your brain, say, \"Hello, my",
        "textdich": ""
    },
    {
        "start": 2597.2,
        "end": 2614.48,
        "text": "name is your name. Nice to meet you.\" Imagine the person says, \"Nice to meet you, too.\" Then in your brain, ask, \"Where are you from?\" Imagine their",
        "textdich": ""
    },
    {
        "start": 2610.16,
        "end": 2625.839,
        "text": "answer. Then you say, \"That's nice.\" Or, \"Oh, I know that place.\" When you practice this kind of small talk in your brain, your brain becomes",
        "textdich": ""
    },
    {
        "start": 2622.4,
        "end": 2634.72,
        "text": "ready. When a real person talks to you, your brain will say, \"Ah, I know this. I have done this before.\" And you will",
        "textdich": ""
    },
    {
        "start": 2632.0,
        "end": 2639.92,
        "text": "feel more confident. You can do the same for other situations.",
        "textdich": ""
    },
    {
        "start": 2637.04,
        "end": 2657.28,
        "text": "Imagine you are at a shop. In your brain, say, \"How much is this?\" Imagine the person says, \"It's $5.\" You say, \"Thank you.\" Imagine you are at a cafe.",
        "textdich": ""
    },
    {
        "start": 2653.119,
        "end": 2667.76,
        "text": "Say, \"Can I have a coffee, please?\" The more you practice these small situations in your brain, the stronger your speaking confidence becomes.",
        "textdich": ""
    },
    {
        "start": 2665.52,
        "end": 2674.96,
        "text": "Your brain starts to see speaking English as normal. And this is what makes you confident.",
        "textdich": ""
    },
    {
        "start": 2672.48,
        "end": 2683.839,
        "text": "Another way brain talking helps confidence is that it teaches you to speak without fear of mistakes.",
        "textdich": ""
    },
    {
        "start": 2680.48,
        "end": 2692.0,
        "text": "When you brain talk, no one hears you, no one can laugh, no one can judge you.",
        "textdich": ""
    },
    {
        "start": 2687.92,
        "end": 2698.96,
        "text": "This gives your brain a safe space. In this space, you can try new sentences.",
        "textdich": ""
    },
    {
        "start": 2696.0,
        "end": 2705.599,
        "text": "You can try new words. You can make mistakes and you can fix them.",
        "textdich": ""
    },
    {
        "start": 2703.2,
        "end": 2716.72,
        "text": "Your brain learns that mistakes are part of learning. And when you feel this inside, you stop being afraid of mistakes when you speak with people. You",
        "textdich": ""
    },
    {
        "start": 2713.839,
        "end": 2727.119,
        "text": "start to speak more freely. You start to enjoy speaking. You can also use brain to practice speaking in a strong, clear",
        "textdich": ""
    },
    {
        "start": 2723.599,
        "end": 2732.4,
        "text": "voice. When you brain talk, do not always do it silently.",
        "textdich": ""
    },
    {
        "start": 2729.68,
        "end": 2743.92,
        "text": "Sometimes speak out loud when you are alone. Stand tall. Smile. Say your sentences with power. For example, say I",
        "textdich": ""
    },
    {
        "start": 2740.4,
        "end": 2754.96,
        "text": "can speak English. Say, \"I am learning every day.\" Say, \"I am not afraid to speak.\" When you do this, your brain connects",
        "textdich": ""
    },
    {
        "start": 2752.0,
        "end": 2761.839,
        "text": "English with a strong feeling. And when you feel strong, you speak with confidence.",
        "textdich": ""
    },
    {
        "start": 2759.2,
        "end": 2765.28,
        "text": "Here is another idea.",
        "textdich": ""
    },
    {
        "start": 2761.839,
        "end": 2775.28,
        "text": "Use brain before you speak with real people. Before you go to a shop, brain talk the sentences you will use. Before",
        "textdich": ""
    },
    {
        "start": 2772.24,
        "end": 2782.4,
        "text": "you call someone, brain talk what you will say. This gives your brain a plan.",
        "textdich": ""
    },
    {
        "start": 2779.44,
        "end": 2796.96,
        "text": "And when your brain has a plan, it feels safe. It feels ready. And you feel confident. Even if things change a little, your brain is ready to try. Your",
        "textdich": ""
    },
    {
        "start": 2793.359,
        "end": 2802.88,
        "text": "brain is not afraid. You can also brain talk about your dreams and hopes.",
        "textdich": ""
    },
    {
        "start": 2800.24,
        "end": 2810.64,
        "text": "Imagine yourself speaking English in the future. Imagine yourself talking to new friends.",
        "textdich": ""
    },
    {
        "start": 2807.76,
        "end": 2812.64,
        "text": "Imagine yourself speaking at work.",
        "textdich": ""
    },
    {
        "start": 2810.64,
        "end": 2820.0,
        "text": "Imagine people listening to you and smiling. Brain talk these good pictures.",
        "textdich": ""
    },
    {
        "start": 2816.64,
        "end": 2828.64,
        "text": "Say, \"I will speak English.\" Well, I will speak with confidence. When you see these pictures in your mind, your brain",
        "textdich": ""
    },
    {
        "start": 2825.92,
        "end": 2835.52,
        "text": "believes them. And when your brain believes, you feel strong.",
        "textdich": ""
    },
    {
        "start": 2832.48,
        "end": 2839.04,
        "text": "Finally, remember this.",
        "textdich": ""
    },
    {
        "start": 2835.52,
        "end": 2842.319,
        "text": "Confidence grows with small steps.",
        "textdich": ""
    },
    {
        "start": 2839.04,
        "end": 2851.76,
        "text": "You do not need to be perfect today. You only need to practice today. Each time you brain talk, you are building your",
        "textdich": ""
    },
    {
        "start": 2848.72,
        "end": 2861.04,
        "text": "confidence. Each time you use English in your mind, you are teaching your brain that English is safe, that English is",
        "textdich": ""
    },
    {
        "start": 2857.839,
        "end": 2872.48,
        "text": "normal, that English is something you can do. And this is what makes a confident English speaker. So use your brain talking every day. Practice small",
        "textdich": ""
    },
    {
        "start": 2870.96,
        "end": 2875.76,
        "text": "situations.",
        "textdich": ""
    },
    {
        "start": 2872.48,
        "end": 2878.72,
        "text": "Practice clear, strong sentences.",
        "textdich": ""
    },
    {
        "start": 2875.76,
        "end": 2882.24,
        "text": "Practice before you speak with people.",
        "textdich": ""
    },
    {
        "start": 2878.72,
        "end": 2888.24,
        "text": "Imagine your good future and be kind to yourself.",
        "textdich": ""
    },
    {
        "start": 2883.76,
        "end": 2891.2,
        "text": "Confidence is not magic. It is practice.",
        "textdich": ""
    },
    {
        "start": 2888.24,
        "end": 2905.119,
        "text": "And with brain talking, you are on the path to becoming a confident, happy English speaker. Keep going. Your confidence is growing every day.",
        "textdich": ""
    },
    {
        "start": 2901.2,
        "end": 2909.2,
        "text": "Chapter 8. The secret power of repeating in your mind.",
        "textdich": ""
    },
    {
        "start": 2907.119,
        "end": 2920.559,
        "text": "Now you are ready to learn another secret that can change how you speak English. This is the secret power of repeating in your mind. You have already",
        "textdich": ""
    },
    {
        "start": 2917.68,
        "end": 2928.64,
        "text": "learned about brain talking. You have seen how talking to yourself in English can help you feel confident.",
        "textdich": ""
    },
    {
        "start": 2925.839,
        "end": 2940.559,
        "text": "But now I want to show you how repeating simple English sentences silently in your mind can make your English faster, clearer, and more natural.",
        "textdich": ""
    },
    {
        "start": 2937.76,
        "end": 2949.76,
        "text": "This is something that great learners do even if they do not talk about it and it is something you can start doing today.",
        "textdich": ""
    },
    {
        "start": 2946.319,
        "end": 2958.72,
        "text": "The best part, you can do it anywhere, anytime. You can do it while you are walking, while you are sitting, or even",
        "textdich": ""
    },
    {
        "start": 2955.68,
        "end": 2965.52,
        "text": "while you are waiting for a bus. Let's see how it works and why it is so powerful.",
        "textdich": ""
    },
    {
        "start": 2962.64,
        "end": 2973.119,
        "text": "First, think about this. When you hear English, your brain works hard to understand.",
        "textdich": ""
    },
    {
        "start": 2969.92,
        "end": 2982.88,
        "text": "But if you only listen, your brain stays quiet. If you want to really learn, your brain must also do English.",
        "textdich": ""
    },
    {
        "start": 2980.559,
        "end": 2993.599,
        "text": "Repeating in your mind is how you help your brain do English without fear, without mistakes, and without needing another person.",
        "textdich": ""
    },
    {
        "start": 2990.64,
        "end": 2998.72,
        "text": "It is like giving your brain quiet practice.",
        "textdich": ""
    },
    {
        "start": 2995.359,
        "end": 3007.599,
        "text": "Practice that makes your English smooth and natural over time.",
        "textdich": ""
    },
    {
        "start": 3002.64,
        "end": 3010.4,
        "text": "So, how do you do it? It is very easy.",
        "textdich": ""
    },
    {
        "start": 3007.599,
        "end": 3018.16,
        "text": "When you hear or read a simple English sentence, you repeat it in your mind.",
        "textdich": ""
    },
    {
        "start": 3013.76,
        "end": 3033.599,
        "text": "For example, you hear, \"I like tea.\" You silently say in your mind, \"I like tea.\" You hear, \"It's a nice day.\" You say in your mind, \"It's a nice day.\"",
        "textdich": ""
    },
    {
        "start": 3030.079,
        "end": 3040.319,
        "text": "You hear, \"Where are you from?\" You say in your mind, \"Where are you from?",
        "textdich": ""
    },
    {
        "start": 3037.52,
        "end": 3053.44,
        "text": "That is all. You do not change the sentence. You do not translate. You do not think too much. You just repeat again and again.",
        "textdich": ""
    },
    {
        "start": 3050.4,
        "end": 3067.04,
        "text": "What happens when you do this? Your brain starts to remember these simple sentences. They become part of you. When you need them, they come out easily.",
        "textdich": ""
    },
    {
        "start": 3062.8,
        "end": 3080.96,
        "text": "For example, one day someone asks, \"Do you want tea or coffee?\" You will say, \"I like tea.\" without thinking. Why? Because you",
        "textdich": ""
    },
    {
        "start": 3077.2,
        "end": 3084.16,
        "text": "repeated it in your mind many times.",
        "textdich": ""
    },
    {
        "start": 3080.96,
        "end": 3097.119,
        "text": "Your brain knows it. This is how you start speaking English faster. This is how you start speaking without fear because your brain is ready. Your brain",
        "textdich": ""
    },
    {
        "start": 3094.16,
        "end": 3109.359,
        "text": "knows the sentences. You can do this with all kinds of simple sentences. You can use daily sentences like what time is it? How much is this? I don't",
        "textdich": ""
    },
    {
        "start": 3107.68,
        "end": 3112.0,
        "text": "understand.",
        "textdich": ""
    },
    {
        "start": 3109.359,
        "end": 3114.24,
        "text": "Please say that again.",
        "textdich": ""
    },
    {
        "start": 3112.0,
        "end": 3116.4,
        "text": "That's interesting.",
        "textdich": ""
    },
    {
        "start": 3114.24,
        "end": 3128.559,
        "text": "These are the small sentences that people use every day. And when you repeat them in your mind, you are teaching your brain to use them naturally.",
        "textdich": ""
    },
    {
        "start": 3125.28,
        "end": 3139.44,
        "text": "Here is something more. When you repeat in your mind, try to hear the sound. Try to feel the rhythm. English has its own",
        "textdich": ""
    },
    {
        "start": 3135.76,
        "end": 3149.52,
        "text": "music, its own beat. When you repeat in your mind, do not just see the words, hear them, feel them. This will help",
        "textdich": ""
    },
    {
        "start": 3146.0,
        "end": 3158.319,
        "text": "your speaking sound more natural. This will help your brain remember the feeling of English, not just the words.",
        "textdich": ""
    },
    {
        "start": 3155.52,
        "end": 3166.319,
        "text": "Let's look at when you can do this. You can repeat in your mind when you listen to an English video or podcast.",
        "textdich": ""
    },
    {
        "start": 3164.0,
        "end": 3170.319,
        "text": "You can repeat when you read a simple English book.",
        "textdich": ""
    },
    {
        "start": 3168.24,
        "end": 3175.04,
        "text": "You can repeat when you hear people speaking English on the street.",
        "textdich": ""
    },
    {
        "start": 3173.2,
        "end": 3185.2,
        "text": "You can repeat when you remember sentences you learned before. The time and place do not matter. What matters is",
        "textdich": ""
    },
    {
        "start": 3181.68,
        "end": 3195.599,
        "text": "that you do it. Each time you repeat in your mind, you are building your English brain. You are making your English stronger.",
        "textdich": ""
    },
    {
        "start": 3192.559,
        "end": 3210.72,
        "text": "Some learners ask, \"But how many times should I repeat?\" The answer is simple. As many times as you like. 10 times, 20 times. There is no rule.",
        "textdich": ""
    },
    {
        "start": 3208.0,
        "end": 3222.4,
        "text": "The more you repeat, the deeper the sentence goes into your brain. Some people like to repeat the same sentence many times in one day. Others like to",
        "textdich": ""
    },
    {
        "start": 3219.68,
        "end": 3225.119,
        "text": "repeat a little bit every day.",
        "textdich": ""
    },
    {
        "start": 3222.4,
        "end": 3235.2,
        "text": "Both ways are good. The important thing is to enjoy it. Do not feel stress. Do not feel that you must do it a certain",
        "textdich": ""
    },
    {
        "start": 3231.359,
        "end": 3245.04,
        "text": "way. Just repeat in your mind as a game, as a fun practice. Here is another small tip. You can also repeat sentences you",
        "textdich": ""
    },
    {
        "start": 3242.0,
        "end": 3256.24,
        "text": "want to say in the future. For example, you want to say, \"I'm learning English.\" Repeat it in your mind many times. I'm",
        "textdich": ""
    },
    {
        "start": 3251.44,
        "end": 3258.88,
        "text": "learning English. I'm learning English.",
        "textdich": ""
    },
    {
        "start": 3256.24,
        "end": 3269.839,
        "text": "Or maybe you want to say, \"Can you help me?\" Repeat it silently again and again.",
        "textdich": ""
    },
    {
        "start": 3265.2,
        "end": 3273.2,
        "text": "Can you help me? Can you help me?",
        "textdich": ""
    },
    {
        "start": 3269.839,
        "end": 3282.0,
        "text": "This will prepare your brain. This will make it easier to say these sentences when the time comes. And do not forget",
        "textdich": ""
    },
    {
        "start": 3278.4,
        "end": 3286.4,
        "text": "to smile as you repeat in your mind.",
        "textdich": ""
    },
    {
        "start": 3282.0,
        "end": 3289.2,
        "text": "When you smile, your brain feels good.",
        "textdich": ""
    },
    {
        "start": 3286.4,
        "end": 3293.599,
        "text": "Your brain connects English with a happy feeling.",
        "textdich": ""
    },
    {
        "start": 3290.72,
        "end": 3304.0,
        "text": "This makes learning easier. This makes your speaking easier. A small smile is a big help. So now you know the secret",
        "textdich": ""
    },
    {
        "start": 3300.64,
        "end": 3311.04,
        "text": "power of repeating in your mind. It is a simple tool, but it is a powerful tool.",
        "textdich": ""
    },
    {
        "start": 3308.319,
        "end": 3318.72,
        "text": "It helps you remember. It helps you speak faster. It helps you feel natural.",
        "textdich": ""
    },
    {
        "start": 3315.28,
        "end": 3326.319,
        "text": "And you can start right now. After this chapter, pick one simple English sentence.",
        "textdich": ""
    },
    {
        "start": 3322.8,
        "end": 3334.16,
        "text": "Close your eyes. Say it silently in your mind again and again. Feel the words.",
        "textdich": ""
    },
    {
        "start": 3330.8,
        "end": 3344.0,
        "text": "Hear the sound. Enjoy the practice and know this. With each silent repeat, you are building the English speaker inside",
        "textdich": ""
    },
    {
        "start": 3340.16,
        "end": 3353.04,
        "text": "you. Keep going. Your English is growing every day. The text in my videos is copyright protected by bookish English.",
        "textdich": ""
    },
    {
        "start": 3350.559,
        "end": 3360.079,
        "text": "No one is allowed to steal or use my transcript in their videos under any circumstances.",
        "textdich": ""
    },
    {
        "start": 3357.04,
        "end": 3367.839,
        "text": "Using it in any form, including in your videos, is a violation of copyright laws.",
        "textdich": ""
    },
    {
        "start": 3364.799,
        "end": 3373.04,
        "text": "Immediate removal is required. Legal action will be taken if you fail to comply.",
        "textdich": ""
    }
]