[
    {
        "start": 0.719,
        "end": 11.2,
        "text": "Hi everyone, welcome to a new episode of Easy English. So, as some of you may already know, uh, Easy and I like to",
        "textdich": ""
    },
    {
        "start": 9.04,
        "end": 20.16,
        "text": "spend a lot of time in our hometown of Müster, Germany. And as you can see, it's a total winter wonderland. And it",
        "textdich": ""
    },
    {
        "start": 18.08,
        "end": 27.199,
        "text": "got me thinking about making a part two of an episode that we already made in Berlin, which you can watch up here,",
        "textdich": ""
    },
    {
        "start": 24.64,
        "end": 36.079,
        "text": "about cultural shocks I find between the UK and Germany. And hopefully in turn, this allows me to maybe describe some of",
        "textdich": ""
    },
    {
        "start": 33.44,
        "end": 42.64,
        "text": "the more cultural traditions, rules, and behaviors that you'll find when you come to the UK, when I'm finding these",
        "textdich": ""
    },
    {
        "start": 40.399,
        "end": 49.76,
        "text": "comparisons and culture shocks between the UK and Germany. Before we start this video, if you are a regular Easy English",
        "textdich": ""
    },
    {
        "start": 47.12,
        "end": 55.44,
        "text": "viewer, but not yet a subscriber, then it would really mean the world to me if you quickly subscribe below and we'll",
        "textdich": ""
    },
    {
        "start": 53.6,
        "end": 58.6,
        "text": "get going with this week's video. Here we go.",
        "textdich": ""
    },
    {
        "start": 69.6,
        "end": 82.08,
        "text": "So one of the first things I noticed and mainly inspired me due to all this adverse weather conditions is maybe not",
        "textdich": ""
    },
    {
        "start": 78.32,
        "end": 90.96,
        "text": "a shock be but a reassurance uh is that Germany is very good at dealing with harsh weather conditions. not only in terms of uh the businesses",
        "textdich": ""
    },
    {
        "start": 89.6,
        "end": 97.92,
        "text": "that are running, the schools that are running, the roads that are running, but also the people, they're ready. They're",
        "textdich": ""
    },
    {
        "start": 95.36,
        "end": 107.52,
        "text": "ready for the snow to come. They all probably have a set of skis in their basement and uh also appropriate clothing, which people, even strangers,",
        "textdich": ""
    },
    {
        "start": 105.439,
        "end": 114.399,
        "text": "have commented about my lack of suitable winter clothing. I do have gloves, though.",
        "textdich": ""
    },
    {
        "start": 111.759,
        "end": 119.68,
        "text": "That's the most important thing. But maybe this is more of a take on the UK.",
        "textdich": ""
    },
    {
        "start": 117.68,
        "end": 129.679,
        "text": "When you come to the UK and you experience weather conditions like this, not just snow, but maybe severe rain, severe winds,",
        "textdich": ""
    },
    {
        "start": 126.719,
        "end": 134.959,
        "text": "everything stops. Schools will close, even not with this much snow, even less.",
        "textdich": ""
    },
    {
        "start": 132.56,
        "end": 142.56,
        "text": "The schools will close, airplanes will be grounded, trains will be cancelled, and we're just not quite ready to deal",
        "textdich": ""
    },
    {
        "start": 140.08,
        "end": 149.2,
        "text": "with adverse weather conditions, which maybe helps you if you're thinking about coming to the UK as a tourist. Just be",
        "textdich": ""
    },
    {
        "start": 147.28,
        "end": 158.879,
        "text": "prepared. Another thing you'll also notice is the lack of suitable winter wear amongst Brits. Uh maybe it's the",
        "textdich": ""
    },
    {
        "start": 155.519,
        "end": 165.44,
        "text": "Viking blood inside of us, but the sight of the sunshine, regardless of the temperature, just instinctually makes us",
        "textdich": ""
    },
    {
        "start": 163.519,
        "end": 173.64,
        "text": "want to put shorts on. It's something that Easy mentions on a day-to-day basis, and you have to come just to see it. It's bizarre.",
        "textdich": ""
    },
    {
        "start": 182.319,
        "end": 194.319,
        "text": "Another culture shock. I've also noticed is the opening hour nature of shops and restaurants. In the UK, we've uh adopted",
        "textdich": ""
    },
    {
        "start": 191.68,
        "end": 201.44,
        "text": "this American style where everything is open Monday through Sunday, 9 till late.",
        "textdich": ""
    },
    {
        "start": 198.319,
        "end": 208.48,
        "text": "Uh even the pubs, you'll notice uh will open around uh 11:00 a.m. if you want to start your drinking nice and early.",
        "textdich": ""
    },
    {
        "start": 206.56,
        "end": 213.28,
        "text": "Whereas in Germany, they still have this sort of traditional European nature.",
        "textdich": ""
    },
    {
        "start": 210.799,
        "end": 220.879,
        "text": "Most things, almost everything is closed on a Sunday. And you'll even find that some shops, little shops in particular,",
        "textdich": ""
    },
    {
        "start": 218.64,
        "end": 228.08,
        "text": "restaurants, hairdressers, will be closed on a Monday. This is great for any of you that are visiting. Just that you know that you can pretty much turn",
        "textdich": ""
    },
    {
        "start": 225.92,
        "end": 236.0,
        "text": "up and you can go to any supermarket, any store, any restaurant, and they're generally going to be open within reasonable times. Whereas here, if",
        "textdich": ""
    },
    {
        "start": 234.56,
        "end": 242.48,
        "text": "you've forgotten to buy your groceries on Saturday, you're screwed for food on Sunday.",
        "textdich": ""
    },
    {
        "start": 240.799,
        "end": 247.879,
        "text": "That is unless you want to shop at an all night garage and buy some ready-made sandwiches.",
        "textdich": ""
    },
    {
        "start": 266.8,
        "end": 279.84,
        "text": "So, before we go back into the episode this week and before I freeze my off, uh I just want to quickly uh ask you guys,",
        "textdich": ""
    },
    {
        "start": 278.0,
        "end": 287.04,
        "text": "any of you that are looking to improve their English this year, maybe it's part of your New Year's resolution to check out our membership page.",
        "textdich": ""
    },
    {
        "start": 285.44,
        "end": 296.32,
        "text": "Uh it's a place where you can not only support us but improve and take your English to that next level. Uh it's useful for everyone whether you're",
        "textdich": ""
    },
    {
        "start": 293.759,
        "end": 302.88,
        "text": "wanting to improve your your reading, your listening or your conversation skills. Um the conversation part is the",
        "textdich": ""
    },
    {
        "start": 300.56,
        "end": 312.32,
        "text": "bit that interests me the most. Uh every Tuesday night we all meet, myself, Ezy, and other conversation members on Zoom",
        "textdich": ""
    },
    {
        "start": 308.479,
        "end": 318.96,
        "text": "in an online pub themed atmosphere. It's a place where we share opinions, we chat, we get to know each other. Uh, but",
        "textdich": ""
    },
    {
        "start": 317.28,
        "end": 325.919,
        "text": "most importantly, a place where we can all improve our English speaking and listening skills. Every month, Easy and",
        "textdich": ""
    },
    {
        "start": 323.12,
        "end": 334.8,
        "text": "I, we create uh different topics that we'll talk about in each of our pub calls. Uh, for example, this month we're speaking about beginnings. We're",
        "textdich": ""
    },
    {
        "start": 332.4,
        "end": 343.44,
        "text": "speaking about being caring. We're even having a little debate club where we'll debate two sort of controversial subjects, not too controversial. And",
        "textdich": ""
    },
    {
        "start": 341.28,
        "end": 352.08,
        "text": "it's just a very welcoming place where you're free to come and make mistakes and just practice and slowly but steadily improve your English in a very",
        "textdich": ""
    },
    {
        "start": 350.24,
        "end": 359.44,
        "text": "welcoming atmosphere. If you're someone who maybe is feeling a bit nervous or you don't know what level your English",
        "textdich": ""
    },
    {
        "start": 356.4,
        "end": 367.919,
        "text": "speaking is at, then we offer a 7-day free trial of our conversation membership. So you can come along, see how you feel, see how you fit in, and",
        "textdich": ""
    },
    {
        "start": 365.919,
        "end": 375.52,
        "text": "get rid of those nerves, dust off the cobwebs of that English that you had when you went to school and really improve it in a nice inclusive",
        "textdich": ""
    },
    {
        "start": 373.6,
        "end": 390.919,
        "text": "atmosphere. Uh, if that interests you, then you should go to the link here, easyenglish.vide/membership, or you can click the link up here or up here.",
        "textdich": ""
    },
    {
        "start": 386.56,
        "end": 390.919,
        "text": "And yeah, let's get back to the episode.",
        "textdich": ""
    },
    {
        "start": 391.759,
        "end": 403.36,
        "text": "So, something that's also a big culture shock for me coming to Germany is the lack of public and most importantly free",
        "textdich": ""
    },
    {
        "start": 400.24,
        "end": 410.08,
        "text": "toilets. Here are some you find in some public spheres. But in general, if you need to go for a pee, you're probably",
        "textdich": ""
    },
    {
        "start": 408.08,
        "end": 419.039,
        "text": "going to have to pay for some food or something to go inside a restaurant uh or run to the nearest free toilet, which",
        "textdich": ""
    },
    {
        "start": 415.28,
        "end": 424.8,
        "text": "are very scarce. You're also potentially going to have to pay some fees when you use these toilets. Luckily, these ones",
        "textdich": ""
    },
    {
        "start": 423.199,
        "end": 433.12,
        "text": "are free, but I had to really look on Google Maps to find some. So, the UK in comparison is very generous with its",
        "textdich": ""
    },
    {
        "start": 429.919,
        "end": 439.919,
        "text": "offer of many free public toilets. Uh, not only do you get public ones like we just saw here in Germany, but you're",
        "textdich": ""
    },
    {
        "start": 437.44,
        "end": 449.599,
        "text": "able to go inside any pub you wish and openly use their toilet. Um, it's probably polite to try to buy something, but the offer is there. is a public",
        "textdich": ""
    },
    {
        "start": 447.12,
        "end": 458.08,
        "text": "house for you to use. Uh on top of the pubs also we have many service stations in the UK which uh offer free use of",
        "textdich": ""
    },
    {
        "start": 455.68,
        "end": 467.759,
        "text": "their toilets and they're generally all pretty good condition. Whereas in Germany and France you have to pay and they can be a bit ming if I'm if I'm",
        "textdich": ""
    },
    {
        "start": 465.199,
        "end": 473.88,
        "text": "honest. Uh so yeah that's just one positive if ever you need to take a pee in the UK.",
        "textdich": ""
    },
    {
        "start": 482.08,
        "end": 495.12,
        "text": "So the next point I want to get on to is something connected to this. The amount of paperwork that's involved with being",
        "textdich": ""
    },
    {
        "start": 492.24,
        "end": 505.44,
        "text": "in Germany. Uh I recently registered in Germany about a year ago and I've already amassed an entire folder dedicated towards my life and I received",
        "textdich": ""
    },
    {
        "start": 502.639,
        "end": 521.519,
        "text": "letters on a daily basis informing me things about my health insurance uh about the car, about my tax, uh about NOLA and just general things to do with",
        "textdich": ""
    },
    {
        "start": 516.959,
        "end": 530.0,
        "text": "living here such as bills and uh other payments you might have to Not only will you be receiving letters informing you of news connected to your",
        "textdich": ""
    },
    {
        "start": 528.0,
        "end": 540.16,
        "text": "account, they will, and I've got experience of this, send you letters telling you that they are going to send you the actual letter and then maybe",
        "textdich": ""
    },
    {
        "start": 537.12,
        "end": 549.92,
        "text": "even a letter after the letter saying, \"We sent you something.\" The amount of paperwork is insane. If you compare it",
        "textdich": ""
    },
    {
        "start": 545.92,
        "end": 560.8,
        "text": "to in the UK, you just need a phone. On my phone, I have things such as my banking, I have my internet, I have my household things such as gas,",
        "textdich": ""
    },
    {
        "start": 559.2,
        "end": 563.36,
        "text": "electricity.",
        "textdich": ""
    },
    {
        "start": 560.8,
        "end": 571.92,
        "text": "Um, yeah, everything can be done on here, including even train tickets, airline tickets.",
        "textdich": ""
    },
    {
        "start": 569.12,
        "end": 576.8,
        "text": "It's all done through QR codes and things attached to your phone's wallet.",
        "textdich": ""
    },
    {
        "start": 574.32,
        "end": 579.92,
        "text": "So, yeah.",
        "textdich": ""
    },
    {
        "start": 576.8,
        "end": 593.76,
        "text": "So, one more culture shock which is probably the biggest that affects myself and easy uh is the lack of public footpaths and ways to cross the country",
        "textdich": ""
    },
    {
        "start": 590.8,
        "end": 604.0,
        "text": "that are not using pavements or by the roadside. In the UK, we have many footpaths, bridal ways, many ways to cross the entire country without ever",
        "textdich": ""
    },
    {
        "start": 601.839,
        "end": 615.839,
        "text": "having to step foot on a road or pavement, which is an amazing thing if you have a dog. Uh here I'm in a park, which is obviously great if you have a",
        "textdich": ""
    },
    {
        "start": 612.48,
        "end": 624.959,
        "text": "dog, but you're always kind of walking around in circles essentially. Whereas on a Sunday in the UK, you can plot out",
        "textdich": ""
    },
    {
        "start": 622.32,
        "end": 634.8,
        "text": "a very direct course that takes you from one part of your home to the other part of your city maybe. or uh a good example",
        "textdich": ""
    },
    {
        "start": 631.68,
        "end": 645.279,
        "text": "would be the South Downs Way, which is a 100mile free-touse open foot path that is maintained uh by the taxpayers money and it takes",
        "textdich": ""
    },
    {
        "start": 642.72,
        "end": 655.2,
        "text": "you all the way from Eastborne to the old capital Winchester. On that way, you'll see some amazing sites. Nearly slipped there.",
        "textdich": ""
    },
    {
        "start": 651.92,
        "end": 656.959,
        "text": "You'll get a good breath of fresh air.",
        "textdich": ""
    },
    {
        "start": 655.2,
        "end": 670.32,
        "text": "And to tie this in nicely, you'll also go past plenty of pubs, which will probably be open, and you'll there be able to rest your legs, have some food,",
        "textdich": ""
    },
    {
        "start": 666.0,
        "end": 672.32,
        "text": "and of course, have a delicious beer.",
        "textdich": ""
    },
    {
        "start": 670.32,
        "end": 674.16,
        "text": "Thanks for watching this week's episode.",
        "textdich": ""
    },
    {
        "start": 672.32,
        "end": 680.959,
        "text": "Let us know in the comments below any similarities or differences that I might have missed out on. And don't forget to",
        "textdich": ""
    },
    {
        "start": 678.48,
        "end": 684.2,
        "text": "subscribe. And as always, we'll see you next time.",
        "textdich": ""
    },
    {
        "start": 696.72,
        "end": 699.8,
        "text": "Heat. Heat.",
        "textdich": ""
    }
]