[
    {
        "start": 0.16,
        "end": 14.08,
        "text": "Hello everyone, welcome back to our channel. Today we talk about one of the most powerful truths of life. Attitude is everything.",
        "textdich": ""
    },
    {
        "start": 10.8,
        "end": 19.84,
        "text": "Your attitude decides your success. Your attitude decides your relationships.",
        "textdich": ""
    },
    {
        "start": 16.88,
        "end": 22.64,
        "text": "Your attitude decides your confidence.",
        "textdich": ""
    },
    {
        "start": 19.84,
        "end": 31.439,
        "text": "Your attitude decides your future. Two people can face the same problem. One gives up, the other becomes stronger.",
        "textdich": ""
    },
    {
        "start": 28.32,
        "end": 43.36,
        "text": "Why? Not because of knowledge, not because of talent, but because of attitude. A strong attitude builds your life. A weak attitude breaks it.",
        "textdich": ""
    },
    {
        "start": 40.96,
        "end": 52.879,
        "text": "Today we start with the first and most important lesson on building a powerful attitude that can change your entire life.",
        "textdich": ""
    },
    {
        "start": 49.44,
        "end": 58.16,
        "text": "Lesson one, your mindset decides your life, not your circumstances.",
        "textdich": ""
    },
    {
        "start": 56.48,
        "end": 68.0,
        "text": "Most people think their life is controlled by luck, background, education, family, problems, society.",
        "textdich": ""
    },
    {
        "start": 65.119,
        "end": 75.92,
        "text": "But the truth is different. Your life is controlled by your mindset. Your attitude shapes how you see the world.",
        "textdich": ""
    },
    {
        "start": 73.2,
        "end": 84.88,
        "text": "Your attitude shapes how you react. Your attitude shapes how you rise after falling. Let's understand this deeply.",
        "textdich": ""
    },
    {
        "start": 81.36,
        "end": 95.52,
        "text": "One, a positive attitude sees solutions, not problems. Everyone has problems, but the person with a strong attitude says,",
        "textdich": ""
    },
    {
        "start": 91.36,
        "end": 98.72,
        "text": "\"I will find a way. I can handle this.",
        "textdich": ""
    },
    {
        "start": 95.52,
        "end": 110.64,
        "text": "There must be a solution. I will rise again.\" This attitude makes the impossible possible. A negative attitude says, \"I can't do this. This is too",
        "textdich": ""
    },
    {
        "start": 106.64,
        "end": 120.56,
        "text": "hard. My life is unfair.\" This attitude kills growth. Your mindset decides whether you move forward or stay stuck.",
        "textdich": ""
    },
    {
        "start": 117.28,
        "end": 130.319,
        "text": "Two, attitude is more important than talent. The world is full of talented people who never become successful because they have a weak attitude. And",
        "textdich": ""
    },
    {
        "start": 128.16,
        "end": 135.52,
        "text": "the world is full of ordinary people who become extraordinary.",
        "textdich": ""
    },
    {
        "start": 132.8,
        "end": 144.64,
        "text": "Because of a powerful attitude, talent opens a door. Attitude decides if you stay inside that room. People with the",
        "textdich": ""
    },
    {
        "start": 141.04,
        "end": 154.879,
        "text": "right attitude, try again. Don't give up. Stay consistent. Stay hopeful. Keep improving. This brings success.",
        "textdich": ""
    },
    {
        "start": 152.08,
        "end": 160.0,
        "text": "Three. Your attitude is your shield against negativity. Life will test you.",
        "textdich": ""
    },
    {
        "start": 158.08,
        "end": 166.959,
        "text": "People will doubt you. Life will disappoint you. Situations will challenge you. Failures will hurt you.",
        "textdich": ""
    },
    {
        "start": 164.64,
        "end": 177.04,
        "text": "But if your attitude is strong, you stay calm, focused and powerful. A strong attitude says this is temporary.",
        "textdich": ""
    },
    {
        "start": 174.0,
        "end": 185.92,
        "text": "I will overcome this. I am stronger than this moment. Your attitude protects your mind from negativity.",
        "textdich": ""
    },
    {
        "start": 182.08,
        "end": 189.04,
        "text": "Four, attitude shapes your confidence.",
        "textdich": ""
    },
    {
        "start": 185.92,
        "end": 195.44,
        "text": "When you believe I can improve, I can learn, I can succeed, your confidence increases.",
        "textdich": ""
    },
    {
        "start": 193.599,
        "end": 202.239,
        "text": "This confidence changes the way you walk, talk, think, and face challenges.",
        "textdich": ""
    },
    {
        "start": 199.519,
        "end": 206.08,
        "text": "Confidence is not born from perfection.",
        "textdich": ""
    },
    {
        "start": 202.239,
        "end": 209.519,
        "text": "Confidence is born from attitude. Five.",
        "textdich": ""
    },
    {
        "start": 206.08,
        "end": 211.92,
        "text": "A strong attitude turns pain into power.",
        "textdich": ""
    },
    {
        "start": 209.519,
        "end": 221.519,
        "text": "Life gives everyone pain. But your attitude decides what you do with that pain. A weak attitude breaks down. A strong attitude transforms pain into",
        "textdich": ""
    },
    {
        "start": 220.0,
        "end": 224.159,
        "text": "motivation.",
        "textdich": ""
    },
    {
        "start": 221.519,
        "end": 230.799,
        "text": "A strong attitude says this pain is teaching me something.",
        "textdich": ""
    },
    {
        "start": 227.76,
        "end": 233.84,
        "text": "This challenge will make me better.",
        "textdich": ""
    },
    {
        "start": 230.799,
        "end": 235.68,
        "text": "I will grow through this.",
        "textdich": ""
    },
    {
        "start": 233.84,
        "end": 245.76,
        "text": "Pain becomes your teacher when your attitude is right. Six. Attitude creates your identity. People remember you more",
        "textdich": ""
    },
    {
        "start": 242.799,
        "end": 257.12,
        "text": "for your attitude than your skills. Your attitude shows your strength, your discipline, your character, your mindset, your inner power. A powerful",
        "textdich": ""
    },
    {
        "start": 254.879,
        "end": 262.8,
        "text": "attitude attracts good people, good opportunities, and a good future.",
        "textdich": ""
    },
    {
        "start": 260.0,
        "end": 274.88,
        "text": "Remember this, your attitude is your superpower. If you control your attitude, you can control your entire life. Lesson two, your attitude creates",
        "textdich": ""
    },
    {
        "start": 271.84,
        "end": 278.0,
        "text": "your reality. Change your thoughts.",
        "textdich": ""
    },
    {
        "start": 274.88,
        "end": 289.52,
        "text": "Change your life. What you think inside creates the life you live outside. Your thoughts become your attitude. Your attitude becomes your actions. Your",
        "textdich": ""
    },
    {
        "start": 286.32,
        "end": 297.04,
        "text": "actions become your habits. Your habits become your results. Your results become your future.",
        "textdich": ""
    },
    {
        "start": 294.72,
        "end": 306.479,
        "text": "This is why the strongest people do not focus only on the outside world. They focus on their inner world, their attitude.",
        "textdich": ""
    },
    {
        "start": 304.479,
        "end": 312.4,
        "text": "Let's understand how your thoughts shape your entire reality.",
        "textdich": ""
    },
    {
        "start": 308.88,
        "end": 325.52,
        "text": "One, your thoughts decide how you feel every day. If your thoughts are negative, fearful, doubtful, angry, hopeless, your day becomes heavy. But if",
        "textdich": ""
    },
    {
        "start": 322.08,
        "end": 336.639,
        "text": "your thoughts are positive, clear, hopeful, strong, grateful, your day becomes powerful. A good attitude begins with controlling your thoughts. Two,",
        "textdich": ""
    },
    {
        "start": 333.52,
        "end": 342.4,
        "text": "what you focus on always grows. If you focus on problems, your problems grow.",
        "textdich": ""
    },
    {
        "start": 340.08,
        "end": 354.479,
        "text": "If you focus on solutions, your solutions grow. If you focus on excuses, your excuses grow. If you focus on growth, your growth increases. Your",
        "textdich": ""
    },
    {
        "start": 352.0,
        "end": 360.479,
        "text": "attitude follows your focus. Where your attention goes, your energy flows.",
        "textdich": ""
    },
    {
        "start": 358.0,
        "end": 373.84,
        "text": "Three, a negative attitude makes everything harder. Negative attitude says, \"I can't. I'm unlucky. Nothing works for me. This is too difficult. My",
        "textdich": ""
    },
    {
        "start": 370.639,
        "end": 383.12,
        "text": "life is unfair.\" These thoughts destroy action. They destroy confidence. They destroy courage. A negative attitude",
        "textdich": ""
    },
    {
        "start": 379.759,
        "end": 392.8,
        "text": "creates slow progress, constant stress, low energy, lack of motivation, fear of failure. This is why some people never",
        "textdich": ""
    },
    {
        "start": 388.639,
        "end": 395.44,
        "text": "move forward. Their attitude stops them.",
        "textdich": ""
    },
    {
        "start": 392.8,
        "end": 406.0,
        "text": "Four, a positive attitude turns challenges into opportunities. A positive attitude is not fake. It does not ignore problems. It simply says, \"I",
        "textdich": ""
    },
    {
        "start": 404.24,
        "end": 409.52,
        "text": "can learn from this.",
        "textdich": ""
    },
    {
        "start": 406.0,
        "end": 419.759,
        "text": "I will find a way. This setback is a lesson. This delay is guiding me. A powerful attitude sees opportunities where others see obstacles. This",
        "textdich": ""
    },
    {
        "start": 417.36,
        "end": 427.039,
        "text": "attitude makes life lighter, easier, and brighter. Five. Your attitude controls.",
        "textdich": ""
    },
    {
        "start": 424.0,
        "end": 439.599,
        "text": "Your response, not the situation. You cannot control the weather, other people, problems, delays, mistakes, challenges. But you can control your",
        "textdich": ""
    },
    {
        "start": 436.639,
        "end": 445.919,
        "text": "reactions, your thinking, your attitude and your response matters more than the situation.",
        "textdich": ""
    },
    {
        "start": 443.199,
        "end": 454.88,
        "text": "Two people face the same difficulty. One collapses, one becomes stronger. The difference is attitude.",
        "textdich": ""
    },
    {
        "start": 451.52,
        "end": 466.479,
        "text": "Six. Your attitude attracts the life you live. People with confidence, positive energy, discipline, gratitude, maturity,",
        "textdich": ""
    },
    {
        "start": 463.199,
        "end": 474.319,
        "text": "respect attract better relationships, better opportunities, better environment, better outcomes.",
        "textdich": ""
    },
    {
        "start": 471.599,
        "end": 482.96,
        "text": "A powerful attitude naturally brings success. A weak attitude pushes success away. Your attitude decides what you",
        "textdich": ""
    },
    {
        "start": 479.759,
        "end": 492.56,
        "text": "attract into your life. Seven. You can change your entire reality by changing your attitude. If you want a better",
        "textdich": ""
    },
    {
        "start": 488.319,
        "end": 505.28,
        "text": "life, a better future, a stronger mind, a calm heart, a successful journey, start with your attitude. Shift your thoughts from fear to courage. From",
        "textdich": ""
    },
    {
        "start": 501.68,
        "end": 513.839,
        "text": "doubt to belief, from anger to peace, from excuses to action, from weakness to strength, from negativity to gratitude.",
        "textdich": ""
    },
    {
        "start": 511.28,
        "end": 516.399,
        "text": "These small shifts create big changes.",
        "textdich": ""
    },
    {
        "start": 513.839,
        "end": 524.8,
        "text": "Remember this, you don't need a new life. You need a new attitude. Your thoughts create your reality.",
        "textdich": ""
    },
    {
        "start": 522.479,
        "end": 527.68,
        "text": "Choose them wisely.",
        "textdich": ""
    },
    {
        "start": 524.8,
        "end": 539.2,
        "text": "Lesson three, your attitude towards yourself shapes your entire life. Most people talk about attitude toward work, attitude toward problems, attitude",
        "textdich": ""
    },
    {
        "start": 536.24,
        "end": 545.6,
        "text": "toward success. But the most important attitude is the attitude you have toward yourself.",
        "textdich": ""
    },
    {
        "start": 543.12,
        "end": 554.32,
        "text": "How you see yourself decides how you live your life. If you see yourself as weak, your actions become weak. If you",
        "textdich": ""
    },
    {
        "start": 551.92,
        "end": 562.48,
        "text": "see yourself as capable, your actions become powerful. If you believe in yourself, your future becomes bright.",
        "textdich": ""
    },
    {
        "start": 560.32,
        "end": 572.48,
        "text": "Let's understand how your inner attitude shapes your entire identity. One, you become what you believe about yourself.",
        "textdich": ""
    },
    {
        "start": 569.36,
        "end": 580.959,
        "text": "If you keep saying, \"I can't do this. I am not good enough. I am not smart, I always fail,\" your mind will start",
        "textdich": ""
    },
    {
        "start": 578.32,
        "end": 591.36,
        "text": "acting like it is true. But if you tell yourself I am improving, I can learn anything. I will become stronger. I have",
        "textdich": ""
    },
    {
        "start": 587.68,
        "end": 599.68,
        "text": "potential. Your mind rises. Your inner belief becomes your outer reality. Two, your self- attitude decides your",
        "textdich": ""
    },
    {
        "start": 597.04,
        "end": 605.92,
        "text": "confidence. Confidence is not built from compliments. Confidence is built from self-talk.",
        "textdich": ""
    },
    {
        "start": 603.76,
        "end": 615.68,
        "text": "If you speak to yourself with respect, your confidence grows. If you insult yourself in your mind, your confidence disappears.",
        "textdich": ""
    },
    {
        "start": 612.959,
        "end": 621.68,
        "text": "Your attitude must say, \"I believe in myself.",
        "textdich": ""
    },
    {
        "start": 617.2,
        "end": 628.399,
        "text": "I am capable. I deserve good things.\" Confidence comes from how you treat yourself internally.",
        "textdich": ""
    },
    {
        "start": 625.44,
        "end": 638.72,
        "text": "Three, stop judging yourself through other people's opinions. Many people lose their power because they think, \"What will they think of me? What if",
        "textdich": ""
    },
    {
        "start": 635.839,
        "end": 649.44,
        "text": "they don't like me? What if they judge me? But here is the truth. People's opinions are temporary. Your attitude toward yourself is permanent. Do not",
        "textdich": ""
    },
    {
        "start": 647.6,
        "end": 657.36,
        "text": "reduce your value just because someone cannot see it. Their vision does not define your worth. Four, treat yourself",
        "textdich": ""
    },
    {
        "start": 655.6,
        "end": 668.32,
        "text": "with the same respect you expect from others. You want people to respect you, value you, speak kindly, treat you well.",
        "textdich": ""
    },
    {
        "start": 665.92,
        "end": 672.24,
        "text": "Then start doing the same to yourself.",
        "textdich": ""
    },
    {
        "start": 668.32,
        "end": 674.88,
        "text": "Respect your limits. Value your dreams.",
        "textdich": ""
    },
    {
        "start": 672.24,
        "end": 684.72,
        "text": "Speak kindly to yourself. Give yourself time. Five. Your attitude determines your discipline. If you see yourself as",
        "textdich": ""
    },
    {
        "start": 681.519,
        "end": 695.92,
        "text": "strong, you act with discipline. If you see yourself as lazy, you behave like a lazy person. If you see yourself as capable, you take action.",
        "textdich": ""
    },
    {
        "start": 693.279,
        "end": 706.32,
        "text": "If you see yourself as helpless, you remain stuck. Discipline does not begin with action. Discipline begins with attitude.",
        "textdich": ""
    },
    {
        "start": 703.04,
        "end": 712.48,
        "text": "Six. A strong self attitude helps you overcome failure. Everyone fails.",
        "textdich": ""
    },
    {
        "start": 709.36,
        "end": 714.48,
        "text": "Everyone falls. Everyone makes mistakes.",
        "textdich": ""
    },
    {
        "start": 712.48,
        "end": 726.0,
        "text": "But some people rise again while others stay down. The difference? A strong inner attitude says this is not the end.",
        "textdich": ""
    },
    {
        "start": 721.36,
        "end": 733.519,
        "text": "I will try again. I will improve. I will not quit. Your attitude toward yourself gives you the power to rise after every",
        "textdich": ""
    },
    {
        "start": 730.32,
        "end": 745.839,
        "text": "fall. Seven, your attitude determines your worth in your own eyes. If you think I am not worthy, your actions follow that belief. But if you think I",
        "textdich": ""
    },
    {
        "start": 743.44,
        "end": 751.92,
        "text": "deserve success, you start working like someone who is worthy of success.",
        "textdich": ""
    },
    {
        "start": 748.639,
        "end": 757.68,
        "text": "If you think I deserve respect, you start setting boundaries.",
        "textdich": ""
    },
    {
        "start": 754.16,
        "end": 768.48,
        "text": "If you think I deserve happiness, you start choosing healthier things. Your attitude toward yourself decides the life you choose.",
        "textdich": ""
    },
    {
        "start": 764.959,
        "end": 777.6,
        "text": "Remember this, your biggest power is not outside you. Your biggest power is how you think about yourself. Change your",
        "textdich": ""
    },
    {
        "start": 774.8,
        "end": 781.6,
        "text": "self- attitude and your entire life will change.",
        "textdich": ""
    },
    {
        "start": 779.12,
        "end": 787.2,
        "text": "Lesson four. Your attitude towards challenges determines your strength.",
        "textdich": ""
    },
    {
        "start": 784.639,
        "end": 790.56,
        "text": "Life will always give you challenges.",
        "textdich": ""
    },
    {
        "start": 787.2,
        "end": 795.76,
        "text": "Life will always test you. Not to break you, but to build you.",
        "textdich": ""
    },
    {
        "start": 793.6,
        "end": 803.68,
        "text": "The difference between people who grow and people who give up is not intelligence, not talent, not luck.",
        "textdich": ""
    },
    {
        "start": 801.92,
        "end": 808.32,
        "text": "It is their attitude toward the challenges they face.",
        "textdich": ""
    },
    {
        "start": 806.079,
        "end": 817.92,
        "text": "Let's understand how your mindset toward difficulties shapes your strength, your growth, and your future. One, challenges",
        "textdich": ""
    },
    {
        "start": 815.36,
        "end": 827.44,
        "text": "are not stop signs. They are growth signs. Most people see challenges and say, \"Why me? This is too hard. I can't",
        "textdich": ""
    },
    {
        "start": 824.079,
        "end": 832.48,
        "text": "do this.\" A strong attitude says, \"This is my chance to grow.",
        "textdich": ""
    },
    {
        "start": 829.92,
        "end": 835.519,
        "text": "This will make me stronger.",
        "textdich": ""
    },
    {
        "start": 832.48,
        "end": 847.12,
        "text": "I will learn something from this. Every challenge carries a lesson. Every challenge makes you wiser. Challenges don't come to stop you. They come to",
        "textdich": ""
    },
    {
        "start": 843.36,
        "end": 852.0,
        "text": "prepare you. Two, a powerful attitude helps you stay calm under pressure.",
        "textdich": ""
    },
    {
        "start": 849.519,
        "end": 864.639,
        "text": "Pressure shows your true strength. When life gets difficult, a weak attitude becomes stressed, angry, scared, confused, hopeless. But a strong",
        "textdich": ""
    },
    {
        "start": 861.04,
        "end": 873.12,
        "text": "attitude stays. Calm, focused, patient, steady, committed. This is emotional intelligence. This is mental toughness.",
        "textdich": ""
    },
    {
        "start": 870.48,
        "end": 876.399,
        "text": "This is the power of attitude.",
        "textdich": ""
    },
    {
        "start": 873.12,
        "end": 886.88,
        "text": "Three, challenges are temporary. Your growth is permanent. The problems you face today will not last forever. But the strength you gain from overcoming",
        "textdich": ""
    },
    {
        "start": 883.92,
        "end": 894.16,
        "text": "them will stay with you forever. A strong attitude remembers. Storms pass.",
        "textdich": ""
    },
    {
        "start": 890.399,
        "end": 904.56,
        "text": "Pain heals. Time changes things. Effort pays off. Growth continues. Your situation is temporary. Your progress is permanent.",
        "textdich": ""
    },
    {
        "start": 901.68,
        "end": 914.0,
        "text": "Four. Your attitude turns setbacks into comebacks. Every time you fail, you have two choices. Give up or come back",
        "textdich": ""
    },
    {
        "start": 910.48,
        "end": 925.12,
        "text": "stronger. A weak attitude gives up. A strong attitude rebuilds. A powerful attitude says, \"This is not the end.",
        "textdich": ""
    },
    {
        "start": 922.56,
        "end": 929.12,
        "text": "I will rise again.",
        "textdich": ""
    },
    {
        "start": 925.12,
        "end": 937.36,
        "text": "I will not quit on myself.\" Success is not about never falling.",
        "textdich": ""
    },
    {
        "start": 932.959,
        "end": 939.839,
        "text": "Success is about always rising. Five.",
        "textdich": ""
    },
    {
        "start": 937.36,
        "end": 949.92,
        "text": "How you speak during challenges shows your character during hard times. Listen to your own words. Do you say I can't do",
        "textdich": ""
    },
    {
        "start": 946.24,
        "end": 961.759,
        "text": "this? Life is unfair. Why is this happening? Or do you say I will find a way? I am stronger than this. I will grow through this. Your words create",
        "textdich": ""
    },
    {
        "start": 959.279,
        "end": 971.839,
        "text": "your attitude. Your attitude creates your strength. Speak with courage. Speak with belief. Speak with hope. Six.",
        "textdich": ""
    },
    {
        "start": 969.759,
        "end": 977.6,
        "text": "Challenges build qualities that comfort never can. Comfort gives you rest.",
        "textdich": ""
    },
    {
        "start": 975.279,
        "end": 989.199,
        "text": "Challenges give you strength. Because through challenges you learn. Patience, resilience, discipline, persistence, courage, self-control, faith,",
        "textdich": ""
    },
    {
        "start": 986.16,
        "end": 990.88,
        "text": "creativity, emotional balance.",
        "textdich": ""
    },
    {
        "start": 989.199,
        "end": 996.72,
        "text": "These qualities make your future powerful. Comfort never grows you.",
        "textdich": ""
    },
    {
        "start": 994.639,
        "end": 1000.32,
        "text": "Challenges do.",
        "textdich": ""
    },
    {
        "start": 996.72,
        "end": 1008.079,
        "text": "Seven. A strong attitude helps you trust the journey. You may not understand everything right now. You may not see",
        "textdich": ""
    },
    {
        "start": 1005.44,
        "end": 1017.6,
        "text": "the result immediately. You may not know why this challenge came. But a strong attitude says, \"I trust the process.\"",
        "textdich": ""
    },
    {
        "start": 1015.04,
        "end": 1026.16,
        "text": "Because even when life feels confusing, your growth is happening, your character is building, your future is preparing,",
        "textdich": ""
    },
    {
        "start": 1023.12,
        "end": 1035.36,
        "text": "trust the journey. Your attitude will carry you to the other side. Remember this, challenges are not there to break you.",
        "textdich": ""
    },
    {
        "start": 1033.439,
        "end": 1045.199,
        "text": "They are there to build the strongest version of you. Your attitude decides whether you fall or you rise. Choose an",
        "textdich": ""
    },
    {
        "start": 1041.919,
        "end": 1048.799,
        "text": "attitude that makes you unstoppable.",
        "textdich": ""
    },
    {
        "start": 1045.199,
        "end": 1053.76,
        "text": "Lesson five. Your attitude towards time shapes your success.",
        "textdich": ""
    },
    {
        "start": 1051.2,
        "end": 1058.88,
        "text": "Time is one of the most powerful forces in life.",
        "textdich": ""
    },
    {
        "start": 1055.6,
        "end": 1066.08,
        "text": "Everyone gets the same 24 hours, but the difference between failure and success comes from how we use those hours. Your",
        "textdich": ""
    },
    {
        "start": 1064.32,
        "end": 1074.64,
        "text": "attitude towards time shows your discipline, your respect, and your seriousness about your goals in your life. Let's understand how attitude",
        "textdich": ""
    },
    {
        "start": 1072.799,
        "end": 1088.08,
        "text": "affects time. and how time in return shapes your future. One, a strong attitude values every minute. People with a weak",
        "textdich": ""
    },
    {
        "start": 1084.88,
        "end": 1100.4,
        "text": "attitude say, \"I'll do it later. I have time. It's not urgent. I'll start tomorrow.\" People with a powerful attitude say, \"I'll do it now.\" Every",
        "textdich": ""
    },
    {
        "start": 1096.88,
        "end": 1103.52,
        "text": "minute matters. Small steps every day.",
        "textdich": ""
    },
    {
        "start": 1100.4,
        "end": 1105.52,
        "text": "My future depends on what I do today.",
        "textdich": ""
    },
    {
        "start": 1103.52,
        "end": 1116.88,
        "text": "Your attitude decides whether you use time or waste it. Two, time will never come back. But efforts will come back as",
        "textdich": ""
    },
    {
        "start": 1113.28,
        "end": 1129.2,
        "text": "success. Once a day is gone, it never returns. But the effort you put today will return in the form of success, confidence, strength, growth,",
        "textdich": ""
    },
    {
        "start": 1125.919,
        "end": 1131.2,
        "text": "improvement, better opportunities.",
        "textdich": ""
    },
    {
        "start": 1129.2,
        "end": 1141.039,
        "text": "Most people don't respect time because they don't see immediate results. A strong attitude understands that time is",
        "textdich": ""
    },
    {
        "start": 1136.32,
        "end": 1152.24,
        "text": "an investment, not a cost. Three, your attitude towards time shows your priorities. Ask yourself, where does your time go? scrolling, gossip,",
        "textdich": ""
    },
    {
        "start": 1149.36,
        "end": 1164.32,
        "text": "comparison, overthinking, distraction, useless talks, or does it go into learning, improving, building skills, working on goals, reading, self-care,",
        "textdich": ""
    },
    {
        "start": 1162.48,
        "end": 1167.2,
        "text": "discipline?",
        "textdich": ""
    },
    {
        "start": 1164.32,
        "end": 1178.64,
        "text": "Your time shows your attitude, and your attitude shows your future. Four, a disciplined attitude creates a disciplined life. People think",
        "textdich": ""
    },
    {
        "start": 1175.039,
        "end": 1184.0,
        "text": "discipline is about motivation. It's not discipline is an attitude.",
        "textdich": ""
    },
    {
        "start": 1180.96,
        "end": 1196.559,
        "text": "A disciplined attitude says, \"I will do what I must even when I don't feel like it. I choose consistency over comfort. I value progress over excuses.\"",
        "textdich": ""
    },
    {
        "start": 1193.919,
        "end": 1199.6,
        "text": "This attitude makes you unstoppable.",
        "textdich": ""
    },
    {
        "start": 1196.559,
        "end": 1208.0,
        "text": "Even on bad days, you move forward. Even when you feel tired, you take one more small step. Even when motivation",
        "textdich": ""
    },
    {
        "start": 1204.64,
        "end": 1210.559,
        "text": "disappears, your discipline carries you.",
        "textdich": ""
    },
    {
        "start": 1208.0,
        "end": 1222.72,
        "text": "Five, your attitude determines how you handle delays and setbacks. Success takes time. But many people quit because results didn't come fast. Life got",
        "textdich": ""
    },
    {
        "start": 1219.6,
        "end": 1232.88,
        "text": "difficult. Progress was slow. Others were ahead. A weak attitude says, \"Why is this taking so long?\" A strong attitude says, \"Good things take time. I",
        "textdich": ""
    },
    {
        "start": 1231.28,
        "end": 1246.72,
        "text": "will keep going.\" Patience is a mindset. Consistency is an attitude. Commitment is a choice. If you respect time, time will reward you. Six.",
        "textdich": ""
    },
    {
        "start": 1243.28,
        "end": 1257.44,
        "text": "Small daily efforts build. Big long-term success. You don't need to do big things. You just need to do small things consistently.",
        "textdich": ""
    },
    {
        "start": 1253.039,
        "end": 1270.64,
        "text": "One page a day, 365 pages a year, 10 minutes daily practice. Expert in months, one new word daily, 365 new words. 20 minutes learning, new skill.",
        "textdich": ""
    },
    {
        "start": 1268.72,
        "end": 1280.0,
        "text": "Small daily discipline, massive transformation. A strong attitude understands the power of daily effort.",
        "textdich": ""
    },
    {
        "start": 1275.84,
        "end": 1282.88,
        "text": "Small steps create big results. Seven.",
        "textdich": ""
    },
    {
        "start": 1280.0,
        "end": 1284.799,
        "text": "Time respects those who respect it.",
        "textdich": ""
    },
    {
        "start": 1282.88,
        "end": 1293.44,
        "text": "Life gives more time to people who use their current time wisely. If you waste time, you lose opportunities. If you use",
        "textdich": ""
    },
    {
        "start": 1291.039,
        "end": 1300.4,
        "text": "time well, new opportunities come to you. Success, growth, confidence, clarity.",
        "textdich": ""
    },
    {
        "start": 1298.4,
        "end": 1312.799,
        "text": "All these things grow when your attitude values time. Remember this, your attitude towards time decides your future. If you value your time, your",
        "textdich": ""
    },
    {
        "start": 1309.52,
        "end": 1320.24,
        "text": "time will value you back. Small daily efforts plus strong attitude equals unstoppable success.",
        "textdich": ""
    },
    {
        "start": 1317.36,
        "end": 1325.12,
        "text": "Lesson six, build an unshakable attitude.",
        "textdich": ""
    },
    {
        "start": 1321.84,
        "end": 1327.2,
        "text": "The attitude that changes your life.",
        "textdich": ""
    },
    {
        "start": 1325.12,
        "end": 1336.64,
        "text": "This final lesson is about creating an attitude so strong that no problem, no person, no situation can break your",
        "textdich": ""
    },
    {
        "start": 1333.12,
        "end": 1346.32,
        "text": "spirit or your direction. An unshakable attitude is not loud, not aggressive, not arrogant.",
        "textdich": ""
    },
    {
        "start": 1341.36,
        "end": 1354.0,
        "text": "It is calm, clear, strong, steady. It is the attitude of someone who knows who they are and where they are going. Let's",
        "textdich": ""
    },
    {
        "start": 1352.08,
        "end": 1364.64,
        "text": "understand how to build this unshakable mindset. One, believe in yourself even when no one else does. People may doubt",
        "textdich": ""
    },
    {
        "start": 1361.44,
        "end": 1375.919,
        "text": "you. People may question you. People may not understand your dreams. But your attitude must say, \"I trust myself. I know my potential. I will prove it",
        "textdich": ""
    },
    {
        "start": 1373.2,
        "end": 1382.96,
        "text": "through my actions. When you believe in yourself from the inside, the world cannot stop you on the outside.",
        "textdich": ""
    },
    {
        "start": 1380.799,
        "end": 1391.52,
        "text": "Self-belief is the root of every success story. Two, stay calm in difficult situations.",
        "textdich": ""
    },
    {
        "start": 1389.2,
        "end": 1394.88,
        "text": "Calmness is power.",
        "textdich": ""
    },
    {
        "start": 1391.52,
        "end": 1407.12,
        "text": "Anyone can stay calm when life is easy, but successful people stay calm when life becomes hard. Calmness shows maturity, intelligence, emotional",
        "textdich": ""
    },
    {
        "start": 1403.44,
        "end": 1414.4,
        "text": "strength, self-control, confidence. Your attitude becomes unshakable when you respond with calm instead of anger. A",
        "textdich": ""
    },
    {
        "start": 1412.32,
        "end": 1421.44,
        "text": "calm mind can solve problems that an angry mind cannot even understand.",
        "textdich": ""
    },
    {
        "start": 1417.6,
        "end": 1424.4,
        "text": "Three, don't take everything personally.",
        "textdich": ""
    },
    {
        "start": 1421.44,
        "end": 1426.799,
        "text": "Free yourself mentally.",
        "textdich": ""
    },
    {
        "start": 1424.4,
        "end": 1438.72,
        "text": "Most of your stress comes from overthinking people's words, worrying about opinions, taking comments personally, reacting emotionally,",
        "textdich": ""
    },
    {
        "start": 1435.52,
        "end": 1450.0,
        "text": "feeling attacked. But the truth is people speak from their mindset, not your worth. Your attitude must say their opinion is not my identity. I do not",
        "textdich": ""
    },
    {
        "start": 1447.44,
        "end": 1455.84,
        "text": "need to react to everything. I choose peace over drama. Let go. Stay light.",
        "textdich": ""
    },
    {
        "start": 1454.0,
        "end": 1458.88,
        "text": "Stay focused.",
        "textdich": ""
    },
    {
        "start": 1455.84,
        "end": 1467.76,
        "text": "Four. Keep moving forward no matter how slow. Progress is never in a straight line. Some days you move fast, some days",
        "textdich": ""
    },
    {
        "start": 1464.799,
        "end": 1471.2,
        "text": "slow, some days you don't move at all.",
        "textdich": ""
    },
    {
        "start": 1467.76,
        "end": 1482.799,
        "text": "But what matters is you don't stop. Your attitude must say even slow progress is progress. I will not give up. I will rise again. Consistency builds an",
        "textdich": ""
    },
    {
        "start": 1480.799,
        "end": 1485.279,
        "text": "unshakable mind.",
        "textdich": ""
    },
    {
        "start": 1482.799,
        "end": 1496.96,
        "text": "Five. Learn to see the good in every situation. Life is not perfect, but your attitude decides what you focus on. A strong attitude finds lessons in",
        "textdich": ""
    },
    {
        "start": 1493.679,
        "end": 1508.799,
        "text": "mistakes, power in pain, hope in difficulty, opportunities in change, strength in failure. This is how winners think. They see what others ignore. When",
        "textdich": ""
    },
    {
        "start": 1505.84,
        "end": 1512.48,
        "text": "you look for the good, the good grows.",
        "textdich": ""
    },
    {
        "start": 1508.799,
        "end": 1518.24,
        "text": "Six. Protect your peace. like it is your treasure. Your peace is your strength.",
        "textdich": ""
    },
    {
        "start": 1515.6,
        "end": 1526.4,
        "text": "Your peace is your clarity. Your peace is your power. Do not let anyone disturb your mind, drain your energy, bring",
        "textdich": ""
    },
    {
        "start": 1523.76,
        "end": 1536.799,
        "text": "negativity, shake your focus, control your emotions. Your attitude must say, \"My peace matters. My mind is my responsibility.",
        "textdich": ""
    },
    {
        "start": 1534.4,
        "end": 1543.52,
        "text": "I choose positivity.\" Peace makes your attitude unbreakable.",
        "textdich": ""
    },
    {
        "start": 1539.76,
        "end": 1548.559,
        "text": "Seven, be grateful. Gratitude builds a strong heart and strong attitude.",
        "textdich": ""
    },
    {
        "start": 1545.76,
        "end": 1558.88,
        "text": "Gratitude changes everything. When you focus on what you have, what you learned, how far you've come, the opportunities you received, the strength",
        "textdich": ""
    },
    {
        "start": 1556.24,
        "end": 1565.52,
        "text": "you gained, your mindset becomes powerful. Gratitude removes fear.",
        "textdich": ""
    },
    {
        "start": 1562.4,
        "end": 1574.96,
        "text": "Gratitude removes comparison. Gratitude removes negativity. A grateful heart builds an unshakable attitude. Remember",
        "textdich": ""
    },
    {
        "start": 1571.919,
        "end": 1585.12,
        "text": "this final truth. Your attitude is the foundation of your entire life. Build it strong. Protect it. Feed it with belief,",
        "textdich": ""
    },
    {
        "start": 1581.919,
        "end": 1587.44,
        "text": "calmness, discipline, and gratitude.",
        "textdich": ""
    },
    {
        "start": 1585.12,
        "end": 1593.84,
        "text": "With the right attitude, nothing can stop you. Not even your own doubts.",
        "textdich": ""
    },
    {
        "start": 1591.12,
        "end": 1603.279,
        "text": "Remember this. Your attitude shapes your future, not your past, not your mistakes, not your circumstances. If you",
        "textdich": ""
    },
    {
        "start": 1600.72,
        "end": 1613.84,
        "text": "build a strong attitude today, your life will transform tomorrow. Stay focused, stay disciplined, stay calm, and stay",
        "textdich": ""
    },
    {
        "start": 1610.72,
        "end": 1619.679,
        "text": "committed to your growth. If this video inspired you, stay connected with us.",
        "textdich": ""
    },
    {
        "start": 1617.36,
        "end": 1631.679,
        "text": "And if you haven't subscribed yet, this is the right moment. Subscribe now and join our journey of daily motivation and powerful self-growth.",
        "textdich": ""
    },
    {
        "start": 1628.08,
        "end": 1638.279,
        "text": "Your attitude is your superpower.",
        "textdich": ""
    },
    {
        "start": 1631.679,
        "end": 1638.279,
        "text": "Use it, protect it, and rise with it.",
        "textdich": ""
    }
]