[
    {
        "start": 0.0,
        "end": 12.08,
        "text": "[Music] Hello everyone.",
        "textdich": ""
    },
    {
        "start": 8.72,
        "end": 16.08,
        "text": "Welcome to English Insights.",
        "textdich": ""
    },
    {
        "start": 12.08,
        "end": 27.519,
        "text": "Today we will explore the story of the Kennedy family, one of the most powerful families in American history.",
        "textdich": ""
    },
    {
        "start": 23.76,
        "end": 34.96,
        "text": "They were rich, successful, and often called America's royal family.",
        "textdich": ""
    },
    {
        "start": 31.519,
        "end": 48.48,
        "text": "But behind the fame came sadness, accidents, and many shocking deaths. So, people began to call it the Kennedy family curse.",
        "textdich": ""
    },
    {
        "start": 44.48,
        "end": 51.84,
        "text": "Why did so many Kennedys face tragedy?",
        "textdich": ""
    },
    {
        "start": 48.48,
        "end": 56.48,
        "text": "Was it just bad luck or something more mysterious?",
        "textdich": ""
    },
    {
        "start": 53.76,
        "end": 67.119,
        "text": "These questions have fascinated people for decades. In this video, we will learn about their rise, their successes,",
        "textdich": ""
    },
    {
        "start": 64.479,
        "end": 71.84,
        "text": "and the painful events that shaped their legacy.",
        "textdich": ""
    },
    {
        "start": 68.799,
        "end": 82.56,
        "text": "This is also a great chance to improve your English listening skills while discovering an unforgettable story.",
        "textdich": ""
    },
    {
        "start": 79.2,
        "end": 87.759,
        "text": "Part one, the rise of the Kennedy family.",
        "textdich": ""
    },
    {
        "start": 84.24,
        "end": 103.36,
        "text": "The story of the Kennedy family begins with Joseph P. Kennedy, the father. He was born in 1888 to an Irishamean family in Boston.",
        "textdich": ""
    },
    {
        "start": 99.6,
        "end": 110.399,
        "text": "At that time, Irish immigrants often face discrimination.",
        "textdich": ""
    },
    {
        "start": 106.159,
        "end": 116.0,
        "text": "But Joseph Kennedy was smart, ambitious, and determined to succeed.",
        "textdich": ""
    },
    {
        "start": 113.28,
        "end": 127.68,
        "text": "Joseph studied hard, went to Harvard University, and soon began a career in banking and business.",
        "textdich": ""
    },
    {
        "start": 124.079,
        "end": 137.84,
        "text": "He made money in many industries, the stock market, movies, real estate, and alcohol after prohibition.",
        "textdich": ""
    },
    {
        "start": 135.28,
        "end": 146.48,
        "text": "By the 1930s, he was one of the richest men in America.",
        "textdich": ""
    },
    {
        "start": 142.0,
        "end": 152.72,
        "text": "Joseph was not only rich, he also wanted power.",
        "textdich": ""
    },
    {
        "start": 148.16,
        "end": 160.959,
        "text": "He entered politics and served as the US ambassador to Britain before World War II.",
        "textdich": ""
    },
    {
        "start": 157.599,
        "end": 168.8,
        "text": "Even after he left that position, he kept his focus on politics.",
        "textdich": ""
    },
    {
        "start": 164.72,
        "end": 177.04,
        "text": "He had a dream. one of his sons would become president of the United States.",
        "textdich": ""
    },
    {
        "start": 172.72,
        "end": 185.68,
        "text": "The Kennedy family grew up with wealth, education, and strong expectations.",
        "textdich": ""
    },
    {
        "start": 182.08,
        "end": 189.44,
        "text": "Joseph and his wife Rose had nine children.",
        "textdich": ""
    },
    {
        "start": 187.2,
        "end": 194.879,
        "text": "They were raised in a strict but supportive home.",
        "textdich": ""
    },
    {
        "start": 191.76,
        "end": 203.68,
        "text": "The children were taught to work hard, to compete, and to aim for success.",
        "textdich": ""
    },
    {
        "start": 199.68,
        "end": 210.08,
        "text": "Sports, religion, and education played a big part in their lives.",
        "textdich": ""
    },
    {
        "start": 206.72,
        "end": 217.44,
        "text": "The Kennedy sons were sent to the best schools and were trained for leadership.",
        "textdich": ""
    },
    {
        "start": 214.4,
        "end": 226.799,
        "text": "The daughters also received a good education which was unusual for women at that time.",
        "textdich": ""
    },
    {
        "start": 223.68,
        "end": 243.84,
        "text": "From the outside, the family looked perfect, rich, attractive, and full of promise. By the 1940s, the Kennedys had become known across the country.",
        "textdich": ""
    },
    {
        "start": 240.239,
        "end": 252.879,
        "text": "Newspapers often showed pictures of the smiling family sailing, playing football, or attending church.",
        "textdich": ""
    },
    {
        "start": 250.48,
        "end": 266.16,
        "text": "They represented the idea of the American dream. A family that had risen from immigrant roots to wealth and influence.",
        "textdich": ""
    },
    {
        "start": 262.16,
        "end": 269.44,
        "text": "But with power came high expectations.",
        "textdich": ""
    },
    {
        "start": 266.16,
        "end": 274.8,
        "text": "Joseph Kennedy pushed his children to achieve greatness.",
        "textdich": ""
    },
    {
        "start": 271.52,
        "end": 280.08,
        "text": "He told them that failure was not an option.",
        "textdich": ""
    },
    {
        "start": 276.639,
        "end": 288.8,
        "text": "For the Kennedy family, success was not just personal. It was part of their duty to the nation.",
        "textdich": ""
    },
    {
        "start": 286.0,
        "end": 304.08,
        "text": "The rise of the Kennedys seemed like a fairy tale. But soon tragedy would begin to strike and the idea of a curse would take shape.",
        "textdich": ""
    },
    {
        "start": 299.6,
        "end": 306.72,
        "text": "Part two, the first tragedies.",
        "textdich": ""
    },
    {
        "start": 304.08,
        "end": 315.12,
        "text": "Even as the Kennedy family rose to wealth and power, shadows began to fall.",
        "textdich": ""
    },
    {
        "start": 311.759,
        "end": 324.479,
        "text": "The first tragedies struck not long after Joseph Kennedy had built his dream of a powerful dynasty.",
        "textdich": ""
    },
    {
        "start": 321.12,
        "end": 331.6,
        "text": "One of the most painful stories was that of Rosemary Kennedy, the eldest daughter.",
        "textdich": ""
    },
    {
        "start": 329.199,
        "end": 336.16,
        "text": "Rosemary was different from her brothers and sisters.",
        "textdich": ""
    },
    {
        "start": 333.52,
        "end": 341.68,
        "text": "She had learning difficulties and struggled in school.",
        "textdich": ""
    },
    {
        "start": 339.199,
        "end": 353.84,
        "text": "In the 1940s, people did not understand such conditions well and families often felt ashamed.",
        "textdich": ""
    },
    {
        "start": 350.0,
        "end": 365.6,
        "text": "Joseph Kennedy wanted Rosemary to live a normal life, but he also worried that her behavior might hurt the family's public image.",
        "textdich": ""
    },
    {
        "start": 363.12,
        "end": 378.24,
        "text": "In 1941, without telling the rest of the family, Joseph approved a new medical procedure called a labbotomy.",
        "textdich": ""
    },
    {
        "start": 375.039,
        "end": 393.12,
        "text": "Doctors believed it could calm people with mental or emotional problems, but the operation was experimental and very risky.",
        "textdich": ""
    },
    {
        "start": 388.319,
        "end": 402.0,
        "text": "Sadly, it went terribly wrong. Rosemary was left unable to speak clearly or live independently.",
        "textdich": ""
    },
    {
        "start": 399.68,
        "end": 408.8,
        "text": "She spent the rest of her life in institutions away from the public.",
        "textdich": ""
    },
    {
        "start": 406.8,
        "end": 421.039,
        "text": "For the Kennedes, this was a secret pain and many later called it the first curse of the family.",
        "textdich": ""
    },
    {
        "start": 418.0,
        "end": 426.479,
        "text": "Another tragedy came during World War II.",
        "textdich": ""
    },
    {
        "start": 422.72,
        "end": 430.56,
        "text": "Joseph Kennedy's eldest son, Joseph P.",
        "textdich": ""
    },
    {
        "start": 426.479,
        "end": 435.84,
        "text": "Kennedy Jr., was a bright and brave young man.",
        "textdich": ""
    },
    {
        "start": 432.72,
        "end": 442.88,
        "text": "He was seen as the one who would fulfill his father's dream of a Kennedy presidency.",
        "textdich": ""
    },
    {
        "start": 440.72,
        "end": 457.919,
        "text": "In 1944, while serving as a Navy pilot, Joe Jr. volunteered for a dangerous mission in Europe. His plane loaded with explosives",
        "textdich": ""
    },
    {
        "start": 455.28,
        "end": 466.0,
        "text": "exploded in the air before reaching its target. He was killed instantly.",
        "textdich": ""
    },
    {
        "start": 462.0,
        "end": 473.599,
        "text": "He was only 29 years old. The death of Joe Jr. was a huge blow to the family.",
        "textdich": ""
    },
    {
        "start": 470.4,
        "end": 481.039,
        "text": "Joseph Kennedy had always expected his eldest son to become president one day.",
        "textdich": ""
    },
    {
        "start": 477.68,
        "end": 484.0,
        "text": "Now that dream was gone.",
        "textdich": ""
    },
    {
        "start": 481.039,
        "end": 497.44,
        "text": "The responsibility shifted to his second son, John F. Kennedy, who would later carry the hopes of the entire family.",
        "textdich": ""
    },
    {
        "start": 493.36,
        "end": 504.56,
        "text": "The tragedies of Rosemary and Joe Jr. were deeply painful.",
        "textdich": ""
    },
    {
        "start": 500.16,
        "end": 513.919,
        "text": "They showed that even a family as rich and powerful as the Kennedys could not escape suffering.",
        "textdich": ""
    },
    {
        "start": 510.479,
        "end": 526.16,
        "text": "To the outside world, the Kennedys still looked glamorous and successful, but inside they carried scars of loss and sorrow.",
        "textdich": ""
    },
    {
        "start": 523.68,
        "end": 536.08,
        "text": "These early tragedies set the stage for what people would later call the Kennedy family curse.",
        "textdich": ""
    },
    {
        "start": 533.36,
        "end": 550.32,
        "text": "They were only the beginning of a long series of accidents, deaths, and heartbreaks that would follow the family through the decades.",
        "textdich": ""
    },
    {
        "start": 546.32,
        "end": 556.48,
        "text": "Part three, John F. Kennedy and the presidency.",
        "textdich": ""
    },
    {
        "start": 553.12,
        "end": 570.0,
        "text": "After the death of Joseph Kennedy Jr., the family's hopes turned to the second son, John Fitzgerald Kennedy, often called JFK.",
        "textdich": ""
    },
    {
        "start": 565.92,
        "end": 573.279,
        "text": "He was smart, charming, and handsome.",
        "textdich": ""
    },
    {
        "start": 570.0,
        "end": 586.0,
        "text": "Though he suffered from health problems, including chronic back pain, he showed courage and determination.",
        "textdich": ""
    },
    {
        "start": 580.64,
        "end": 597.279,
        "text": "JFK entered politics after World War II, first as a congressman and then as a senator from Massachusetts.",
        "textdich": ""
    },
    {
        "start": 593.279,
        "end": 601.12,
        "text": "He quickly became popular with voters.",
        "textdich": ""
    },
    {
        "start": 597.279,
        "end": 608.16,
        "text": "People liked his energy, his speeches, and his vision for America.",
        "textdich": ""
    },
    {
        "start": 603.92,
        "end": 613.12,
        "text": "In 1960, he ran for president against Richard Nixon.",
        "textdich": ""
    },
    {
        "start": 610.16,
        "end": 629.92,
        "text": "The campaign was hard fought, but Kennedy won, becoming the youngest elected president in US history at only 43 years old. The Kennedy presidency",
        "textdich": ""
    },
    {
        "start": 624.959,
        "end": 632.32,
        "text": "soon became known as the Camelot era.",
        "textdich": ""
    },
    {
        "start": 629.92,
        "end": 640.399,
        "text": "This was a reference to the legendary kingdom of King Arthur, full of hope and romance.",
        "textdich": ""
    },
    {
        "start": 637.6,
        "end": 652.16,
        "text": "With his elegant wife, Jacquellyn Kennedy and their young children, JFK brought a new image to the White House.",
        "textdich": ""
    },
    {
        "start": 648.56,
        "end": 667.76,
        "text": "The Kennedes looked like America's royal family, stylish, modern, and full of promise. JFK faced serious challenges as president.",
        "textdich": ""
    },
    {
        "start": 664.079,
        "end": 675.76,
        "text": "He dealt with the Cuban missile crisis which brought the world close to nuclear war.",
        "textdich": ""
    },
    {
        "start": 672.079,
        "end": 686.8,
        "text": "He also spoke about civil rights calling for equality for black Americans. His speeches inspired millions with phrases",
        "textdich": ""
    },
    {
        "start": 683.279,
        "end": 703.279,
        "text": "like, \"Ask not what your country can do for you. Ask what you can do for your country.\" But this bright era ended in tragedy. On November 22nd, 1963,",
        "textdich": ""
    },
    {
        "start": 700.64,
        "end": 710.88,
        "text": "President Kennedy was riding in a motorcade in Dallas, Texas.",
        "textdich": ""
    },
    {
        "start": 707.36,
        "end": 715.2,
        "text": "Crowds lined the streets to see him.",
        "textdich": ""
    },
    {
        "start": 710.88,
        "end": 730.32,
        "text": "Suddenly, gunshots rang out. JFK was struck and fatally wounded. He was only 46 years old. The assassination shocked the entire world. People cried",
        "textdich": ""
    },
    {
        "start": 726.959,
        "end": 736.56,
        "text": "in the streets. Television showed the sadness of a nation in mourning.",
        "textdich": ""
    },
    {
        "start": 733.519,
        "end": 750.24,
        "text": "Leaders across the globe paid tribute to Kennedy as a symbol of hope and youth for the Kennedy family. The pain was unbearable.",
        "textdich": ""
    },
    {
        "start": 745.839,
        "end": 763.04,
        "text": "Jquelyn Kennedy, now a widow, became an icon of strength as she stood beside her husband's coffin. Their young children, John Jr.",
        "textdich": ""
    },
    {
        "start": 759.36,
        "end": 771.6,
        "text": "and Carolene saluted their father at the funeral. A heartbreaking image remembered forever.",
        "textdich": ""
    },
    {
        "start": 768.24,
        "end": 780.0,
        "text": "The death of John F. Kennedy added another layer to the idea of a Kennedy curse.",
        "textdich": ""
    },
    {
        "start": 776.639,
        "end": 794.88,
        "text": "Here was a family that had reached the very top of American power only to be struck down in the most public and tragic way possible.",
        "textdich": ""
    },
    {
        "start": 789.92,
        "end": 804.399,
        "text": "Even today, the assassination of JFK remains one of the most shocking events in US history.",
        "textdich": ""
    },
    {
        "start": 800.959,
        "end": 811.6,
        "text": "It was not just the loss of a president, but also the end of America's Camelot.",
        "textdich": ""
    },
    {
        "start": 808.72,
        "end": 819.04,
        "text": "The hope that surrounded the Kennedys was forever touched by sadness.",
        "textdich": ""
    },
    {
        "start": 815.519,
        "end": 824.56,
        "text": "Part four. Robert Kennedy and more loss.",
        "textdich": ""
    },
    {
        "start": 821.279,
        "end": 838.72,
        "text": "After John F. Kennedy's assassination in 1963, the family turned to another son, Robert F. Kennedy, often called Bobby.",
        "textdich": ""
    },
    {
        "start": 835.2,
        "end": 844.88,
        "text": "He was strong, intelligent, and deeply loyal to his family.",
        "textdich": ""
    },
    {
        "start": 841.519,
        "end": 853.68,
        "text": "Like his brother, he had a passion for politics and a belief in public service.",
        "textdich": ""
    },
    {
        "start": 850.16,
        "end": 863.92,
        "text": "Robert first gained national attention as the attorney general in his brother's government. He fought against organized",
        "textdich": ""
    },
    {
        "start": 859.839,
        "end": 867.68,
        "text": "crime and supported civil rights.",
        "textdich": ""
    },
    {
        "start": 863.92,
        "end": 874.88,
        "text": "Many Americans admired his courage and his sense of justice.",
        "textdich": ""
    },
    {
        "start": 870.48,
        "end": 883.44,
        "text": "After JFK's death, Bobby became a symbol of hope for those who still believed in the Kennedy dream.",
        "textdich": ""
    },
    {
        "start": 880.88,
        "end": 892.079,
        "text": "In 1964, Robert was elected as a senator from New York.",
        "textdich": ""
    },
    {
        "start": 888.48,
        "end": 901.04,
        "text": "Over the next few years, he became one of the most popular politicians in the country.",
        "textdich": ""
    },
    {
        "start": 897.519,
        "end": 907.6,
        "text": "He spoke out against poverty, racism, and the Vietnam War.",
        "textdich": ""
    },
    {
        "start": 904.079,
        "end": 914.8,
        "text": "Crowds followed him everywhere, cheering his speeches and shaking his hand.",
        "textdich": ""
    },
    {
        "start": 911.76,
        "end": 921.12,
        "text": "To many, he looked like the natural successor to his brother.",
        "textdich": ""
    },
    {
        "start": 918.399,
        "end": 934.959,
        "text": "By 1968, Robert Kennedy decided to run for president. His campaign was full of energy. Young people, minorities, and",
        "textdich": ""
    },
    {
        "start": 931.6,
        "end": 941.6,
        "text": "workingclass voters supported him with great enthusiasm.",
        "textdich": ""
    },
    {
        "start": 938.079,
        "end": 948.24,
        "text": "He promised unity, peace, and a better future for America.",
        "textdich": ""
    },
    {
        "start": 944.24,
        "end": 954.959,
        "text": "For a moment, it seemed that the Kennedy dream might rise again.",
        "textdich": ""
    },
    {
        "start": 951.199,
        "end": 968.16,
        "text": "But then, tragedy struck once more. On the night of June 5th, 1968, after winning the California Democratic primary, Robert Kennedy gave a victory",
        "textdich": ""
    },
    {
        "start": 965.199,
        "end": 971.36,
        "text": "speech in Los Angeles.",
        "textdich": ""
    },
    {
        "start": 968.16,
        "end": 977.199,
        "text": "As he walked through a hotel kitchen, a gunman opened fire.",
        "textdich": ""
    },
    {
        "start": 974.0,
        "end": 981.519,
        "text": "Robert was shot several times.",
        "textdich": ""
    },
    {
        "start": 977.199,
        "end": 988.56,
        "text": "The next day, he died in the hospital at only 42 years old.",
        "textdich": ""
    },
    {
        "start": 985.04,
        "end": 992.48,
        "text": "The news devastated the nation.",
        "textdich": ""
    },
    {
        "start": 988.56,
        "end": 1002.24,
        "text": "Once again, Americans watched in shock as another Kennedy was taken by violence.",
        "textdich": ""
    },
    {
        "start": 997.759,
        "end": 1014.399,
        "text": "The image of Robert's wife, Ethel, standing by his hospital bed with their children waiting at home was heartbreaking.",
        "textdich": ""
    },
    {
        "start": 1010.88,
        "end": 1021.519,
        "text": "Just as with John F. Kennedy. The funeral was broadcast worldwide.",
        "textdich": ""
    },
    {
        "start": 1018.56,
        "end": 1028.64,
        "text": "Millions mourned the loss of a leader who had promised hope and change.",
        "textdich": ""
    },
    {
        "start": 1026.079,
        "end": 1035.039,
        "text": "For the Kennedy family, it was almost unbearable.",
        "textdich": ""
    },
    {
        "start": 1032.079,
        "end": 1044.959,
        "text": "Within just 5 years, two brothers had been assassinated while serving their country.",
        "textdich": ""
    },
    {
        "start": 1041.12,
        "end": 1054.16,
        "text": "Joseph Kennedy, the father, had once dreamed of seeing his sons in the White House.",
        "textdich": ""
    },
    {
        "start": 1050.16,
        "end": 1060.64,
        "text": "Now, two of them were dead, and the dream had become a nightmare.",
        "textdich": ""
    },
    {
        "start": 1057.36,
        "end": 1069.679,
        "text": "The death of Robert Kennedy strengthened the belief in a Kennedy family curse.",
        "textdich": ""
    },
    {
        "start": 1065.2,
        "end": 1080.16,
        "text": "To many people it seemed impossible that so many tragedies could happen to one family by chance.",
        "textdich": ""
    },
    {
        "start": 1075.36,
        "end": 1087.919,
        "text": "The Kennedes had power, money, and fame, but also an unending chain of sorrow.",
        "textdich": ""
    },
    {
        "start": 1084.72,
        "end": 1096.16,
        "text": "By the end of the 1960s, the Kennedys were no longer only America's royal family.",
        "textdich": ""
    },
    {
        "start": 1093.2,
        "end": 1101.6,
        "text": "They had become symbols of both greatness and grief.",
        "textdich": ""
    },
    {
        "start": 1098.96,
        "end": 1114.4,
        "text": "Their story was no longer just about success. It was about loss, heartbreak, and the mystery of fate.",
        "textdich": ""
    },
    {
        "start": 1110.24,
        "end": 1119.919,
        "text": "Part five, later generations and continuing tragedies.",
        "textdich": ""
    },
    {
        "start": 1117.52,
        "end": 1127.2,
        "text": "After the deaths of John and Robert Kennedy, the family tried to move forward.",
        "textdich": ""
    },
    {
        "start": 1124.4,
        "end": 1135.2,
        "text": "The remaining brother, Edward Ted Kennedy, carried the political torch.",
        "textdich": ""
    },
    {
        "start": 1131.2,
        "end": 1144.88,
        "text": "He served for decades as a senator and became one of the most powerful voices in American politics.",
        "textdich": ""
    },
    {
        "start": 1141.44,
        "end": 1149.36,
        "text": "But even his life was touched by scandal and sorrow.",
        "textdich": ""
    },
    {
        "start": 1147.12,
        "end": 1159.12,
        "text": "In 1969, Ted Kennedy was involved in the Chapaquitic accident.",
        "textdich": ""
    },
    {
        "start": 1155.2,
        "end": 1165.679,
        "text": "Late at night, his car went off a bridge and into the water.",
        "textdich": ""
    },
    {
        "start": 1161.679,
        "end": 1172.16,
        "text": "A young woman named Mary Joe Copes, who was with him, drowned.",
        "textdich": ""
    },
    {
        "start": 1168.559,
        "end": 1178.16,
        "text": "Ted escaped, but he did not report the accident right away.",
        "textdich": ""
    },
    {
        "start": 1174.72,
        "end": 1189.44,
        "text": "The scandal damaged his reputation and although he remained a senator, it ended his chance of becoming president.",
        "textdich": ""
    },
    {
        "start": 1185.919,
        "end": 1193.76,
        "text": "The curse seemed to continue in the next generations.",
        "textdich": ""
    },
    {
        "start": 1191.36,
        "end": 1205.919,
        "text": "In 1984, David Kennedy, the son of Robert, died of a drug overdose at only 28 years old.",
        "textdich": ""
    },
    {
        "start": 1203.44,
        "end": 1216.48,
        "text": "In 1997, another son of Robert, Michael Kennedy, died in a skiing accident.",
        "textdich": ""
    },
    {
        "start": 1213.28,
        "end": 1225.52,
        "text": "Each loss added to the sense that tragedy followed the family no matter what they did.",
        "textdich": ""
    },
    {
        "start": 1221.919,
        "end": 1231.2,
        "text": "The most famous of the later tragedies came in 1999.",
        "textdich": ""
    },
    {
        "start": 1228.64,
        "end": 1243.52,
        "text": "John F. Kennedy Jr., The son of President Kennedy and Jacqueline was often called America's prince.",
        "textdich": ""
    },
    {
        "start": 1240.4,
        "end": 1248.64,
        "text": "He was handsome, charismatic, and popular.",
        "textdich": ""
    },
    {
        "start": 1245.36,
        "end": 1254.799,
        "text": "Many believed he might follow the family path into politics.",
        "textdich": ""
    },
    {
        "start": 1251.52,
        "end": 1269.6,
        "text": "But in July 1999, while flying his small airplane to a wedding, the plane crashed into the Atlantic Ocean near Martha's Vineyard.",
        "textdich": ""
    },
    {
        "start": 1265.76,
        "end": 1276.4,
        "text": "John Jr., his wife Carolyn, and her sister all died.",
        "textdich": ""
    },
    {
        "start": 1272.32,
        "end": 1282.64,
        "text": "He was only 38 years old. The news shocked the world.",
        "textdich": ""
    },
    {
        "start": 1278.799,
        "end": 1289.6,
        "text": "For many, it confirmed that the Kennedy family curse was real.",
        "textdich": ""
    },
    {
        "start": 1286.0,
        "end": 1299.44,
        "text": "Other members of the family also faced struggles, accidents, health problems, or public scandals.",
        "textdich": ""
    },
    {
        "start": 1296.72,
        "end": 1306.0,
        "text": "It seemed that fame and fortune could not protect them from pain.",
        "textdich": ""
    },
    {
        "start": 1302.48,
        "end": 1315.12,
        "text": "While most families experience loss, the number of deaths and tragedies in Zenes made their story stand out.",
        "textdich": ""
    },
    {
        "start": 1312.88,
        "end": 1322.799,
        "text": "For Americans, each new Kennedy tragedy felt personal.",
        "textdich": ""
    },
    {
        "start": 1319.919,
        "end": 1330.799,
        "text": "Newspaper and television covered their lives as if they were a royal family.",
        "textdich": ""
    },
    {
        "start": 1327.44,
        "end": 1337.44,
        "text": "People admired their charm and service, but also mourned their pain.",
        "textdich": ""
    },
    {
        "start": 1334.48,
        "end": 1348.96,
        "text": "By the late 1990s, the Kennedys had become symbols of both American greatness and American sorrow.",
        "textdich": ""
    },
    {
        "start": 1346.08,
        "end": 1360.4,
        "text": "The story of later generations showed that the so-called curse did not stop with John and Robert.",
        "textdich": ""
    },
    {
        "start": 1357.12,
        "end": 1365.44,
        "text": "It continued to shape the family across the decades.",
        "textdich": ""
    },
    {
        "start": 1362.559,
        "end": 1380.32,
        "text": "With every loss, the legend of the Kennedy curse grew stronger, leaving people to wonder if destiny itself was against them.",
        "textdich": ""
    },
    {
        "start": 1375.44,
        "end": 1383.679,
        "text": "Part six, legacy and reflection.",
        "textdich": ""
    },
    {
        "start": 1380.32,
        "end": 1391.6,
        "text": "Today, the Kennedy family remains one of the most famous families in America.",
        "textdich": ""
    },
    {
        "start": 1387.679,
        "end": 1397.52,
        "text": "Their story is told in books, films, and documentaries.",
        "textdich": ""
    },
    {
        "start": 1393.919,
        "end": 1408.08,
        "text": "For many people, the name Kennedy still brings images of power, charm, and tragedy.",
        "textdich": ""
    },
    {
        "start": 1404.0,
        "end": 1416.159,
        "text": "Despite all the loss, the Kennedys also left behind a strong legacy of service.",
        "textdich": ""
    },
    {
        "start": 1412.4,
        "end": 1433.039,
        "text": "John F. Kennedy is remembered as a president who inspired hope, asked Americans to serve their country, and guided the nation through dangerous times.",
        "textdich": ""
    },
    {
        "start": 1428.72,
        "end": 1442.72,
        "text": "Robert Kennedy is remembered as a man who spoke for justice, equality, and peace.",
        "textdich": ""
    },
    {
        "start": 1439.039,
        "end": 1456.0,
        "text": "Ted Kennedy, even with his scandals, became known as the lion of the Senate for his long career and dedication to public policy.",
        "textdich": ""
    },
    {
        "start": 1452.96,
        "end": 1461.919,
        "text": "Other family members also continued the tradition.",
        "textdich": ""
    },
    {
        "start": 1457.84,
        "end": 1468.159,
        "text": "Caroline Kennedy, the daughter of JFK, became an ambassador and author.",
        "textdich": ""
    },
    {
        "start": 1465.44,
        "end": 1477.76,
        "text": "Many of the younger Kennedys have worked in law, education, or charity.",
        "textdich": ""
    },
    {
        "start": 1474.32,
        "end": 1485.6,
        "text": "The family name still carries weight in American politics and culture.",
        "textdich": ""
    },
    {
        "start": 1482.08,
        "end": 1492.32,
        "text": "But alongside this legacy, the idea of the Kennedy curse remains.",
        "textdich": ""
    },
    {
        "start": 1489.12,
        "end": 1494.08,
        "text": "The list of tragedies is long.",
        "textdich": ""
    },
    {
        "start": 1492.32,
        "end": 1502.08,
        "text": "Assassinations, accidents, illnesses, and scandals.",
        "textdich": ""
    },
    {
        "start": 1498.799,
        "end": 1509.919,
        "text": "Few other families have experienced so many losses in such a public way.",
        "textdich": ""
    },
    {
        "start": 1506.559,
        "end": 1518.559,
        "text": "To some people, the curse is just a way to explain a series of unlucky events.",
        "textdich": ""
    },
    {
        "start": 1514.159,
        "end": 1525.76,
        "text": "To others, it feels like destiny, as if greatness always comes with a price.",
        "textdich": ""
    },
    {
        "start": 1522.559,
        "end": 1530.72,
        "text": "The Kennedes are often compared to royalty.",
        "textdich": ""
    },
    {
        "start": 1527.279,
        "end": 1533.52,
        "text": "They had wealth, beauty, and influence.",
        "textdich": ""
    },
    {
        "start": 1530.72,
        "end": 1544.64,
        "text": "Their lives played out on the front pages of newspapers just like kings and queens of old.",
        "textdich": ""
    },
    {
        "start": 1541.039,
        "end": 1552.48,
        "text": "But like tragic heroes in stories, they also faced downfall and sorrow.",
        "textdich": ""
    },
    {
        "start": 1549.6,
        "end": 1560.08,
        "text": "This mixture of light and darkness is what keeps people fascinated.",
        "textdich": ""
    },
    {
        "start": 1555.84,
        "end": 1566.799,
        "text": "In the end, the Kennedy family shows both sides of the American dream.",
        "textdich": ""
    },
    {
        "start": 1563.6,
        "end": 1579.52,
        "text": "They rose from immigrant roots to the highest office in the land. They inspired millions with their words and actions.",
        "textdich": ""
    },
    {
        "start": 1575.12,
        "end": 1589.76,
        "text": "But they also remind us that no family, no matter how rich or powerful, can escape human pain and loss.",
        "textdich": ""
    },
    {
        "start": 1586.08,
        "end": 1601.679,
        "text": "The legacy of the Kennedys is not only about a curse. It is also about courage, service, and resilience. They teach us",
        "textdich": ""
    },
    {
        "start": 1597.44,
        "end": 1609.36,
        "text": "that even in the face of tragedy, people can continue to work for a better world.",
        "textdich": ""
    },
    {
        "start": 1605.679,
        "end": 1613.159,
        "text": "And perhaps that is why the name Kennedy will never be forgotten.",
        "textdich": ""
    },
    {
        "start": 1613.35,
        "end": 1621.229,
        "text": "[Music]",
        "textdich": ""
    }
]