[
    {
        "start": 0.32,
        "end": 13.04,
        "text": "A great danger is coming to the United States. It is not from an army, but from the sky itself.",
        "textdich": ""
    },
    {
        "start": 8.88,
        "end": 26.48,
        "text": "More than 175 million people across America are in its path. This is a truly historic weather event unlike many seen before. It brings two very serious",
        "textdich": ""
    },
    {
        "start": 23.68,
        "end": 38.0,
        "text": "threats. First, there will be a crippling winter storm with heavy snow and dangerous ice. Second, record-breaking cold air from the Arctic",
        "textdich": ""
    },
    {
        "start": 35.28,
        "end": 49.92,
        "text": "will move south, making temperatures incredibly low. What is causing this powerful and frightening storm? There is a mysterious weather event called a",
        "textdich": ""
    },
    {
        "start": 47.039,
        "end": 52.879,
        "text": "displaced polar vortex.",
        "textdich": ""
    },
    {
        "start": 49.92,
        "end": 62.079,
        "text": "This is usually a large area of very cold air that stays high above the Earth near the North Pole. But now it has",
        "textdich": ""
    },
    {
        "start": 58.96,
        "end": 67.28,
        "text": "moved far away from its normal home. It is traveling towards the United States.",
        "textdich": ""
    },
    {
        "start": 65.28,
        "end": 79.36,
        "text": "We will learn more about the science behind this huge atmospheric monster later in this story. This is not a regular cold front or a typical",
        "textdich": ""
    },
    {
        "start": 75.439,
        "end": 89.119,
        "text": "snowstorm. Its size is immense. The storm will cover about 2,000 m, reaching from the southwest to the entire east",
        "textdich": ""
    },
    {
        "start": 85.759,
        "end": 100.32,
        "text": "coast. It will bring both heavy snow and freezing rain, creating very risky conditions for travel and homes. The dual threats of thick ice and extreme",
        "textdich": ""
    },
    {
        "start": 98.079,
        "end": 112.079,
        "text": "cold make this event especially dangerous. People must prepare as this is a serious challenge from nature. The eastern twothirds of the country is now",
        "textdich": ""
    },
    {
        "start": 109.759,
        "end": 124.799,
        "text": "holding its breath, preparing for the impact. Cities and towns are getting ready. But one urgent question is on everyone's mind.",
        "textdich": ""
    },
    {
        "start": 120.96,
        "end": 133.08,
        "text": "Where and when will this colossal storm first hit our land and unleash its full terrible fury?",
        "textdich": ""
    },
    {
        "start": 133.2,
        "end": 139.52,
        "text": "The storm is coming.",
        "textdich": ""
    },
    {
        "start": 136.48,
        "end": 145.52,
        "text": "The big winter storm started its journey on Thursday.",
        "textdich": ""
    },
    {
        "start": 141.599,
        "end": 152.72,
        "text": "Very cold arctic air first moved in to the northern plains of the United States.",
        "textdich": ""
    },
    {
        "start": 149.28,
        "end": 158.08,
        "text": "Temperatures there dropped far below 0° F.",
        "textdich": ""
    },
    {
        "start": 154.56,
        "end": 165.44,
        "text": "This intense cold then began to spread systematically across the country.",
        "textdich": ""
    },
    {
        "start": 161.92,
        "end": 175.28,
        "text": "By Friday, heavy snow began to fall in the southern high plains, covering parts of Colorado and New Mexico.",
        "textdich": ""
    },
    {
        "start": 171.599,
        "end": 177.76,
        "text": "The storm quickly moved eastward.",
        "textdich": ""
    },
    {
        "start": 175.28,
        "end": 190.159,
        "text": "On Saturday, it spread across the southern plains and into the Mississippi Valley, aiming for the mid Mississippi Valley and the Ohio Valley.",
        "textdich": ""
    },
    {
        "start": 186.879,
        "end": 198.64,
        "text": "By Saturday night and Sunday, the large weather system was nearing the east coast, reaching southern Appalachia, the",
        "textdich": ""
    },
    {
        "start": 195.599,
        "end": 204.879,
        "text": "Carolas, and the Mid-Atlantic states, and finally the Northeast.",
        "textdich": ""
    },
    {
        "start": 202.159,
        "end": 210.0,
        "text": "Cities in the storm's path prepared for significant snowfall.",
        "textdich": ""
    },
    {
        "start": 207.68,
        "end": 216.56,
        "text": "Oklahoma City was predicted to receive between 8 and 14 in of snow.",
        "textdich": ""
    },
    {
        "start": 213.68,
        "end": 226.64,
        "text": "Little Rock, Arkansas, could see 6 to 12 in. In Amarillo, Texas, 5 to 10 in of snow might accumulate.",
        "textdich": ""
    },
    {
        "start": 224.0,
        "end": 235.92,
        "text": "However, weather experts warned on an even more insidious and destructive danger that was developing alongside the snow.",
        "textdich": ""
    },
    {
        "start": 233.44,
        "end": 248.159,
        "text": "This was a threat from ice, which forecasters described as potentially catastrophic for the South. A major ice storm was expected to hit Texas on",
        "textdich": ""
    },
    {
        "start": 245.2,
        "end": 257.44,
        "text": "Friday night and then spread across the deep south and the Carolas throughout the weekend. This ice was not just a",
        "textdich": ""
    },
    {
        "start": 254.64,
        "end": 265.44,
        "text": "little freezing rain. It threatened to cause widespread damage to roads and buildings.",
        "textdich": ""
    },
    {
        "start": 262.079,
        "end": 275.04,
        "text": "Just a small amount of ice, like half an inch, could add the weight of a heavy object to power lines, making them snap",
        "textdich": ""
    },
    {
        "start": 271.44,
        "end": 282.4,
        "text": "easily. Trees could break and utility poles could fall, leading to many power outages.",
        "textdich": ""
    },
    {
        "start": 279.52,
        "end": 293.199,
        "text": "The heavy blankets of snow were just the opening act for this powerful storm. A silent, heavier, and far more dangerous",
        "textdich": ""
    },
    {
        "start": 289.04,
        "end": 302.639,
        "text": "force was still on its way. This force, the thick, destructive ice, had the power to break essential power lines",
        "textdich": ""
    },
    {
        "start": 298.8,
        "end": 312.08,
        "text": "like small twigs and enase entire cities in a frozen tomb. What exactly was this growing threat of ice? And why did",
        "textdich": ""
    },
    {
        "start": 309.52,
        "end": 325.919,
        "text": "experts say it was much worse than a simple blizzard? The danger of ice. The heavy snow was just the first part of the storm. A much bigger danger was",
        "textdich": ""
    },
    {
        "start": 321.6,
        "end": 328.72,
        "text": "approaching. Silent and heavy ice.",
        "textdich": ""
    },
    {
        "start": 325.919,
        "end": 335.68,
        "text": "Forecasters gave a very serious warning about this ice, calling it potentially catastrophic.",
        "textdich": ""
    },
    {
        "start": 333.6,
        "end": 348.479,
        "text": "Ice is destructive because of its weight. Even half an inch makes a big difference. On 300 ft of power lines, half an inch of ice adds weight like a",
        "textdich": ""
    },
    {
        "start": 345.039,
        "end": 358.479,
        "text": "small car. This massive weight can snap power lines, break utility poles, and bring down large trees. Many homes can",
        "textdich": ""
    },
    {
        "start": 354.96,
        "end": 370.56,
        "text": "lose electricity for a long time. This dangerous ice storm will hit a huge part of the southern United States from Texas to the Carolas.",
        "textdich": ""
    },
    {
        "start": 367.68,
        "end": 384.8,
        "text": "Cities like Houston and areas in the deep south are in danger. North Georgia and Central Georgia also expect heavy ice, some places an inch or more.",
        "textdich": ""
    },
    {
        "start": 381.68,
        "end": 394.56,
        "text": "Emergency officials are worried. Keith Avery, an electricity expert, said even half an inch of ice is catastrophic.",
        "textdich": ""
    },
    {
        "start": 391.919,
        "end": 399.44,
        "text": "This weight can destroy power and communication systems.",
        "textdich": ""
    },
    {
        "start": 396.88,
        "end": 405.199,
        "text": "Everyone in these regions must be ready for serious problems.",
        "textdich": ""
    },
    {
        "start": 402.0,
        "end": 408.8,
        "text": "But ice is only one part of the problem.",
        "textdich": ""
    },
    {
        "start": 405.199,
        "end": 418.0,
        "text": "What comes after makes it worse. Very cold temperatures will follow the storm and stay for many days. The ice will not",
        "textdich": ""
    },
    {
        "start": 414.88,
        "end": 431.36,
        "text": "melt quickly. It will stay frozen on trees and power lines. Meteorologist Owen Shei explained that lasting cold makes recovery very hard. Roads will",
        "textdich": ""
    },
    {
        "start": 428.0,
        "end": 437.84,
        "text": "stay icy and dangerous. Fixing power lines in freezing weather is difficult.",
        "textdich": ""
    },
    {
        "start": 434.639,
        "end": 450.56,
        "text": "This mix of heavy ice and extreme lasting cold creates a compounding crisis. This crisis means serious trouble. Ice can cut off power. When",
        "textdich": ""
    },
    {
        "start": 447.759,
        "end": 462.319,
        "text": "electricity stops, houses become cold and dark. Without heat, inside temperatures can drop fast and become deadly. This silent danger will be",
        "textdich": ""
    },
    {
        "start": 458.88,
        "end": 473.919,
        "text": "inside homes. A power outage from heavy ice could quickly become a desperate fight for survival against the freezing cold. Four, the big freeze.",
        "textdich": ""
    },
    {
        "start": 471.44,
        "end": 483.599,
        "text": "Life-threatening cold air arrived with the storm. In some northern areas, wind chills were expected to drop to 40 or 50",
        "textdich": ""
    },
    {
        "start": 480.16,
        "end": 491.28,
        "text": "degrees below zero Fahrenheit. This made the air feel much colder than the actual temperature.",
        "textdich": ""
    },
    {
        "start": 488.319,
        "end": 503.28,
        "text": "This Arctic air covered a vast part of the country. It spread from the upper Midwest and Great Lakes down to the Gulf Coast and parts of Florida.",
        "textdich": ""
    },
    {
        "start": 500.319,
        "end": 507.68,
        "text": "Even places not used to such cold felt its bite.",
        "textdich": ""
    },
    {
        "start": 504.879,
        "end": 516.479,
        "text": "In Texas, wind chills could fall to single digits or 10° below zero, very rare for southern states.",
        "textdich": ""
    },
    {
        "start": 514.08,
        "end": 522.24,
        "text": "Florida might see freezing temperatures as far south as Jacksonville.",
        "textdich": ""
    },
    {
        "start": 519.599,
        "end": 530.959,
        "text": "This extreme cold was a serious threat to health. Too much time outside could quickly lead to frostbite.",
        "textdich": ""
    },
    {
        "start": 528.08,
        "end": 540.959,
        "text": "Frostbite made skin numb and changed to white or grayish yellow, often on fingers, toes, nose, and ears. These signs of danger could appear in just",
        "textdich": ""
    },
    {
        "start": 539.279,
        "end": 544.08,
        "text": "minutes.",
        "textdich": ""
    },
    {
        "start": 540.959,
        "end": 546.0,
        "text": "Even more serious was hypothermia.",
        "textdich": ""
    },
    {
        "start": 544.08,
        "end": 552.72,
        "text": "This happens when the body's core temperature falls below 95° F.",
        "textdich": ""
    },
    {
        "start": 550.08,
        "end": 560.24,
        "text": "People might shiver, become confused, or drowsy. They might struggle with their hands, or lose memory.",
        "textdich": ""
    },
    {
        "start": 557.6,
        "end": 568.56,
        "text": "Experts warned hypothermia affects the brain, making it hard for victims to think clearly or realize their danger.",
        "textdich": ""
    },
    {
        "start": 566.32,
        "end": 580.16,
        "text": "This record cold was driven by a displaced polar vortex. This is a large area of very cold air that usually stays over the North Pole, but now it had",
        "textdich": ""
    },
    {
        "start": 577.519,
        "end": 588.399,
        "text": "moved south, letting Arctic air rush into the United States. We had seen its effects, but what was this Titan? And",
        "textdich": ""
    },
    {
        "start": 586.0,
        "end": 596.959,
        "text": "why had it left its Arctic home to wage war on the United States? The combined attack of heavy ice and bitter cold put",
        "textdich": ""
    },
    {
        "start": 594.0,
        "end": 600.24,
        "text": "huge pressure on vital infrastructure.",
        "textdich": ""
    },
    {
        "start": 596.959,
        "end": 616.0,
        "text": "For millions in one state, these conditions brought back terrible memories. It reminded them of a disaster not long ago that left hundreds dead and",
        "textdich": ""
    },
    {
        "start": 610.959,
        "end": 620.56,
        "text": "the entire region frozen in darkness.",
        "textdich": ""
    },
    {
        "start": 616.0,
        "end": 624.8,
        "text": "Five. Will the power stay on?",
        "textdich": ""
    },
    {
        "start": 620.56,
        "end": 631.839,
        "text": "The memory of the February 20121 freeze was heavy in Texas.",
        "textdich": ""
    },
    {
        "start": 627.519,
        "end": 644.079,
        "text": "That winter storm killed over 200 people and left more than 4.5 million homes and businesses without power for a very long time.",
        "textdich": ""
    },
    {
        "start": 640.88,
        "end": 648.8,
        "text": "As another big storm approached, a sense of fear returned.",
        "textdich": ""
    },
    {
        "start": 646.48,
        "end": 657.519,
        "text": "People worried if the power grid would fail again, bringing back the nightmare of freezing darkness.",
        "textdich": ""
    },
    {
        "start": 654.88,
        "end": 667.92,
        "text": "Texas Governor Greg Abbott said the state had emergency resources ready. He asked people to stay safe. Ecort, which",
        "textdich": ""
    },
    {
        "start": 664.88,
        "end": 677.839,
        "text": "manages most of the state's power grid, stated that power conditions were expected to stay normal. They watched the cold weather carefully, trying to",
        "textdich": ""
    },
    {
        "start": 675.519,
        "end": 681.04,
        "text": "reassure everyone.",
        "textdich": ""
    },
    {
        "start": 677.839,
        "end": 692.0,
        "text": "However, independent energy experts gave strong warnings. They said the Texas grid was improved, but this storm would",
        "textdich": ""
    },
    {
        "start": 687.519,
        "end": 703.12,
        "text": "truly test it. Acue chief meteorologist Jonathan Porter noted the cold would come with a major snow and ice storm to North Texas.",
        "textdich": ""
    },
    {
        "start": 699.839,
        "end": 714.16,
        "text": "Ed Hirs, an energy expert, cautioned that deep cold could freeze wind turbines and other power equipment, stopping generation. He also worried a",
        "textdich": ""
    },
    {
        "start": 711.519,
        "end": 718.16,
        "text": "problem in one area could cause failures in others.",
        "textdich": ""
    },
    {
        "start": 715.92,
        "end": 724.56,
        "text": "Power companies from Texas to the Carolas, worked hard to get ready.",
        "textdich": ""
    },
    {
        "start": 721.6,
        "end": 735.68,
        "text": "Encore, a Texas company, moved transformers and trimmed many trees to prevent outages. In North Carolina, Duke Energy asked customers to use less",
        "textdich": ""
    },
    {
        "start": 734.079,
        "end": 738.8,
        "text": "electricity.",
        "textdich": ""
    },
    {
        "start": 735.68,
        "end": 749.279,
        "text": "Governor Josh Stein advised residents to gather food, water, and batteries. He also told people to plan to stay home.",
        "textdich": ""
    },
    {
        "start": 746.48,
        "end": 758.639,
        "text": "These efforts were vital, but with the storm's huge size and heavy ice, their work felt like a desperate gamble.",
        "textdich": ""
    },
    {
        "start": 756.0,
        "end": 764.639,
        "text": "Utility workers knew communications and power could be out for many days.",
        "textdich": ""
    },
    {
        "start": 762.0,
        "end": 772.56,
        "text": "Extreme cold after the storm would make repairs even harder, leaving homes without heat.",
        "textdich": ""
    },
    {
        "start": 769.839,
        "end": 778.72,
        "text": "Beyond the power grid, the storm would also stop the nation's movement and trade.",
        "textdich": ""
    },
    {
        "start": 776.48,
        "end": 787.2,
        "text": "Southern states have less equipment to clear snow and ice. Highways could be shut down for a long time.",
        "textdich": ""
    },
    {
        "start": 784.88,
        "end": 798.56,
        "text": "Major airlines canled thousands of flights and issued warnings. This would strand many travelers. It would also break important supply chains.",
        "textdich": ""
    },
    {
        "start": 796.399,
        "end": 809.44,
        "text": "With the power grid struggling and millions facing dangerous cold, the country's roads and airports were about to stop, threatening to cut off people",
        "textdich": ""
    },
    {
        "start": 806.88,
        "end": 811.76,
        "text": "and vital goods.",
        "textdich": ""
    },
    {
        "start": 809.44,
        "end": 814.8,
        "text": "A country stops.",
        "textdich": ""
    },
    {
        "start": 811.76,
        "end": 821.76,
        "text": "The country began to stop. On the ground, driving became very dangerous.",
        "textdich": ""
    },
    {
        "start": 818.399,
        "end": 832.24,
        "text": "In Michigan, over 100 cars crashed on a big highway. In New York, another major highway had to close because of many accidents.",
        "textdich": ""
    },
    {
        "start": 828.8,
        "end": 834.48,
        "text": "Ice and snow made roads deadwe.",
        "textdich": ""
    },
    {
        "start": 832.24,
        "end": 843.36,
        "text": "Southern states have fewer machines to clear snow and ice. This made driving even harder there. The extreme cold",
        "textdich": ""
    },
    {
        "start": 840.88,
        "end": 850.32,
        "text": "after the storm meant ice would stay on roads for days. It was not just roads.",
        "textdich": ""
    },
    {
        "start": 847.44,
        "end": 854.32,
        "text": "The sky also closed down.",
        "textdich": ""
    },
    {
        "start": 850.32,
        "end": 864.0,
        "text": "Major airlines like Delta, United, and American had to stop thousands of flights. They told people they could change their tickets without paying",
        "textdich": ""
    },
    {
        "start": 862.399,
        "end": 867.279,
        "text": "extra.",
        "textdich": ""
    },
    {
        "start": 864.0,
        "end": 877.36,
        "text": "Around 40 airports in the east and south were impacted. People could not travel by air, causing big problems for many.",
        "textdich": ""
    },
    {
        "start": 874.72,
        "end": 887.839,
        "text": "This storm also hit the country's money hard. Businesses closed and work stopped. This means a lot of money was",
        "textdich": ""
    },
    {
        "start": 883.519,
        "end": 903.44,
        "text": "lost. Fixing damaged roads, power lines, and other things would cost billions of dollars. Experts said the 2021 storm in Texas cost 155 billion.",
        "textdich": ""
    },
    {
        "start": 900.56,
        "end": 913.519,
        "text": "This new storm was not as bad, but it affected more than 35 states. The total cost would be very high. Beyond traffic",
        "textdich": ""
    },
    {
        "start": 910.88,
        "end": 924.959,
        "text": "and money, the storm brought hidden dangers to people's health. Shoveling heavy snow can be very dangerous for the heart. Doctors said more people had",
        "textdich": ""
    },
    {
        "start": 922.16,
        "end": 927.04,
        "text": "heart attacks when clearing snow.",
        "textdich": ""
    },
    {
        "start": 924.959,
        "end": 935.76,
        "text": "Another silent killer was carbon monoxide. When the power went out, some people used outdoor heaters inside.",
        "textdich": ""
    },
    {
        "start": 933.519,
        "end": 941.839,
        "text": "These heaters can fill a home with a deadly gas that has no smell or color.",
        "textdich": ""
    },
    {
        "start": 939.44,
        "end": 954.56,
        "text": "Many people became sick or died from this. We have seen how this storm affected people's lives, stopped power, and cost a lot of money. But what is",
        "textdich": ""
    },
    {
        "start": 951.12,
        "end": 963.199,
        "text": "causing all this chaos? What is the big force in the sky that drives this extreme weather? To truly understand if",
        "textdich": ""
    },
    {
        "start": 960.399,
        "end": 973.68,
        "text": "this storm is a rare event or a sign of the future, we need to look closely at the mysterious and powerful polar vortex.",
        "textdich": ""
    },
    {
        "start": 970.32,
        "end": 989.199,
        "text": "Seven, the science of the storm. The polar vortex is a big area of very cold air. It usually stays over the north pole, spinning high above the Earth.",
        "textdich": ""
    },
    {
        "start": 985.68,
        "end": 995.6,
        "text": "But sometimes this large mass of cold air moves much farther south.",
        "textdich": ""
    },
    {
        "start": 993.12,
        "end": 1002.88,
        "text": "This happens because of something called a sudden stratospheric warming event.",
        "textdich": ""
    },
    {
        "start": 999.92,
        "end": 1012.88,
        "text": "This warming is like a big heat up in the air high above the Arctic in the stratosphere layer. This event makes the",
        "textdich": ""
    },
    {
        "start": 1009.519,
        "end": 1017.92,
        "text": "polar vortex weak and pushes it off its normal path.",
        "textdich": ""
    },
    {
        "start": 1014.88,
        "end": 1029.12,
        "text": "When this happens, the very cold Arctic air can travel a long way south, bringing severe winter weather to places that are not used to it. This is the",
        "textdich": ""
    },
    {
        "start": 1026.88,
        "end": 1033.12,
        "text": "main reason for the current powerful storm.",
        "textdich": ""
    },
    {
        "start": 1030.88,
        "end": 1041.039,
        "text": "Forecasters, like the experts at the National Weather Service, have a hard job predicting these complex storms.",
        "textdich": ""
    },
    {
        "start": 1038.559,
        "end": 1048.72,
        "text": "They use many different computer models to guess what the weather will do. for this storm. Models from different groups",
        "textdich": ""
    },
    {
        "start": 1046.4,
        "end": 1059.44,
        "text": "like the European Center for Medium Range Weather Forecasts generally agreed on the big picture. However, these models could show different amounts of",
        "textdich": ""
    },
    {
        "start": 1056.24,
        "end": 1068.24,
        "text": "snow or ice for specific cities. This makes it hard for forecasters to be perfectly sure about the storm's exact impacts in every area.",
        "textdich": ""
    },
    {
        "start": 1066.4,
        "end": 1078.16,
        "text": "Small differences in temperature, sometimes just 1 or 2°, can mean the difference between cold rain, sleet, or heavy freezing rain. This adds to the",
        "textdich": ""
    },
    {
        "start": 1076.16,
        "end": 1087.52,
        "text": "challenge and makes the storm's precise effects very uncertain until it is closer. Many people also ask about the connection between climate change and",
        "textdich": ""
    },
    {
        "start": 1084.799,
        "end": 1098.64,
        "text": "these cold storms. The world is generally getting warmer, and winter is the fastest warming season in many parts of the United States.",
        "textdich": ""
    },
    {
        "start": 1096.0,
        "end": 1110.16,
        "text": "But scientists are still studying exactly how a warming planet affects extreme winter weather events. It's a complex topic.",
        "textdich": ""
    },
    {
        "start": 1107.6,
        "end": 1120.0,
        "text": "Some research suggests that warming in the Arctic can change how the jetream and polar vortex move. This might make",
        "textdich": ""
    },
    {
        "start": 1116.72,
        "end": 1128.72,
        "text": "the polar vortex more likely to wander, allowing cold air to spread south more often in some years. So even with a",
        "textdich": ""
    },
    {
        "start": 1125.919,
        "end": 1139.919,
        "text": "generally warmer climate, we can still have very brutal cold snaps and big winter storms. This shows that the Earth's weather system is incredibly",
        "textdich": ""
    },
    {
        "start": 1137.12,
        "end": 1149.2,
        "text": "complex and can still deliver harsh winters. The science behind this massive storm is hard to fully understand, but",
        "textdich": ""
    },
    {
        "start": 1146.48,
        "end": 1157.679,
        "text": "the danger it brings to millions is now very clear and immediate. With the storm beginning to strike across the country,",
        "textdich": ""
    },
    {
        "start": 1155.2,
        "end": 1166.559,
        "text": "what are the final critical preparations that families must make? These last steps could be the difference between",
        "textdich": ""
    },
    {
        "start": 1162.72,
        "end": 1175.52,
        "text": "safety and disaster for many. Eight. The final warning. The big winter storm had arrived, bringing its full force across",
        "textdich": ""
    },
    {
        "start": 1172.64,
        "end": 1187.679,
        "text": "the country. For millions of people, this was the final urgent warning. The dangers were clear. widespread ice, extreme cold, and the very real chance",
        "textdich": ""
    },
    {
        "start": 1184.48,
        "end": 1199.679,
        "text": "of long power outages. It was critical to act now and follow the simple, practical advice from emergency officials. First, focus on making your",
        "textdich": ""
    },
    {
        "start": 1196.0,
        "end": 1210.16,
        "text": "home a safe haven. Ensure your house is sealed tightly. Use coaul to fill cracks around windows and add weather stripping",
        "textdich": ""
    },
    {
        "start": 1207.039,
        "end": 1213.36,
        "text": "to doors to keep the cold out.",
        "textdich": ""
    },
    {
        "start": 1210.16,
        "end": 1221.44,
        "text": "Install and test smoke alarms and carbon monoxide detectors, making sure they have fresh batteries.",
        "textdich": ""
    },
    {
        "start": 1218.32,
        "end": 1230.88,
        "text": "Prepare an emergency kit with at least 3 days supply of non-p perishable food, bottled water, and any necessary medications.",
        "textdich": ""
    },
    {
        "start": 1228.72,
        "end": 1234.96,
        "text": "Don't forget food and water for your pets.",
        "textdich": ""
    },
    {
        "start": 1232.32,
        "end": 1244.96,
        "text": "Gather extra batteries for flashlights and a batterypowered radio for if the power fails. Keep water faucets dripping",
        "textdich": ""
    },
    {
        "start": 1241.6,
        "end": 1247.84,
        "text": "slowly to prevent pipes from freezing.",
        "textdich": ""
    },
    {
        "start": 1244.96,
        "end": 1253.6,
        "text": "Open cabinet doors under sinks to allow warmer air to reach the plumbing.",
        "textdich": ""
    },
    {
        "start": 1250.64,
        "end": 1259.6,
        "text": "Remember to disconnect and drain all outdoor hoses.",
        "textdich": ""
    },
    {
        "start": 1255.84,
        "end": 1268.799,
        "text": "Second, avoid travel if you can. Roads will be dangerous due to ice and heavy snow. If you must drive, prepare your",
        "textdich": ""
    },
    {
        "start": 1265.52,
        "end": 1280.32,
        "text": "vehicle carefully. Your car's emergency kit should include jumper cables, a bag of sand or kitty or for tighter traction, a flashlight, and bright",
        "textdich": ""
    },
    {
        "start": 1276.64,
        "end": 1293.039,
        "text": "warning flares. Pack warm blankets, a fully charged phone, a power bank, water, and some snacks. Keep your gas tank full. If you get stranded, it is",
        "textdich": ""
    },
    {
        "start": 1289.76,
        "end": 1302.0,
        "text": "almost always safer to stay inside your vehicle. Critically, ensure your car's exhaust pipe is clear of snow to prevent",
        "textdich": ""
    },
    {
        "start": 1299.36,
        "end": 1311.44,
        "text": "deadly carbon monoxide from entering the car. This historic storm would be a major test. It would test our modern",
        "textdich": ""
    },
    {
        "start": 1308.72,
        "end": 1324.0,
        "text": "infrastructure and how well communities could come together. It reminded everyone of nature's raw power. By taking these steps, families could face",
        "textdich": ""
    },
    {
        "start": 1320.72,
        "end": 1329.28,
        "text": "the storm's fury with more confidence and resilience.",
        "textdich": ""
    },
    {
        "start": 1326.32,
        "end": 1338.88,
        "text": "What do you believe is the single most important thing a family should do to prepare for a very bad winter storm?",
        "textdich": ""
    },
    {
        "start": 1336.24,
        "end": 1340.96,
        "text": " Hey there, just a second before you go.",
        "textdich": ""
    },
    {
        "start": 1338.88,
        "end": 1349.84,
        "text": "If you learned something new today, please give this video a like, write your thoughts in the comments, and subscribe to the channel. It only takes",
        "textdich": ""
    },
    {
        "start": 1347.12,
        "end": 1356.96,
        "text": "a second, and it really, really helps to create even better English videos for you. Your support means the world. Thank you.",
        "textdich": ""
    }
]