[
    {
        "start": 0.32,
        "end": 11.519,
        "text": "Welcome to my channel. Okay, let me ask you something honestly and I really want you to think about this for a second.",
        "textdich": ""
    },
    {
        "start": 9.519,
        "end": 26.48,
        "text": "Have you ever noticed how some people improve their English so fast? I mean one day they are quiet, shy and unsure and then suddenly",
        "textdich": ""
    },
    {
        "start": 22.08,
        "end": 29.359,
        "text": "wow they are speaking with confidence.",
        "textdich": ""
    },
    {
        "start": 26.48,
        "end": 40.239,
        "text": "Meanwhile, you might be studying English for months, maybe even years, and still feel stuck. You understand a little. You",
        "textdich": ""
    },
    {
        "start": 37.52,
        "end": 47.28,
        "text": "know some words, but when it's time to speak, h you freeze.",
        "textdich": ""
    },
    {
        "start": 44.0,
        "end": 58.239,
        "text": "Why does this happen? Is it talent? Is it age? Is it because they are smarter than you? Actually, no, not at all. And",
        "textdich": ""
    },
    {
        "start": 55.52,
        "end": 66.88,
        "text": "this is the strange part. Most people never tell you this. What if I told you that improving English fast is not about",
        "textdich": ""
    },
    {
        "start": 64.159,
        "end": 80.159,
        "text": "studying harder, reading thicker books, or memorizing long grammar rules. It's about doing the right things in the right order. That's it. Nothing",
        "textdich": ""
    },
    {
        "start": 76.24,
        "end": 84.24,
        "text": "complicated, no magic, just the correct order.",
        "textdich": ""
    },
    {
        "start": 81.52,
        "end": 90.08,
        "text": "You see, many learners work very hard, but they work in the wrong direction.",
        "textdich": ""
    },
    {
        "start": 86.96,
        "end": 93.439,
        "text": "And honestly, that's not their fault.",
        "textdich": ""
    },
    {
        "start": 90.08,
        "end": 105.6,
        "text": "Nobody explains this clearly. So stay with me. Don't skip. Don't rush. In this video, I'm going to show you the fastest",
        "textdich": ""
    },
    {
        "start": 101.439,
        "end": 117.84,
        "text": "way to improve English step by step in very simple words in a calm and practical way that actually works for real people like you and me.",
        "textdich": ""
    },
    {
        "start": 115.119,
        "end": 121.6,
        "text": "Chapter 1.",
        "textdich": ""
    },
    {
        "start": 117.84,
        "end": 124.479,
        "text": "Why most English learners fail.",
        "textdich": ""
    },
    {
        "start": 121.6,
        "end": 134.4,
        "text": "Let's start with something very real. something almost every English learner feels but rarely says out loud. You open",
        "textdich": ""
    },
    {
        "start": 131.2,
        "end": 141.68,
        "text": "your English book, you look at the page, and after a few minutes, you feel tired.",
        "textdich": ""
    },
    {
        "start": 139.04,
        "end": 145.68,
        "text": "Not physically tired, but mentally tired.",
        "textdich": ""
    },
    {
        "start": 143.28,
        "end": 155.76,
        "text": "Your eyes move over the words your brain tries to understand. And deep inside you think I understand a little but why",
        "textdich": ""
    },
    {
        "start": 152.16,
        "end": 159.04,
        "text": "can't I speak? That feeling is heavy.",
        "textdich": ""
    },
    {
        "start": 155.76,
        "end": 165.04,
        "text": "It's confusing. It's frustrating. And honestly, it hurts your confidence.",
        "textdich": ""
    },
    {
        "start": 162.72,
        "end": 175.36,
        "text": "Many beginners feel afraid when they hear English, afraid of making mistakes, afraid of sounding silly, afraid that",
        "textdich": ""
    },
    {
        "start": 172.319,
        "end": 185.76,
        "text": "people will laugh. You might know some grammar rules. You might know some words, but when someone speaks to you in",
        "textdich": ""
    },
    {
        "start": 180.879,
        "end": 197.2,
        "text": "English, your mind goes blank. H nothing comes out. And then you start thinking, maybe English is not for me. Maybe I'm",
        "textdich": ""
    },
    {
        "start": 192.8,
        "end": 200.159,
        "text": "too slow. Maybe I started too late.",
        "textdich": ""
    },
    {
        "start": 197.2,
        "end": 209.76,
        "text": "If this sounds like you, let me tell you something very important. This is not your fault. Not at all.",
        "textdich": ""
    },
    {
        "start": 207.12,
        "end": 221.92,
        "text": "For many years, schools have taught English in the wrong way. They teach English like a subject, like math or history. They focus too much on grammar",
        "textdich": ""
    },
    {
        "start": 218.879,
        "end": 236.56,
        "text": "rules, long explanations, and translation. You learn present tense, past tense, future tense. You memorize rules. You memorize word lists. You",
        "textdich": ""
    },
    {
        "start": 232.799,
        "end": 247.92,
        "text": "translate sentences again and again. But when it's time to speak, surprisingly, nothing happens. Why? Because English is",
        "textdich": ""
    },
    {
        "start": 243.92,
        "end": 257.6,
        "text": "not a subject. English is a skill. Think about it. How did you learn to walk? Did someone give you a book about walking?",
        "textdich": ""
    },
    {
        "start": 254.4,
        "end": 266.88,
        "text": "Did they explain rules like first lift your left foot, then your right foot? number.",
        "textdich": ""
    },
    {
        "start": 262.56,
        "end": 275.199,
        "text": "You watched, you tried, you fell and you tried again. Slowly, naturally, you learned.",
        "textdich": ""
    },
    {
        "start": 272.96,
        "end": 286.16,
        "text": "The same thing happened when you learned your first language. You listened first a lot. You didn't translate. You didn't",
        "textdich": ""
    },
    {
        "start": 282.639,
        "end": 297.6,
        "text": "study grammar. You just absorbed it. But with English, many learners do the opposite. They start with grammar. They start with translation.",
        "textdich": ""
    },
    {
        "start": 294.479,
        "end": 310.0,
        "text": "And this creates a big problem. Your brain becomes slow. Every time you want to speak, your mind says, \"Wait, first think in my language, then",
        "textdich": ""
    },
    {
        "start": 307.44,
        "end": 320.88,
        "text": "translate into English, then check grammar, then speak.\" By the time you're ready, oops, the moment is gone.",
        "textdich": ""
    },
    {
        "start": 318.24,
        "end": 334.639,
        "text": "Let's be honest for a second. How many times have you learned a new word, felt happy, and then forgotten it the next day? You write it down,",
        "textdich": ""
    },
    {
        "start": 330.4,
        "end": 340.8,
        "text": "you repeat it, you memorize it, and still it disappears.",
        "textdich": ""
    },
    {
        "start": 338.96,
        "end": 353.52,
        "text": "That's not because you are bad at learning. It's because memorization without use doesn't stay. Imagine opening your English book after a long",
        "textdich": ""
    },
    {
        "start": 350.0,
        "end": 366.639,
        "text": "day. You're already kind of tired. You read one page, then another. You feel sleepy. You close the book and think, \"I'll do it tomorrow.\"",
        "textdich": ""
    },
    {
        "start": 363.44,
        "end": 380.639,
        "text": "And tomorrow comes and the same thing happens. Slowly motivation goes down, confidence goes down and English starts to feel heavy instead of exciting.",
        "textdich": ""
    },
    {
        "start": 377.919,
        "end": 384.0,
        "text": "Here comes a very important moment.",
        "textdich": ""
    },
    {
        "start": 380.639,
        "end": 396.16,
        "text": "Listen carefully. The first secret to improving English fast is this. Stop translating in your head. Yes, I know",
        "textdich": ""
    },
    {
        "start": 392.16,
        "end": 406.319,
        "text": "this sounds scary. You might think, \"But how can I understand English without translation?\" That's normal. Everyone feels that way",
        "textdich": ""
    },
    {
        "start": 403.039,
        "end": 418.08,
        "text": "at first. But translation is like a crutch. It helps you in the beginning, but if you depend on it forever, you never walk freely.",
        "textdich": ""
    },
    {
        "start": 415.36,
        "end": 428.08,
        "text": "When you stop translating, something amazing starts to happen. Your brain begins to connect English words directly",
        "textdich": ""
    },
    {
        "start": 424.4,
        "end": 440.16,
        "text": "with meaning, pictures, and feelings, not with your native language. At first, it feels strange, confusing, maybe even uncomfortable.",
        "textdich": ""
    },
    {
        "start": 437.199,
        "end": 449.599,
        "text": "But that discomfort means your brain is learning in a new, faster way. This is why some people improve so fast. They",
        "textdich": ""
    },
    {
        "start": 447.68,
        "end": 457.12,
        "text": "don't think about grammar when they speak. They don't translate every word.",
        "textdich": ""
    },
    {
        "start": 453.52,
        "end": 461.68,
        "text": "They focus on meaning, on message, on communication.",
        "textdich": ""
    },
    {
        "start": 458.639,
        "end": 470.96,
        "text": "And here's the good news. This skill is not special. It's not for smart people only. Anyone can learn it. You just need",
        "textdich": ""
    },
    {
        "start": 468.24,
        "end": 474.0,
        "text": "to change how you approach English.",
        "textdich": ""
    },
    {
        "start": 470.96,
        "end": 484.24,
        "text": "Before speaking fast, before sounding fluent, before using big words, there is one thing you must change first. How you",
        "textdich": ""
    },
    {
        "start": 481.039,
        "end": 494.4,
        "text": "think about English. Not your book, not your teacher, not your age, your mindset. If you want to improve English",
        "textdich": ""
    },
    {
        "start": 490.72,
        "end": 500.56,
        "text": "fast, the first thing you must change is not your book, it's your mindset.",
        "textdich": ""
    },
    {
        "start": 498.72,
        "end": 514.159,
        "text": "Chapter two. how your brain really learns English fast. Okay, so now that we've talked about why most learners fail, let's talk",
        "textdich": ""
    },
    {
        "start": 510.08,
        "end": 526.399,
        "text": "about your brain. Yes, your brain, the amazing, strange, sometimes confusing organ that somehow manages to learn everything you do.",
        "textdich": ""
    },
    {
        "start": 523.519,
        "end": 536.48,
        "text": "You see, your brain doesn't work like a book. Honestly, this is super important to understand because so many learners",
        "textdich": ""
    },
    {
        "start": 533.04,
        "end": 542.24,
        "text": "think if I memorize enough grammar, I will speak perfectly.",
        "textdich": ""
    },
    {
        "start": 539.12,
        "end": 549.12,
        "text": "But here's the truth. Your brain doesn't learn English through memorizing rules.",
        "textdich": ""
    },
    {
        "start": 545.76,
        "end": 557.44,
        "text": "Not really. It learns through patterns, repetition, and listening.",
        "textdich": ""
    },
    {
        "start": 553.2,
        "end": 561.279,
        "text": "That's it. Sounds simple, right?",
        "textdich": ""
    },
    {
        "start": 557.44,
        "end": 572.48,
        "text": "Well, it really is, but most people over complicate it. Think about how babies learn. Babies don't read grammar books.",
        "textdich": ""
    },
    {
        "start": 568.72,
        "end": 575.68,
        "text": "They don't memorize long lists of words.",
        "textdich": ""
    },
    {
        "start": 572.48,
        "end": 583.279,
        "text": "They just listen. They hear sounds over and over again. They notice patterns.",
        "textdich": ""
    },
    {
        "start": 579.36,
        "end": 590.24,
        "text": "And slowly, magically, they start repeating words.",
        "textdich": ""
    },
    {
        "start": 585.92,
        "end": 600.24,
        "text": "First it's mama, then dada, then a tiny sentence, and before you know it, a full story comes out of their little mouth.",
        "textdich": ""
    },
    {
        "start": 597.04,
        "end": 610.0,
        "text": "Now, guess what? Your brain can do the same thing. Even as an adult, the only difference is that as adults, we often",
        "textdich": ""
    },
    {
        "start": 607.2,
        "end": 614.72,
        "text": "try to force our brains into the wrong way.",
        "textdich": ""
    },
    {
        "start": 611.44,
        "end": 621.6,
        "text": "We try to memorize words, translate everything in our heads and think too much.",
        "textdich": ""
    },
    {
        "start": 618.88,
        "end": 631.6,
        "text": "But your brain doesn't need that. In fact, that thinking slows you down. You see, learning English is like learning",
        "textdich": ""
    },
    {
        "start": 628.16,
        "end": 640.88,
        "text": "to dance or swim. You don't start by reading a book about swimming. You jump into the water and feel how your body",
        "textdich": ""
    },
    {
        "start": 636.88,
        "end": 654.16,
        "text": "moves. You make mistakes, splash around, maybe even panic a little and slowly, slowly your body learns. The same is true with English.",
        "textdich": ""
    },
    {
        "start": 650.399,
        "end": 663.12,
        "text": "Mistakes are not bad. Honestly, mistakes are proof that learning is happening. If you are scared to make mistakes, your",
        "textdich": ""
    },
    {
        "start": 660.0,
        "end": 667.44,
        "text": "brain never gets a chance to practice.",
        "textdich": ""
    },
    {
        "start": 663.12,
        "end": 674.0,
        "text": "And practice is the real key. Here's something I want you to remember.",
        "textdich": ""
    },
    {
        "start": 669.68,
        "end": 676.24,
        "text": "Listening comes before speaking. Always.",
        "textdich": ""
    },
    {
        "start": 674.0,
        "end": 686.24,
        "text": "You might feel frustrated because you want to speak and you are thinking, \"But I want to talk now.\" I understand.",
        "textdich": ""
    },
    {
        "start": 683.519,
        "end": 697.6,
        "text": "But guess what? Speaking will come naturally just like it did for the baby if your brain has enough listening patterns to copy.",
        "textdich": ""
    },
    {
        "start": 694.079,
        "end": 700.24,
        "text": "Listening builds the foundation.",
        "textdich": ""
    },
    {
        "start": 697.6,
        "end": 707.2,
        "text": "Listening shows your brain the rhythm, the sound, the way sentences are formed.",
        "textdich": ""
    },
    {
        "start": 704.32,
        "end": 711.68,
        "text": "You start to feel what is normal English.",
        "textdich": ""
    },
    {
        "start": 708.72,
        "end": 722.16,
        "text": "And then when you speak, your brain already knows what to say. It just needs your mouth to catch up. Okay. So, how do",
        "textdich": ""
    },
    {
        "start": 718.8,
        "end": 730.639,
        "text": "you make this work? The answer is daily exposure, but not hours of boring study.",
        "textdich": ""
    },
    {
        "start": 727.12,
        "end": 745.04,
        "text": "Not one huge grammar book a week. Just short, simple, repeatable English every day. Listen to something small like a fiveinut story or conversation.",
        "textdich": ""
    },
    {
        "start": 740.16,
        "end": 747.839,
        "text": "Listen again. Pause. Repeat.",
        "textdich": ""
    },
    {
        "start": 745.04,
        "end": 753.36,
        "text": "Slowly your brain starts noticing patterns.",
        "textdich": ""
    },
    {
        "start": 749.519,
        "end": 765.68,
        "text": "Oh, this word comes after that word. Oh, people say this this way. Every tiny repetition is building your brain's English muscle. And guess what? You",
        "textdich": ""
    },
    {
        "start": 762.32,
        "end": 777.68,
        "text": "don't need a lot of time. Even 10 minutes a day done consistently is better than 1 hour a week. Here's a small trick that works wonders. Listen",
        "textdich": ""
    },
    {
        "start": 774.72,
        "end": 790.959,
        "text": "to English while doing something easy like walking, washing dishes or having coffee. Your brain is still active, still absorbing. And because you are",
        "textdich": ""
    },
    {
        "start": 787.12,
        "end": 801.519,
        "text": "relaxed, it remembers better. And don't worry if you don't understand everything. You don't need to. Your brain will pick up words and patterns",
        "textdich": ""
    },
    {
        "start": 798.8,
        "end": 810.16,
        "text": "without you even realizing it. It's like magic but it's actually science.",
        "textdich": ""
    },
    {
        "start": 806.639,
        "end": 821.279,
        "text": "Now I want to remind you again mistakes are proof of learning. If you are listening every day your brain is collecting patterns. If you try to speak",
        "textdich": ""
    },
    {
        "start": 818.72,
        "end": 828.8,
        "text": "and make a mistake, your brain is actually correcting itself without you even noticing.",
        "textdich": ""
    },
    {
        "start": 825.76,
        "end": 831.6,
        "text": "That is how fast improvement happens.",
        "textdich": ""
    },
    {
        "start": 828.8,
        "end": 838.0,
        "text": "It's not about perfection. It's about exposure and repetition.",
        "textdich": ""
    },
    {
        "start": 835.12,
        "end": 849.519,
        "text": "By the end of this process, you will feel English starting to click. Words will feel familiar. Sentences will start making sense automatically.",
        "textdich": ""
    },
    {
        "start": 847.44,
        "end": 861.199,
        "text": "You will start thinking in English instead of translating in your head. And honestly, that moment is amazing. You feel more",
        "textdich": ""
    },
    {
        "start": 857.92,
        "end": 871.199,
        "text": "confident, more alive, more connected to the world. So now you know how the brain learns through listening, repetition,",
        "textdich": ""
    },
    {
        "start": 868.0,
        "end": 875.6,
        "text": "and patterns, not grammar rules or memorization.",
        "textdich": ""
    },
    {
        "start": 873.04,
        "end": 887.199,
        "text": "You also know that mistakes are good and that speaking comes naturally after enough listening. But here's the next question. What should you actually",
        "textdich": ""
    },
    {
        "start": 883.68,
        "end": 897.279,
        "text": "listen to every day? Because not all listening is useful. Some listening is just noise. And that's exactly what we",
        "textdich": ""
    },
    {
        "start": 894.0,
        "end": 906.8,
        "text": "will talk about in the next chapter. So now you know how the brain learns. But what should you actually listen to every",
        "textdich": ""
    },
    {
        "start": 902.56,
        "end": 914.48,
        "text": "day? Chapter 3. The fastest input method. Listening that actually works.",
        "textdich": ""
    },
    {
        "start": 911.12,
        "end": 927.68,
        "text": "All right. So now that we understand how your brain learns, let's talk about the fastest way to actually give your brain the input it needs. Listening.",
        "textdich": ""
    },
    {
        "start": 924.48,
        "end": 934.399,
        "text": "Honestly, this is the gamecher for anyone who wants to improve English fast.",
        "textdich": ""
    },
    {
        "start": 931.519,
        "end": 944.399,
        "text": "You see, most learners spend too much time trying to speak before they have listened enough. They jump into conversations,",
        "textdich": ""
    },
    {
        "start": 941.12,
        "end": 953.519,
        "text": "read a book, or memorize vocabulary lists, but their brain doesn't have a clear map yet. It's like trying to drive",
        "textdich": ""
    },
    {
        "start": 951.199,
        "end": 961.519,
        "text": "a car without knowing where the roads are. Listening is that map.",
        "textdich": ""
    },
    {
        "start": 958.56,
        "end": 967.68,
        "text": "Listening shows your brain the road, the rhythm, the sounds, and the patterns.",
        "textdich": ""
    },
    {
        "start": 964.639,
        "end": 973.44,
        "text": "Without it, speaking will always feel difficult, slow or awkward.",
        "textdich": ""
    },
    {
        "start": 971.519,
        "end": 987.759,
        "text": "Now, here's the first secret about listening. You need easy input. Easy input means listening to English that is simple, slow, and familiar. Not",
        "textdich": ""
    },
    {
        "start": 984.399,
        "end": 1002.88,
        "text": "complicated news, not movies with fast conversations and slang. Not podcasts full of unfamiliar words. I know. I know. You might think, \"But movies are",
        "textdich": ""
    },
    {
        "start": 999.12,
        "end": 1016.32,
        "text": "fun. I want to understand them.\" And that's okay. We all want fun. But at the beginning, your brain gets tired and confused with too much information.",
        "textdich": ""
    },
    {
        "start": 1012.88,
        "end": 1024.319,
        "text": "Instead, start with short sentences, slow speech, and topics you already know.",
        "textdich": ""
    },
    {
        "start": 1021.04,
        "end": 1034.88,
        "text": "For example, a short story about daily life, a conversation about food, or even a simple description of someone's day.",
        "textdich": ""
    },
    {
        "start": 1032.0,
        "end": 1044.4,
        "text": "Your brain will start noticing patterns, words, and pronunciation without feeling overwhelmed.",
        "textdich": ""
    },
    {
        "start": 1040.559,
        "end": 1047.76,
        "text": "And here comes another important point.",
        "textdich": ""
    },
    {
        "start": 1044.4,
        "end": 1051.76,
        "text": "Repetition without boredom.",
        "textdich": ""
    },
    {
        "start": 1047.76,
        "end": 1061.36,
        "text": "Yes, repetition is the secret. Listen again and again. I know it might feel boring at first, but here's the trick.",
        "textdich": ""
    },
    {
        "start": 1058.72,
        "end": 1066.96,
        "text": "Don't just listen mindlessly. Listen with understanding.",
        "textdich": ""
    },
    {
        "start": 1063.44,
        "end": 1077.44,
        "text": "Try to notice one new word, one sound, or one sentence structure each time. The first time, just hear the words. The",
        "textdich": ""
    },
    {
        "start": 1074.24,
        "end": 1080.32,
        "text": "second time, try to catch the meaning.",
        "textdich": ""
    },
    {
        "start": 1077.44,
        "end": 1089.28,
        "text": "The third time, maybe repeat it softly with your voice. By the fourth time, your brain will have absorbed much more",
        "textdich": ""
    },
    {
        "start": 1086.16,
        "end": 1101.679,
        "text": "than you realize. It's amazing how much we can learn this way. Honestly, the brain loves repetition. It builds confidence, vocabulary, and",
        "textdich": ""
    },
    {
        "start": 1098.4,
        "end": 1104.48,
        "text": "pronunciation all at once.",
        "textdich": ""
    },
    {
        "start": 1101.679,
        "end": 1115.919,
        "text": "Speaking of pronunciation, listening every day actually improves it naturally. When your brain hears the correct sounds over and over, your mouth",
        "textdich": ""
    },
    {
        "start": 1113.36,
        "end": 1130.08,
        "text": "starts to copy without you thinking about it. You will start saying words correctly without worrying about rules or stress marks. That's the beauty of",
        "textdich": ""
    },
    {
        "start": 1125.76,
        "end": 1136.4,
        "text": "easy input. Your vocabulary grows too because you remember words in context.",
        "textdich": ""
    },
    {
        "start": 1133.28,
        "end": 1141.76,
        "text": "You don't need to memorize lists. You learn words as part of real sentences.",
        "textdich": ""
    },
    {
        "start": 1139.52,
        "end": 1152.24,
        "text": "And this makes speaking much easier later. Now, let's make it practical. How can you listen every day without it",
        "textdich": ""
    },
    {
        "start": 1148.64,
        "end": 1156.64,
        "text": "being hard or boring? Small routines are the key.",
        "textdich": ""
    },
    {
        "start": 1153.919,
        "end": 1167.6,
        "text": "Listen while walking in the park, while cooking, or even before sleeping. 10 or 15 minutes a day is enough if you do it consistently.",
        "textdich": ""
    },
    {
        "start": 1165.12,
        "end": 1172.72,
        "text": "Maybe in the morning, you listen to a short story or conversation.",
        "textdich": ""
    },
    {
        "start": 1170.4,
        "end": 1182.72,
        "text": "In the afternoon, repeat it while relaxing. At night, you can listen again while resting. Your brain doesn't get",
        "textdich": ""
    },
    {
        "start": 1179.039,
        "end": 1192.64,
        "text": "tired with this small repeated input. It actually enjoys it. And guess what? Over time, English starts sounding familiar,",
        "textdich": ""
    },
    {
        "start": 1189.52,
        "end": 1198.32,
        "text": "like a friend you recognize. And here's something very important.",
        "textdich": ""
    },
    {
        "start": 1194.96,
        "end": 1201.679,
        "text": "It's okay if you feel confused at first.",
        "textdich": ""
    },
    {
        "start": 1198.32,
        "end": 1204.24,
        "text": "Honestly, this is completely normal.",
        "textdich": ""
    },
    {
        "start": 1201.679,
        "end": 1213.52,
        "text": "When you start listening, you might hear words and feel, \"I don't understand anything.\" That's okay. Your brain is picking up",
        "textdich": ""
    },
    {
        "start": 1211.28,
        "end": 1223.6,
        "text": "patterns even if your conscious mind doesn't realize it yet. Over time, the confusion disappears.",
        "textdich": ""
    },
    {
        "start": 1219.52,
        "end": 1229.12,
        "text": "Your brain slowly organizes the sounds, sentences, and meanings.",
        "textdich": ""
    },
    {
        "start": 1226.32,
        "end": 1236.799,
        "text": "You might even notice that some words suddenly make sense almost magically.",
        "textdich": ""
    },
    {
        "start": 1233.44,
        "end": 1239.6,
        "text": "That is how learning actually works.",
        "textdich": ""
    },
    {
        "start": 1236.799,
        "end": 1245.44,
        "text": "Another thing to remember, speaking comes naturally after enough listening.",
        "textdich": ""
    },
    {
        "start": 1242.96,
        "end": 1254.799,
        "text": "Don't rush it. Don't pressure yourself to speak perfectly at first. Your brain needs to have enough input before your",
        "textdich": ""
    },
    {
        "start": 1251.12,
        "end": 1260.72,
        "text": "mouth can catch up. The more you listen, the more confident you become.",
        "textdich": ""
    },
    {
        "start": 1257.679,
        "end": 1271.44,
        "text": "Then when you start speaking, words flow more easily, sentences feel natural and your voice becomes more comfortable.",
        "textdich": ""
    },
    {
        "start": 1267.52,
        "end": 1275.12,
        "text": "You see, listening is not just passive.",
        "textdich": ""
    },
    {
        "start": 1271.44,
        "end": 1279.039,
        "text": "It's active training for speaking.",
        "textdich": ""
    },
    {
        "start": 1275.12,
        "end": 1293.44,
        "text": "So let's summarize. Easy input, repetition without boredom, short daily routines, and patience. Listen, understand, repeat, and enjoy the process.",
        "textdich": ""
    },
    {
        "start": 1290.559,
        "end": 1300.96,
        "text": "Over time, pronunciation, vocabulary, and confidence improve together.",
        "textdich": ""
    },
    {
        "start": 1298.08,
        "end": 1312.72,
        "text": "Small steps every day lead to big results. Your brain is working quietly in the background, preparing you to speak naturally.",
        "textdich": ""
    },
    {
        "start": 1309.84,
        "end": 1319.2,
        "text": "Once English starts sounding familiar in your ears, something amazing happens.",
        "textdich": ""
    },
    {
        "start": 1316.24,
        "end": 1323.2,
        "text": "You start wanting to speak.",
        "textdich": ""
    },
    {
        "start": 1319.2,
        "end": 1334.88,
        "text": "Suddenly speaking feels fun, exciting, and even a little addictive. And that, my friend, is when the real progress begins.",
        "textdich": ""
    },
    {
        "start": 1331.28,
        "end": 1340.559,
        "text": "Chapter 4. How to start speaking without fear or shame.",
        "textdich": ""
    },
    {
        "start": 1337.2,
        "end": 1351.76,
        "text": "Okay, so now we've listened enough and your brain is starting to recognize English words and patterns. That's amazing, right? But here comes the next",
        "textdich": ""
    },
    {
        "start": 1349.039,
        "end": 1358.24,
        "text": "step, the one that scares almost everyone. Speaking.",
        "textdich": ""
    },
    {
        "start": 1354.88,
        "end": 1369.44,
        "text": "Honestly, I know how it feels. You've probably thought I can understand some English, but when I try to speak, I freeze. I feel embarrassed. I make",
        "textdich": ""
    },
    {
        "start": 1367.84,
        "end": 1372.72,
        "text": "mistakes.",
        "textdich": ""
    },
    {
        "start": 1369.44,
        "end": 1377.039,
        "text": "Maybe I'm just not good at speaking.",
        "textdich": ""
    },
    {
        "start": 1372.72,
        "end": 1380.159,
        "text": "I get it. You are not alone.",
        "textdich": ""
    },
    {
        "start": 1377.039,
        "end": 1384.159,
        "text": "Almost every beginner feels this way.",
        "textdich": ""
    },
    {
        "start": 1380.159,
        "end": 1393.2,
        "text": "And guess what? It's okay. Really, here's something important. Speaking does not start with conversations.",
        "textdich": ""
    },
    {
        "start": 1390.159,
        "end": 1404.4,
        "text": "That's right. You don't need a friend, a teacher, or a perfect environment to start speaking. Speaking starts with talking to yourself. Yep. Talking to",
        "textdich": ""
    },
    {
        "start": 1402.88,
        "end": 1406.48,
        "text": "yourself.",
        "textdich": ""
    },
    {
        "start": 1404.4,
        "end": 1412.48,
        "text": "Sounds strange maybe, but it works.",
        "textdich": ""
    },
    {
        "start": 1409.6,
        "end": 1415.52,
        "text": "Imagine describing your room out loud.",
        "textdich": ""
    },
    {
        "start": 1412.48,
        "end": 1425.679,
        "text": "You could say, \"My room is small. There is a table. On the table, there is a book. I like this book. It is interesting.",
        "textdich": ""
    },
    {
        "start": 1422.88,
        "end": 1437.36,
        "text": "Simple, right? And you are already practicing English in a safe, comfortable space. No one is judging you. No one is listening.",
        "textdich": ""
    },
    {
        "start": 1434.32,
        "end": 1445.2,
        "text": "You are free to make mistakes and your brain is learning every single word.",
        "textdich": ""
    },
    {
        "start": 1441.44,
        "end": 1448.159,
        "text": "Another technique is called shadowing.",
        "textdich": ""
    },
    {
        "start": 1445.2,
        "end": 1457.2,
        "text": "Shadowing means listening and repeating at the same time. For example, if you hear a sentence like, \"I like to drink",
        "textdich": ""
    },
    {
        "start": 1454.72,
        "end": 1470.32,
        "text": "coffee in the morning,\" you repeat it softly after the speaker or even at the same time. It doesn't need to be perfect. You don't need to stress about",
        "textdich": ""
    },
    {
        "start": 1466.24,
        "end": 1480.72,
        "text": "pronunciation or grammar at first. Just follow the sounds, follow the rhythm, and your mouth and brain will start moving together.",
        "textdich": ""
    },
    {
        "start": 1477.919,
        "end": 1491.039,
        "text": "Honestly, this is one of the fastest ways to improve speaking because it combines listening and speaking naturally.",
        "textdich": ""
    },
    {
        "start": 1488.0,
        "end": 1495.76,
        "text": "Daily self-t talk is another simple but powerful technique.",
        "textdich": ""
    },
    {
        "start": 1493.44,
        "end": 1508.64,
        "text": "You can talk about your day, your feelings, or even small things around you. For example, today is sunny. I am happy. I am",
        "textdich": ""
    },
    {
        "start": 1505.279,
        "end": 1513.6,
        "text": "drinking water. I like water. I am learning English.",
        "textdich": ""
    },
    {
        "start": 1510.559,
        "end": 1521.2,
        "text": "Don't worry if it sounds silly. The goal is not to impress anyone. The goal is to train your brain and mouth to work in",
        "textdich": ""
    },
    {
        "start": 1518.559,
        "end": 1531.2,
        "text": "English. Over time, these simple sentences grow longer. Your vocabulary grows naturally and your confidence increases.",
        "textdich": ""
    },
    {
        "start": 1528.72,
        "end": 1535.84,
        "text": "Now, let's talk about fear and embarrassment.",
        "textdich": ""
    },
    {
        "start": 1532.799,
        "end": 1549.44,
        "text": "I know these feelings are real. Maybe you tried to speak before and someone corrected you or maybe you felt shy or maybe you just froze. That's normal.",
        "textdich": ""
    },
    {
        "start": 1546.159,
        "end": 1561.679,
        "text": "Honestly, everyone has felt it. But here's the thing. Mistakes are part of learning. They are proof that you are improving. Every mistake teaches your",
        "textdich": ""
    },
    {
        "start": 1558.32,
        "end": 1573.52,
        "text": "brain something new. Every sentence you say, even if it's not perfect, is training your brain and your mouth to speak English comfortably.",
        "textdich": ""
    },
    {
        "start": 1569.679,
        "end": 1582.159,
        "text": "Fluency is not about speed. It's not about speaking like a native in the first month. Fluency is about comfort.",
        "textdich": ""
    },
    {
        "start": 1580.08,
        "end": 1595.2,
        "text": "It's about being able to say what you want without fear, without stress, and without stopping yourself. You might start slowly. That's okay. You might",
        "textdich": ""
    },
    {
        "start": 1592.24,
        "end": 1598.48,
        "text": "repeat the same sentence 10 times.",
        "textdich": ""
    },
    {
        "start": 1595.2,
        "end": 1608.64,
        "text": "That's okay, too. Each repetition makes your brain stronger. Each attempt makes you braver. And each sentence moves you",
        "textdich": ""
    },
    {
        "start": 1604.88,
        "end": 1622.08,
        "text": "closer to real speaking. Remember, pauses are natural. It's okay to pause, think, and then speak. In fact, pausing helps your brain organize words and",
        "textdich": ""
    },
    {
        "start": 1619.2,
        "end": 1635.52,
        "text": "sentences, and gentle encouragement works wonders. Tell yourself, \"It's okay. Really, I am learning.\" Celebrate small victories like saying a",
        "textdich": ""
    },
    {
        "start": 1632.799,
        "end": 1647.6,
        "text": "sentence without translating it or using a new word correctly. These little moments are the top spikes in your journey. They make learning exciting and",
        "textdich": ""
    },
    {
        "start": 1644.559,
        "end": 1661.2,
        "text": "keep you motivated. By practicing self-talk, shadowing, and simple daily conversations with yourself, you create a safe environment for speaking.",
        "textdich": ""
    },
    {
        "start": 1657.6,
        "end": 1665.36,
        "text": "You remove fear, embarrassment, and past failures.",
        "textdich": ""
    },
    {
        "start": 1662.799,
        "end": 1670.4,
        "text": "You train your brain and mouth to work together. And here's something amazing.",
        "textdich": ""
    },
    {
        "start": 1668.64,
        "end": 1682.0,
        "text": "When you connect speaking with listening, the techniques we learned in the last chapter, vocabulary grows naturally. You don't need to memorize",
        "textdich": ""
    },
    {
        "start": 1678.96,
        "end": 1688.399,
        "text": "long lists. Words come to you in context. Sentences feel familiar.",
        "textdich": ""
    },
    {
        "start": 1685.6,
        "end": 1696.799,
        "text": "Speaking starts to feel fun instead of scary. So by now you see the pattern.",
        "textdich": ""
    },
    {
        "start": 1692.64,
        "end": 1701.12,
        "text": "Listen first. Repeat. Talk to yourself.",
        "textdich": ""
    },
    {
        "start": 1696.799,
        "end": 1704.72,
        "text": "Make mistakes. Repeat again. Enjoy the process.",
        "textdich": ""
    },
    {
        "start": 1702.72,
        "end": 1715.279,
        "text": "Your brain and mouth are learning together step by step. Slowly but surely, you will speak with confidence.",
        "textdich": ""
    },
    {
        "start": 1712.0,
        "end": 1727.279,
        "text": "And the best part, once listening and speaking work together, vocabulary stops being a problem. words start appearing naturally in your",
        "textdich": ""
    },
    {
        "start": 1724.0,
        "end": 1732.24,
        "text": "speech because your brain has already heard them in context.",
        "textdich": ""
    },
    {
        "start": 1729.919,
        "end": 1740.96,
        "text": "And that's exactly what we will talk about in the next chapter. How to grow your vocabulary without memorizing just",
        "textdich": ""
    },
    {
        "start": 1738.32,
        "end": 1745.919,
        "text": "by connecting, listening and speaking naturally.",
        "textdich": ""
    },
    {
        "start": 1743.2,
        "end": 1752.08,
        "text": "When you listen and speak together, vocabulary stops being a problem.",
        "textdich": ""
    },
    {
        "start": 1750.0,
        "end": 1759.76,
        "text": "Chapter 5, how to build vocabulary without memorizing.",
        "textdich": ""
    },
    {
        "start": 1757.039,
        "end": 1768.399,
        "text": "Okay, so now that you are listening and speaking more comfortably, the next question is, what about vocabulary?",
        "textdich": ""
    },
    {
        "start": 1766.559,
        "end": 1776.96,
        "text": "How do you learn enough words to actually communicate without spending hours memorizing lists?",
        "textdich": ""
    },
    {
        "start": 1774.0,
        "end": 1791.6,
        "text": "Honestly, this is where many learners get frustrated. They think I need to know thousands of words or I can't speak. And yes, vocabulary is important.",
        "textdich": ""
    },
    {
        "start": 1788.24,
        "end": 1805.44,
        "text": "But here's the good news. You don't need thousands of words to speak well. You just need the right words, the words you use, and repeated exposure.",
        "textdich": ""
    },
    {
        "start": 1801.6,
        "end": 1810.159,
        "text": "That's it. The first secret is guessing meaning from context.",
        "textdich": ""
    },
    {
        "start": 1807.919,
        "end": 1821.039,
        "text": "You don't need to check the dictionary for every word you hear or see. Instead, try to understand words from the",
        "textdich": ""
    },
    {
        "start": 1817.36,
        "end": 1832.88,
        "text": "situation or the surrounding words. For example, imagine you hear someone say, \"I'm exhausted after work.\" If you don't know exhausted, think about",
        "textdich": ""
    },
    {
        "start": 1830.72,
        "end": 1835.279,
        "text": "the situation.",
        "textdich": ""
    },
    {
        "start": 1832.88,
        "end": 1840.96,
        "text": "Someone just finished work. They are probably very tired.",
        "textdich": ""
    },
    {
        "start": 1837.52,
        "end": 1846.48,
        "text": "So you can guess that exhausted means really really tired.",
        "textdich": ""
    },
    {
        "start": 1843.84,
        "end": 1849.6,
        "text": "Simple, right?",
        "textdich": ""
    },
    {
        "start": 1846.48,
        "end": 1856.08,
        "text": "Your brain remembers meaning much faster when you connect it to a real situation.",
        "textdich": ""
    },
    {
        "start": 1853.44,
        "end": 1860.399,
        "text": "Another method is using surrounding words.",
        "textdich": ""
    },
    {
        "start": 1857.6,
        "end": 1873.36,
        "text": "Let's say you read the movie was hilarious. Everyone laughed a lot. If you don't know hilarious, notice the word laughed and everyone.",
        "textdich": ""
    },
    {
        "start": 1870.399,
        "end": 1884.159,
        "text": "You can guess that hilarious means very funny. Again, no dictionary needed. Your brain learns words faster when it sees",
        "textdich": ""
    },
    {
        "start": 1881.039,
        "end": 1892.559,
        "text": "or hears them in context. And the more times you encounter the word in different sentences, the stronger it sticks.",
        "textdich": ""
    },
    {
        "start": 1890.399,
        "end": 1897.12,
        "text": "Now, here's something amazing.",
        "textdich": ""
    },
    {
        "start": 1892.559,
        "end": 1899.679,
        "text": "Memorization is slow, but usage is fast.",
        "textdich": ""
    },
    {
        "start": 1897.12,
        "end": 1910.0,
        "text": "You might spend hours trying to memorize 50 new words, but after a week, half of them are gone. That's normal. Don't feel",
        "textdich": ""
    },
    {
        "start": 1906.48,
        "end": 1913.279,
        "text": "bad about it. It happens to everyone.",
        "textdich": ""
    },
    {
        "start": 1910.0,
        "end": 1925.84,
        "text": "The trick is to use words naturally in speaking or writing. Even a simple sentence like I am exhausted today or that movie was hilarious helps your",
        "textdich": ""
    },
    {
        "start": 1922.88,
        "end": 1928.399,
        "text": "brain remember the word permanently.",
        "textdich": ""
    },
    {
        "start": 1925.84,
        "end": 1933.44,
        "text": "Each time you use it, the memory strengthens.",
        "textdich": ""
    },
    {
        "start": 1929.919,
        "end": 1936.88,
        "text": "Repetition through usage is the key.",
        "textdich": ""
    },
    {
        "start": 1933.44,
        "end": 1939.84,
        "text": "Let's talk about daily life examples.",
        "textdich": ""
    },
    {
        "start": 1936.88,
        "end": 1952.96,
        "text": "Words you hear while listening, words you repeat while talking to yourself, words you notice while reading, they all become your vocabulary naturally.",
        "textdich": ""
    },
    {
        "start": 1949.84,
        "end": 1960.32,
        "text": "For example, you might hear delicious many times while listening to stories about food.",
        "textdich": ""
    },
    {
        "start": 1957.76,
        "end": 1967.36,
        "text": "Then when you describe your lunch, you say, \"This cake is delicious.\" Boom.",
        "textdich": ""
    },
    {
        "start": 1964.88,
        "end": 1972.88,
        "text": "That word is now part of your active vocabulary.",
        "textdich": ""
    },
    {
        "start": 1969.039,
        "end": 1982.72,
        "text": "No lists, no memorizing, just natural learning. And guess what? Forgetting is completely normal.",
        "textdich": ""
    },
    {
        "start": 1979.6,
        "end": 1994.32,
        "text": "Honestly, your brain sometimes seems tricky. You might learn a word today, forget it tomorrow, and then suddenly remember it later in a conversation.",
        "textdich": ""
    },
    {
        "start": 1991.2,
        "end": 2002.559,
        "text": "That's actually good. It means your brain is organizing information and reinforcing connections.",
        "textdich": ""
    },
    {
        "start": 1999.76,
        "end": 2011.279,
        "text": "Words come back stronger after a few repetitions, especially if you use them in real situations.",
        "textdich": ""
    },
    {
        "start": 2008.159,
        "end": 2020.72,
        "text": "So, don't panic when you forget. Keep listening, keep speaking, and words will stick. Here's another spike. You really",
        "textdich": ""
    },
    {
        "start": 2018.64,
        "end": 2026.159,
        "text": "don't need to know every word in English to speak confidently.",
        "textdich": ""
    },
    {
        "start": 2022.96,
        "end": 2035.76,
        "text": "Most daily conversations use only a few hundred words. The secret is frequency and usefulness.",
        "textdich": ""
    },
    {
        "start": 2031.919,
        "end": 2037.919,
        "text": "Focus on words you hear and use often.",
        "textdich": ""
    },
    {
        "start": 2035.76,
        "end": 2047.36,
        "text": "Learn them naturally through listening and speaking. Your vocabulary will grow faster than any memorization method ever",
        "textdich": ""
    },
    {
        "start": 2043.84,
        "end": 2056.399,
        "text": "could. This is empowering, right? You feel in control, not overwhelmed by endless lists or complex dictionaries.",
        "textdich": ""
    },
    {
        "start": 2054.32,
        "end": 2069.839,
        "text": "Now, I know some of you might feel stressed when you see long word lists or complicated lessons online. I get it. It can feel impossible.",
        "textdich": ""
    },
    {
        "start": 2066.72,
        "end": 2080.639,
        "text": "But here's the emotional truth. Your brain is already learning in a smarter way. Listening, repeating, self-talking,",
        "textdich": ""
    },
    {
        "start": 2077.44,
        "end": 2094.8,
        "text": "and using words in context is far more effective than memorizing dozens of words a day. Slow, natural growth is better than fast, forced memorization.",
        "textdich": ""
    },
    {
        "start": 2091.599,
        "end": 2103.04,
        "text": "Trust the process. Celebrate each word you actually use, not just the words you see on a list.",
        "textdich": ""
    },
    {
        "start": 2100.48,
        "end": 2108.64,
        "text": "Finally, let's prepare for the last chapter.",
        "textdich": ""
    },
    {
        "start": 2104.88,
        "end": 2115.04,
        "text": "By now, you know the steps. Listen, repeat, talk, and learn words naturally.",
        "textdich": ""
    },
    {
        "start": 2112.079,
        "end": 2120.0,
        "text": "But here's the big question. How do you make all of this consistent?",
        "textdich": ""
    },
    {
        "start": 2117.599,
        "end": 2130.8,
        "text": "How do you ensure that listening, speaking, and vocabulary building happen every day without losing motivation or forgetting?",
        "textdich": ""
    },
    {
        "start": 2127.52,
        "end": 2145.68,
        "text": "Consistency is the real secret and that is exactly what we will cover in the next chapter. So remember, guess words from context, use words naturally.",
        "textdich": ""
    },
    {
        "start": 2141.599,
        "end": 2148.56,
        "text": "Repeat and don't worry about forgetting.",
        "textdich": ""
    },
    {
        "start": 2145.68,
        "end": 2153.2,
        "text": "You don't need thousands of words, just the right words.",
        "textdich": ""
    },
    {
        "start": 2150.8,
        "end": 2167.28,
        "text": "Your brain is learning faster than you think. And with consistency, your English will continue to improve step by step every day.",
        "textdich": ""
    },
    {
        "start": 2164.0,
        "end": 2176.72,
        "text": "Now you know what to do. But the final question is how to stay consistent.",
        "textdich": ""
    },
    {
        "start": 2172.8,
        "end": 2182.16,
        "text": "Chapter 6. The simple daily system that makes English stick.",
        "textdich": ""
    },
    {
        "start": 2179.359,
        "end": 2193.92,
        "text": "Okay, my friend. We've reached the final step. Everything we've talked about so far, listening, speaking, building vocabulary",
        "textdich": ""
    },
    {
        "start": 2190.0,
        "end": 2206.24,
        "text": "now comes together. And the best part, you don't need complicated schedules, long hours, or expensive courses. What you need is a simple daily system.",
        "textdich": ""
    },
    {
        "start": 2203.359,
        "end": 2211.76,
        "text": "Something you can do every day, step by step, without pressure.",
        "textdich": ""
    },
    {
        "start": 2209.2,
        "end": 2223.44,
        "text": "Honestly, this is the part that makes English improvement inevitable if you stick with it. Let's start with the routine. Keep it small, short, and",
        "textdich": ""
    },
    {
        "start": 2220.079,
        "end": 2231.92,
        "text": "consistent. For example, you might begin your day by listening to a short English story, maybe 5 or 10 minutes. Don't",
        "textdich": ""
    },
    {
        "start": 2229.359,
        "end": 2235.119,
        "text": "worry about understanding everything.",
        "textdich": ""
    },
    {
        "start": 2231.92,
        "end": 2239.92,
        "text": "Just notice the sounds, the rhythm, the words.",
        "textdich": ""
    },
    {
        "start": 2236.8,
        "end": 2246.72,
        "text": "Then take a few minutes to repeat shadowing or softly talking to yourself.",
        "textdich": ""
    },
    {
        "start": 2243.76,
        "end": 2253.119,
        "text": "Describe your day, your room, or your feelings in simple sentences.",
        "textdich": ""
    },
    {
        "start": 2249.52,
        "end": 2263.44,
        "text": "This is your speaking practice. Then during the day, listen again while walking, cooking or relaxing.",
        "textdich": ""
    },
    {
        "start": 2260.0,
        "end": 2268.96,
        "text": "And finally, before sleeping, play a short audio again.",
        "textdich": ""
    },
    {
        "start": 2266.0,
        "end": 2281.76,
        "text": "The repetition helps your brain organize everything naturally without stress. The key here is short time every day.",
        "textdich": ""
    },
    {
        "start": 2278.32,
        "end": 2291.359,
        "text": "10 or 15 minutes might sound small, but done consistently, it's more powerful than 1 hour once a week.",
        "textdich": ""
    },
    {
        "start": 2287.599,
        "end": 2294.56,
        "text": "Your brain loves repeated exposure.",
        "textdich": ""
    },
    {
        "start": 2291.359,
        "end": 2306.88,
        "text": "Think of it like planting seeds. You water them a little every day and slowly the roots grow deep. You don't try to grow a tree in one day. It takes",
        "textdich": ""
    },
    {
        "start": 2302.64,
        "end": 2310.96,
        "text": "patience. English is exactly the same.",
        "textdich": ""
    },
    {
        "start": 2306.88,
        "end": 2315.44,
        "text": "Small daily actions build real lasting fluency.",
        "textdich": ""
    },
    {
        "start": 2313.04,
        "end": 2319.839,
        "text": "Now, let's talk about patience and trust.",
        "textdich": ""
    },
    {
        "start": 2317.28,
        "end": 2329.68,
        "text": "Honestly, learning English is not about rushing. It's about trusting your brain. trusting your process and enjoying the",
        "textdich": ""
    },
    {
        "start": 2326.72,
        "end": 2338.079,
        "text": "journey. You might not notice big changes every day and that's okay.",
        "textdich": ""
    },
    {
        "start": 2333.839,
        "end": 2348.0,
        "text": "Small improvements add up. Maybe today you understand one new word. Tomorrow you use it in a sentence. The next week",
        "textdich": ""
    },
    {
        "start": 2345.599,
        "end": 2353.44,
        "text": "you speak a short conversation with confidence.",
        "textdich": ""
    },
    {
        "start": 2349.52,
        "end": 2357.52,
        "text": "Little by little, step by step, progress becomes visible.",
        "textdich": ""
    },
    {
        "start": 2355.599,
        "end": 2369.359,
        "text": "And when you look back after a few months, wow, you'll be amazed at how far you've come. Emotional encouragement is very important here. I want you to",
        "textdich": ""
    },
    {
        "start": 2367.2,
        "end": 2383.28,
        "text": "picture yourself speaking English confidently one day. Imagine ordering food in a restaurant, talking with friends, or even giving a short presentation",
        "textdich": ""
    },
    {
        "start": 2379.44,
        "end": 2386.72,
        "text": "all in English. How does that feel?",
        "textdich": ""
    },
    {
        "start": 2383.28,
        "end": 2398.56,
        "text": "Exciting, freeing. You can reach that point. Really, you can. Every short listening session, every self-t talk moment, every repeated sentence is a",
        "textdich": ""
    },
    {
        "start": 2395.68,
        "end": 2402.32,
        "text": "step toward that future. Celebrate it.",
        "textdich": ""
    },
    {
        "start": 2398.56,
        "end": 2405.76,
        "text": "Feel proud. Believe in yourself.",
        "textdich": ""
    },
    {
        "start": 2402.32,
        "end": 2412.56,
        "text": "Another tip, relax and enjoy the process. Don't stress about mistakes.",
        "textdich": ""
    },
    {
        "start": 2409.28,
        "end": 2421.839,
        "text": "Don't stress about forgetting. Mistakes mean learning. Forgetting means your brain is organizing knowledge. Enjoy the",
        "textdich": ""
    },
    {
        "start": 2419.119,
        "end": 2431.44,
        "text": "little victories. Pronouncing a word correctly, understanding a sentence, or speaking without translating.",
        "textdich": ""
    },
    {
        "start": 2427.92,
        "end": 2438.24,
        "text": "These moments are the top spikes, the exciting moments that keep you motivated.",
        "textdich": ""
    },
    {
        "start": 2435.2,
        "end": 2443.44,
        "text": "Notice them, feel them, and let them energize your learning.",
        "textdich": ""
    },
    {
        "start": 2440.96,
        "end": 2458.24,
        "text": "Let's summarize the system one more time. Listen every day, repeat and shadow. Talk to yourself. Use words naturally and relax.",
        "textdich": ""
    },
    {
        "start": 2454.72,
        "end": 2464.24,
        "text": "Small sessions repeated consistently lead to unstoppable improvement.",
        "textdich": ""
    },
    {
        "start": 2461.599,
        "end": 2472.8,
        "text": "Your brain is learning quietly in the background even when you feel tired or distracted.",
        "textdich": ""
    },
    {
        "start": 2469.359,
        "end": 2481.359,
        "text": "Consistency beats intensity. Comfort beats perfection. Enjoyment beats pressure.",
        "textdich": ""
    },
    {
        "start": 2478.56,
        "end": 2490.88,
        "text": "Here's the final spike. The thing I really want you to remember. Improvement is inevitable if you follow this system.",
        "textdich": ""
    },
    {
        "start": 2488.319,
        "end": 2502.96,
        "text": "Honestly, if you keep listening, speaking, and using words every day, your English will grow. You might not notice it minute by minute, but over",
        "textdich": ""
    },
    {
        "start": 2499.92,
        "end": 2512.319,
        "text": "weeks and months, your confidence, vocabulary, pronunciation, and fluency will skyrocket.",
        "textdich": ""
    },
    {
        "start": 2509.28,
        "end": 2523.119,
        "text": "It's not magic. It's the brain working exactly as it should. So now take a deep breath and imagine your English future.",
        "textdich": ""
    },
    {
        "start": 2520.64,
        "end": 2532.0,
        "text": "You speaking comfortably. You understanding naturally. You thinking in English without translating.",
        "textdich": ""
    },
    {
        "start": 2529.2,
        "end": 2545.599,
        "text": "That future is real and it is waiting for you. Start with small steps today. 5 10 15 minutes of listening and speaking.",
        "textdich": ""
    },
    {
        "start": 2542.0,
        "end": 2551.44,
        "text": "Trust yourself. Trust the process and watch your English grow.",
        "textdich": ""
    },
    {
        "start": 2548.079,
        "end": 2562.48,
        "text": "Remember, English is a skill, not a subject. Skills are learned by doing every day. Small, consistent practice is",
        "textdich": ""
    },
    {
        "start": 2558.88,
        "end": 2568.56,
        "text": "your secret weapon. Believe in it, enjoy it, and keep going.",
        "textdich": ""
    },
    {
        "start": 2565.839,
        "end": 2577.119,
        "text": "If this video helped you even just a little, please give it a like. It really supports the channel and helps me create",
        "textdich": ""
    },
    {
        "start": 2574.72,
        "end": 2590.0,
        "text": "more helpful content for learners like you. And don't forget to subscribe to the channel because here we learn English step by step, slowly, simply,",
        "textdich": ""
    },
    {
        "start": 2587.44,
        "end": 2592.4,
        "text": "and naturally.",
        "textdich": ""
    },
    {
        "start": 2590.0,
        "end": 2602.0,
        "text": "Every video is designed to help you improve without stress, without pressure, and without feeling overwhelmed.",
        "textdich": ""
    },
    {
        "start": 2598.4,
        "end": 2604.0,
        "text": "I also want you to comment below.",
        "textdich": ""
    },
    {
        "start": 2602.0,
        "end": 2613.68,
        "text": "Tell me where you are learning English from. What part of this video was most helpful or which step felt hardest for",
        "textdich": ""
    },
    {
        "start": 2610.16,
        "end": 2623.28,
        "text": "you? Your comments inspire me and help other learners, too. Remember, you don't need to be perfect. English is a",
        "textdich": ""
    },
    {
        "start": 2619.92,
        "end": 2634.319,
        "text": "journey, not a race. The most important thing is to keep going every day in small steps. Even 10 minutes a day adds",
        "textdich": ""
    },
    {
        "start": 2630.64,
        "end": 2643.599,
        "text": "up to big progress over time. You are capable, you are learning, and your English will improve if you stay consistent.",
        "textdich": ""
    },
    {
        "start": 2640.88,
        "end": 2649.359,
        "text": "So, take one small action today. Listen, repeat, speak, and keep moving forward.",
        "textdich": ""
    },
    {
        "start": 2645.76,
        "end": 2658.48,
        "text": "You've got this. My name is Ariel, and today I want to tell you a small story about English and daily habits. Let me",
        "textdich": ""
    },
    {
        "start": 2655.359,
        "end": 2668.079,
        "text": "start with a simple idea. If you have a plant in your room and you give it water only one time in a month, what will",
        "textdich": ""
    },
    {
        "start": 2664.24,
        "end": 2681.839,
        "text": "happen? The plant will slowly die. But if you give it a little water every day, it will grow strong and green. Your English is the same. English is not",
        "textdich": ""
    },
    {
        "start": 2677.68,
        "end": 2693.04,
        "text": "magic. English is not talent. English is a habit. Many people ask me, Ariel, why am I not improving? I study sometimes,",
        "textdich": ""
    },
    {
        "start": 2689.839,
        "end": 2707.92,
        "text": "but my English is still weak. And my answer is always simple. because sometimes is not enough. English needs every day, even a little, even 5 minutes.",
        "textdich": ""
    },
    {
        "start": 2705.359,
        "end": 2718.48,
        "text": "When I was learning English, I was not smart. I was not special. I was just consistent. I made English part of my",
        "textdich": ""
    },
    {
        "start": 2715.599,
        "end": 2722.88,
        "text": "daily life, like eating food or checking my phone.",
        "textdich": ""
    },
    {
        "start": 2720.24,
        "end": 2730.56,
        "text": "Today I want to share with you seven daily habits to learn English every day.",
        "textdich": ""
    },
    {
        "start": 2727.359,
        "end": 2739.92,
        "text": "These habits are simple. You do not need money. You do not need a teacher next to you. You just need your phone, your",
        "textdich": ""
    },
    {
        "start": 2736.079,
        "end": 2753.04,
        "text": "ears, your mouth, and your heart. Habit one is reading a little every day. Not big books, not hard books, just small and easy things.",
        "textdich": ""
    },
    {
        "start": 2749.119,
        "end": 2756.24,
        "text": "When I started, I read one short story.",
        "textdich": ""
    },
    {
        "start": 2753.04,
        "end": 2759.04,
        "text": "Sometimes only one paragraph.",
        "textdich": ""
    },
    {
        "start": 2756.24,
        "end": 2769.599,
        "text": "Sometimes just English comments under a video. Reading shows you how English lives. You see how words walk together.",
        "textdich": ""
    },
    {
        "start": 2766.24,
        "end": 2779.52,
        "text": "You see how sentences breathe. When you read every day, your brain slowly learns patterns. You start to feel what sounds",
        "textdich": ""
    },
    {
        "start": 2776.48,
        "end": 2790.24,
        "text": "right. You do not need to understand every word. Just read and enjoy. When you see a new word, you can write it in",
        "textdich": ""
    },
    {
        "start": 2786.88,
        "end": 2802.88,
        "text": "a small notebook or in your phone. Later you will see this word again and again and again. That is how learning becomes natural.",
        "textdich": ""
    },
    {
        "start": 2799.68,
        "end": 2811.599,
        "text": "Habit two is listening to English every day. Listening is like opening a window.",
        "textdich": ""
    },
    {
        "start": 2808.0,
        "end": 2813.68,
        "text": "English comes inside without pressure.",
        "textdich": ""
    },
    {
        "start": 2811.599,
        "end": 2824.24,
        "text": "You do not need to sit straight and study hard. You can listen while walking, cooking, cleaning, or resting.",
        "textdich": ""
    },
    {
        "start": 2821.52,
        "end": 2831.839,
        "text": "When you listen every day, your ear becomes friendly with English sounds.",
        "textdich": ""
    },
    {
        "start": 2827.839,
        "end": 2834.079,
        "text": "At first, English may sound fast.",
        "textdich": ""
    },
    {
        "start": 2831.839,
        "end": 2837.119,
        "text": "Words may mix.",
        "textdich": ""
    },
    {
        "start": 2834.079,
        "end": 2848.24,
        "text": "That is okay. Your brain is still learning in the background. I used to listen to simple podcasts and slow videos.",
        "textdich": ""
    },
    {
        "start": 2844.319,
        "end": 2850.8,
        "text": "Sometimes I understood only 10%.",
        "textdich": ""
    },
    {
        "start": 2848.24,
        "end": 2856.24,
        "text": "But I did not stop.",
        "textdich": ""
    },
    {
        "start": 2850.8,
        "end": 2859.68,
        "text": "After some weeks 10 became 20, then 50.",
        "textdich": ""
    },
    {
        "start": 2856.24,
        "end": 2870.4,
        "text": "Listening teaches you real English, not book English. You learn how people really speak. Habit three is speaking",
        "textdich": ""
    },
    {
        "start": 2866.88,
        "end": 2880.56,
        "text": "even when you feel scared. Many learners wait. They say, \"I will speak when my English is perfect.\" But perfect never",
        "textdich": ""
    },
    {
        "start": 2877.28,
        "end": 2891.2,
        "text": "comes. Speaking is like learning to ride a bicycle. You will fall. You will feel shy. But that is part of the process. I",
        "textdich": ""
    },
    {
        "start": 2888.16,
        "end": 2902.079,
        "text": "talked to myself a lot. I spoke in my room. I described my day in English. I made mistakes, many mistakes. But every",
        "textdich": ""
    },
    {
        "start": 2898.96,
        "end": 2911.92,
        "text": "mistake was a step forward. When you speak every day, your mouth learns English. Your brain learns speed.",
        "textdich": ""
    },
    {
        "start": 2907.92,
        "end": 2914.559,
        "text": "Confidence grows slowly like a sunrise.",
        "textdich": ""
    },
    {
        "start": 2911.92,
        "end": 2924.64,
        "text": "Habit four is writing something every day. Writing helps you slow down. It helps you see your English clearly.",
        "textdich": ""
    },
    {
        "start": 2921.599,
        "end": 2928.16,
        "text": "You do not need to write long stories.",
        "textdich": ""
    },
    {
        "start": 2924.64,
        "end": 2930.8,
        "text": "Just three simple sentences are enough.",
        "textdich": ""
    },
    {
        "start": 2928.16,
        "end": 2942.8,
        "text": "Write about your day. Write what you feel. Write what you see. When you write, you touch English with your hands. You remember words better. You",
        "textdich": ""
    },
    {
        "start": 2939.839,
        "end": 2945.52,
        "text": "understand sentence order better.",
        "textdich": ""
    },
    {
        "start": 2942.8,
        "end": 2956.64,
        "text": "Sometimes you will see your mistakes and that is good. Mistakes are teachers not enemies. Habit five is learning a few",
        "textdich": ""
    },
    {
        "start": 2952.559,
        "end": 2966.72,
        "text": "new words every day. Not many, just a few. Five words are enough. Words are like bricks. With a few bricks every",
        "textdich": ""
    },
    {
        "start": 2963.68,
        "end": 2976.8,
        "text": "day, you can build a strong house. When you learn a word, do not just memorize it. Use it. Make a sentence. Say it out",
        "textdich": ""
    },
    {
        "start": 2973.52,
        "end": 2982.88,
        "text": "loud. Write it. Meet the word like a friend.",
        "textdich": ""
    },
    {
        "start": 2978.16,
        "end": 2986.4,
        "text": "When you meet it again, you will smile.",
        "textdich": ""
    },
    {
        "start": 2982.88,
        "end": 2995.599,
        "text": "Habit six is thinking in English. This habit changed everything for me. When you think in your own language and",
        "textdich": ""
    },
    {
        "start": 2991.839,
        "end": 3005.76,
        "text": "translate, English feels heavy. But when you think directly in English, English feels light. Start small. Look at things",
        "textdich": ""
    },
    {
        "start": 3002.8,
        "end": 3018.24,
        "text": "around you and name them in English. chair, phone, window. Plan your day in English inside your head. Slowly English becomes your second voice, not a",
        "textdich": ""
    },
    {
        "start": 3016.48,
        "end": 3021.28,
        "text": "translation.",
        "textdich": ""
    },
    {
        "start": 3018.24,
        "end": 3024.72,
        "text": "Habit seven is consistency.",
        "textdich": ""
    },
    {
        "start": 3021.28,
        "end": 3030.319,
        "text": "This is the heart of everything. Doing a little every day is powerful.",
        "textdich": ""
    },
    {
        "start": 3027.76,
        "end": 3043.52,
        "text": "15 minutes every day is better than 2 hours once a week. When you are consistent, English becomes normal. Not scary, not heavy, just normal.",
        "textdich": ""
    },
    {
        "start": 3040.72,
        "end": 3054.96,
        "text": "Some days you will feel tired. Some days you will feel slow, but you still show up. That is how change happens. English",
        "textdich": ""
    },
    {
        "start": 3050.64,
        "end": 3063.599,
        "text": "is not a race. It is a daily walk. If you walk every day, one day you will look back and see how far you have come.",
        "textdich": ""
    },
    {
        "start": 3061.2,
        "end": 3066.96,
        "text": "This is my story.",
        "textdich": ""
    },
    {
        "start": 3063.599,
        "end": 3080.0,
        "text": "This is my message to you. If you make these seven habits part of your daily life, English will change for you slowly, quietly, and forever.",
        "textdich": ""
    },
    {
        "start": 3078.319,
        "end": 3085.04,
        "text": "Thank you for staying with me, my friend.",
        "textdich": ""
    },
    {
        "start": 3081.599,
        "end": 3088.079,
        "text": "Let us continue this story together.",
        "textdich": ""
    },
    {
        "start": 3085.04,
        "end": 3096.319,
        "text": "When I talk about daily habits, I am not talking about pressure or stress.",
        "textdich": ""
    },
    {
        "start": 3091.28,
        "end": 3098.8,
        "text": "I am talking about kindness to yourself.",
        "textdich": ""
    },
    {
        "start": 3096.319,
        "end": 3106.64,
        "text": "Many learners think learning English means pain, fear, and long study hours.",
        "textdich": ""
    },
    {
        "start": 3103.04,
        "end": 3116.0,
        "text": "But that idea is wrong. English can be soft. English can be friendly. When you wake up in the morning and open your",
        "textdich": ""
    },
    {
        "start": 3112.24,
        "end": 3125.92,
        "text": "phone, you already have time. That small time can become English time. You do not need to change your whole life. You only",
        "textdich": ""
    },
    {
        "start": 3122.88,
        "end": 3129.119,
        "text": "need to change small moments.",
        "textdich": ""
    },
    {
        "start": 3125.92,
        "end": 3139.28,
        "text": "I remember when I started, I felt lazy many days. I did not feel motivated. But I learned one important truth.",
        "textdich": ""
    },
    {
        "start": 3136.079,
        "end": 3153.2,
        "text": "Motivation comes after action not before. When you start doing something small, your energy follows you. That is why daily habits are so powerful.",
        "textdich": ""
    },
    {
        "start": 3149.359,
        "end": 3165.68,
        "text": "Habit one, reading slowly becomes part of your eyes. One day you notice something interesting. You start guessing meanings. You stop translating",
        "textdich": ""
    },
    {
        "start": 3161.44,
        "end": 3173.839,
        "text": "every word. Your eyes move faster. You feel less tired. That is growth.",
        "textdich": ""
    },
    {
        "start": 3170.16,
        "end": 3188.72,
        "text": "Habit two, listening becomes background music in your life. English sounds stop feeling strange. You start recognizing words without effort. You hear a",
        "textdich": ""
    },
    {
        "start": 3184.24,
        "end": 3197.44,
        "text": "sentence and think, \"Hey, I know this.\" That moment feels amazing. It gives you hope.",
        "textdich": ""
    },
    {
        "start": 3193.839,
        "end": 3207.92,
        "text": "Habit three, speaking, starts changing how you see yourself. At first, your voice shakes, your sentences break, but",
        "textdich": ""
    },
    {
        "start": 3204.96,
        "end": 3214.48,
        "text": "every time you speak, something inside you becomes stronger.",
        "textdich": ""
    },
    {
        "start": 3210.64,
        "end": 3227.92,
        "text": "One day you speak without fear. You speak without thinking too much. That day you realize you are becoming an English speaker, not just an English",
        "textdich": ""
    },
    {
        "start": 3222.88,
        "end": 3234.48,
        "text": "learner. Habit four, writing helps your mind become organized.",
        "textdich": ""
    },
    {
        "start": 3230.72,
        "end": 3246.0,
        "text": "Before your thoughts were messy, but now you can put ideas into sentences. You can explain yourself. You can express feelings.",
        "textdich": ""
    },
    {
        "start": 3242.8,
        "end": 3250.88,
        "text": "Writing teaches patience. It teaches clarity.",
        "textdich": ""
    },
    {
        "start": 3247.68,
        "end": 3264.48,
        "text": "When you write every day, even a little, your English becomes cleaner. Habit five, learning words becomes fun when you stop forcing yourself.",
        "textdich": ""
    },
    {
        "start": 3260.8,
        "end": 3269.52,
        "text": "Words stop feeling like enemies. They become tools.",
        "textdich": ""
    },
    {
        "start": 3266.4,
        "end": 3281.04,
        "text": "You start collecting them slowly. You review them at night. You smile when you see them again. Your vocabulary grows quietly like a tree growing roots",
        "textdich": ""
    },
    {
        "start": 3279.04,
        "end": 3284.64,
        "text": "underground.",
        "textdich": ""
    },
    {
        "start": 3281.04,
        "end": 3297.92,
        "text": "Habit six, thinking in English, feels strange at first. Your brain resists. It wants comfort. But if you keep going, something magical happens. English",
        "textdich": ""
    },
    {
        "start": 3295.359,
        "end": 3301.28,
        "text": "thoughts appear automatically.",
        "textdich": ""
    },
    {
        "start": 3297.92,
        "end": 3303.52,
        "text": "You do not push them. They just come.",
        "textdich": ""
    },
    {
        "start": 3301.28,
        "end": 3316.4,
        "text": "That is when English becomes part of your identity. Habit seven, consistency protects all the other habits. Without consistency,",
        "textdich": ""
    },
    {
        "start": 3312.8,
        "end": 3326.8,
        "text": "everything breaks. With consistency, even weak effort becomes strong. I want you to understand something very important. Missing one day is not",
        "textdich": ""
    },
    {
        "start": 3325.28,
        "end": 3330.48,
        "text": "failure.",
        "textdich": ""
    },
    {
        "start": 3326.8,
        "end": 3336.88,
        "text": "Quitting is failure. If one day you feel tired and do nothing, forgive yourself.",
        "textdich": ""
    },
    {
        "start": 3333.839,
        "end": 3350.64,
        "text": "Come back the next day. Learning English is like building a relationship. Some days are good, some days are quiet, but you stay. You do not leave.",
        "textdich": ""
    },
    {
        "start": 3347.359,
        "end": 3361.359,
        "text": "I also want to tell you about time. Many people say they do not have time. But time is not found. Time is created. You",
        "textdich": ""
    },
    {
        "start": 3358.24,
        "end": 3369.76,
        "text": "create time when you choose English over scrolling. When you choose listening over silence.",
        "textdich": ""
    },
    {
        "start": 3366.319,
        "end": 3373.68,
        "text": "When you choose reading over waiting.",
        "textdich": ""
    },
    {
        "start": 3369.76,
        "end": 3376.799,
        "text": "Even 5 minutes before sleep matters.",
        "textdich": ""
    },
    {
        "start": 3373.68,
        "end": 3379.04,
        "text": "Your brain loves repetition.",
        "textdich": ""
    },
    {
        "start": 3376.799,
        "end": 3386.64,
        "text": "When English visits your brain every day, your brain opens the door wider.",
        "textdich": ""
    },
    {
        "start": 3383.119,
        "end": 3392.16,
        "text": "Slowly. English feels familiar, friendly, safe.",
        "textdich": ""
    },
    {
        "start": 3389.52,
        "end": 3403.839,
        "text": "I want you to imagine yourself one year from now. You are listening to English without subtitles. You are speaking without fear. You are understanding",
        "textdich": ""
    },
    {
        "start": 3401.2,
        "end": 3418.72,
        "text": "jokes. You are thinking in English naturally. That future is not far. That future is built by small habits today, not tomorrow. today.",
        "textdich": ""
    },
    {
        "start": 3415.599,
        "end": 3421.92,
        "text": "Do not wait for confidence.",
        "textdich": ""
    },
    {
        "start": 3418.72,
        "end": 3432.319,
        "text": "Confidence comes from action. Do not wait for perfect English. Perfect English does not exist. Real English exists.",
        "textdich": ""
    },
    {
        "start": 3429.04,
        "end": 3440.16,
        "text": "I am not telling you to be perfect. I am telling you to be consistent. When you practice daily, you respect yourself.",
        "textdich": ""
    },
    {
        "start": 3438.24,
        "end": 3455.359,
        "text": "You tell yourself that your dreams matter. You tell yourself that you are capable and you are. If you ever feel lost, come back to these habits. Read a",
        "textdich": ""
    },
    {
        "start": 3451.599,
        "end": 3466.24,
        "text": "little, listen a little, speak a little, write a little, learn a few words. Think in English. Stay consistent.",
        "textdich": ""
    },
    {
        "start": 3462.799,
        "end": 3469.839,
        "text": "That is enough. That is powerful.",
        "textdich": ""
    },
    {
        "start": 3466.24,
        "end": 3482.079,
        "text": "This journey belongs to you. Walk it at your own speed. Just do not stop. I am really happy you are still here, my friend, because staying is already a",
        "textdich": ""
    },
    {
        "start": 3480.16,
        "end": 3484.96,
        "text": "good habit.",
        "textdich": ""
    },
    {
        "start": 3482.079,
        "end": 3491.92,
        "text": "Let me take you deeper into this journey and make it feel more real for you.",
        "textdich": ""
    },
    {
        "start": 3488.88,
        "end": 3505.68,
        "text": "Many learners think improvement must be loud and fast, but real progress is quiet. It happens when nobody is watching. It happens in your room with",
        "textdich": ""
    },
    {
        "start": 3502.16,
        "end": 3508.16,
        "text": "your phone with your thoughts.",
        "textdich": ""
    },
    {
        "start": 3505.68,
        "end": 3515.44,
        "text": "One day you suddenly understand a sentence that you did not understand before.",
        "textdich": ""
    },
    {
        "start": 3512.559,
        "end": 3520.4,
        "text": "One day you reply in English without planning.",
        "textdich": ""
    },
    {
        "start": 3517.359,
        "end": 3523.2,
        "text": "That is not luck.",
        "textdich": ""
    },
    {
        "start": 3520.4,
        "end": 3528.16,
        "text": "That is the result of daily habits working together.",
        "textdich": ""
    },
    {
        "start": 3525.599,
        "end": 3537.44,
        "text": "When you read every day, your brain starts building a map of English. You stop seeing words as separate pieces.",
        "textdich": ""
    },
    {
        "start": 3534.799,
        "end": 3548.96,
        "text": "You start seeing meaning. When you listen every day, your ears learn rhythm. English has music. Stress flow.",
        "textdich": ""
    },
    {
        "start": 3545.52,
        "end": 3558.96,
        "text": "Listening teaches that music. Even if you do not repeat, your brain is copying sounds quietly. When you speak every",
        "textdich": ""
    },
    {
        "start": 3555.599,
        "end": 3570.559,
        "text": "day, even for one minute, your mouth learns courage. Speaking is not only about language. It is about emotion.",
        "textdich": ""
    },
    {
        "start": 3566.16,
        "end": 3583.839,
        "text": "Fear lives in silence. Confidence grows in action. Every time you speak, fear becomes smaller. Writing every day gives you control.",
        "textdich": ""
    },
    {
        "start": 3580.24,
        "end": 3589.68,
        "text": "When thoughts stay only in your head, they feel confusing.",
        "textdich": ""
    },
    {
        "start": 3586.16,
        "end": 3592.4,
        "text": "When you write them, they become clear.",
        "textdich": ""
    },
    {
        "start": 3589.68,
        "end": 3597.04,
        "text": "Writing shows you that you already know more than you think.",
        "textdich": ""
    },
    {
        "start": 3594.799,
        "end": 3609.52,
        "text": "Many learners are stronger than they believe. They just do not give themselves a chance. Learning words daily gives you keys. Each word opens a",
        "textdich": ""
    },
    {
        "start": 3606.88,
        "end": 3622.079,
        "text": "small door. One word helps you understand one sentence. 10 words help you understand a story. Words connect everything.",
        "textdich": ""
    },
    {
        "start": 3617.92,
        "end": 3626.319,
        "text": "But remember words love repetition.",
        "textdich": ""
    },
    {
        "start": 3622.079,
        "end": 3631.52,
        "text": "Use them, speak them, write them, meet them again and again.",
        "textdich": ""
    },
    {
        "start": 3629.28,
        "end": 3641.52,
        "text": "Thinking in English is like switching a light inside your mind. At first the light is weak. Then it becomes brighter.",
        "textdich": ""
    },
    {
        "start": 3639.04,
        "end": 3650.48,
        "text": "When you think in English, you stop fighting your brain. You allow English to live naturally.",
        "textdich": ""
    },
    {
        "start": 3647.119,
        "end": 3655.44,
        "text": "You stop translating life. You start living it in English.",
        "textdich": ""
    },
    {
        "start": 3652.96,
        "end": 3667.359,
        "text": "Consistency is the habit that keeps you moving. When motivation sleeps, motivation is emotional. It comes and goes. Consistency is a decision. It",
        "textdich": ""
    },
    {
        "start": 3665.839,
        "end": 3670.16,
        "text": "stays.",
        "textdich": ""
    },
    {
        "start": 3667.359,
        "end": 3681.359,
        "text": "Some days you will feel bored. Some days you will feel slow. But you still do something small. That small action is powerful.",
        "textdich": ""
    },
    {
        "start": 3678.88,
        "end": 3696.4,
        "text": "I want to tell you a secret that helped me. I stopped asking do I feel like studying? I started asking what is the smallest thing I can do today? One",
        "textdich": ""
    },
    {
        "start": 3692.4,
        "end": 3708.559,
        "text": "sentence, one minute, one word. That question removes pressure. It makes learning easy. When learning feels easy, you do it again tomorrow. That is how",
        "textdich": ""
    },
    {
        "start": 3706.319,
        "end": 3711.119,
        "text": "habits are born.",
        "textdich": ""
    },
    {
        "start": 3708.559,
        "end": 3716.16,
        "text": "I also want you to change how you talk to yourself.",
        "textdich": ""
    },
    {
        "start": 3712.88,
        "end": 3728.0,
        "text": "Do not say my English is bad. Say my English is growing. Words shape your identity. When you call yourself a learner, you allow mistakes.",
        "textdich": ""
    },
    {
        "start": 3725.119,
        "end": 3731.92,
        "text": "When you call yourself bad, you create fear.",
        "textdich": ""
    },
    {
        "start": 3729.52,
        "end": 3735.119,
        "text": "Be kind to yourself.",
        "textdich": ""
    },
    {
        "start": 3731.92,
        "end": 3741.44,
        "text": "You are learning a new skill, a big skill.",
        "textdich": ""
    },
    {
        "start": 3736.64,
        "end": 3744.319,
        "text": "Language is not small. Language is life.",
        "textdich": ""
    },
    {
        "start": 3741.44,
        "end": 3759.04,
        "text": "You are doing something brave. You are stepping out of comfort that deserves respect. I remember days when I felt stupid, I felt slow, I felt behind.",
        "textdich": ""
    },
    {
        "start": 3754.96,
        "end": 3770.96,
        "text": "But I kept going and slowly English started to answer me. I started understanding without trying. I started speaking without fear.",
        "textdich": ""
    },
    {
        "start": 3768.4,
        "end": 3781.839,
        "text": "It did not happen in one week. It happened because I showed up every day even on bad days. Especially on bad days, I want you to build a simple",
        "textdich": ""
    },
    {
        "start": 3780.319,
        "end": 3785.92,
        "text": "routine.",
        "textdich": ""
    },
    {
        "start": 3781.839,
        "end": 3791.04,
        "text": "Not a perfect routine, a real one. Maybe in the morning you read for 5 minutes.",
        "textdich": ""
    },
    {
        "start": 3788.88,
        "end": 3803.68,
        "text": "Maybe in the afternoon you listen while walking. Maybe at night you write three sentences. That is enough. Do not compare your journey with others.",
        "textdich": ""
    },
    {
        "start": 3800.48,
        "end": 3807.359,
        "text": "Everyone starts at a different place.",
        "textdich": ""
    },
    {
        "start": 3803.68,
        "end": 3821.68,
        "text": "Comparison steals joy. Focus builds skill. Your only competition is yesterday you. If today you do one small thing more than yesterday, you are",
        "textdich": ""
    },
    {
        "start": 3817.28,
        "end": 3831.359,
        "text": "winning. English is not about speed. It is about direction. As long as you are moving forward, you are doing it right.",
        "textdich": ""
    },
    {
        "start": 3828.24,
        "end": 3841.52,
        "text": "One day you will help someone else. One day you will speak freely. One day you will smile and remember this moment. And",
        "textdich": ""
    },
    {
        "start": 3837.839,
        "end": 3845.52,
        "text": "you will be proud you did not quit.",
        "textdich": ""
    },
    {
        "start": 3841.52,
        "end": 3848.48,
        "text": "My friend, this story is not just words.",
        "textdich": ""
    },
    {
        "start": 3845.52,
        "end": 3862.96,
        "text": "It is a mirror. I want you to see yourself in it. You are capable. You are learning. You are becoming better every day. Stay with me. Stay with bookish",
        "textdich": ""
    },
    {
        "start": 3860.079,
        "end": 3875.359,
        "text": "English. We are walking this path together. I am glad you are still listening my friend because listening is also a habit and you are practicing it",
        "textdich": ""
    },
    {
        "start": 3872.24,
        "end": 3885.68,
        "text": "right now. Let me tell you something very real. Many people start learning English with excitement but they stop",
        "textdich": ""
    },
    {
        "start": 3881.68,
        "end": 3897.76,
        "text": "when things become slow. They think slow means wrong. But slow does not mean wrong. Slow means deep. Slow means real.",
        "textdich": ""
    },
    {
        "start": 3895.039,
        "end": 3904.16,
        "text": "When you learn English every day, even slowly, your brain is changing shape.",
        "textdich": ""
    },
    {
        "start": 3901.28,
        "end": 3910.24,
        "text": "New connections are growing. New paths are opening. You may not see it today.",
        "textdich": ""
    },
    {
        "start": 3907.52,
        "end": 3912.88,
        "text": "You may not feel it tomorrow.",
        "textdich": ""
    },
    {
        "start": 3910.24,
        "end": 3921.44,
        "text": "But one day, suddenly you understand more. Suddenly, you speak better.",
        "textdich": ""
    },
    {
        "start": 3917.359,
        "end": 3923.92,
        "text": "That is the power of daily habits.",
        "textdich": ""
    },
    {
        "start": 3921.44,
        "end": 3936.079,
        "text": "I want you to imagine English as a friend who visits you every day. If your friend comes every day, even for 5 minutes, you become close. If your",
        "textdich": ""
    },
    {
        "start": 3934.0,
        "end": 3942.72,
        "text": "friend comes once a month for many hours, the connection is weak.",
        "textdich": ""
    },
    {
        "start": 3939.52,
        "end": 3946.24,
        "text": "English loves small daily meetings.",
        "textdich": ""
    },
    {
        "start": 3942.72,
        "end": 3949.52,
        "text": "Reading every day builds familiarity.",
        "textdich": ""
    },
    {
        "start": 3946.24,
        "end": 3952.64,
        "text": "Listening every day builds comfort.",
        "textdich": ""
    },
    {
        "start": 3949.52,
        "end": 3955.839,
        "text": "Speaking every day builds courage.",
        "textdich": ""
    },
    {
        "start": 3952.64,
        "end": 3958.319,
        "text": "Writing every day builds clarity.",
        "textdich": ""
    },
    {
        "start": 3955.839,
        "end": 3962.079,
        "text": "Learning words every day builds strength.",
        "textdich": ""
    },
    {
        "start": 3959.839,
        "end": 3972.799,
        "text": "Thinking in English every day builds speed. Consistency every day builds identity. One habit supports the other.",
        "textdich": ""
    },
    {
        "start": 3969.68,
        "end": 3976.0,
        "text": "Together they create change.",
        "textdich": ""
    },
    {
        "start": 3972.799,
        "end": 3989.2,
        "text": "I want to talk about fear because many learners carry fear inside. Fear of mistakes. Fear of sounding stupid. Fear of being judged.",
        "textdich": ""
    },
    {
        "start": 3986.0,
        "end": 3992.559,
        "text": "Let me tell you something important.",
        "textdich": ""
    },
    {
        "start": 3989.2,
        "end": 4006.24,
        "text": "Nobody speaks perfect English. Not even native speakers. They forget words. They make mistakes. They change sentences in the middle. That is normal.",
        "textdich": ""
    },
    {
        "start": 4002.079,
        "end": 4008.88,
        "text": "Language is alive. It is not perfect.",
        "textdich": ""
    },
    {
        "start": 4006.24,
        "end": 4022.88,
        "text": "When you accept this, fear becomes smaller. When fear becomes smaller, speaking becomes easier. When speaking becomes easier, learning becomes faster.",
        "textdich": ""
    },
    {
        "start": 4020.319,
        "end": 4025.52,
        "text": "Everything is connected.",
        "textdich": ""
    },
    {
        "start": 4022.88,
        "end": 4034.48,
        "text": "I also want you to understand that learning English is not only about English. It is about discipline.",
        "textdich": ""
    },
    {
        "start": 4031.52,
        "end": 4042.559,
        "text": "It is about patience. It is about believing in yourself when results are not visible.",
        "textdich": ""
    },
    {
        "start": 4038.88,
        "end": 4054.24,
        "text": "These skills help you in life too. When you show up for English every day, you are training your mind to stay committed. That commitment will help you",
        "textdich": ""
    },
    {
        "start": 4050.24,
        "end": 4057.52,
        "text": "in work, study, and dreams.",
        "textdich": ""
    },
    {
        "start": 4054.24,
        "end": 4068.48,
        "text": "English becomes a teacher of life. Some days you will feel tired. On those days, reduce your effort, not your habit. Do",
        "textdich": ""
    },
    {
        "start": 4064.48,
        "end": 4072.96,
        "text": "one tiny thing. Listen to one sentence.",
        "textdich": ""
    },
    {
        "start": 4068.48,
        "end": 4082.64,
        "text": "Read one paragraph. Say one word. That keeps the habit alive. Habits die when we stop completely.",
        "textdich": ""
    },
    {
        "start": 4078.559,
        "end": 4084.64,
        "text": "They grow when we keep them breathing.",
        "textdich": ""
    },
    {
        "start": 4082.64,
        "end": 4094.16,
        "text": "I want you to stop waiting for the perfect mood. The perfect mood is a lie.",
        "textdich": ""
    },
    {
        "start": 4089.68,
        "end": 4107.279,
        "text": "Action creates mood. Start first, feel later. This simple rule can change everything. When you press play on an English video, when you open a short",
        "textdich": ""
    },
    {
        "start": 4103.759,
        "end": 4118.08,
        "text": "text, when you say a sentence out loud, your mind follows you. Energy appears after movement. This is how progress",
        "textdich": ""
    },
    {
        "start": 4114.48,
        "end": 4131.44,
        "text": "works. I also want you to build a safe space for English. A space where mistakes are allowed. A space where learning feels gentle. Your room, your",
        "textdich": ""
    },
    {
        "start": 4127.679,
        "end": 4143.12,
        "text": "phone, your notebook. Make English your friend, not your enemy. When English feels safe, your brain opens. When your",
        "textdich": ""
    },
    {
        "start": 4138.48,
        "end": 4155.199,
        "text": "brain opens, learning flows. Remember, you do not need to understand everything. Understanding grows with time. Trust the process. Trust the",
        "textdich": ""
    },
    {
        "start": 4152.239,
        "end": 4162.239,
        "text": "habits. They work even when you doubt them. I am not here to promise miracles.",
        "textdich": ""
    },
    {
        "start": 4158.96,
        "end": 4172.4,
        "text": "I am here to promise progress. If you follow these seven habits every day, your English will improve. Maybe not in",
        "textdich": ""
    },
    {
        "start": 4168.4,
        "end": 4176.48,
        "text": "one week. Maybe not in one month, but it will improve.",
        "textdich": ""
    },
    {
        "start": 4174.319,
        "end": 4190.96,
        "text": "That is guaranteed because daily practice never fails. Only quitting fails. And you are not a quitter. You are here. You are reading.",
        "textdich": ""
    },
    {
        "start": 4188.56,
        "end": 4194.32,
        "text": "You are continuing.",
        "textdich": ""
    },
    {
        "start": 4190.96,
        "end": 4203.04,
        "text": "That already says something about you. I want you to feel proud of that. Learning English is not easy.",
        "textdich": ""
    },
    {
        "start": 4200.64,
        "end": 4206.4,
        "text": "But it is possible.",
        "textdich": ""
    },
    {
        "start": 4203.04,
        "end": 4211.84,
        "text": "Millions have done it. You can do it too.",
        "textdich": ""
    },
    {
        "start": 4208.0,
        "end": 4222.64,
        "text": "One day English will feel normal. One day you will help others. One day you will remember this journey with a smile.",
        "textdich": ""
    },
    {
        "start": 4218.56,
        "end": 4226.96,
        "text": "Until that day, keep going. One small step every day.",
        "textdich": ""
    },
    {
        "start": 4225.12,
        "end": 4229.04,
        "text": "That is enough.",
        "textdich": ""
    },
    {
        "start": 4226.96,
        "end": 4232.239,
        "text": "That is powerful.",
        "textdich": ""
    },
    {
        "start": 4229.04,
        "end": 4244.08,
        "text": "That is real. I am proud of you for staying with this story, my friend, because staying is how real learners are made. Let me speak to you honestly now",
        "textdich": ""
    },
    {
        "start": 4241.28,
        "end": 4246.8,
        "text": "like a friend sitting next to you.",
        "textdich": ""
    },
    {
        "start": 4244.08,
        "end": 4257.28,
        "text": "Learning English every day is not about being strong all the time. It is about showing up even when you feel weak. Some",
        "textdich": ""
    },
    {
        "start": 4253.84,
        "end": 4265.679,
        "text": "days you will feel excited. Some days you will feel bored. Some days you will feel nothing.",
        "textdich": ""
    },
    {
        "start": 4262.4,
        "end": 4272.32,
        "text": "But you still read a little. You still listen a little. You still try.",
        "textdich": ""
    },
    {
        "start": 4270.08,
        "end": 4278.4,
        "text": "That is what separates learners who succeed from learners who quit.",
        "textdich": ""
    },
    {
        "start": 4275.44,
        "end": 4288.4,
        "text": "When English becomes a habit, it no longer depends on mood. It becomes part of who you are. Just like brushing your",
        "textdich": ""
    },
    {
        "start": 4284.96,
        "end": 4299.199,
        "text": "teeth, you do not ask yourself if you feel motivated to brush your teeth. You just do it. English should become the",
        "textdich": ""
    },
    {
        "start": 4295.04,
        "end": 4308.64,
        "text": "same, a normal part of your life. I want you to stop seeing English as a big mountain. A mountain feels scary.",
        "textdich": ""
    },
    {
        "start": 4304.88,
        "end": 4319.76,
        "text": "Instead, see English as a path. You only need to take one step today, tomorrow another step. That is all. When you read",
        "textdich": ""
    },
    {
        "start": 4316.8,
        "end": 4325.36,
        "text": "every day, even short text, your confidence grows quietly.",
        "textdich": ""
    },
    {
        "start": 4322.64,
        "end": 4335.84,
        "text": "One day you notice you are not afraid of English anymore. When you listen every day, your brain starts predicting words.",
        "textdich": ""
    },
    {
        "start": 4332.88,
        "end": 4344.88,
        "text": "You hear the beginning of a sentence and you already know how it will end. That is understanding.",
        "textdich": ""
    },
    {
        "start": 4341.6,
        "end": 4353.36,
        "text": "When you speak every day, your voice changes. It becomes clearer, stronger.",
        "textdich": ""
    },
    {
        "start": 4349.76,
        "end": 4356.64,
        "text": "You stop hiding. You stop whispering.",
        "textdich": ""
    },
    {
        "start": 4353.36,
        "end": 4369.679,
        "text": "You start trusting yourself. Writing every day helps you respect your thoughts. You learn that your ideas matter. You learn how to express them.",
        "textdich": ""
    },
    {
        "start": 4366.64,
        "end": 4376.719,
        "text": "Learning words every day gives you freedom. You are no longer trapped in silence.",
        "textdich": ""
    },
    {
        "start": 4374.64,
        "end": 4378.719,
        "text": "You can explain.",
        "textdich": ""
    },
    {
        "start": 4376.719,
        "end": 4381.36,
        "text": "You can share.",
        "textdich": ""
    },
    {
        "start": 4378.719,
        "end": 4384.0,
        "text": "You can connect.",
        "textdich": ""
    },
    {
        "start": 4381.36,
        "end": 4394.08,
        "text": "Thinking in English makes everything faster. You stop translating life. You start living it in English. Consistency",
        "textdich": ""
    },
    {
        "start": 4391.52,
        "end": 4401.52,
        "text": "ties everything together like a strong rope. Without it, habits fall apart.",
        "textdich": ""
    },
    {
        "start": 4398.4,
        "end": 4406.239,
        "text": "With it, even weak habits become powerful.",
        "textdich": ""
    },
    {
        "start": 4403.76,
        "end": 4411.6,
        "text": "I want you to understand something very important.",
        "textdich": ""
    },
    {
        "start": 4407.76,
        "end": 4414.56,
        "text": "Progress is not always visible.",
        "textdich": ""
    },
    {
        "start": 4411.6,
        "end": 4425.12,
        "text": "Just because you cannot see change does not mean change is not happening. Seeds grow under the soil before you see",
        "textdich": ""
    },
    {
        "start": 4421.04,
        "end": 4428.4,
        "text": "anything. English grows the same way.",
        "textdich": ""
    },
    {
        "start": 4425.12,
        "end": 4438.719,
        "text": "Trust the work you are doing. Trust your effort. Even when it feels slow, especially when it feels slow.",
        "textdich": ""
    },
    {
        "start": 4436.0,
        "end": 4446.8,
        "text": "I also want to remind you that learning English is not about being better than others.",
        "textdich": ""
    },
    {
        "start": 4443.04,
        "end": 4450.719,
        "text": "It is about being better than yesterday.",
        "textdich": ""
    },
    {
        "start": 4446.8,
        "end": 4455.76,
        "text": "Yesterday you maybe knew 10 words. Today you know 12.",
        "textdich": ""
    },
    {
        "start": 4453.04,
        "end": 4462.719,
        "text": "That is growth. Yesterday you were afraid to speak. Today you tried one sentence.",
        "textdich": ""
    },
    {
        "start": 4460.32,
        "end": 4465.04,
        "text": "That is growth.",
        "textdich": ""
    },
    {
        "start": 4462.719,
        "end": 4468.56,
        "text": "Celebrate small wins.",
        "textdich": ""
    },
    {
        "start": 4465.04,
        "end": 4474.56,
        "text": "Small wins create motivation. Motivation creates consistency.",
        "textdich": ""
    },
    {
        "start": 4470.8,
        "end": 4477.44,
        "text": "Consistency creates results.",
        "textdich": ""
    },
    {
        "start": 4474.56,
        "end": 4480.88,
        "text": "Everything starts small.",
        "textdich": ""
    },
    {
        "start": 4477.44,
        "end": 4489.52,
        "text": "Do not wait for permission to learn. Do not wait for someone to tell you are ready.",
        "textdich": ""
    },
    {
        "start": 4484.88,
        "end": 4497.679,
        "text": "You are ready now. You always were. You just needed to start and you did. I want you to imagine yourself teaching someone",
        "textdich": ""
    },
    {
        "start": 4495.28,
        "end": 4509.84,
        "text": "else English one day. You will understand their fear. You will understand their mistakes because you walked this path because you practiced",
        "textdich": ""
    },
    {
        "start": 4506.08,
        "end": 4513.199,
        "text": "every day because you did not give up.",
        "textdich": ""
    },
    {
        "start": 4509.84,
        "end": 4522.0,
        "text": "That future version of you is real. You are building it right now.",
        "textdich": ""
    },
    {
        "start": 4516.0,
        "end": 4529.6,
        "text": "One habit, one day, one step. Remember English is not a subject. It is a skill.",
        "textdich": ""
    },
    {
        "start": 4526.719,
        "end": 4533.84,
        "text": "Skills grow with use.",
        "textdich": ""
    },
    {
        "start": 4529.6,
        "end": 4540.64,
        "text": "Use English daily. Touch it daily. Let it become familiar. Let it become safe.",
        "textdich": ""
    },
    {
        "start": 4538.159,
        "end": 4544.239,
        "text": "Let it become yours.",
        "textdich": ""
    },
    {
        "start": 4540.64,
        "end": 4554.8,
        "text": "I am here with you. Bookish English is here with you. This journey is long but you are not alone.",
        "textdich": ""
    },
    {
        "start": 4550.719,
        "end": 4560.0,
        "text": "Keep going, keep believing, keep practicing.",
        "textdich": ""
    },
    {
        "start": 4557.84,
        "end": 4571.84,
        "text": "I am really happy you reached this point, my friend, because reaching the end means you did not quit. And that itself is a strong habit.",
        "textdich": ""
    },
    {
        "start": 4568.88,
        "end": 4580.8,
        "text": "Let me slow down and speak to you gently now like a calm voice reminding you why you started.",
        "textdich": ""
    },
    {
        "start": 4577.84,
        "end": 4589.84,
        "text": "Learning English every day is not about changing your life in one night. It is about changing your direction.",
        "textdich": ""
    },
    {
        "start": 4586.88,
        "end": 4599.199,
        "text": "When you choose English today, even for a few minutes, you are choosing a better version of yourself tomorrow.",
        "textdich": ""
    },
    {
        "start": 4595.679,
        "end": 4607.84,
        "text": "Many people dream but few people act daily. You are different. You are here.",
        "textdich": ""
    },
    {
        "start": 4603.679,
        "end": 4610.8,
        "text": "You are reading. That matters.",
        "textdich": ""
    },
    {
        "start": 4607.84,
        "end": 4616.64,
        "text": "I want you to remember that English will not always feel exciting.",
        "textdich": ""
    },
    {
        "start": 4613.6,
        "end": 4621.52,
        "text": "Some days it will feel boring. Some days it will feel hard.",
        "textdich": ""
    },
    {
        "start": 4618.96,
        "end": 4625.44,
        "text": "But those days are the most important days.",
        "textdich": ""
    },
    {
        "start": 4623.199,
        "end": 4632.239,
        "text": "Those are the days when habits are tested.",
        "textdich": ""
    },
    {
        "start": 4627.12,
        "end": 4635.04,
        "text": "If you continue on those days, you win.",
        "textdich": ""
    },
    {
        "start": 4632.239,
        "end": 4641.52,
        "text": "Reading every day will slowly make English feel less scary.",
        "textdich": ""
    },
    {
        "start": 4638.159,
        "end": 4644.56,
        "text": "Words will stop looking like strangers.",
        "textdich": ""
    },
    {
        "start": 4641.52,
        "end": 4647.12,
        "text": "They will start feeling familiar.",
        "textdich": ""
    },
    {
        "start": 4644.56,
        "end": 4658.08,
        "text": "Listening every day will make your ears relaxed. You will stop feeling tired when you hear English. You will start enjoying it.",
        "textdich": ""
    },
    {
        "start": 4655.36,
        "end": 4667.52,
        "text": "Speaking every day will remove fear from your voice. One day you will speak without shaking. Writing every day will",
        "textdich": ""
    },
    {
        "start": 4664.56,
        "end": 4670.08,
        "text": "give you confidence in your thoughts.",
        "textdich": ""
    },
    {
        "start": 4667.52,
        "end": 4674.08,
        "text": "You will learn how to explain yourself clearly.",
        "textdich": ""
    },
    {
        "start": 4671.6,
        "end": 4683.04,
        "text": "Learning words every day will give you power. You will no longer feel stuck when you want to say something. Thinking",
        "textdich": ""
    },
    {
        "start": 4679.76,
        "end": 4688.32,
        "text": "in English will make you faster. You will stop translating.",
        "textdich": ""
    },
    {
        "start": 4685.28,
        "end": 4691.6,
        "text": "You will start responding naturally.",
        "textdich": ""
    },
    {
        "start": 4688.32,
        "end": 4693.92,
        "text": "Consistency will protect all of this.",
        "textdich": ""
    },
    {
        "start": 4691.6,
        "end": 4698.8,
        "text": "Consistency will keep you going when motivation disappears.",
        "textdich": ""
    },
    {
        "start": 4696.4,
        "end": 4703.12,
        "text": "I want you to stop waiting for big results.",
        "textdich": ""
    },
    {
        "start": 4700.48,
        "end": 4716.0,
        "text": "Big results come from small actions repeated many times. 15 minutes a day for 1 year is stronger than 5 hours once a month. English respects effort. It",
        "textdich": ""
    },
    {
        "start": 4712.719,
        "end": 4728.159,
        "text": "always gives back. Maybe not today, maybe not tomorrow, but it always gives back. I want you to build trust with English. Show up every day and English",
        "textdich": ""
    },
    {
        "start": 4725.92,
        "end": 4730.239,
        "text": "will meet you halfway.",
        "textdich": ""
    },
    {
        "start": 4728.159,
        "end": 4740.159,
        "text": "There will be moments when you feel proud. There will be moments when you feel frustrated.",
        "textdich": ""
    },
    {
        "start": 4735.76,
        "end": 4742.08,
        "text": "Both are normal. Do not judge yourself.",
        "textdich": ""
    },
    {
        "start": 4740.159,
        "end": 4745.04,
        "text": "Just continue.",
        "textdich": ""
    },
    {
        "start": 4742.08,
        "end": 4747.28,
        "text": "Be patient with your progress.",
        "textdich": ""
    },
    {
        "start": 4745.04,
        "end": 4751.52,
        "text": "You are not slow.",
        "textdich": ""
    },
    {
        "start": 4747.28,
        "end": 4754.48,
        "text": "You are learning. Speed does not matter.",
        "textdich": ""
    },
    {
        "start": 4751.52,
        "end": 4761.44,
        "text": "Direction matters. Every day you practice, you are moving forward. Even if it feels small.",
        "textdich": ""
    },
    {
        "start": 4759.76,
        "end": 4767.36,
        "text": "I want you to believe something important. You are not bad at English.",
        "textdich": ""
    },
    {
        "start": 4764.719,
        "end": 4771.44,
        "text": "You are just in the process.",
        "textdich": ""
    },
    {
        "start": 4767.36,
        "end": 4779.28,
        "text": "Process means movement. Process means growth. Process means future.",
        "textdich": ""
    },
    {
        "start": 4775.84,
        "end": 4786.4,
        "text": "Never say my English is bad. Say my English is getting better. Words matter.",
        "textdich": ""
    },
    {
        "start": 4783.36,
        "end": 4788.48,
        "text": "The way you talk to yourself matters.",
        "textdich": ""
    },
    {
        "start": 4786.4,
        "end": 4802.0,
        "text": "Encourage yourself like you would encourage a friend. When you fall, stand up gently. When you miss a day, return the next day. Do not punish yourself.",
        "textdich": ""
    },
    {
        "start": 4799.44,
        "end": 4814.56,
        "text": "Learning should not hurt. Learning should feel supportive. Make English your companion. Walk with it daily. Let it be part of your mornings, your",
        "textdich": ""
    },
    {
        "start": 4811.6,
        "end": 4817.84,
        "text": "evenings, your thoughts.",
        "textdich": ""
    },
    {
        "start": 4814.56,
        "end": 4827.36,
        "text": "One day without realizing it, English will feel natural. You will understand more. You will speak more. You will feel",
        "textdich": ""
    },
    {
        "start": 4824.08,
        "end": 4842.48,
        "text": "proud. That day will come because you did not stop. This story you are reading is not just a story. It is a reminder. A reminder that you are capable.",
        "textdich": ""
    },
    {
        "start": 4838.64,
        "end": 4845.36,
        "text": "A reminder that habits change lives.",
        "textdich": ""
    },
    {
        "start": 4842.48,
        "end": 4851.52,
        "text": "A reminder that small daily actions create big futures.",
        "textdich": ""
    },
    {
        "start": 4847.92,
        "end": 4862.159,
        "text": "I am Ariel and this is Bookish English and I believe in you. Stay consistent, stay patient, stay kind to yourself.",
        "textdich": ""
    },
    {
        "start": 4859.28,
        "end": 4871.679,
        "text": "Keep charging your English every day like you charge your phone and one day your English will be full of power. My",
        "textdich": ""
    },
    {
        "start": 4869.12,
        "end": 4874.239,
        "text": "friend, this is almost the end of our journey.",
        "textdich": ""
    }
]