[
    {
        "start": 0.24,
        "end": 4.319,
        "text": "Welcome everyone.",
        "textdich": ""
    },
    {
        "start": 2.24,
        "end": 14.0,
        "text": "Today I'm going to show you how to get addicted to English. Not just for a few days, not just when you're motivated,",
        "textdich": ""
    },
    {
        "start": 11.04,
        "end": 24.4,
        "text": "but permanently for the rest of your life. If you've ever started learning English and then quit. If you've ever",
        "textdich": ""
    },
    {
        "start": 20.08,
        "end": 26.72,
        "text": "felt excited one day but bored the next.",
        "textdich": ""
    },
    {
        "start": 24.4,
        "end": 32.719,
        "text": "If you've ever asked yourself, \"Why can't I stay consistent with English?",
        "textdich": ""
    },
    {
        "start": 29.84,
        "end": 42.8,
        "text": "Why do I always lose interest? Then this video is for you. Because the truth is, it's not your fault. Your brain is not",
        "textdich": ""
    },
    {
        "start": 39.44,
        "end": 50.64,
        "text": "broken. You are not lazy. You've just never been taught how to fall in love with English. This is not a video about",
        "textdich": ""
    },
    {
        "start": 47.6,
        "end": 62.879,
        "text": "grammar or vocabulary. This is a video about rewiring your brain to love English, to crave English, to need English like food, to make English your",
        "textdich": ""
    },
    {
        "start": 60.239,
        "end": 74.24,
        "text": "identity, your lifestyle, your daily obsession. This is not motivation for one day. This is a complete system to make English a permanent part of your",
        "textdich": ""
    },
    {
        "start": 70.56,
        "end": 86.72,
        "text": "life. And I promise you, by the end of this video, you will feel different. You will see English differently and you will say this is the moment my",
        "textdich": ""
    },
    {
        "start": 83.36,
        "end": 97.759,
        "text": "English journey truly began. So listen till the end and subscribe to our channel because this channel is not here to just teach English. It's here to",
        "textdich": ""
    },
    {
        "start": 95.84,
        "end": 101.36,
        "text": "change your relationship with English forever.",
        "textdich": ""
    },
    {
        "start": 99.52,
        "end": 104.64,
        "text": "Let's begin.",
        "textdich": ""
    },
    {
        "start": 101.36,
        "end": 113.04,
        "text": "Part one. Train your brain to love English. If you want to get addicted to English, you must stop treating English",
        "textdich": ""
    },
    {
        "start": 110.0,
        "end": 122.24,
        "text": "like a subject. This is the number one reason people fail. They treat English like mathematics, like science, like",
        "textdich": ""
    },
    {
        "start": 118.479,
        "end": 125.84,
        "text": "homework. But English is not a subject.",
        "textdich": ""
    },
    {
        "start": 122.24,
        "end": 128.72,
        "text": "It's not something you complete or pass.",
        "textdich": ""
    },
    {
        "start": 125.84,
        "end": 139.52,
        "text": "English is a language. And a language is living. It's how we feel. It's how we express our emotions. It's how we understand the world. It's how we",
        "textdich": ""
    },
    {
        "start": 137.04,
        "end": 149.04,
        "text": "connect with people. It's how we show love, fear, anger, joy. And if you treat English like a lifeless subject, your",
        "textdich": ""
    },
    {
        "start": 146.08,
        "end": 152.16,
        "text": "brain will never fall in love with it.",
        "textdich": ""
    },
    {
        "start": 149.04,
        "end": 161.12,
        "text": "So the first step is simple. You must train your brain to love English like a passion, like your favorite movie, like",
        "textdich": ""
    },
    {
        "start": 158.16,
        "end": 166.0,
        "text": "your favorite person, like your favorite food.",
        "textdich": ""
    },
    {
        "start": 162.72,
        "end": 175.04,
        "text": "Step one, change the identity of English in your brain. Ask yourself this question. What does English mean to me?",
        "textdich": ""
    },
    {
        "start": 172.4,
        "end": 180.56,
        "text": "For many learners, the answer is English is difficult. English is confusing.",
        "textdich": ""
    },
    {
        "start": 177.68,
        "end": 190.72,
        "text": "English is scary. English reminds me of failure. English is something I'm not good at. If this is your story, then your brain will always try to escape",
        "textdich": ""
    },
    {
        "start": 187.84,
        "end": 201.28,
        "text": "English. It will run away. It will find distractions. It will find excuses every time. But now, starting today, we change",
        "textdich": ""
    },
    {
        "start": 198.4,
        "end": 212.4,
        "text": "the story. Starting today, you must tell your brain. English is my key to freedom. English is my power. English is my superpower.",
        "textdich": ""
    },
    {
        "start": 210.0,
        "end": 214.799,
        "text": "English is how I will travel the world.",
        "textdich": ""
    },
    {
        "start": 212.4,
        "end": 218.799,
        "text": "English is how I will become confident.",
        "textdich": ""
    },
    {
        "start": 214.799,
        "end": 227.2,
        "text": "English is my future. Say it out loud every day. Repeat it until your brain starts to believe it. Because the truth",
        "textdich": ""
    },
    {
        "start": 224.4,
        "end": 230.64,
        "text": "is the brain learns through emotion and repetition.",
        "textdich": ""
    },
    {
        "start": 228.72,
        "end": 237.12,
        "text": "If you tell it something with emotion again and again, it accepts it as truth.",
        "textdich": ""
    },
    {
        "start": 235.519,
        "end": 246.64,
        "text": "This is how people get addicted to anything. They associate it with pleasure, with power, with identity.",
        "textdich": ""
    },
    {
        "start": 243.28,
        "end": 256.0,
        "text": "Step two, use emotional triggers for English. Here's the most powerful secret of this video. People don't get addicted",
        "textdich": ""
    },
    {
        "start": 252.799,
        "end": 265.28,
        "text": "to things. They get addicted to how those things make them feel. For example, someone who's addicted to their phone.",
        "textdich": ""
    },
    {
        "start": 263.04,
        "end": 267.199,
        "text": "They're not addicted to the phone.",
        "textdich": ""
    },
    {
        "start": 265.28,
        "end": 277.04,
        "text": "They're addicted to the dopamine they feel when they scroll. Same with food, movies, or even love. Now, let's apply",
        "textdich": ""
    },
    {
        "start": 274.08,
        "end": 287.199,
        "text": "this to English. If English makes you feel bored, tired, frustrated, your brain will reject it. But if English makes you feel powerful, excited,",
        "textdich": ""
    },
    {
        "start": 285.68,
        "end": 298.639,
        "text": "inspired, your brain will start to want more of it. So here's what you must do. Create emotional English experiences.",
        "textdich": ""
    },
    {
        "start": 296.32,
        "end": 308.479,
        "text": "How? Listen to English podcasts that inspire you. Watch English movies that make you cry. Read English stories that",
        "textdich": ""
    },
    {
        "start": 304.479,
        "end": 318.72,
        "text": "make you feel love or fear or joy. Speak English while looking at yourself in the mirror and say, \"I am powerful. I am fluent. I am unstoppable.\"",
        "textdich": ""
    },
    {
        "start": 316.72,
        "end": 326.56,
        "text": "Train your brain to connect English with emotion. And slowly your brain will start asking for more English, not",
        "textdich": ""
    },
    {
        "start": 324.24,
        "end": 336.96,
        "text": "because you should, but because it feels good. Step three, use the 321 addicted loop every morning. Here's a daily",
        "textdich": ""
    },
    {
        "start": 334.4,
        "end": 340.56,
        "text": "exercise to start training your brain.",
        "textdich": ""
    },
    {
        "start": 336.96,
        "end": 346.639,
        "text": "The 321 addicted loop takes just 6 minutes, 3 minutes.",
        "textdich": ""
    },
    {
        "start": 343.68,
        "end": 356.639,
        "text": "Watch something inspiring in English. A motivational video, a speech, a story, a scene from your favorite movie. 2",
        "textdich": ""
    },
    {
        "start": 352.72,
        "end": 365.44,
        "text": "minutes. Speak out loud. Repeat what you learned. Shadow it. Try to say it with emotion. Train your mouth plus brain",
        "textdich": ""
    },
    {
        "start": 362.72,
        "end": 378.639,
        "text": "together. One minute. Close your eyes and say, \"English is my future. English is my power. English is who I am.\" Do this every morning before you touch",
        "textdich": ""
    },
    {
        "start": 374.88,
        "end": 380.88,
        "text": "your phone or start your day. Why?",
        "textdich": ""
    },
    {
        "start": 378.639,
        "end": 387.36,
        "text": "Because your brain is most sensitive in the morning. That's when new beliefs enter easily.",
        "textdich": ""
    },
    {
        "start": 385.44,
        "end": 395.36,
        "text": "And if your first emotional experience of the day is English, your brain will start building a new connection. A",
        "textdich": ""
    },
    {
        "start": 392.479,
        "end": 408.0,
        "text": "connection that says, \"I feel good when I speak English.\" And that is how addiction begins. Not from force, but from feeling. Step four, think like a",
        "textdich": ""
    },
    {
        "start": 405.28,
        "end": 418.88,
        "text": "champion. Ask yourself, how does a champion learn a language? Not like a student. A champion learns with purpose, with passion. with a reason, with",
        "textdich": ""
    },
    {
        "start": 416.319,
        "end": 431.199,
        "text": "desire. They don't say I I have to study. They say I want to grow. And the difference between success and failure in English is not your intelligence.",
        "textdich": ""
    },
    {
        "start": 429.199,
        "end": 443.759,
        "text": "It's not your age. It's not your grammar. It's how you feel about English every day. If English feels like pain, your brain will avoid it.",
        "textdich": ""
    },
    {
        "start": 440.479,
        "end": 453.199,
        "text": "If English feels like power, your brain will crave it. Part two, change your environment to English. Let me begin",
        "textdich": ""
    },
    {
        "start": 450.16,
        "end": 458.24,
        "text": "with a powerful truth. Your environment is stronger than your motivation.",
        "textdich": ""
    },
    {
        "start": 456.16,
        "end": 470.72,
        "text": "You may feel excited after watching this video. You may say, \"Yes, I will learn English every day from now.\" But what happens after one week? Your",
        "textdich": ""
    },
    {
        "start": 467.599,
        "end": 481.919,
        "text": "energy goes down. You get busy, you feel lazy and slowly English disappears again. Why? Because your environment pulls you back. If you",
        "textdich": ""
    },
    {
        "start": 480.319,
        "end": 490.96,
        "text": "live in a house where nobody speaks English, if your phone is in your native language, if all your apps, friends, and",
        "textdich": ""
    },
    {
        "start": 487.52,
        "end": 499.28,
        "text": "routines are in your native language, then your environment is designed to kill your English habit. Even if you are",
        "textdich": ""
    },
    {
        "start": 496.4,
        "end": 509.84,
        "text": "highly motivated if your environment doesn't support your goal, you will eventually fail. So what is the solution? You must create an English",
        "textdich": ""
    },
    {
        "start": 506.96,
        "end": 522.719,
        "text": "environment around yourself. Even if you live in a non-English country, yes, it's possible. Yes, you can do it. And I'll now show you exactly how.",
        "textdich": ""
    },
    {
        "start": 519.919,
        "end": 534.56,
        "text": "Step one, turn your phone into an English training machine. Your phone is not just a device. It is a language immersion tool if you use it correctly.",
        "textdich": ""
    },
    {
        "start": 531.68,
        "end": 542.0,
        "text": "Here's what to do. Change your phone's language settings to English. This will train your brain to recognize everyday",
        "textdich": ""
    },
    {
        "start": 539.2,
        "end": 554.0,
        "text": "vocabulary automatically. Rename your apps. For example, WhatsApp, talk, camera, take picture, notes, my English",
        "textdich": ""
    },
    {
        "start": 551.04,
        "end": 562.16,
        "text": "brain. Make your brain see English every time you touch your phone. Delete all apps that waste your time in your native",
        "textdich": ""
    },
    {
        "start": 559.36,
        "end": 569.44,
        "text": "language. Replace them with English learning apps, English podcasts, English YouTube playlists.",
        "textdich": ""
    },
    {
        "start": 567.279,
        "end": 579.2,
        "text": "Use your lock screen wallpaper as a motivational English quote. I speak English confidently.",
        "textdich": ""
    },
    {
        "start": 575.36,
        "end": 582.399,
        "text": "English is my identity. Practice daily.",
        "textdich": ""
    },
    {
        "start": 579.2,
        "end": 589.92,
        "text": "Power daily. This is called passive brain rewiring. You are not studying but your brain is constantly seeing English,",
        "textdich": ""
    },
    {
        "start": 588.0,
        "end": 598.72,
        "text": "feeling English, recognizing English, building new patterns. Over time, your brain begins to expect English.",
        "textdich": ""
    },
    {
        "start": 595.68,
        "end": 602.64,
        "text": "And that's how you build addiction.",
        "textdich": ""
    },
    {
        "start": 598.72,
        "end": 612.399,
        "text": "Step two, create a 247 English audio world. What you listen to affects how you think. Your thoughts come from your ears.",
        "textdich": ""
    },
    {
        "start": 610.08,
        "end": 624.959,
        "text": "So ask yourself what kind of sounds are entering my ears every day. If your day is filled with your native language, then your brain is staying in that",
        "textdich": ""
    },
    {
        "start": 621.68,
        "end": 636.24,
        "text": "world. But if your ears hear English for hours, even if you don't understand every word, even if you're just walking, cleaning, eating, [clears throat]",
        "textdich": ""
    },
    {
        "start": 633.92,
        "end": 645.36,
        "text": "your brain is absorbing the rhythm, sound, flow, structure. It's called passive listening immersion.",
        "textdich": ""
    },
    {
        "start": 642.24,
        "end": 655.12,
        "text": "And this is how babies learn. They hear English for hundreds of hours before they even try to speak. So, let's bring",
        "textdich": ""
    },
    {
        "start": 650.72,
        "end": 657.279,
        "text": "that same magic to your life. Do this.",
        "textdich": ""
    },
    {
        "start": 655.12,
        "end": 662.64,
        "text": "Start every morning with 10 minutes of English audio. Don't check your phone.",
        "textdich": ""
    },
    {
        "start": 660.8,
        "end": 674.88,
        "text": "Just play an English podcast or motivational video. While doing household chores, play English in the background. Cleaning, walking, cooking,",
        "textdich": ""
    },
    {
        "start": 672.0,
        "end": 686.959,
        "text": "waiting in line. Let your environment whisper English into your brain. Go to sleep with English sounds playing softly. Your subconscious will absorb it",
        "textdich": ""
    },
    {
        "start": 683.12,
        "end": 695.36,
        "text": "during rest. Choose voices you enjoy. If the voice is boring, your brain won't listen. If the voice is emotional or",
        "textdich": ""
    },
    {
        "start": 692.16,
        "end": 698.64,
        "text": "interesting, you will stay connected.",
        "textdich": ""
    },
    {
        "start": 695.36,
        "end": 709.36,
        "text": "The goal is simple. Make silence your enemy and English your background. Step three, use the English mirror rule. Let",
        "textdich": ""
    },
    {
        "start": 706.56,
        "end": 717.36,
        "text": "me give you a very powerful trick. Every time you look into a mirror, you must say at least one sentence in English.",
        "textdich": ""
    },
    {
        "start": 714.959,
        "end": 730.16,
        "text": "Why? Because the mirror is something you see many times a day. in your bedroom, bathroom, lift, store, etc. Use it as a trigger.",
        "textdich": ""
    },
    {
        "start": 727.92,
        "end": 737.36,
        "text": "Every time you see your reflection, speak in English. It can be small.",
        "textdich": ""
    },
    {
        "start": 734.24,
        "end": 746.079,
        "text": "I look tired today. I have to finish my English lesson. This shirt looks good on me. I will succeed.",
        "textdich": ""
    },
    {
        "start": 743.12,
        "end": 748.959,
        "text": "This is how you create micro habits.",
        "textdich": ""
    },
    {
        "start": 746.079,
        "end": 754.959,
        "text": "These small repeated actions, they slowly train your brain to make English automatic.",
        "textdich": ""
    },
    {
        "start": 753.12,
        "end": 766.32,
        "text": "The mirror becomes your speaking partner. And most importantly, you're training your brain to speak without fear of judgment.",
        "textdich": ""
    },
    {
        "start": 762.88,
        "end": 771.6,
        "text": "Step four, decorate your physical space with English.",
        "textdich": ""
    },
    {
        "start": 768.399,
        "end": 773.68,
        "text": "Now, let's go beyond the digital world.",
        "textdich": ""
    },
    {
        "start": 771.6,
        "end": 784.0,
        "text": "Let's bring English into your physical world because the things you see every day create your thoughts, emotions, habits.",
        "textdich": ""
    },
    {
        "start": 782.16,
        "end": 788.8,
        "text": "So, you must surround yourself with English.",
        "textdich": ""
    },
    {
        "start": 785.6,
        "end": 798.959,
        "text": "Here's how to do it. Write your favorite English quotes on sticky notes. Put them on your mirror, fridge, door, walls. For",
        "textdich": ""
    },
    {
        "start": 795.44,
        "end": 806.24,
        "text": "example, never give up. I speak English fluently. I am improving every day.",
        "textdich": ""
    },
    {
        "start": 803.04,
        "end": 815.519,
        "text": "English is my future. Create a small English corner in your room. Put your English books, headphones, notebook, pen",
        "textdich": ""
    },
    {
        "start": 811.839,
        "end": 824.0,
        "text": "there. Light a candle. Add a plant. Make it a sacred space. A space that tells your brain, \"This is where I become",
        "textdich": ""
    },
    {
        "start": 821.2,
        "end": 834.56,
        "text": "powerful.\" Place a daily English target on your wall. Today's goal, five new words, 10 minutes shadowing, one self-t talk session.",
        "textdich": ""
    },
    {
        "start": 832.88,
        "end": 846.72,
        "text": "This system will give your brain constant reminders. English is not something you do once. It's part of your day, your identity, your atmosphere.",
        "textdich": ""
    },
    {
        "start": 843.519,
        "end": 852.16,
        "text": "Step five, replace 30 minutes of native content with English content.",
        "textdich": ""
    },
    {
        "start": 849.279,
        "end": 860.24,
        "text": "Let's be honest, most people spend 2 to three hours every day watching YouTube, Instagram, Tik Tok, Netflix, all in",
        "textdich": ""
    },
    {
        "start": 857.76,
        "end": 872.72,
        "text": "their native language. And then they say, \"I don't have time for English.\" But the truth is, you don't need more time. You just need to replace time.",
        "textdich": ""
    },
    {
        "start": 870.399,
        "end": 874.88,
        "text": "Start small.",
        "textdich": ""
    },
    {
        "start": 872.72,
        "end": 879.36,
        "text": "Replace 30 minutes of native language content with English content.",
        "textdich": ""
    },
    {
        "start": 877.44,
        "end": 888.0,
        "text": "If you usually watch your favorite show in your language, try watching the same show in English with English subtitles.",
        "textdich": ""
    },
    {
        "start": 885.76,
        "end": 895.36,
        "text": "If you scroll YouTube shorts or Instagram reels, scroll in English.",
        "textdich": ""
    },
    {
        "start": 892.079,
        "end": 899.12,
        "text": "Choose pages that help you improve.",
        "textdich": ""
    },
    {
        "start": 895.36,
        "end": 908.639,
        "text": "Even a small change, 30 minutes a day, can completely reprogram your language center over 6 months. Step six, speak",
        "textdich": ""
    },
    {
        "start": 905.12,
        "end": 910.8,
        "text": "English even if nobody understands you.",
        "textdich": ""
    },
    {
        "start": 908.639,
        "end": 917.12,
        "text": "One of the biggest excuses learners give is there's nobody to speak English with.",
        "textdich": ""
    },
    {
        "start": 915.04,
        "end": 928.639,
        "text": "That's not a problem. That's an opportunity because now you must become your own English partner. Here's what to do. Talk to yourself in English while",
        "textdich": ""
    },
    {
        "start": 925.6,
        "end": 935.04,
        "text": "walking, cooking, waiting. Explain what you're doing. Now I'm making tea.",
        "textdich": ""
    },
    {
        "start": 932.56,
        "end": 938.32,
        "text": "This smells amazing.",
        "textdich": ""
    },
    {
        "start": 935.04,
        "end": 941.199,
        "text": "Today is a good day to practice English.",
        "textdich": ""
    },
    {
        "start": 938.32,
        "end": 950.399,
        "text": "Narrate your life like a movie. She looked at her phone. The time was 6:15 a.m. Another beautiful morning to become",
        "textdich": ""
    },
    {
        "start": 947.199,
        "end": 956.32,
        "text": "fluent. If you're brave, start using English phrases even with your family.",
        "textdich": ""
    },
    {
        "start": 953.44,
        "end": 961.519,
        "text": "Just short ones. Don't worry if they don't understand.",
        "textdich": ""
    },
    {
        "start": 958.399,
        "end": 969.519,
        "text": "They will get used to it. This is about creating a brain level shift. You are training your brain to speak English",
        "textdich": ""
    },
    {
        "start": 966.639,
        "end": 974.88,
        "text": "even when it's uncomfortable so that one day it becomes natural.",
        "textdich": ""
    },
    {
        "start": 972.48,
        "end": 984.56,
        "text": "If you change your environment, you change your identity. If you change your identity, you change your destiny.",
        "textdich": ""
    },
    {
        "start": 981.68,
        "end": 986.56,
        "text": "Don't wait for the perfect teacher.",
        "textdich": ""
    },
    {
        "start": 984.56,
        "end": 994.639,
        "text": "Don't wait for English speakers to magically appear. Become your own environment.",
        "textdich": ""
    },
    {
        "start": 991.199,
        "end": 1002.72,
        "text": "Build your own English world on your phone, in your room, in your mirror, in your ears, in your mind.",
        "textdich": ""
    },
    {
        "start": 1000.88,
        "end": 1012.399,
        "text": "Because once your environment starts speaking English to you, your brain will have no choice but to fall in love with",
        "textdich": ""
    },
    {
        "start": 1008.48,
        "end": 1015.36,
        "text": "it. And that's how addiction begins.",
        "textdich": ""
    },
    {
        "start": 1012.399,
        "end": 1019.839,
        "text": "Part three, connect English with emotion.",
        "textdich": ""
    },
    {
        "start": 1017.04,
        "end": 1028.24,
        "text": "Let's begin with a question. Why do you still remember your first love, your worst fight, or the saddest moment of",
        "textdich": ""
    },
    {
        "start": 1024.079,
        "end": 1038.4,
        "text": "your life even after 10 years? It's not because you memorized it. It's because you felt it. The brain forgets facts.",
        "textdich": ""
    },
    {
        "start": 1034.959,
        "end": 1040.16,
        "text": "But the heart never forgets emotions.",
        "textdich": ""
    },
    {
        "start": 1038.4,
        "end": 1051.2,
        "text": "So if you want English to become unforgettable, if you want it to stay in your brain forever, if you want to think in English, speak",
        "textdich": ""
    },
    {
        "start": 1047.679,
        "end": 1058.08,
        "text": "in English, dream in English, then you must stop learning only with logic and start learning with emotion.",
        "textdich": ""
    },
    {
        "start": 1055.919,
        "end": 1066.799,
        "text": "That is the secret behind long-term addiction to English. Emotion is what makes a language stick to your soul. And",
        "textdich": ""
    },
    {
        "start": 1064.24,
        "end": 1078.08,
        "text": "in this part, I'll teach you how to make English emotional so you fall in love with it on a deeper level than ever before.",
        "textdich": ""
    },
    {
        "start": 1073.6,
        "end": 1081.28,
        "text": "Step one, understand the science.",
        "textdich": ""
    },
    {
        "start": 1078.08,
        "end": 1084.0,
        "text": "Why emotion creates memory.",
        "textdich": ""
    },
    {
        "start": 1081.28,
        "end": 1094.16,
        "text": "Here's the simple science. When you feel a strong emotion, your brain releases chemicals like dopamine, adrenaline, and cortisol.",
        "textdich": ""
    },
    {
        "start": 1092.08,
        "end": 1099.039,
        "text": "These chemicals make your brain pay attention and remember.",
        "textdich": ""
    },
    {
        "start": 1096.799,
        "end": 1106.64,
        "text": "That's why you remember emotional scenes from movies but forget what you read in your textbook yesterday.",
        "textdich": ""
    },
    {
        "start": 1104.32,
        "end": 1115.6,
        "text": "Now imagine using this power in your English learning. If you connect emotion to the words you hear, speak and write,",
        "textdich": ""
    },
    {
        "start": 1113.52,
        "end": 1127.679,
        "text": "your brain will automatically start remembering them. Not because you are studying but because your brain says this is important. This means something.",
        "textdich": ""
    },
    {
        "start": 1125.12,
        "end": 1139.84,
        "text": "I must keep this. So how do we bring emotion into English? Step two. Watch English content that makes you feel something. Many learners say I watch",
        "textdich": ""
    },
    {
        "start": 1136.72,
        "end": 1142.4,
        "text": "English movies but I don't improve.",
        "textdich": ""
    },
    {
        "start": 1139.84,
        "end": 1151.12,
        "text": "The problem is they are watching without feeling. They're watching to learn but not to live.",
        "textdich": ""
    },
    {
        "start": 1147.84,
        "end": 1162.32,
        "text": "So, here's what you must do. Stop watching English content that feels boring. Start watching what touches your heart. Choose English movies or shows",
        "textdich": ""
    },
    {
        "start": 1159.039,
        "end": 1169.28,
        "text": "that make you laugh out loud. Cry silently. Feel angry. Feel inspired.",
        "textdich": ""
    },
    {
        "start": 1166.08,
        "end": 1171.76,
        "text": "Feel connected. Feel scared. Feel love.",
        "textdich": ""
    },
    {
        "start": 1169.28,
        "end": 1177.12,
        "text": "Feel pain. Because when your heart is open, your brain listens more deeply.",
        "textdich": ""
    },
    {
        "start": 1175.12,
        "end": 1184.32,
        "text": "Real example, watch a scene from a movie like The Pursuit of Happiness.",
        "textdich": ""
    },
    {
        "start": 1181.84,
        "end": 1195.679,
        "text": "When Will Smith cries while holding his son in the bathroom, your heart feels something deep. Now watch it again with English subtitles.",
        "textdich": ""
    },
    {
        "start": 1192.4,
        "end": 1204.72,
        "text": "Now repeat the dialogue. Now pause and speak it out loud. Now close your eyes and feel the pain behind those words.",
        "textdich": ""
    },
    {
        "start": 1202.16,
        "end": 1207.039,
        "text": "That's emotional immersion.",
        "textdich": ""
    },
    {
        "start": 1204.72,
        "end": 1211.36,
        "text": "And that's what creates powerful brain links to English.",
        "textdich": ""
    },
    {
        "start": 1209.2,
        "end": 1223.44,
        "text": "Even if you watch just 2 minutes of something powerful, but you feel it, you'll remember it better than hours of lifeless learning. Step three, write",
        "textdich": ""
    },
    {
        "start": 1220.559,
        "end": 1234.4,
        "text": "your emotions in English every day. This may be the most important habit of your life. Start writing your feelings in English every",
        "textdich": ""
    },
    {
        "start": 1230.559,
        "end": 1240.72,
        "text": "day. Not grammar exercises, not copying sample sentences, not translation.",
        "textdich": ""
    },
    {
        "start": 1237.919,
        "end": 1251.039,
        "text": "I mean your real feelings, what you're scared of, what you're excited about, what made you angry today, what you're",
        "textdich": ""
    },
    {
        "start": 1247.36,
        "end": 1259.919,
        "text": "dreaming of, what you're proud of, what you're hiding. Because when you write your truth in English, you are building",
        "textdich": ""
    },
    {
        "start": 1256.64,
        "end": 1262.24,
        "text": "a personal connection with the language.",
        "textdich": ""
    },
    {
        "start": 1259.919,
        "end": 1271.679,
        "text": "Suddenly English becomes the language of your inner world, your secrets, your memories, your identity. You stop seeing",
        "textdich": ""
    },
    {
        "start": 1269.12,
        "end": 1278.4,
        "text": "English as something foreign. It becomes your language, your voice. Try this.",
        "textdich": ""
    },
    {
        "start": 1276.08,
        "end": 1289.919,
        "text": "Every night before bed, write five sentences in English. For example, I felt very anxious today. I don't know why. I remembered my childhood this",
        "textdich": ""
    },
    {
        "start": 1287.12,
        "end": 1293.44,
        "text": "morning. It made me emotional.",
        "textdich": ""
    },
    {
        "start": 1289.919,
        "end": 1300.96,
        "text": "I miss someone, but I can't tell them. I felt strong today. I spoke English with confidence.",
        "textdich": ""
    },
    {
        "start": 1298.24,
        "end": 1309.84,
        "text": "I'm scared I'll fail, but I want to keep going. This is not just writing. This is therapy. This is emotional connection.",
        "textdich": ""
    },
    {
        "start": 1307.919,
        "end": 1320.72,
        "text": "This is how English becomes a part of your soul. Step four, speak with feeling, not just grammar. Most English learners make one big mistake. They",
        "textdich": ""
    },
    {
        "start": 1318.799,
        "end": 1332.96,
        "text": "focus only on correctness, not connection. They say things like, \"I don't know the right grammar. What if I make a mistake? What if people laugh at",
        "textdich": ""
    },
    {
        "start": 1329.2,
        "end": 1342.72,
        "text": "me?\" So they speak carefully, slowly, nervously. And the result is no emotion, no connection. But great speakers, even",
        "textdich": ""
    },
    {
        "start": 1340.32,
        "end": 1351.919,
        "text": "native speakers, don't always speak perfect grammar. They speak with feeling, with passion, with [clears throat] energy, with belief and",
        "textdich": ""
    },
    {
        "start": 1348.88,
        "end": 1355.12,
        "text": "people remember them. That is your job.",
        "textdich": ""
    },
    {
        "start": 1351.919,
        "end": 1367.36,
        "text": "Now, here's how to practice. Take any emotional sentence. Say it with real feeling. For example, I don't want to give up. I want to speak English so",
        "textdich": ""
    },
    {
        "start": 1363.44,
        "end": 1374.159,
        "text": "badly. This is important to me. I know I can do it. I'm tired, but I won't quit.",
        "textdich": ""
    },
    {
        "start": 1371.12,
        "end": 1377.039,
        "text": "I feel broken, but I'm still learning.",
        "textdich": ""
    },
    {
        "start": 1374.159,
        "end": 1383.679,
        "text": "Say each sentence slowly, loudly, clearly. Put emotion in every word.",
        "textdich": ""
    },
    {
        "start": 1380.32,
        "end": 1391.76,
        "text": "Repeat it, feel it, own it. Now, English is no longer just a language. It becomes a channel for your soul.",
        "textdich": ""
    },
    {
        "start": 1388.559,
        "end": 1404.0,
        "text": "Step five, use emotional visualization in English. Close your eyes. Imagine yourself walking into a job interview with confidence. Giving a speech in",
        "textdich": ""
    },
    {
        "start": 1400.88,
        "end": 1409.679,
        "text": "English to 500 people. Making your parents proud with your English skills.",
        "textdich": ""
    },
    {
        "start": 1407.52,
        "end": 1413.44,
        "text": "Traveling to another country and speaking fluently.",
        "textdich": ""
    },
    {
        "start": 1411.84,
        "end": 1424.559,
        "text": "Helping someone because you understood them in English. Reading a book and understanding every word. Watching a movie and laughing with no subtitles.",
        "textdich": ""
    },
    {
        "start": 1421.76,
        "end": 1436.48,
        "text": "Writing a love letter in English. Feel the emotions of that moment. Now describe it out loud in English. Even if it's not perfect,",
        "textdich": ""
    },
    {
        "start": 1433.6,
        "end": 1445.76,
        "text": "even if you don't have the exact words, speak it anyway. Use simple English, but use strong feeling. This is called",
        "textdich": ""
    },
    {
        "start": 1442.96,
        "end": 1452.88,
        "text": "emotional visualization. And your brain does not know the difference between imagination and reality. If you practice",
        "textdich": ""
    },
    {
        "start": 1450.48,
        "end": 1466.08,
        "text": "this daily, you will start building a new English identity inside you, a version of you that is already confident, fluent, and expressive.",
        "textdich": ""
    },
    {
        "start": 1461.2,
        "end": 1469.279,
        "text": "And slowly you will become that person.",
        "textdich": ""
    },
    {
        "start": 1466.08,
        "end": 1480.24,
        "text": "Step six, listen to English that gives you goosebumps. This is a very unique and powerful strategy. Find English content that gives you goosebumps. It",
        "textdich": ""
    },
    {
        "start": 1477.039,
        "end": 1488.08,
        "text": "can be a speech, a poem, a song, a story, a movie scene, a powerful voice, a real life story of struggle. When you",
        "textdich": ""
    },
    {
        "start": 1486.08,
        "end": 1497.919,
        "text": "listen to something in English and feel your heartbeat faster. When your eyes become wet. When you feel something move",
        "textdich": ""
    },
    {
        "start": 1494.64,
        "end": 1510.159,
        "text": "inside your chest, that is not just language learning. That is brain rewiring. That's when the language enters your emotional memory and never",
        "textdich": ""
    },
    {
        "start": 1506.159,
        "end": 1516.159,
        "text": "leaves. So collect those moments. Make a playlist called Goosebumps English.",
        "textdich": ""
    },
    {
        "start": 1513.2,
        "end": 1525.279,
        "text": "Listen to it when you feel low. Repeat those words. Speak them like you mean them. And your English will grow from",
        "textdich": ""
    },
    {
        "start": 1521.84,
        "end": 1530.559,
        "text": "your heart, not from a textbook. Emotion is your most powerful learning tool.",
        "textdich": ""
    },
    {
        "start": 1527.36,
        "end": 1533.2,
        "text": "Don't just memorize words, feel them.",
        "textdich": ""
    },
    {
        "start": 1530.559,
        "end": 1544.88,
        "text": "Don't just speak sentences, express them. Don't just practice English, live English, breathe English, cry in English, love in English, heal in",
        "textdich": ""
    },
    {
        "start": 1542.64,
        "end": 1556.0,
        "text": "English. Because when you connect English with emotion, you build a relationship that your brain will never forget. And that's how addiction is",
        "textdich": ""
    },
    {
        "start": 1552.4,
        "end": 1568.159,
        "text": "born. You no longer try to learn English. You need it. You love it. you become it. Part four, talk to yourself in English. Train your",
        "textdich": ""
    },
    {
        "start": 1565.6,
        "end": 1571.36,
        "text": "mouth to speak naturally.",
        "textdich": ""
    },
    {
        "start": 1568.159,
        "end": 1577.76,
        "text": "You can read 1,000 English books. You can understand 100 hours of English videos.",
        "textdich": ""
    },
    {
        "start": 1575.039,
        "end": 1582.32,
        "text": "But if you don't move your mouth, you will never speak fluently.",
        "textdich": ""
    },
    {
        "start": 1580.32,
        "end": 1594.64,
        "text": "Fluency is not just knowledge in your brain. Fluency is training in your mouth. It's physical. Think of it like this. You can watch 1,000 hours of",
        "textdich": ""
    },
    {
        "start": 1590.88,
        "end": 1597.6,
        "text": "dancing on YouTube, but can you dance?",
        "textdich": ""
    },
    {
        "start": 1594.64,
        "end": 1607.84,
        "text": "You can read 50 books on driving, but can you drive a car? You can study every rule of swimming, but will you float",
        "textdich": ""
    },
    {
        "start": 1603.76,
        "end": 1610.72,
        "text": "when you touch water? The answer is no.",
        "textdich": ""
    },
    {
        "start": 1607.84,
        "end": 1617.44,
        "text": "Because these are physical skills and to master any physical skill, you must practice it physically.",
        "textdich": ""
    },
    {
        "start": 1615.279,
        "end": 1627.919,
        "text": "Speaking English is also a physical skill. But most learners do the opposite. They study grammar. They memorize vocabulary. They think a lot.",
        "textdich": ""
    },
    {
        "start": 1626.0,
        "end": 1638.559,
        "text": "But they don't move their mouth every day. And then they wonder, \"Why can I understand English, but I can't speak?\"",
        "textdich": ""
    },
    {
        "start": 1635.679,
        "end": 1647.12,
        "text": "Now you know the answer. So now I'll teach you how to speak English alone every day and train your mouth, brain, and memory together.",
        "textdich": ""
    },
    {
        "start": 1645.2,
        "end": 1654.32,
        "text": "So you can become fluent without needing any teacher, partner or school.",
        "textdich": ""
    },
    {
        "start": 1650.32,
        "end": 1662.159,
        "text": "Step one, accept the truth. Speaking alone is the fastest way to speak fluent English. Many learners ask, \"But how can",
        "textdich": ""
    },
    {
        "start": 1660.24,
        "end": 1673.679,
        "text": "I improve my speaking if I have no one to talk to?\" The answer is simple. Talk to yourself every single day out loud with energy, with emotion.",
        "textdich": ""
    },
    {
        "start": 1671.579,
        "end": 1682.72,
        "text": "[clears throat] This is not silly. This is not childish. This is exactly how champions are made. Every great speaker,",
        "textdich": ""
    },
    {
        "start": 1680.399,
        "end": 1693.76,
        "text": "actor, leader, and communicator has practiced alone for thousands of hours before they spoke in public. So, don't wait for a perfect speaking partner.",
        "textdich": ""
    },
    {
        "start": 1690.72,
        "end": 1699.2,
        "text": "Don't wait for a class. Don't wait for a native speaker.",
        "textdich": ""
    },
    {
        "start": 1695.76,
        "end": 1701.84,
        "text": "Start now. Start alone.",
        "textdich": ""
    },
    {
        "start": 1699.2,
        "end": 1710.159,
        "text": "Start with yourself. Because when you talk to yourself in English, you control the topic. You can repeat again and",
        "textdich": ""
    },
    {
        "start": 1707.12,
        "end": 1717.679,
        "text": "again. You remove fear of judgment. You build confidence and clarity. Your mouth becomes trained. Your words become",
        "textdich": ""
    },
    {
        "start": 1714.96,
        "end": 1720.799,
        "text": "faster. Your voice becomes stronger.",
        "textdich": ""
    },
    {
        "start": 1717.679,
        "end": 1725.12,
        "text": "Your identity becomes more fluent.",
        "textdich": ""
    },
    {
        "start": 1720.799,
        "end": 1734.559,
        "text": "Step two, the science. Why talking to yourself works. Your brain learns faster when you hear something, you speak it out loud,",
        "textdich": ""
    },
    {
        "start": 1732.48,
        "end": 1739.039,
        "text": "you feel the movement in your mouth, and you repeat it consistently.",
        "textdich": ""
    },
    {
        "start": 1736.72,
        "end": 1744.399,
        "text": "This process is called active recall with muscle memory.",
        "textdich": ""
    },
    {
        "start": 1741.279,
        "end": 1755.52,
        "text": "It builds deep connections between your brain's language center, your mouth's muscle control, your emotional confidence system. When you speak",
        "textdich": ""
    },
    {
        "start": 1752.799,
        "end": 1766.64,
        "text": "English to yourself, you're activating your vocabulary memory. You're training your mouth muscles to produce English sounds.",
        "textdich": ""
    },
    {
        "start": 1762.96,
        "end": 1768.72,
        "text": "You're building brainto- mouth fluency.",
        "textdich": ""
    },
    {
        "start": 1766.64,
        "end": 1780.72,
        "text": "This is very different from just listening or reading. This is full body fluency training. Now, let's get into the practical methods.",
        "textdich": ""
    },
    {
        "start": 1776.48,
        "end": 1791.039,
        "text": "Step three, the mirror talk method. your most powerful fluency partner. The mirror is the best speaking partner in the world. It's always available. It",
        "textdich": ""
    },
    {
        "start": 1789.279,
        "end": 1793.52,
        "text": "never interrupts.",
        "textdich": ""
    },
    {
        "start": 1791.039,
        "end": 1798.88,
        "text": "It never laughs and it reflects your body language, emotions, and eye contact.",
        "textdich": ""
    },
    {
        "start": 1796.96,
        "end": 1812.32,
        "text": "Stand in front of the mirror for 5 minutes. Look into your own eyes. Don't look away. Start with simple sentences about your day. Today, I woke up at",
        "textdich": ""
    },
    {
        "start": 1808.399,
        "end": 1818.88,
        "text": "6:30. I feel tired but excited. I want to improve my English speaking today.",
        "textdich": ""
    },
    {
        "start": 1814.96,
        "end": 1823.919,
        "text": "Speak slowly, clearly with emotion. Use hand movements and facial expressions.",
        "textdich": ""
    },
    {
        "start": 1821.279,
        "end": 1837.36,
        "text": "Repeat each sentence three times louder each time. Add a second topic. Your dreams, your problems, your future plans. End with a power sentence. I am",
        "textdich": ""
    },
    {
        "start": 1834.399,
        "end": 1842.0,
        "text": "becoming fluent. I can feel it. I will speak English with confidence.",
        "textdich": ""
    },
    {
        "start": 1839.84,
        "end": 1854.32,
        "text": "This exercise activates your confidence muscles. You're not just practicing English. You're practicing belief, power, presence, fluency.",
        "textdich": ""
    },
    {
        "start": 1851.2,
        "end": 1861.52,
        "text": "Do this every morning and evening, even for 5 minutes. It will change everything.",
        "textdich": ""
    },
    {
        "start": 1858.399,
        "end": 1869.52,
        "text": "Step four, the narration practice. Talk through your life in English. Narration means describing what you're doing as",
        "textdich": ""
    },
    {
        "start": 1866.32,
        "end": 1881.679,
        "text": "you do it. This is the easiest and most natural way to speak English all day long. Here's how to do it. Whatever you're doing, say it in English. When",
        "textdich": ""
    },
    {
        "start": 1878.799,
        "end": 1890.24,
        "text": "brushing your teeth. I'm brushing my teeth. The water is cold. I like the minty taste of the toothpaste.",
        "textdich": ""
    },
    {
        "start": 1886.88,
        "end": 1893.039,
        "text": "When cooking, I'm cutting the onions.",
        "textdich": ""
    },
    {
        "start": 1890.24,
        "end": 1903.919,
        "text": "They're making my eyes water. Now I'm heating the oil. When walking. The weather is hot today. I can see the sun.",
        "textdich": ""
    },
    {
        "start": 1899.44,
        "end": 1906.48,
        "text": "I'm sweating a little. When cleaning.",
        "textdich": ""
    },
    {
        "start": 1903.919,
        "end": 1912.399,
        "text": "This table is dusty. I need to clean it properly. I like when things are neat.",
        "textdich": ""
    },
    {
        "start": 1910.159,
        "end": 1917.2,
        "text": "This method turns your daily life into a language classroom.",
        "textdich": ""
    },
    {
        "start": 1914.559,
        "end": 1930.64,
        "text": "You don't need extra time. You don't need books. You just need awareness. and your mouth will get thousands of repetitions daily without stress.",
        "textdich": ""
    },
    {
        "start": 1926.399,
        "end": 1937.679,
        "text": "Step five, the shadowing technique. Copy like a parrot with power. Shadowing is a very famous and powerful method used by",
        "textdich": ""
    },
    {
        "start": 1935.679,
        "end": 1951.44,
        "text": "interpreters, actors, and language masters. It means listen to a sentence and immediately speak it at the same time like an echo. It trains your brain",
        "textdich": ""
    },
    {
        "start": 1947.679,
        "end": 1965.2,
        "text": "to hear sounds correctly, match pronunciation and rhythm, [clears throat] improve fluency and speed, speak without translating. Part five,",
        "textdich": ""
    },
    {
        "start": 1962.08,
        "end": 1975.76,
        "text": "repeat until you crave it. Most people start learning English with excitement, but after a few days or weeks, they stop. Not because they're not",
        "textdich": ""
    },
    {
        "start": 1973.12,
        "end": 1982.24,
        "text": "intelligent, not because they don't have time, not because they don't want to improve.",
        "textdich": ""
    },
    {
        "start": 1980.32,
        "end": 1993.44,
        "text": "They stop because they never built repetition into their system. And without repetition, nothing sticks. The brain doesn't grow",
        "textdich": ""
    },
    {
        "start": 1990.08,
        "end": 2005.2,
        "text": "from what you do once. The brain grows from what you do every day. Fluency is not the result of intensity. It's the result of consistency.",
        "textdich": ""
    },
    {
        "start": 2003.039,
        "end": 2013.36,
        "text": "Repetition is the reason you remember your name. Repetition is the reason you walk without thinking.",
        "textdich": ""
    },
    {
        "start": 2011.039,
        "end": 2019.44,
        "text": "Repetition is the reason you speak your native language automatically.",
        "textdich": ""
    },
    {
        "start": 2016.32,
        "end": 2029.36,
        "text": "And now repetition must be the reason you become fluent in English. Step one, understand how addiction really works.",
        "textdich": ""
    },
    {
        "start": 2026.72,
        "end": 2031.279,
        "text": "Let's break the myth of addiction.",
        "textdich": ""
    },
    {
        "start": 2029.36,
        "end": 2042.72,
        "text": "People think addiction is about weakness or bad habits. But in reality, addiction is very simple. When the brain experiences something again and again",
        "textdich": ""
    },
    {
        "start": 2040.399,
        "end": 2049.599,
        "text": "and that experience gives even a small reward, it begins to expect that reward.",
        "textdich": ""
    },
    {
        "start": 2047.12,
        "end": 2057.44,
        "text": "And soon the brain doesn't ask for permission. It just wants more.",
        "textdich": ""
    },
    {
        "start": 2053.599,
        "end": 2066.0,
        "text": "That's how people get addicted to sugar, scrolling, gambling, games, validation, social media. Now apply the same science",
        "textdich": ""
    },
    {
        "start": 2063.359,
        "end": 2074.48,
        "text": "to English. If you repeat your English practice every day, even for 10 minutes, even small things like saying five",
        "textdich": ""
    },
    {
        "start": 2071.76,
        "end": 2086.8,
        "text": "sentences to yourself, watching a short clip, writing a diary entry, reading a paragraph aloud, and if you attach emotion, belief, and identity to it,",
        "textdich": ""
    },
    {
        "start": 2083.599,
        "end": 2097.52,
        "text": "your brain will start to expect it. Miss a day, you'll feel uncomfortable. Miss 2 days, you'll feel restless. miss 3 days,",
        "textdich": ""
    },
    {
        "start": 2094.159,
        "end": 2100.0,
        "text": "you'll feel lost. That's what we want.",
        "textdich": ""
    },
    {
        "start": 2097.52,
        "end": 2109.68,
        "text": "We want to make your brain crave English just like it craves food, water, or sleep. That's how permanent fluency is",
        "textdich": ""
    },
    {
        "start": 2105.04,
        "end": 2115.92,
        "text": "built. Step two, the magic rule. Repeat to remember, repeat to rewire.",
        "textdich": ""
    },
    {
        "start": 2113.28,
        "end": 2119.44,
        "text": "Let me show you two types of repetition.",
        "textdich": ""
    },
    {
        "start": 2115.92,
        "end": 2127.04,
        "text": "Type one, repetition to remember. This is basic memorization. If you learn a new word like consistent and you never",
        "textdich": ""
    },
    {
        "start": 2124.4,
        "end": 2136.24,
        "text": "repeat it, you'll forget it within 2 to 3 days. But if you use it in a sentence while speaking to yourself in your",
        "textdich": ""
    },
    {
        "start": 2133.119,
        "end": 2146.8,
        "text": "diary, during narration, in a shadowing practice, then your brain stores it permanently. Type two, repetition to rewire.",
        "textdich": ""
    },
    {
        "start": 2144.56,
        "end": 2158.48,
        "text": "This is deeper. It's not just about remembering. It's about changing who you are. If every day for 90 days you say I speak English confidently.",
        "textdich": ""
    },
    {
        "start": 2155.599,
        "end": 2167.2,
        "text": "English is part of my identity. Speaking English is easy for me. I train daily. I grow daily. I become better daily.",
        "textdich": ""
    },
    {
        "start": 2165.44,
        "end": 2172.48,
        "text": "Even if your brain didn't believe it on day one.",
        "textdich": ""
    },
    {
        "start": 2168.96,
        "end": 2175.68,
        "text": "By day 90, it will start to accept it.",
        "textdich": ""
    },
    {
        "start": 2172.48,
        "end": 2177.599,
        "text": "This is called identity repetition.",
        "textdich": ""
    },
    {
        "start": 2175.68,
        "end": 2189.92,
        "text": "And it's how you rewire the way you think, act, and live. So now you must build a system where English words repeat, English phrases repeat, English",
        "textdich": ""
    },
    {
        "start": 2186.56,
        "end": 2203.92,
        "text": "actions repeat, English beliefs repeat until one day you don't try to be fluent. You wake up and realize you already are. Step three, create rituals,",
        "textdich": ""
    },
    {
        "start": 2200.88,
        "end": 2211.44,
        "text": "not random study sessions. Most learners treat English like a task. I'll do it when I have time.",
        "textdich": ""
    },
    {
        "start": 2208.56,
        "end": 2217.119,
        "text": "Maybe I'll study tomorrow. I'll learn English when I feel motivated.",
        "textdich": ""
    },
    {
        "start": 2213.92,
        "end": 2225.599,
        "text": "But that never works because the brain needs rhythm to trust something. And rhythm only comes from rituals. A ritual",
        "textdich": ""
    },
    {
        "start": 2223.52,
        "end": 2234.32,
        "text": "is something you do every day without negotiation. Like brushing your teeth, like taking a shower, like eating.",
        "textdich": ""
    },
    {
        "start": 2231.92,
        "end": 2246.48,
        "text": "And now English must become one of those things. Choose your time. Same time every day, morning, lunch, evening, doesn't matter. But it must be fixed.",
        "textdich": ""
    },
    {
        "start": 2244.32,
        "end": 2249.76,
        "text": "Choose your practice.",
        "textdich": ""
    },
    {
        "start": 2246.48,
        "end": 2265.44,
        "text": "Like 5 minutes mirror talk, 5 minutes shadowing, 5 minutes journaling, 5 minutes listening, 5 minutes speaking aloud. Choose your place. Your bed, your",
        "textdich": ""
    },
    {
        "start": 2260.56,
        "end": 2275.68,
        "text": "bathroom, your roof, your bus stop. one consistent place where your brain connects that place with English. Choose your reward. After your ritual, say",
        "textdich": ""
    },
    {
        "start": 2272.079,
        "end": 2282.24,
        "text": "something to yourself. I did it. I'm becoming better. I kept my promise.",
        "textdich": ""
    },
    {
        "start": 2279.599,
        "end": 2293.28,
        "text": "Do this for 30 days. Your brain will begin to expect English like it expects coffee or food, and you'll no longer rely on motivation. You'll have a",
        "textdich": ""
    },
    {
        "start": 2289.52,
        "end": 2305.68,
        "text": "system. Step four, use the repetition rule of 10 to 10 to 10. This method is very powerful for building momentum. 10 words plus 10 minutes plus 10",
        "textdich": ""
    },
    {
        "start": 2302.079,
        "end": 2315.04,
        "text": "repetitions. Here's how it works. Choose 10 words or phrases you want to remember today. For example, I'm getting better.",
        "textdich": ""
    },
    {
        "start": 2312.24,
        "end": 2324.0,
        "text": "I can do this. I'm proud of myself. I'll never give up. This is just the beginning. It's okay to make mistakes.",
        "textdich": ""
    },
    {
        "start": 2320.56,
        "end": 2327.68,
        "text": "English is my identity. I trust myself.",
        "textdich": ""
    },
    {
        "start": 2324.0,
        "end": 2330.32,
        "text": "I am growing. I speak English every day.",
        "textdich": ""
    },
    {
        "start": 2327.68,
        "end": 2343.599,
        "text": "Set a timer for 10 minutes. Your only job is to repeat those 10 lines out loud again and again. Repeat each line 10 times with emotion. Feel it. Say it",
        "textdich": ""
    },
    {
        "start": 2339.599,
        "end": 2352.56,
        "text": "slowly, loudly, clearly. Now your brain, your tongue, your confidence, your voice, everything gets trained together.",
        "textdich": ""
    },
    {
        "start": 2349.76,
        "end": 2361.2,
        "text": "Repeat this daily and in one week you will notice. Your speaking becomes smoother. Your hesitation becomes less.",
        "textdich": ""
    },
    {
        "start": 2358.64,
        "end": 2374.96,
        "text": "Your voice becomes stronger. Your English becomes automatic. That's the power of 10 to the power of 10 to the power of 10. Step five, make English",
        "textdich": ""
    },
    {
        "start": 2370.8,
        "end": 2380.56,
        "text": "boring so you never stop. This may sound strange, but listen carefully.",
        "textdich": ""
    },
    {
        "start": 2378.56,
        "end": 2391.04,
        "text": "Most people quit English because they want it to feel exciting every day. But anything that's permanent in your life will sometimes feel boring.",
        "textdich": ""
    },
    {
        "start": 2388.079,
        "end": 2402.96,
        "text": "You brush your teeth every day. It's boring. But you still do it. You eat meals every day. Sometimes boring but",
        "textdich": ""
    },
    {
        "start": 2398.8,
        "end": 2408.64,
        "text": "necessary. You sleep, you bathe, you get dressed.",
        "textdich": ""
    },
    {
        "start": 2404.64,
        "end": 2411.68,
        "text": "Boring but part of life.",
        "textdich": ""
    },
    {
        "start": 2408.64,
        "end": 2414.56,
        "text": "So here's a powerful mindset.",
        "textdich": ""
    },
    {
        "start": 2411.68,
        "end": 2426.4,
        "text": "Don't chase excitement, chase consistency, and let English become a normal part of your daily life. When English becomes as",
        "textdich": ""
    },
    {
        "start": 2422.16,
        "end": 2437.599,
        "text": "normal as tea or coffee, you win because now you'll never quit. You'll repeat it forever. And that repetition will build",
        "textdich": ""
    },
    {
        "start": 2433.28,
        "end": 2439.68,
        "text": "fluency on a deep, unbreakable level.",
        "textdich": ""
    },
    {
        "start": 2437.599,
        "end": 2450.56,
        "text": "This is how you become addicted to English in the most beautiful, powerful, unstoppable way. Not because someone forced you, not because of school or",
        "textdich": ""
    },
    {
        "start": 2447.92,
        "end": 2463.76,
        "text": "pressure, but because you finally found a reason so deep, so personal, so emotional that English became your identity, not your subject.",
        "textdich": ""
    },
    {
        "start": 2459.52,
        "end": 2471.92,
        "text": "So from today, speak with purpose, learn with emotion, practice with power, repeat with consistency, and carry your",
        "textdich": ""
    },
    {
        "start": 2469.839,
        "end": 2482.24,
        "text": "mission every day like a flame in your heart. Because this is not just about English. This is about who you are becoming. This is about who you are",
        "textdich": ""
    },
    {
        "start": 2479.52,
        "end": 2491.44,
        "text": "choosing to become. We rebuild your mind. We reset your emotions. And we help you become unstoppable.",
        "textdich": ""
    },
    {
        "start": 2488.079,
        "end": 2496.4,
        "text": "Our today's topic is 10 rules to master positive thinking.",
        "textdich": ""
    },
    {
        "start": 2493.92,
        "end": 2503.28,
        "text": "Let me ask you something. Have you ever felt like your own mind is working against you? Like no matter how hard you",
        "textdich": ""
    },
    {
        "start": 2501.2,
        "end": 2515.04,
        "text": "try, the negative thoughts just keep coming. You smile on the outside, but inside you're tired. You're overthinking. You",
        "textdich": ""
    },
    {
        "start": 2511.68,
        "end": 2523.839,
        "text": "feel stuck. This video is not just about thinking positive. It's about learning how to take control of your thoughts",
        "textdich": ""
    },
    {
        "start": 2520.96,
        "end": 2534.16,
        "text": "step by step. It's about learning how to stop being your worst enemy and start becoming your biggest supporter. Because",
        "textdich": ""
    },
    {
        "start": 2530.0,
        "end": 2536.88,
        "text": "listen carefully, your mind is a garden.",
        "textdich": ""
    },
    {
        "start": 2534.16,
        "end": 2546.8,
        "text": "And every single thought you think is a seed. What you water grows. So if you feed your brain fear, doubt, and stress,",
        "textdich": ""
    },
    {
        "start": 2545.04,
        "end": 2559.52,
        "text": "that's exactly what your life will look like. But if you feed it belief, strength, gratitude, and hope, your life will start changing quietly, slowly,",
        "textdich": ""
    },
    {
        "start": 2557.68,
        "end": 2561.76,
        "text": "then suddenly.",
        "textdich": ""
    },
    {
        "start": 2559.52,
        "end": 2573.04,
        "text": "In this video, I'll show you 10 life-changing rules that positive people follow every single day. Rules that helped me, helped thousands,",
        "textdich": ""
    },
    {
        "start": 2570.16,
        "end": 2583.599,
        "text": "and they will help you, too. And remember, this video is also great for your English because you're not just learning grammar or vocabulary.",
        "textdich": ""
    },
    {
        "start": 2580.96,
        "end": 2593.839,
        "text": "You're learning how to think, feel, and speak like a powerful person. So listen till the end and apply everything",
        "textdich": ""
    },
    {
        "start": 2590.56,
        "end": 2603.52,
        "text": "because your brain is listening and your future is waiting. Before we begin, make sure to subscribe to our channel. We're",
        "textdich": ""
    },
    {
        "start": 2601.359,
        "end": 2613.28,
        "text": "here to change your mindset and improve your English, one video at a time. Rule one, your thoughts shape your reality.",
        "textdich": ""
    },
    {
        "start": 2611.52,
        "end": 2625.599,
        "text": "Let's start with the most important truth. You don't see the world the way it is. You see the world the way you are. If your mind is full of fear,",
        "textdich": ""
    },
    {
        "start": 2622.48,
        "end": 2627.92,
        "text": "you'll see danger in every opportunity.",
        "textdich": ""
    },
    {
        "start": 2625.599,
        "end": 2632.88,
        "text": "If your mind is full of doubt, you'll think every challenge it's impossible.",
        "textdich": ""
    },
    {
        "start": 2630.64,
        "end": 2643.28,
        "text": "But if your mind is full of strength, hope, and clarity, you'll find a way even where there is no way. Let me give",
        "textdich": ""
    },
    {
        "start": 2640.4,
        "end": 2652.0,
        "text": "you a simple example. Imagine two people wake up on the same rainy morning. One says, \"Gh, this day is ruined.\" The",
        "textdich": ""
    },
    {
        "start": 2648.8,
        "end": 2661.76,
        "text": "other says, \"Rain means growth. I feel calm. Let's make today meaningful.\" Same weather, same world, different reality.",
        "textdich": ""
    },
    {
        "start": 2659.839,
        "end": 2668.0,
        "text": "Because of different thoughts, you become what you think consistently.",
        "textdich": ""
    },
    {
        "start": 2665.359,
        "end": 2670.88,
        "text": "If every morning you say, \"I'm tired.",
        "textdich": ""
    },
    {
        "start": 2668.0,
        "end": 2683.359,
        "text": "I'm unlucky. Life is hard.\" You're building a mental prison. But if every morning you say, \"I'm improving. I'm learning. I'm still standing.",
        "textdich": ""
    },
    {
        "start": 2680.56,
        "end": 2693.76,
        "text": "You're building a mental fortress.\" Positive thinking doesn't mean lying to yourself. It means choosing thoughts that make you stronger.",
        "textdich": ""
    },
    {
        "start": 2690.64,
        "end": 2701.28,
        "text": "Let me be honest. You will never escape your life if you don't first escape your mental pattern. People wait for better",
        "textdich": ""
    },
    {
        "start": 2698.72,
        "end": 2707.68,
        "text": "days. But better days don't come from the sky. They come from better thinking.",
        "textdich": ""
    },
    {
        "start": 2705.119,
        "end": 2719.599,
        "text": "Scientific truth. Even modern neuroscience confirms your thoughts create neural pathways. If you think a negative thought again and",
        "textdich": ""
    },
    {
        "start": 2715.599,
        "end": 2729.52,
        "text": "again, that path becomes stronger like a deep road in your brain. But the moment you interrupt it, the moment you say,",
        "textdich": ""
    },
    {
        "start": 2725.599,
        "end": 2738.16,
        "text": "\"No, I choose a better thought today,\" you start building a new brain. This is not motivation. This is mental training.",
        "textdich": ""
    },
    {
        "start": 2735.119,
        "end": 2746.64,
        "text": "How to apply it? Every morning, write three thoughts you want to believe, even if you don't believe them yet. For",
        "textdich": ""
    },
    {
        "start": 2743.2,
        "end": 2751.04,
        "text": "example, I am capable of amazing things.",
        "textdich": ""
    },
    {
        "start": 2746.64,
        "end": 2760.4,
        "text": "I am safe. I am calm. I am strong. Today is a fresh start. Now speak them out loud with emotion, not soft, not slow.",
        "textdich": ""
    },
    {
        "start": 2758.64,
        "end": 2772.16,
        "text": "Say it like a soldier training their brain. Do this for 21 days. Your thoughts will change and so will your reality. Look at every successful person",
        "textdich": ""
    },
    {
        "start": 2770.319,
        "end": 2774.16,
        "text": "you admire.",
        "textdich": ""
    },
    {
        "start": 2772.16,
        "end": 2781.92,
        "text": "They all mastered internal thinking before external winning. Athletes visualize victory before the game.",
        "textdich": ""
    },
    {
        "start": 2780.0,
        "end": 2788.64,
        "text": "Speakers rehearse powerful thoughts before facing crowds.",
        "textdich": ""
    },
    {
        "start": 2784.24,
        "end": 2797.599,
        "text": "Survivors say, \"I will not quit.\" Even when everything is falling apart, they were not lucky. They were mentally",
        "textdich": ""
    },
    {
        "start": 2793.68,
        "end": 2806.16,
        "text": "trained. So remember this forever. Your outer life is a reflection of your inner thoughts. Change your thinking and your",
        "textdich": ""
    },
    {
        "start": 2803.359,
        "end": 2818.16,
        "text": "entire life will start responding not in one day but day by day because the brain is like a mirror. It reflects whatever you give it. You have two",
        "textdich": ""
    },
    {
        "start": 2814.96,
        "end": 2830.4,
        "text": "options. Think small and live stuck or think strong and live free. Choose wisely. Rule two, focus on what you can control. Most people are unhappy not",
        "textdich": ""
    },
    {
        "start": 2828.0,
        "end": 2838.8,
        "text": "because of their life, but because of the things they're trying to control that are not in their hands. And when",
        "textdich": ""
    },
    {
        "start": 2835.52,
        "end": 2845.28,
        "text": "you try to control what's not yours, you lose control over what is yours.",
        "textdich": ""
    },
    {
        "start": 2842.24,
        "end": 2855.04,
        "text": "What can't you control? Other people's opinions, the past, the future, the weather, traffic, random events, delays,",
        "textdich": ""
    },
    {
        "start": 2851.599,
        "end": 2860.48,
        "text": "betrayals, mistakes. Most of your stress comes from trying to fix these things.",
        "textdich": ""
    },
    {
        "start": 2857.839,
        "end": 2869.119,
        "text": "You want people to understand you. You want everyone to like you. You want life to be fair. But here's the hard truth.",
        "textdich": ""
    },
    {
        "start": 2866.079,
        "end": 2881.28,
        "text": "You cannot control people. You cannot control events. You cannot control the world. You can only control your focus, your words, your actions, and your",
        "textdich": ""
    },
    {
        "start": 2877.68,
        "end": 2884.24,
        "text": "attitude. That's it. And that's enough.",
        "textdich": ""
    },
    {
        "start": 2881.28,
        "end": 2895.68,
        "text": "Imagine two people get rejected from a job. One says, \"I'm worthless. The system is broken. No one will ever choose me.\" The other says, \"Let me",
        "textdich": ""
    },
    {
        "start": 2892.72,
        "end": 2908.559,
        "text": "improve my skills. Let me learn. Let me show up again stronger.\" Same situation. One tried to control the world and suffered. The other focused on",
        "textdich": ""
    },
    {
        "start": 2904.96,
        "end": 2921.04,
        "text": "self and grew. This is the difference between being a victim and being powerful. Whenever you feel upset, ask, \"Is this in my control?\" If yes, act. If",
        "textdich": ""
    },
    {
        "start": 2917.68,
        "end": 2929.76,
        "text": "no, let go. Let's say someone insults you, that's not in your control. But how you respond, that's in your hands. If",
        "textdich": ""
    },
    {
        "start": 2927.28,
        "end": 2937.2,
        "text": "someone doesn't respect you, you can't change them. But you can change your boundaries.",
        "textdich": ""
    },
    {
        "start": 2933.92,
        "end": 2941.599,
        "text": "If your day starts badly, you can't restart it.",
        "textdich": ""
    },
    {
        "start": 2939.2,
        "end": 2951.52,
        "text": "But you can decide what happens in the next hour. This is what positive people do. They don't waste energy trying to",
        "textdich": ""
    },
    {
        "start": 2948.24,
        "end": 2959.52,
        "text": "fight the river. They build a boat and learn how to row. Every evening, write down two columns.",
        "textdich": ""
    },
    {
        "start": 2956.319,
        "end": 2969.04,
        "text": "What I tried to control today and what I actually had power over. Be honest. Then ask yourself, did I waste energy on",
        "textdich": ""
    },
    {
        "start": 2966.079,
        "end": 2976.0,
        "text": "people or thoughts I can't control? Did I give my full energy to what I could change?",
        "textdich": ""
    },
    {
        "start": 2972.64,
        "end": 2978.48,
        "text": "This one exercise will reset your brain.",
        "textdich": ""
    },
    {
        "start": 2976.0,
        "end": 2981.92,
        "text": "It will make you peaceful, focused, and strong.",
        "textdich": ""
    },
    {
        "start": 2980.16,
        "end": 2991.04,
        "text": "Life becomes simpler when you stop reacting to everything. You don't need to fight every storm. You just need to",
        "textdich": ""
    },
    {
        "start": 2987.68,
        "end": 2997.28,
        "text": "build shelter inside your mind. Focus on your daily action. Focus on your energy.",
        "textdich": ""
    },
    {
        "start": 2995.04,
        "end": 2999.2,
        "text": "Focus on your vision.",
        "textdich": ""
    },
    {
        "start": 2997.28,
        "end": 3008.079,
        "text": "And let everything else move on without you. Because the most powerful people are not the loudest. They're the ones",
        "textdich": ""
    },
    {
        "start": 3004.88,
        "end": 3017.44,
        "text": "who know where their power ends and they protect it like treasure. Rule three, surround yourself with positive people.",
        "textdich": ""
    },
    {
        "start": 3015.76,
        "end": 3028.079,
        "text": "The people around you shape your thoughts and your thoughts shape your future. So, be careful who sits at your table because they influence what's on",
        "textdich": ""
    },
    {
        "start": 3025.2,
        "end": 3040.079,
        "text": "your plate. Let's say this loud and clear. You become like the people you spend the most time with, not just in habits, but in mindset, vocabulary,",
        "textdich": ""
    },
    {
        "start": 3036.88,
        "end": 3043.119,
        "text": "energy, and even your self-worth.",
        "textdich": ""
    },
    {
        "start": 3040.079,
        "end": 3055.52,
        "text": "Ask yourself, do these people lift me or drain me? Do they speak about growth or gossip? Do they encourage solutions or repeat the same complaints?",
        "textdich": ""
    },
    {
        "start": 3052.96,
        "end": 3064.0,
        "text": "Most people never become great, not because they're weak, but because they stay in low energy environments.",
        "textdich": ""
    },
    {
        "start": 3061.599,
        "end": 3074.319,
        "text": "You can have the biggest dreams, but if everyone around you is small-minded, negative, and lazy, you will slowly shrink to fit in.",
        "textdich": ""
    },
    {
        "start": 3071.839,
        "end": 3083.359,
        "text": "Imagine trying to eat healthy, but your entire group eats junk food daily. What will happen? You'll give up. Now imagine",
        "textdich": ""
    },
    {
        "start": 3081.28,
        "end": 3092.319,
        "text": "learning English, but your friends keep saying, \"Why are you doing this? You're wasting your time.",
        "textdich": ""
    },
    {
        "start": 3089.28,
        "end": 3101.76,
        "text": "You'll never be fluent. Will you grow in that environment?\" No. Because the human brain is social. It copies what it sees",
        "textdich": ""
    },
    {
        "start": 3099.2,
        "end": 3107.839,
        "text": "around it. That's why you must protect your circle like your life depends on it.",
        "textdich": ""
    },
    {
        "start": 3104.88,
        "end": 3111.2,
        "text": "Three types of people to avoid.",
        "textdich": ""
    },
    {
        "start": 3107.839,
        "end": 3114.24,
        "text": "One, chronic complainers.",
        "textdich": ""
    },
    {
        "start": 3111.2,
        "end": 3123.76,
        "text": "Nothing is ever good enough. They find a problem in every solution. They drain your mind like a slow poison. Two",
        "textdich": ""
    },
    {
        "start": 3120.4,
        "end": 3133.52,
        "text": "judgers. They laugh at your dreams. They criticize your progress. They're not growing, so they don't want you to grow.",
        "textdich": ""
    },
    {
        "start": 3129.76,
        "end": 3144.319,
        "text": "Three, energy thieves. Every time you talk to them, you feel smaller. They never say, \"I'm proud of you.\" They love drama more than peace.",
        "textdich": ""
    },
    {
        "start": 3141.68,
        "end": 3154.16,
        "text": "Surround yourself with people who speak about goals, not people. Encourage you even when you're slow. Remind you of",
        "textdich": ""
    },
    {
        "start": 3150.8,
        "end": 3164.559,
        "text": "your worth even when you forget. Choose solution over stress. Are also working on themselves just like you. And if you don't have",
        "textdich": ""
    },
    {
        "start": 3161.44,
        "end": 3171.28,
        "text": "these people around right now, be that person for yourself. Be your own biggest supporter.",
        "textdich": ""
    },
    {
        "start": 3169.52,
        "end": 3180.0,
        "text": "And slowly, people who match your energy will appear. Every month, audit your circle.",
        "textdich": ""
    },
    {
        "start": 3177.119,
        "end": 3189.92,
        "text": "Ask, \"Who makes me feel stronger? Who makes me question my dreams? Who listens but never supports?\" Then set boundaries. Not drama, not fights, just",
        "textdich": ""
    },
    {
        "start": 3188.559,
        "end": 3192.4,
        "text": "distance.",
        "textdich": ""
    },
    {
        "start": 3189.92,
        "end": 3203.92,
        "text": "You're not better than them. You're just building a new future and not everyone can come with you. You are not just creating a life. You are building a",
        "textdich": ""
    },
    {
        "start": 3200.0,
        "end": 3211.52,
        "text": "mental environment every day. And in that environment, only two things can grow.",
        "textdich": ""
    },
    {
        "start": 3208.0,
        "end": 3213.92,
        "text": "Your power or your pain.",
        "textdich": ""
    },
    {
        "start": 3211.52,
        "end": 3227.839,
        "text": "So choose your people like you choose your thoughts with love, with wisdom, and with purpose. Rule four, turn challenges into opportunities.",
        "textdich": ""
    },
    {
        "start": 3225.76,
        "end": 3236.48,
        "text": "A positive thinker is not someone who has a perfect life. A positive thinker is someone who knows how to turn pain",
        "textdich": ""
    },
    {
        "start": 3232.48,
        "end": 3241.52,
        "text": "into power. Most people think once life becomes easy, I'll be happy.",
        "textdich": ""
    },
    {
        "start": 3239.76,
        "end": 3248.88,
        "text": "Once I get the perfect job, relationship, or situation, then I'll be positive.",
        "textdich": ""
    },
    {
        "start": 3247.04,
        "end": 3253.52,
        "text": "But here's the truth that most people never hear.",
        "textdich": ""
    },
    {
        "start": 3250.72,
        "end": 3256.96,
        "text": "Life doesn't get easier. You get stronger.",
        "textdich": ""
    },
    {
        "start": 3255.04,
        "end": 3261.2,
        "text": "And the faster you learn how to turn challenges into growth.",
        "textdich": ""
    },
    {
        "start": 3259.44,
        "end": 3265.76,
        "text": "The faster your mindset becomes unshakable.",
        "textdich": ""
    },
    {
        "start": 3262.88,
        "end": 3275.92,
        "text": "Life is not against you. It's training you. Every challenge is a test. But not a test to destroy you. A test to build",
        "textdich": ""
    },
    {
        "start": 3272.8,
        "end": 3285.92,
        "text": "you, reveal you, and prepare you. Think about it. Fire doesn't destroy gold. It purifies it. Pressure doesn't break",
        "textdich": ""
    },
    {
        "start": 3282.48,
        "end": 3291.92,
        "text": "diamonds, it creates them. Resistance doesn't weaken muscles, it grows them.",
        "textdich": ""
    },
    {
        "start": 3289.44,
        "end": 3295.44,
        "text": "So why do we believe that discomfort is bad?",
        "textdich": ""
    },
    {
        "start": 3293.44,
        "end": 3301.359,
        "text": "Positive thinkers are not positive because their life is smooth.",
        "textdich": ""
    },
    {
        "start": 3298.079,
        "end": 3308.16,
        "text": "They're positive because they understand this is a lesson. I am being sharpened.",
        "textdich": ""
    },
    {
        "start": 3304.88,
        "end": 3314.16,
        "text": "I will grow from this. Let's take the example of a student who failed an exam.",
        "textdich": ""
    },
    {
        "start": 3311.119,
        "end": 3323.92,
        "text": "Most people would think, \"I'm dumb. I'm not made for this. I'll give up.\" But a positive thinker says, \"This is",
        "textdich": ""
    },
    {
        "start": 3319.76,
        "end": 3326.8,
        "text": "feedback, not failure. What can I learn?",
        "textdich": ""
    },
    {
        "start": 3323.92,
        "end": 3338.319,
        "text": "What did I do wrong? What can I do better next time? Then they apply that learning. They improve. They return stronger. And when they pass the next",
        "textdich": ""
    },
    {
        "start": 3334.88,
        "end": 3350.799,
        "text": "time, that victory becomes 10 times more meaningful because it came from growth, not luck. Whenever something bad happens, don't just react. Instead,",
        "textdich": ""
    },
    {
        "start": 3347.52,
        "end": 3362.96,
        "text": "pause and ask. What is this trying to teach me? What skill can I develop from this? What mindset is this helping me build? Even the worst situations,",
        "textdich": ""
    },
    {
        "start": 3360.079,
        "end": 3374.64,
        "text": "heartbreak, failure, rejection can become a turning point in your life if you choose to see it that way. Write this down. Pain is not the enemy.",
        "textdich": ""
    },
    {
        "start": 3370.88,
        "end": 3377.76,
        "text": "Avoiding growth is. Think like this.",
        "textdich": ""
    },
    {
        "start": 3374.64,
        "end": 3386.0,
        "text": "Rejected. Good. Now you have space for something better. Lost money. Good. Now you'll learn financial intelligence.",
        "textdich": ""
    },
    {
        "start": 3383.119,
        "end": 3392.0,
        "text": "Betrayed? Good. Now you'll develop boundaries and self-respect.",
        "textdich": ""
    },
    {
        "start": 3388.4,
        "end": 3398.88,
        "text": "Lost motivation. Good. Now you'll learn how to move without feelings. Alone.",
        "textdich": ""
    },
    {
        "start": 3395.92,
        "end": 3408.88,
        "text": "Good. Now you'll connect with your real self. When you train your brain to reframe everything, you become mentally bulletproof.",
        "textdich": ""
    },
    {
        "start": 3406.88,
        "end": 3417.359,
        "text": "Positive thinking doesn't come from a perfect past. It comes from choosing to see the purpose in your pain. And once",
        "textdich": ""
    },
    {
        "start": 3414.88,
        "end": 3425.44,
        "text": "you see that purpose, nothing in life can truly destroy you because everything becomes fuel.",
        "textdich": ""
    },
    {
        "start": 3422.559,
        "end": 3437.479,
        "text": "Remember this, life doesn't happen to you, it happens for you. And if you use every challenge as a lesson, you become unstoppable.",
        "textdich": ""
    },
    {
        "start": 3434.0,
        "end": 3439.04,
        "text": "Rule five, smile more often.",
        "textdich": ""
    },
    {
        "start": 3437.479,
        "end": 3446.799,
        "text": "[clears throat] Most people only smile when something good happens. But here's what positive thinkers understand.",
        "textdich": ""
    },
    {
        "start": 3443.92,
        "end": 3456.48,
        "text": "Smiling is not a reaction. It's a decision. And that decision has power over your body, your brain, and even the",
        "textdich": ""
    },
    {
        "start": 3452.799,
        "end": 3465.119,
        "text": "people around you. When you smile, even if you're sad, your brain releases chemicals like dopamine and serotonin.",
        "textdich": ""
    },
    {
        "start": 3463.04,
        "end": 3473.92,
        "text": "These are the same chemicals that fight stress, reduce anxiety, and make you feel calm. That means your smile can",
        "textdich": ""
    },
    {
        "start": 3471.04,
        "end": 3483.599,
        "text": "literally change your state of mind. And it works even when you don't feel like smiling. So yes, you might feel pain.",
        "textdich": ""
    },
    {
        "start": 3480.72,
        "end": 3492.559,
        "text": "Yes, life may be hard right now, but if you can smile through it, you're telling your brain, \"I'm choosing strength. I'm",
        "textdich": ""
    },
    {
        "start": 3489.04,
        "end": 3503.28,
        "text": "still here. I'm still fighting. Imagine you walk into a room and you see two people. One is serious, closed off, looking down. The other is smiling,",
        "textdich": ""
    },
    {
        "start": 3500.559,
        "end": 3515.599,
        "text": "calm, and open. Who do you feel more drawn to? Who do you trust more? Who looks more powerful? The one waiting for happiness or the one who chooses it?",
        "textdich": ""
    },
    {
        "start": 3513.44,
        "end": 3524.72,
        "text": "Smiling gives you a mental and emotional advantage. It makes you approachable. It makes you confident and most importantly",
        "textdich": ""
    },
    {
        "start": 3522.72,
        "end": 3531.44,
        "text": "it trains your brain to focus on the light not the darkness.",
        "textdich": ""
    },
    {
        "start": 3527.359,
        "end": 3533.68,
        "text": "When should you smile? In the mirror.",
        "textdich": ""
    },
    {
        "start": 3531.44,
        "end": 3539.839,
        "text": "First thing in the morning. When you face a problem. When you feel anxious.",
        "textdich": ""
    },
    {
        "start": 3537.44,
        "end": 3546.64,
        "text": "Before a phone call or meeting. When you're walking alone. While speaking English.",
        "textdich": ""
    },
    {
        "start": 3543.68,
        "end": 3556.24,
        "text": "Before sleeping. Smile as an act of power. Not because life is perfect, but because you are strong.",
        "textdich": ""
    },
    {
        "start": 3552.96,
        "end": 3566.48,
        "text": "People often ask, \"But won't I look fake if I smile when I'm sad?\" No, you're not pretending everything is okay. You're reminding your brain that",
        "textdich": ""
    },
    {
        "start": 3564.319,
        "end": 3571.839,
        "text": "you're okay and you're going to handle it. You're not ignoring your emotions.",
        "textdich": ""
    },
    {
        "start": 3569.68,
        "end": 3575.2,
        "text": "You're guiding them.",
        "textdich": ""
    },
    {
        "start": 3571.839,
        "end": 3577.839,
        "text": "Smile plus speak equals influence.",
        "textdich": ""
    },
    {
        "start": 3575.2,
        "end": 3585.839,
        "text": "When you speak with a smile, your voice changes. It becomes warmer, clearer, and more trustworthy.",
        "textdich": ""
    },
    {
        "start": 3583.44,
        "end": 3597.68,
        "text": "That's why great speakers, leaders, and communicators always smile, even when discussing serious topics. If you want to speak English more confidently,",
        "textdich": ""
    },
    {
        "start": 3594.799,
        "end": 3608.0,
        "text": "try smiling while practicing. You'll sound more natural, you'll feel more relaxed, and people will connect with you faster.",
        "textdich": ""
    },
    {
        "start": 3604.64,
        "end": 3619.839,
        "text": "Your smile is free, but its value is priceless. It can heal you. It can shift your mood. It can break the pattern of overthinking. And it can light up",
        "textdich": ""
    },
    {
        "start": 3616.96,
        "end": 3626.559,
        "text": "someone else's day. Don't wait for reasons to smile. Be the reason.",
        "textdich": ""
    },
    {
        "start": 3624.16,
        "end": 3638.96,
        "text": "Because in a world full of pressure, sadness, and confusion, a calm smile is the sign of someone who's winning on the inside. Rule six,",
        "textdich": ""
    },
    {
        "start": 3636.079,
        "end": 3650.48,
        "text": "expect the best. Let's be clear, expecting the worst is not being realistic. It's a habit. And that habit is killing your progress. How? Because",
        "textdich": ""
    },
    {
        "start": 3647.359,
        "end": 3656.16,
        "text": "when you expect failure, you prepare less. Try with fear. Speak with doubt.",
        "textdich": ""
    },
    {
        "start": 3654.319,
        "end": 3668.16,
        "text": "Block good opportunities without even realizing it. Now, let's flip the mindset. When you expect success, even if you fail, you show up stronger,",
        "textdich": ""
    },
    {
        "start": 3664.72,
        "end": 3672.88,
        "text": "louder, and more alive. And that's when real transformation begins.",
        "textdich": ""
    },
    {
        "start": 3670.88,
        "end": 3677.92,
        "text": "Thought versus belief versus expectation.",
        "textdich": ""
    },
    {
        "start": 3674.48,
        "end": 3687.68,
        "text": "A thought is just an idea. A belief is something you repeat until it feels true. But an expectation is deeper. It shapes your behavior without you",
        "textdich": ""
    },
    {
        "start": 3684.88,
        "end": 3700.48,
        "text": "realizing it. Let's say you're learning English. If you think maybe I'll improve, you'll watch videos but not speak. If you believe I can improve,",
        "textdich": ""
    },
    {
        "start": 3697.839,
        "end": 3714.079,
        "text": "you'll practice sometimes. But if you expect fluent, then you'll speak, practice, fail, try again. Because your mind is already living in the result.",
        "textdich": ""
    },
    {
        "start": 3711.44,
        "end": 3719.2,
        "text": "Expectation is emotional. It creates energy, action, movement.",
        "textdich": ""
    },
    {
        "start": 3717.2,
        "end": 3727.599,
        "text": "That's why positive thinkers don't just hope. They walk into life with a quiet expectation.",
        "textdich": ""
    },
    {
        "start": 3724.48,
        "end": 3731.359,
        "text": "I don't know when, but something amazing is coming.",
        "textdich": ""
    },
    {
        "start": 3729.359,
        "end": 3741.2,
        "text": "There was a girl who failed her exams three times. Everyone told her to stop dreaming. She started to believe them.",
        "textdich": ""
    },
    {
        "start": 3737.76,
        "end": 3750.16,
        "text": "She gave up for 2 years. But one day she wrote in her diary, \"I don't know how, but I believe something good is still",
        "textdich": ""
    },
    {
        "start": 3747.52,
        "end": 3761.839,
        "text": "coming for me.\" She started studying again slowly, quietly. She stopped listening to people and started listening to herself. One year later,",
        "textdich": ""
    },
    {
        "start": 3759.04,
        "end": 3770.88,
        "text": "she passed. Two years later, she got her dream job. And today, she helps other students who feel broken. because she",
        "textdich": ""
    },
    {
        "start": 3767.68,
        "end": 3773.68,
        "text": "remembers how belief saved her life.",
        "textdich": ""
    },
    {
        "start": 3770.88,
        "end": 3776.16,
        "text": "But what if I get disappointed?",
        "textdich": ""
    },
    {
        "start": 3773.68,
        "end": 3779.68,
        "text": "Yes, expectations sometimes lead to disappointment.",
        "textdich": ""
    },
    {
        "start": 3778.079,
        "end": 3784.24,
        "text": "But you know what's worse than disappointment?",
        "textdich": ""
    },
    {
        "start": 3781.359,
        "end": 3793.76,
        "text": "Never trying, never showing up, never seeing your real potential. A positive thinker expects the best and prepares for all possibilities.",
        "textdich": ""
    },
    {
        "start": 3791.44,
        "end": 3795.839,
        "text": "That's not weakness.",
        "textdich": ""
    },
    {
        "start": 3793.76,
        "end": 3799.119,
        "text": "That's wisdom.",
        "textdich": ""
    },
    {
        "start": 3795.839,
        "end": 3802.16,
        "text": "Every morning repeat this to yourself.",
        "textdich": ""
    },
    {
        "start": 3799.119,
        "end": 3808.0,
        "text": "Today something good can happen. I am open. I am ready. I am aligned.",
        "textdich": ""
    },
    {
        "start": 3805.119,
        "end": 3815.68,
        "text": "Even if I don't see it yet, I trust that the best is coming toward me and I am walking toward it. Then ask yourself,",
        "textdich": ""
    },
    {
        "start": 3813.599,
        "end": 3820.88,
        "text": "what would I do today if I expected success?",
        "textdich": ""
    },
    {
        "start": 3817.359,
        "end": 3826.079,
        "text": "How would I speak? How would I walk? How would I prepare?",
        "textdich": ""
    },
    {
        "start": 3822.88,
        "end": 3833.599,
        "text": "And then do it. Walk like it's already happening. Speak like it's already real.",
        "textdich": ""
    },
    {
        "start": 3830.16,
        "end": 3835.599,
        "text": "Move like the universe is on your side.",
        "textdich": ""
    },
    {
        "start": 3833.599,
        "end": 3847.839,
        "text": "Because often it is what you expect. You invite. So stop expecting disappointment. Stop expecting delays. Stop expecting pain.",
        "textdich": ""
    },
    {
        "start": 3845.119,
        "end": 3853.52,
        "text": "You've survived enough. Now expect growth. Expect clarity. Expect miracles.",
        "textdich": ""
    },
    {
        "start": 3852.319,
        "end": 3861.039,
        "text": "Because when you change your expectation, you change your direction.",
        "textdich": ""
    },
    {
        "start": 3856.88,
        "end": 3863.92,
        "text": "Rule seven, stay present and mindful.",
        "textdich": ""
    },
    {
        "start": 3861.039,
        "end": 3873.28,
        "text": "Most people live like this. They regret the past. They fear the future and they ignore the present. That's why their",
        "textdich": ""
    },
    {
        "start": 3870.4,
        "end": 3878.24,
        "text": "mind is always racing. That's why they feel tired without doing anything.",
        "textdich": ""
    },
    {
        "start": 3875.92,
        "end": 3884.48,
        "text": "That's why they struggle to be calm even in a quiet room. But here's the truth.",
        "textdich": ""
    },
    {
        "start": 3882.319,
        "end": 3889.039,
        "text": "The present moment is the only place where life actually happens.",
        "textdich": ""
    },
    {
        "start": 3887.359,
        "end": 3902.48,
        "text": "Everything else is memory or imagination. So if you want peace, if you want power, if you want to think clearly and positively,",
        "textdich": ""
    },
    {
        "start": 3897.92,
        "end": 3907.599,
        "text": "you must return to now. What is now? Now is not the clock. It's not the date.",
        "textdich": ""
    },
    {
        "start": 3905.76,
        "end": 3916.799,
        "text": "It's the space between thoughts where nothing is wrong. where you are breathing, sitting, feeling, observing.",
        "textdich": ""
    },
    {
        "start": 3913.68,
        "end": 3928.0,
        "text": "It's the space where you stop fighting what happened. Stop worrying about what might happen and just be. This sounds simple, but it's life-changing.",
        "textdich": ""
    },
    {
        "start": 3925.68,
        "end": 3936.0,
        "text": "Because when you're present, you eat slower, you speak better, you listen deeper, you feel calmer, you make better",
        "textdich": ""
    },
    {
        "start": 3933.44,
        "end": 3944.0,
        "text": "decisions. Let's say you're talking to someone, but your mind is thinking about a past mistake.",
        "textdich": ""
    },
    {
        "start": 3941.039,
        "end": 3953.44,
        "text": "You're not fully present. You miss their words. You misunderstand their tone. You feel anxious. And you don't even know",
        "textdich": ""
    },
    {
        "start": 3950.079,
        "end": 3964.96,
        "text": "why. Now imagine staying present. You look in their eyes. You hear their words. You respond with clarity. No overthinking. Just awareness. That's the",
        "textdich": ""
    },
    {
        "start": 3961.92,
        "end": 3971.2,
        "text": "power of mindfulness. But what about my problems?",
        "textdich": ""
    },
    {
        "start": 3966.88,
        "end": 3978.4,
        "text": "Yes, your problems exist, but 99% of them are mental repetitions, not real time emergencies.",
        "textdich": ""
    },
    {
        "start": 3976.16,
        "end": 3987.44,
        "text": "You are not fixing the past by thinking about it. You are not controlling the future by worrying about it. You are",
        "textdich": ""
    },
    {
        "start": 3983.68,
        "end": 3994.559,
        "text": "only stealing your peace. Now, positive thinkers are not careless. They are careful with their attention. They say,",
        "textdich": ""
    },
    {
        "start": 3992.24,
        "end": 4005.44,
        "text": "\"I'll learn from the past. I'll prepare for the future. But I will live in this breath, in this hour, in this step.\" Use",
        "textdich": ""
    },
    {
        "start": 4002.559,
        "end": 4016.319,
        "text": "your senses. What can you see, hear, feel, and smell right now? It grounds you. It pulls you back. Breathe with awareness. Take three slow breaths. In",
        "textdich": ""
    },
    {
        "start": 4014.0,
        "end": 4019.359,
        "text": "through the nose, out through the mouth.",
        "textdich": ""
    },
    {
        "start": 4016.319,
        "end": 4023.44,
        "text": "Feel each breath like a wave. Speak with focus.",
        "textdich": ""
    },
    {
        "start": 4020.72,
        "end": 4026.559,
        "text": "While talking to someone, slow down.",
        "textdich": ""
    },
    {
        "start": 4023.44,
        "end": 4032.64,
        "text": "Look at their eyes. Be present. Don't plan your next sentence. Just listen.",
        "textdich": ""
    },
    {
        "start": 4030.079,
        "end": 4042.4,
        "text": "Walk with mindfulness. Next time you walk, don't check your phone. Just notice your steps. Notice the wind, the",
        "textdich": ""
    },
    {
        "start": 4038.4,
        "end": 4050.72,
        "text": "light, the ground. That's life. You will miss your whole life if you keep waiting for the perfect moment.",
        "textdich": ""
    },
    {
        "start": 4047.44,
        "end": 4060.24,
        "text": "This moment right now is the only one that's real. If you don't find peace here, you won't find it anywhere.",
        "textdich": ""
    },
    {
        "start": 4057.839,
        "end": 4063.2,
        "text": "So stay present.",
        "textdich": ""
    },
    {
        "start": 4060.24,
        "end": 4076.16,
        "text": "Not because life is perfect, but because it's happening now and you deserve to feel it. Rule eight, practice gratitude like a daily ritual.",
        "textdich": ""
    },
    {
        "start": 4073.76,
        "end": 4086.16,
        "text": "The fastest way to shift your mood, your mindset, and even your mental health is to stop asking, \"What do I lack?\" and",
        "textdich": ""
    },
    {
        "start": 4082.16,
        "end": 4095.28,
        "text": "start asking, \"What do I already have?\" This is gratitude. And let's be clear, gratitude is not a soft trick. It's not",
        "textdich": ""
    },
    {
        "start": 4092.48,
        "end": 4098.4,
        "text": "something you only do on good days.",
        "textdich": ""
    },
    {
        "start": 4095.28,
        "end": 4107.759,
        "text": "Gratitude is a daily discipline. It's how you take back control of your thoughts no matter what is happening outside.",
        "textdich": ""
    },
    {
        "start": 4104.719,
        "end": 4116.96,
        "text": "Gratitude is so powerful because your brain is always scanning for problems. It's trying to protect you. But the side effect is you focus",
        "textdich": ""
    },
    {
        "start": 4115.199,
        "end": 4129.44,
        "text": "too much on what's missing, what's wrong, what could go bad. And slowly your thoughts become heavy. You start thinking I'm behind. Nothing is working.",
        "textdich": ""
    },
    {
        "start": 4126.48,
        "end": 4140.239,
        "text": "Life is hard. But when you activate gratitude, you're interrupting that pattern. You're telling your brain, \"Stop. Look, there is good here.\"",
        "textdich": ""
    },
    {
        "start": 4138.319,
        "end": 4152.4,
        "text": "And once you find one thing to be thankful for, your brain will find another. And another, and slowly your mindset shifts.",
        "textdich": ""
    },
    {
        "start": 4149.92,
        "end": 4157.199,
        "text": "Imagine two people lose their job on the same day. One says, \"This is terrible.",
        "textdich": ""
    },
    {
        "start": 4155.279,
        "end": 4167.199,
        "text": "I'm nothing without a job. Why does this always happen to me? The other says, \"Okay, I lost this job, but I still have",
        "textdich": ""
    },
    {
        "start": 4164.0,
        "end": 4176.319,
        "text": "my skills. I still have my health. I still have people who love me. Maybe this is my chance to build something better.\"",
        "textdich": ""
    },
    {
        "start": 4172.96,
        "end": 4185.759,
        "text": "One falls into darkness. The other uses gratitude as a flashlight and keeps moving. The situation is the same, but",
        "textdich": ""
    },
    {
        "start": 4182.96,
        "end": 4197.12,
        "text": "the focus is different. And that makes all the difference. It's not pretending everything is perfect. It's not ignoring pain. It's not fake positivity.",
        "textdich": ""
    },
    {
        "start": 4193.839,
        "end": 4204.48,
        "text": "Gratitude says, \"I acknowledge my pain, but I won't let it blind me to what's still good. You can cry and still be",
        "textdich": ""
    },
    {
        "start": 4202.0,
        "end": 4215.6,
        "text": "thankful. You can struggle and still be thankful. You can fail and still be thankful. That's real power.\" The morning three. Before you touch your",
        "textdich": ""
    },
    {
        "start": 4213.6,
        "end": 4229.199,
        "text": "phone, write down three things you're grateful for. It can be small. I woke up. I have food. I get to try again today. The gratitude breath. Every time",
        "textdich": ""
    },
    {
        "start": 4225.92,
        "end": 4238.32,
        "text": "you feel overwhelmed, pause, take a deep breath, and say one sentence. Thank you that I still have the chance to grow.",
        "textdich": ""
    },
    {
        "start": 4235.52,
        "end": 4245.199,
        "text": "Speak gratitude out loud. Say it to others. Thank them. Appreciate them.",
        "textdich": ""
    },
    {
        "start": 4242.56,
        "end": 4247.76,
        "text": "Gratitude grows when you express it.",
        "textdich": ""
    },
    {
        "start": 4245.199,
        "end": 4255.199,
        "text": "Gratitude doesn't remove your problems, but it reminds you that you're bigger than your problems. It reconnects you",
        "textdich": ""
    },
    {
        "start": 4252.239,
        "end": 4264.239,
        "text": "with peace. It returns your focus to the present. It strengthens your spirit and silences fear.",
        "textdich": ""
    },
    {
        "start": 4261.199,
        "end": 4267.12,
        "text": "So, make gratitude your daily ritual.",
        "textdich": ""
    },
    {
        "start": 4264.239,
        "end": 4278.719,
        "text": "Not because life is easy, but because your heart is still beating. And that means your story is not over. Rule nine,",
        "textdich": ""
    },
    {
        "start": 4275.84,
        "end": 4288.88,
        "text": "master the art of letting go. This is one of the hardest and most powerful rules in the journey of positive thinking. Because letting go is not",
        "textdich": ""
    },
    {
        "start": 4285.36,
        "end": 4293.52,
        "text": "about weakness. It's about wisdom. It means understanding.",
        "textdich": ""
    },
    {
        "start": 4290.8,
        "end": 4297.04,
        "text": "Not everything deserves your energy. Not everyone deserves your attention.",
        "textdich": ""
    },
    {
        "start": 4295.539,
        "end": 4303.199,
        "text": "[clears throat] And not every memory deserves a permanent space in your mind.",
        "textdich": ""
    },
    {
        "start": 4299.92,
        "end": 4318.96,
        "text": "Your mind is like a room and every thought, every memory, every person takes up space. If that room is filled with resentment, regret, old pain, past",
        "textdich": ""
    },
    {
        "start": 4314.88,
        "end": 4326.64,
        "text": "mistakes, what they said, what you lost, then there's no space for peace, for growth, for joy, for what's next. And so",
        "textdich": ""
    },
    {
        "start": 4324.239,
        "end": 4335.04,
        "text": "even when something good tries to enter, you don't feel it because you're still holding what should have been released long ago.",
        "textdich": ""
    },
    {
        "start": 4332.88,
        "end": 4345.6,
        "text": "Imagine you're holding a heavy bag full of stones. Each stone is a past memory, an insult, a mistake, a betrayal. You",
        "textdich": ""
    },
    {
        "start": 4342.4,
        "end": 4352.8,
        "text": "want to run. You want to grow. But the bag is pulling you down. Letting go doesn't mean you throw everything away.",
        "textdich": ""
    },
    {
        "start": 4350.8,
        "end": 4364.719,
        "text": "It means you stop carrying what's no longer serving you. You say, \"Yes, it happened. Yes, it hurt. But I choose to stop bleeding. I choose to heal. I",
        "textdich": ""
    },
    {
        "start": 4362.88,
        "end": 4373.679,
        "text": "deserve peace more than I deserve revenge.\" And like any skill, it can be practiced. You don't let go by force.",
        "textdich": ""
    },
    {
        "start": 4371.199,
        "end": 4376.239,
        "text": "You let go by acceptance.",
        "textdich": ""
    },
    {
        "start": 4373.679,
        "end": 4387.6,
        "text": "Acceptance doesn't mean agreement. It means you stop fighting reality. It means you stop asking why did they do this? What if I had chosen differently?",
        "textdich": ""
    },
    {
        "start": 4384.56,
        "end": 4398.239,
        "text": "Why wasn't I good enough? And instead you ask what can I learn? What can I grow into now? Who am I becoming because",
        "textdich": ""
    },
    {
        "start": 4394.4,
        "end": 4411.12,
        "text": "of this? That shift is freedom. Practice letting go in these three areas. One, people. If someone constantly brings you pain, confusion, or disrespect,",
        "textdich": ""
    },
    {
        "start": 4406.64,
        "end": 4420.96,
        "text": "release them gently, quietly. No drama, just distance. Memories. If you keep replaying something that's gone, write",
        "textdich": ""
    },
    {
        "start": 4416.56,
        "end": 4429.36,
        "text": "it down. Cry if you must. Then say, \"I give this memory permission to leave.\" And burn the paper or delete the note.",
        "textdich": ""
    },
    {
        "start": 4426.8,
        "end": 4433.44,
        "text": "Let it go physically to signal your brain emotionally.",
        "textdich": ""
    },
    {
        "start": 4431.6,
        "end": 4435.199,
        "text": "Self-lame.",
        "textdich": ""
    },
    {
        "start": 4433.44,
        "end": 4445.12,
        "text": "If you're angry at yourself for your past, understand this. You did the best you could with who you were at that",
        "textdich": ""
    },
    {
        "start": 4440.48,
        "end": 4446.88,
        "text": "time. Forgive yourself and move forward.",
        "textdich": ""
    },
    {
        "start": 4445.12,
        "end": 4452.4,
        "text": "Letting go doesn't mean your pain was small. It means your future is bigger.",
        "textdich": ""
    },
    {
        "start": 4450.0,
        "end": 4461.36,
        "text": "You are not your pain. You are not your story. You are not your scars. You are the person who survived, who is still",
        "textdich": ""
    },
    {
        "start": 4457.679,
        "end": 4464.32,
        "text": "here, still breathing, still becoming.",
        "textdich": ""
    },
    {
        "start": 4461.36,
        "end": 4476.56,
        "text": "So take a deep breath and say it out loud. I let go. I release the weight. I choose peace now. Rule 10. Believe that",
        "textdich": ""
    },
    {
        "start": 4473.76,
        "end": 4489.84,
        "text": "good things are coming. This is the final and most important mindset of every truly positive person. Faith, hope, belief in a better tomorrow.",
        "textdich": ""
    },
    {
        "start": 4486.48,
        "end": 4497.12,
        "text": "Even when today looks like a storm. Let me tell you something that no one told you growing up. You don't have to know",
        "textdich": ""
    },
    {
        "start": 4494.239,
        "end": 4510.56,
        "text": "how your life will get better. You just have to believe that it can. And that belief, small as it may seem, can keep you alive, can keep you moving,",
        "textdich": ""
    },
    {
        "start": 4507.84,
        "end": 4522.8,
        "text": "can can bring miracles into your world because they've been disappointed, because they've been hurt, because they tried once, twice, 10 times.",
        "textdich": ""
    },
    {
        "start": 4518.96,
        "end": 4532.8,
        "text": "and nothing worked. So they stop. They build a wall around their heart. They tell themselves, \"Maybe happiness is not",
        "textdich": ""
    },
    {
        "start": 4528.159,
        "end": 4535.36,
        "text": "for me. Maybe this is just how life is.",
        "textdich": ""
    },
    {
        "start": 4532.8,
        "end": 4546.4,
        "text": "Maybe I'm just unlucky.\" But here's the truth. It's not your fault that you feel tired, but it is your responsibility to believe again",
        "textdich": ""
    },
    {
        "start": 4544.0,
        "end": 4549.84,
        "text": "because belief is the engine that moves your future.",
        "textdich": ""
    },
    {
        "start": 4548.32,
        "end": 4562.239,
        "text": "When you believe something good is coming, you wake up with purpose. Try one more time. Smile more easily. Notice opportunities.",
        "textdich": ""
    },
    {
        "start": 4559.36,
        "end": 4571.52,
        "text": "Speak with clarity. Treat yourself with patience. Without belief, everything feels heavy. With belief, even struggle",
        "textdich": ""
    },
    {
        "start": 4568.719,
        "end": 4582.239,
        "text": "becomes manageable. Think of people who healed after heartbreak, who rebuilt after bankruptcy, who learned to walk again after",
        "textdich": ""
    },
    {
        "start": 4578.0,
        "end": 4591.28,
        "text": "accidents, who found love again at 50, who started learning English at 60, who became authors, speakers, artists,",
        "textdich": ""
    },
    {
        "start": 4588.08,
        "end": 4603.84,
        "text": "mothers, leaders after being told, \"You can't.\" They all had one thing in common. They kept a small light on inside. They said, \"I don't know how. I",
        "textdich": ""
    },
    {
        "start": 4601.199,
        "end": 4615.36,
        "text": "don't know when, but I know something beautiful is coming.\" That knowing, that belief became their fuel. And step by step, day by day, it became their",
        "textdich": ""
    },
    {
        "start": 4613.6,
        "end": 4617.76,
        "text": "reality.",
        "textdich": ""
    },
    {
        "start": 4615.36,
        "end": 4626.32,
        "text": "Start small. You don't have to believe in something big. Just believe that tomorrow can feel 1% lighter. The right",
        "textdich": ""
    },
    {
        "start": 4623.679,
        "end": 4632.32,
        "text": "people will find you. You'll feel peace again. You'll laugh again. You'll heal.",
        "textdich": ""
    },
    {
        "start": 4629.199,
        "end": 4643.44,
        "text": "You'll rise. And every time your brain says, \"It's too late.\" Answer: No, I'm just getting started. Every time your",
        "textdich": ""
    },
    {
        "start": 4640.159,
        "end": 4656.0,
        "text": "brain says, \"You've failed too much.\" Answer: I've learned too much to stop now. Every time your brain says nothing good will happen. Answer: Watch me.",
        "textdich": ""
    },
    {
        "start": 4653.12,
        "end": 4661.84,
        "text": "Daily practice to build belief. Future journal 2 minutes daily.",
        "textdich": ""
    },
    {
        "start": 4659.04,
        "end": 4666.239,
        "text": "Write in present tense.",
        "textdich": ""
    },
    {
        "start": 4661.84,
        "end": 4674.4,
        "text": "I am calm. I am growing. I am attracting people and opportunities that lift me higher. Gratitude plus vision combo. Say",
        "textdich": ""
    },
    {
        "start": 4672.32,
        "end": 4683.52,
        "text": "thank you for all I have and thank you for all that's coming. Visualize with emotion. Every night imagine something",
        "textdich": ""
    },
    {
        "start": 4679.84,
        "end": 4694.4,
        "text": "beautiful happening. A letter, a call, a moment, a healing, feel it, breathe it, sleep with it. Your subconscious mind",
        "textdich": ""
    },
    {
        "start": 4691.84,
        "end": 4703.199,
        "text": "will believe it's real and start moving toward it. Even in winter, the trees know spring will return. Even when the",
        "textdich": ""
    },
    {
        "start": 4700.239,
        "end": 4714.159,
        "text": "sky is dark, the sun still exists behind the clouds. Even when your heart feels lost, your future is not. So say this",
        "textdich": ""
    },
    {
        "start": 4709.84,
        "end": 4724.88,
        "text": "now out loud. I am still here. That means something beautiful is still on the way. I choose to believe. Not because life is easy, but because I've",
        "textdich": ""
    },
    {
        "start": 4721.52,
        "end": 4735.04,
        "text": "come too far to stop now. Because belief is not about proof. It's about trusting your strength, your growth, and your journey.",
        "textdich": ""
    },
    {
        "start": 4731.92,
        "end": 4746.64,
        "text": "Let me leave you with this. You are not broken. You are becoming. You are not behind. You are building something special and step by step. You are not",
        "textdich": ""
    },
    {
        "start": 4743.84,
        "end": 4756.08,
        "text": "unlucky. You are learning how to handle the weight of your future blessings. You are not done. You are in progress. And",
        "textdich": ""
    },
    {
        "start": 4752.96,
        "end": 4763.36,
        "text": "if no one told you this today, let me say it now. I believe in your comeback.",
        "textdich": ""
    },
    {
        "start": 4760.08,
        "end": 4773.04,
        "text": "I believe in your story. I believe in your strength. And I believe that something beautiful is coming your way.",
        "textdich": ""
    },
    {
        "start": 4769.52,
        "end": 4781.12,
        "text": "Just don't stop. Don't give up. Don't go silent when your soul needs your voice the most. Because this world doesn't",
        "textdich": ""
    },
    {
        "start": 4778.08,
        "end": 4791.28,
        "text": "need another perfect person. It needs you. Awake, alive, healing, believing, growing, and rising. So go back to life",
        "textdich": ""
    },
    {
        "start": 4788.56,
        "end": 4803.6,
        "text": "with a stronger mind. Go back to your dreams with a bigger heart. Go back to yourself with more love than ever before. And say this one last time. I",
        "textdich": ""
    },
    {
        "start": 4799.84,
        "end": 4813.92,
        "text": "will think better. I will feel better. I will speak better. And I will become someone I'm proud of because I deserve",
        "textdich": ""
    },
    {
        "start": 4808.56,
        "end": 4823.28,
        "text": "it and I'm ready now. Now before you go, if this video touched your heart, if even one line helped you shift your mindset,",
        "textdich": ""
    },
    {
        "start": 4820.56,
        "end": 4828.48,
        "text": "then don't forget to subscribe because this channel is not about entertainment.",
        "textdich": ""
    },
    {
        "start": 4825.92,
        "end": 4839.44,
        "text": "It's about transformation and we're just getting started. New videos are coming every week to guide your thoughts, train your",
        "textdich": ""
    },
    {
        "start": 4836.4,
        "end": 4849.28,
        "text": "English, and most importantly, awaken your power. So like, comment, share it with someone who needs it, and I'll see",
        "textdich": ""
    },
    {
        "start": 4845.92,
        "end": 4857.28,
        "text": "you in the next one. Until then, keep believing, keep building, and never forget.",
        "textdich": ""
    },
    {
        "start": 4853.679,
        "end": 4859.6,
        "text": "Your best days are not behind you.",
        "textdich": ""
    },
    {
        "start": 4857.28,
        "end": 4864.76,
        "text": "They're waiting for you to meet them.",
        "textdich": ""
    },
    {
        "start": 4859.6,
        "end": 4864.76,
        "text": "You're not late. You're right on time.",
        "textdich": ""
    }
]