[
  {
    "start": 0.16,
    "end": 9.84,
    "text": "Have you ever wondered why some people seem to succeed in life while others struggle?",
    "textdich": ""
  },
  {
    "start": 5.96,
    "end": 21.8,
    "text": "Is success just luck? Or is there a set of rules that successful people follow? Well, here's the truth. Success is not an accident. It happens when you",
    "textdich": ""
  },
  {
    "start": 20.0,
    "end": 28.439,
    "text": "follow the right principles. Take action and stay committed.",
    "textdich": ""
  },
  {
    "start": 27.199,
    "end": 37.68,
    "text": "In today's video, I'm going to share with you 12 powerful rules for success in life.",
    "textdich": ""
  },
  {
    "start": 35.44,
    "end": 49.84,
    "text": "These rules have helped millions of people achieve their dreams and if you apply them, they can change your life, too. So, make sure you watch till the",
    "textdich": ""
  },
  {
    "start": 46.039,
    "end": 60.039,
    "text": "end because the last rule is the most important one. And if you're ready to take control of your life and become successful, let's jump right in the 12",
    "textdich": ""
  },
  {
    "start": 58.559,
    "end": 75.76,
    "text": "rules for success. Now, you might be wondering, do we really need rules for success? The answer is yes. Think about it. Every successful person follows",
    "textdich": ""
  },
  {
    "start": 73.2,
    "end": 84.64,
    "text": "certain principles. Whether it's Elon Musk, Oprah, Winfrey, Warren Buffett, or even athletes like Cristiano Ronaldo,",
    "textdich": ""
  },
  {
    "start": 82.56,
    "end": 90.96,
    "text": "they all have habits and rules that guide them. Success isn't about luck.",
    "textdich": ""
  },
  {
    "start": 88.159,
    "end": 100.079,
    "text": "It's about following the right mindset, taking the right actions, and staying consistent. But here's the good news.",
    "textdich": ""
  },
  {
    "start": 97.119,
    "end": 108.96,
    "text": "Anyone can be successful. You don't need to be born rich. You don't need to be a genius. You just need to follow these 12",
    "textdich": ""
  },
  {
    "start": 105.799,
    "end": 117.84,
    "text": "rules, apply them in your life, and take action every day. These rules have helped millions of people achieve their",
    "textdich": ""
  },
  {
    "start": 114.6,
    "end": 127.759,
    "text": "dreams, whether in business, career, relationships, or personal growth, and they can work for you, too. So, are you",
    "textdich": ""
  },
  {
    "start": 124.439,
    "end": 141.2,
    "text": "ready? Let's go through the 12 rules one by one. Rule one, set clear goals. The first and most important rule of success is setting clear",
    "textdich": ""
  },
  {
    "start": 138.36,
    "end": 151.0,
    "text": "goals. Think about this. If you don't know where you're going, how will you get there? Imagine a ship sailing in the ocean without a",
    "textdich": ""
  },
  {
    "start": 148.84,
    "end": 163.319,
    "text": "destination. It will just drift aimlessly and never reach success. The same happens in life. If you don't have clear goals, you'll waste",
    "textdich": ""
  },
  {
    "start": 160.319,
    "end": 174.0,
    "text": "time, feel lost, and never move forward. Successful people always set goals. They don't just say, \"I want to be rich or I want to be",
    "textdich": ""
  },
  {
    "start": 170.84,
    "end": 187.2,
    "text": "successful.\" Instead, they define exactly what they want and how to get there. Let's take the example of Elon Musk. Do you think he just woke up one",
    "textdich": ""
  },
  {
    "start": 183.2,
    "end": 198.239,
    "text": "day and became successful? No. He had clear goals. He wanted to revolutionize the car industry with Tesla. Take humans",
    "textdich": ""
  },
  {
    "start": 193.84,
    "end": 210.04,
    "text": "to Mars with SpaceX and improve global internet with Starlink. He didn't just wish for success. He set goals, made plans, and",
    "textdich": ""
  },
  {
    "start": 206.8,
    "end": 224.72,
    "text": "took action. How to apply this in your life. You can do the same. Start by setting smart goals. Specific. Know exactly what you want. Measurable. Track",
    "textdich": ""
  },
  {
    "start": 220.56,
    "end": 235.68,
    "text": "your progress. Achievable. Be realistic but ambitious. Relevant. Focus on what matters to you. Time bound. Set a",
    "textdich": ""
  },
  {
    "start": 232.36,
    "end": 245.04,
    "text": "deadline. For example, instead of saying I want to learn English, say I will practice speaking English for 30 minutes",
    "textdich": ""
  },
  {
    "start": 241.439,
    "end": 250.72,
    "text": "every day for the next 6 months. Now you have a clear goal with a time frame.",
    "textdich": ""
  },
  {
    "start": 248.0,
    "end": 265.639,
    "text": "When you set clear goals, you give yourself direction. You stop wasting time. You stay motivated and you start seeing real progress. So ask yourself",
    "textdich": ""
  },
  {
    "start": 261.199,
    "end": 277.44,
    "text": "right now, what is my goal? Write it down. Make a plan and start working on it today. Rule to take action every day.",
    "textdich": ""
  },
  {
    "start": 274.32,
    "end": 290.16,
    "text": "Now that you've set your goals, here's the next important rule. Take action every day. You see, many people dream big, but very few actually take",
    "textdich": ""
  },
  {
    "start": 287.08,
    "end": 302.4,
    "text": "action. They say, \"One day I'll start a business or one day I'll get in shape.\" But that one day never comes unless they take",
    "textdich": ""
  },
  {
    "start": 298.84,
    "end": 308.96,
    "text": "action. Here's the truth. Success is built on daily actions, not just dreams.",
    "textdich": ""
  },
  {
    "start": 306.56,
    "end": 319.36,
    "text": "Let's talk about Michael Jordan, one of the greatest basketball players of all time. Do you think he became great just because he was talented? No. He",
    "textdich": ""
  },
  {
    "start": 316.88,
    "end": 331.199,
    "text": "practiced every single day shooting thousands of baskets, training harder than anyone else, and never skipping practice. That's why he became a",
    "textdich": ""
  },
  {
    "start": 328.08,
    "end": 344.12,
    "text": "champion. The same applies to learning English, starting a business, or improving your health. Small daily efforts lead to big",
    "textdich": ""
  },
  {
    "start": 340.039,
    "end": 353.039,
    "text": "success. How to apply this in your life. Here's a simple way to take action every day. Break your goal into small",
    "textdich": ""
  },
  {
    "start": 350.32,
    "end": 368.039,
    "text": "steps. Instead of saying, \"I want to get fit.\" Start with I will exercise for 20 minutes every day. Be consistent. Even small efforts every day",
    "textdich": ""
  },
  {
    "start": 363.759,
    "end": 380.16,
    "text": "create big results over time. Remove excuses. Don't wait for the perfect time. Just start. For example, if you want to learn English, don't wait for",
    "textdich": ""
  },
  {
    "start": 377.919,
    "end": 383.28,
    "text": "the right moment.",
    "textdich": ""
  },
  {
    "start": 380.16,
    "end": 394.52,
    "text": "Start by reading a short English article today, practicing speaking for 10 minutes, listening to an English podcast. These small steps done every",
    "textdich": ""
  },
  {
    "start": 391.919,
    "end": 408.08,
    "text": "single day will make you successful. Remember, action beats perfection. Stop waiting. Stop overthinking. Just start today. Rule",
    "textdich": ""
  },
  {
    "start": 404.08,
    "end": 420.4,
    "text": "three, never stop learning. Here's a secret that all successful people know. Learning never stops. Think about it. The world is",
    "textdich": ""
  },
  {
    "start": 417.28,
    "end": 433.919,
    "text": "always changing. New technology, new skills, new ways of doing things. If you stop learning, you get left behind. But if you keep learning, you",
    "textdich": ""
  },
  {
    "start": 430.16,
    "end": 442.84,
    "text": "keep growing. Let's take Bill Gates, the co-founder of Microsoft. Even after becoming one of the richest people in",
    "textdich": ""
  },
  {
    "start": 439.199,
    "end": 454.72,
    "text": "the world, he still reads 50 books every year. Why? Because he knows that learning keeps him ahead. Another example is Elon Musk. He didn't know how",
    "textdich": ""
  },
  {
    "start": 452.479,
    "end": 464.319,
    "text": "to build rockets at first, but he read books, learned from experts, and took action. Now, SpaceX is one of the most",
    "textdich": ""
  },
  {
    "start": 461.199,
    "end": 467.36,
    "text": "successful space companies in the world.",
    "textdich": ""
  },
  {
    "start": 464.319,
    "end": 479.84,
    "text": "How to apply this in your life? Read books, articles, or listen to podcasts. Even 10 minutes a day can change your mindset. Learn from",
    "textdich": ""
  },
  {
    "start": 476.16,
    "end": 489.12,
    "text": "successful people. Watch interviews, read their biographies, and study what they do. Take courses and practice new",
    "textdich": ""
  },
  {
    "start": 486.52,
    "end": 502.0,
    "text": "skills. Whether it's learning English coding or communication skills, keep improving. Be open to feedback. Learn from your mistakes and use them to",
    "textdich": ""
  },
  {
    "start": 498.68,
    "end": 514.56,
    "text": "grow. For example, if you want to speak English fluently, don't just study grammar. Listen to native speakers practice daily and learn new words every",
    "textdich": ""
  },
  {
    "start": 511.0,
    "end": 523.64,
    "text": "day. Remember, the more you learn, the more you earn. Knowledge is power. And the smartest people never stop learning",
    "textdich": ""
  },
  {
    "start": 520.32,
    "end": 533.6,
    "text": "rule for be confident and believe in yourself. Here's the truth. If you don't believe in yourself, no one else will.",
    "textdich": ""
  },
  {
    "start": 530.959,
    "end": 545.2,
    "text": "Confidence is not about being the smartest or the strongest. It's about trusting yourself, your abilities, and your potential to succeed. If you think",
    "textdich": ""
  },
  {
    "start": 542.399,
    "end": 555.36,
    "text": "you can do it, you're already halfway there. But here's the problem. Many people doubt themselves. They think I'm",
    "textdich": ""
  },
  {
    "start": 551.44,
    "end": 568.56,
    "text": "not good enough. Or what if I fail? And because of that fear, they never even try. Let's take JK Rowling, the author of Harry Potter.",
    "textdich": ""
  },
  {
    "start": 565.6,
    "end": 575.04,
    "text": "Did you know that 12 publishers rejected her book before one finally said? Yes.",
    "textdich": ""
  },
  {
    "start": 572.72,
    "end": 585.44,
    "text": "Imagine if she had given up and said, \"Maybe I'm not a good writer. We would never have Harry Potter.\" But she believed in herself and kept",
    "textdich": ""
  },
  {
    "start": 583.0,
    "end": 598.0,
    "text": "going. Now she's one of the most successful authors in history. Another example is Cristiano Ronaldo. When he was young, people told him he wasn't",
    "textdich": ""
  },
  {
    "start": 595.12,
    "end": 610.92,
    "text": "strong enough to be a football star, but he believed in himself, worked hard, and became one of the greatest players ever. How to apply this in your",
    "textdich": ""
  },
  {
    "start": 607.64,
    "end": 615.76,
    "text": "life. Stop negative self-talk.",
    "textdich": ""
  },
  {
    "start": 612.519,
    "end": 628.72,
    "text": "Replace I can't do this with I will find a way. Practice self-confidence daily. Stand tall, make eye contact, and speak with belief. Face",
    "textdich": ""
  },
  {
    "start": 625.839,
    "end": 639.2,
    "text": "your fears. The more you challenge yourself, the stronger your confidence grows. Surround yourself with positive",
    "textdich": ""
  },
  {
    "start": 635.079,
    "end": 648.8,
    "text": "people. Be around those who lift you up, not those who bring you down. For example, if you want to learn English but feel",
    "textdich": ""
  },
  {
    "start": 646.12,
    "end": 660.959,
    "text": "shy, don't say, \"I'm not good at speaking.\" Instead, say, \"I'm improving every day.\" Confidence is built through action and",
    "textdich": ""
  },
  {
    "start": 657.32,
    "end": 674.88,
    "text": "belief. Remember, the world sees you the way you see yourself if you believe in yourself. Others will to rule five. Stay positive and",
    "textdich": ""
  },
  {
    "start": 670.92,
    "end": 677.839,
    "text": "persistent. Life is not always easy.",
    "textdich": ""
  },
  {
    "start": 674.88,
    "end": 683.24,
    "text": "There will be failures, challenges, and moments when you feel like giving up.",
    "textdich": ""
  },
  {
    "start": 681.04,
    "end": 696.16,
    "text": "But here's the secret to success. Stay positive and keep going no matter what. Many people give up too soon because they focus on their",
    "textdich": ""
  },
  {
    "start": 693.56,
    "end": 704.32,
    "text": "failures. But successful people keep trying even when things go wrong. They don't let negativity stop them. Let's",
    "textdich": ""
  },
  {
    "start": 702.24,
    "end": 714.48,
    "text": "talk about Thomas Edison, the inventor of the light bulb. Did you know he failed 10,000 times before finally making a working light",
    "textdich": ""
  },
  {
    "start": 711.88,
    "end": 725.519,
    "text": "bulb? Most people would have given up after 10 or 20 failures, but Edison stayed positive and persistent. He said, \"I have not",
    "textdich": ""
  },
  {
    "start": 721.88,
    "end": 737.72,
    "text": "failed. I've just found 10,000 ways that won't work.\" Another example is Jack Ma, the founder of Alibaba before becoming successful.",
    "textdich": ""
  },
  {
    "start": 734.079,
    "end": 748.8,
    "text": "He was rejected from 30 jobs including KFC. But he never stopped trying. He believed in himself, stayed positive, and kept pushing forward. Today, he's",
    "textdich": ""
  },
  {
    "start": 746.32,
    "end": 751.6,
    "text": "one of the richest people in the world.",
    "textdich": ""
  },
  {
    "start": 748.8,
    "end": 760.8,
    "text": "How to apply this in your life? Think positive even in tough times. Instead of saying I failed, say I learned something",
    "textdich": ""
  },
  {
    "start": 757.76,
    "end": 764.959,
    "text": "new. Never give up on your goals.",
    "textdich": ""
  },
  {
    "start": 760.8,
    "end": 768.48,
    "text": "Success takes time. So keep trying.",
    "textdich": ""
  },
  {
    "start": 764.959,
    "end": 780.72,
    "text": "Focus on solutions, not problems. If something goes wrong, find a way to fix it instead of complaining. Surround yourself with",
    "textdich": ""
  },
  {
    "start": 776.88,
    "end": 786.72,
    "text": "positive people. Avoid negativity and be around those who inspire you.",
    "textdich": ""
  },
  {
    "start": 783.839,
    "end": 795.279,
    "text": "For example, if you are learning English and feel frustrated because you make mistakes, don't say, \"I will never be",
    "textdich": ""
  },
  {
    "start": 792.079,
    "end": 804.48,
    "text": "fluent.\" Instead, say, \"Every mistake helps me improve.\" Stay patient, keep practicing, and you will succeed.",
    "textdich": ""
  },
  {
    "start": 801.76,
    "end": 811.44,
    "text": "Remember, success is not about never failing. It's about never giving up.",
    "textdich": ""
  },
  {
    "start": 807.68,
    "end": 816.24,
    "text": "Stay positive, stay strong, and keep moving forward.",
    "textdich": ""
  },
  {
    "start": 813.2,
    "end": 826.639,
    "text": "Rule six, surround yourself with the right people. They say you are the average of the five people you spend the most time with, and this couldn't be",
    "textdich": ""
  },
  {
    "start": 824.24,
    "end": 838.88,
    "text": "more true. The people you surround yourself with have a huge impact on your success. If you're always around negative, lazy, or unmotivated people,",
    "textdich": ""
  },
  {
    "start": 836.56,
    "end": 846.56,
    "text": "it will be much harder to stay motivated and achieve your goals. On the other hand, when you surround yourself with",
    "textdich": ""
  },
  {
    "start": 844.16,
    "end": 854.959,
    "text": "positive, hard-working, and ambitious people, they will inspire you to reach higher and push you to become better.",
    "textdich": ""
  },
  {
    "start": 852.88,
    "end": 865.079,
    "text": "Let's take Warren Buffett, one of the world's most successful investors. He surrounded himself with smart, successful people who taught him",
    "textdich": ""
  },
  {
    "start": 862.399,
    "end": 876.48,
    "text": "important lessons about business and investing. by learning from them and spending time with people who shared his vision. He grew his wealth and",
    "textdich": ""
  },
  {
    "start": 873.56,
    "end": 886.32,
    "text": "knowledge. Another great example is Steve Jobs, the co-founder of Apple. He always surrounded himself with talented,",
    "textdich": ""
  },
  {
    "start": 883.12,
    "end": 892.639,
    "text": "creative individuals who challenged him and pushed him to think outside the box.",
    "textdich": ""
  },
  {
    "start": 890.0,
    "end": 901.36,
    "text": "It was this circle of highly motivated people that helped him create groundbreaking products like the iPhone.",
    "textdich": ""
  },
  {
    "start": 897.92,
    "end": 914.72,
    "text": "How to apply this in your life? Choose friends and mentors who inspire you. Look for people who support your dreams and encourage you to keep",
    "textdich": ""
  },
  {
    "start": 910.68,
    "end": 917.36,
    "text": "growing. Get rid of toxic relationships.",
    "textdich": ""
  },
  {
    "start": 914.72,
    "end": 928.079,
    "text": "If someone is always negative or brings you down, it may be time to distance yourself from them. Join groups and communities with",
    "textdich": ""
  },
  {
    "start": 924.56,
    "end": 936.6,
    "text": "similar goals. Find groups of people who are working toward the same goals as you. Whether it's in business, health,",
    "textdich": ""
  },
  {
    "start": 933.279,
    "end": 946.72,
    "text": "or personal development, learn from others. Surrounding yourself with the right people gives you the chance to learn and grow. For example, if you're",
    "textdich": ""
  },
  {
    "start": 944.399,
    "end": 955.6,
    "text": "learning English and your current circle doesn't speak English, find new friends who are motivated to learn with you.",
    "textdich": ""
  },
  {
    "start": 952.8,
    "end": 967.36,
    "text": "Join a study group, listen to English podcasts, or find people online, who are also improving their skills. Together, you will help each",
    "textdich": ""
  },
  {
    "start": 964.24,
    "end": 982.24,
    "text": "other improve faster. Remember, the people you spend time with can either lift you up or hold you back. Choose wisely. Rule seven, manage your time",
    "textdich": ""
  },
  {
    "start": 978.199,
    "end": 984.48,
    "text": "wisely. Time is something we all have.",
    "textdich": ""
  },
  {
    "start": 982.24,
    "end": 994.32,
    "text": "But the difference between successful and unsuccessful people is how they use it. Successful people know that time is",
    "textdich": ""
  },
  {
    "start": 991.36,
    "end": 1004.959,
    "text": "their most valuable resource, and they manage it wisely to make sure they're using it for the things that matter most. If you don't manage your time,",
    "textdich": ""
  },
  {
    "start": 1002.399,
    "end": 1018.8,
    "text": "you'll end up wasting it. And once time is gone, you can never get it back. That's why it's so important to make the most of every single day. Look",
    "textdich": ""
  },
  {
    "start": 1014.72,
    "end": 1028.559,
    "text": "at Elon Musk. He runs multiple companies like Tesla and SpaceX, but he is known for being extremely organized with his",
    "textdich": ""
  },
  {
    "start": 1025.079,
    "end": 1039.6,
    "text": "time. He breaks his day into fiveinut blocks. Yes, he schedules even small tasks in fiveinut chunks to stay productive and",
    "textdich": ""
  },
  {
    "start": 1036.76,
    "end": 1048.64,
    "text": "efficient. Another example is Oprah Winfrey, one of the most successful women in the world. She says that her secret to",
    "textdich": ""
  },
  {
    "start": 1046.16,
    "end": 1061.28,
    "text": "success is focusing on what truly matters and saying no to things that waste her time. By managing her time well, she has been able to build an",
    "textdich": ""
  },
  {
    "start": 1057.6,
    "end": 1064.32,
    "text": "empire and inspire millions of people.",
    "textdich": ""
  },
  {
    "start": 1061.28,
    "end": 1074.72,
    "text": "How to apply this in your life? Create a daily schedule. Break down your day into blocks of time. Include everything from",
    "textdich": ""
  },
  {
    "start": 1070.559,
    "end": 1087.16,
    "text": "work to meals to breaks. Prioritize your tasks. Focus on the most important tasks. First, use the 8020 rule. 80% of your results come from 20% of your",
    "textdich": ""
  },
  {
    "start": 1085.12,
    "end": 1100.799,
    "text": "efforts. Avoid distractions. Turn off notifications on your phone. Set boundaries and focus on one task at a time. Take",
    "textdich": ""
  },
  {
    "start": 1097.559,
    "end": 1111.039,
    "text": "breaks. Remember, productivity isn't about working non-stop. Rest and recharge to stay energized and focused. For example, if",
    "textdich": ""
  },
  {
    "start": 1108.64,
    "end": 1119.36,
    "text": "you're learning English, make a schedule for your study sessions. Dedicate 20 minutes in the morning and 20 minutes in",
    "textdich": ""
  },
  {
    "start": 1116.64,
    "end": 1130.32,
    "text": "the evening to practice listening or speaking. By sticking to a routine, you'll improve faster than trying to study for hours without a plan.",
    "textdich": ""
  },
  {
    "start": 1127.48,
    "end": 1140.08,
    "text": "Remember, time is the one thing you can never get back. So, make every minute count and manage your time wisely. Rule",
    "textdich": ""
  },
  {
    "start": 1136.64,
    "end": 1148.24,
    "text": "eight, take care of your health. Your health is the foundation of everything in your life without good health. It's",
    "textdich": ""
  },
  {
    "start": 1145.44,
    "end": 1159.919,
    "text": "impossible to reach your full potential, no matter how smart, talented, or hardworking you are. So, taking care of your body and mind is essential to",
    "textdich": ""
  },
  {
    "start": 1157.0,
    "end": 1171.6,
    "text": "success. Think about it. You need energy, strength, and a clear mind to chase your goals. If you're always tired, stressed, or sick, you won't be",
    "textdich": ""
  },
  {
    "start": 1168.32,
    "end": 1181.28,
    "text": "able to give your best effort. Success requires balance in all areas, and your health should always be a priority. Real",
    "textdich": ""
  },
  {
    "start": 1178.32,
    "end": 1187.4,
    "text": "life example. Let's look at Richard Branson, the founder of Virgin Group.",
    "textdich": ""
  },
  {
    "start": 1184.32,
    "end": 1195.919,
    "text": "He's known for being a very successful entrepreneur, but he credits his success to taking care of his health. Richard",
    "textdich": ""
  },
  {
    "start": 1193.2,
    "end": 1206.2,
    "text": "gets up early every day to exercise, whether it's a morning workout or playing sports. He believes that staying active gives him more energy and helps",
    "textdich": ""
  },
  {
    "start": 1203.919,
    "end": 1218.32,
    "text": "him stay sharp in his business decisions. Another example is Michelle Obama, former first lady of the United States. She has always been an advocate",
    "textdich": ""
  },
  {
    "start": 1215.84,
    "end": 1224.48,
    "text": "for healthy living through exercise, eating well, and focusing on mental health.",
    "textdich": ""
  },
  {
    "start": 1222.24,
    "end": 1233.24,
    "text": "She shows that good health isn't just about physical fitness. It's also about feeling good emotionally and mentally.",
    "textdich": ""
  },
  {
    "start": 1231.039,
    "end": 1244.799,
    "text": "How to apply this in your life? Exercise regularly. Whether it's walking, running, or doing yoga. Find something that keeps you",
    "textdich": ""
  },
  {
    "start": 1241.64,
    "end": 1256.96,
    "text": "moving. Regular exercise boosts your energy mood and focus. Eat a balanced diet. Fuel your body with the right foods. Healthy eating helps your body",
    "textdich": ""
  },
  {
    "start": 1254.08,
    "end": 1271.6,
    "text": "function better, keeps you energized, and boosts your overall mood. Get enough sleep. Your body and mind need rest to recover and perform at their",
    "textdich": ""
  },
  {
    "start": 1267.08,
    "end": 1282.159,
    "text": "best. Aim for 7 to 9 hours of sleep each night. Manage stress. Stress can harm both your body and mind. Take time to",
    "textdich": ""
  },
  {
    "start": 1278.919,
    "end": 1294.159,
    "text": "relax, meditate, or do things you enjoy to reduce stress levels. For example, if you're learning English, it's hard to focus if you're feeling tired or",
    "textdich": ""
  },
  {
    "start": 1291.0,
    "end": 1304.4,
    "text": "stressed. Exercise regularly to keep your energy up and eat healthy foods to help your brain stay sharp. When you feel good physically, you can",
    "textdich": ""
  },
  {
    "start": 1302.24,
    "end": 1313.44,
    "text": "concentrate better on your studies and improve faster. Remember, good health is the most important investment you can",
    "textdich": ""
  },
  {
    "start": 1310.2,
    "end": 1325.52,
    "text": "make. Take care of your body and it will take care of you. Rule nine, develop good communication skills. Communication is key to",
    "textdich": ""
  },
  {
    "start": 1322.96,
    "end": 1337.36,
    "text": "everything in life. Whether you're trying to build relationships, get a job, or lead a team, good communication can make all the difference. It's not",
    "textdich": ""
  },
  {
    "start": 1334.64,
    "end": 1345.679,
    "text": "just about what you say, but how you say it and how well you listen. When you communicate well, you build trust, solve",
    "textdich": ""
  },
  {
    "start": 1343.039,
    "end": 1353.2,
    "text": "problems faster, and create stronger connections with others. People who are great communicators are often the ones",
    "textdich": ""
  },
  {
    "start": 1350.72,
    "end": 1360.679,
    "text": "who succeed because they can get their ideas across, inspire others, and work well with different kinds of people.",
    "textdich": ""
  },
  {
    "start": 1359.44,
    "end": 1368.72,
    "text": "Real life example. Think of Barack Obama. of the former president of the United States.",
    "textdich": ""
  },
  {
    "start": 1366.559,
    "end": 1380.2,
    "text": "His speeches were powerful because of his ability to communicate clearly and inspire people. Whether it was a motivational speech or a simple message,",
    "textdich": ""
  },
  {
    "start": 1378.0,
    "end": 1389.039,
    "text": "Obama knew how to connect with his audience. He often said that his success as a leader came down to his ability to",
    "textdich": ""
  },
  {
    "start": 1386.24,
    "end": 1393.2,
    "text": "communicate effectively with people.",
    "textdich": ""
  },
  {
    "start": 1389.039,
    "end": 1404.039,
    "text": "Another example is Oprah Winfrey. Oprah is known for her amazing communication skills. Whether she's interviewing someone on her talk show or giving a",
    "textdich": ""
  },
  {
    "start": 1400.919,
    "end": 1415.24,
    "text": "speech, she is known for listening carefully, asking the right questions, and making people feel heard and understood. That's why so many people",
    "textdich": ""
  },
  {
    "start": 1412.48,
    "end": 1422.0,
    "text": "trust her and have been inspired by her. How to apply this in your life?",
    "textdich": ""
  },
  {
    "start": 1419.12,
    "end": 1432.72,
    "text": "Improve your speaking skills. Speak clearly and confidently. Practice in front of a mirror or with friends to become more",
    "textdich": ""
  },
  {
    "start": 1429.24,
    "end": 1435.559,
    "text": "comfortable. Become a better listener.",
    "textdich": ""
  },
  {
    "start": 1432.72,
    "end": 1447.52,
    "text": "Good communication isn't just about talking. Pay attention when others speak and show interest in what they have to say. Use body language. Your body",
    "textdich": ""
  },
  {
    "start": 1445.12,
    "end": 1458.24,
    "text": "language communicates just as much as your words make eye contact. Smile and use gestures to support your message.",
    "textdich": ""
  },
  {
    "start": 1454.4,
    "end": 1470.24,
    "text": "Ask questions and engage. Don't just talk at people. Ask questions to show interest and engage in conversations actively. For example, if you're",
    "textdich": ""
  },
  {
    "start": 1467.36,
    "end": 1479.799,
    "text": "learning English, practicing your speaking skills will help you communicate better with others. Speak to native speakers, join language exchange",
    "textdich": ""
  },
  {
    "start": 1477.679,
    "end": 1488.159,
    "text": "groups, or practice in front of a mirror. The more you communicate, the more confident you will become.",
    "textdich": ""
  },
  {
    "start": 1485.0,
    "end": 1499.919,
    "text": "Remember, communication is the bridge between confusion and clarity. The better you communicate, the easier it will be to build relationships and",
    "textdich": ""
  },
  {
    "start": 1496.24,
    "end": 1513.039,
    "text": "achieve your goals. Rule 10. Be adaptable and open to change. Change is inevitable. Whether we like it or not, life is always changing. New",
    "textdich": ""
  },
  {
    "start": 1509.88,
    "end": 1522.52,
    "text": "opportunities, new challenges, new ways of doing things. And the key to success is being able to adapt to these changes,",
    "textdich": ""
  },
  {
    "start": 1520.08,
    "end": 1532.48,
    "text": "and stay flexible in the face of uncertainty. If you're too rigid or stuck in your ways, you might miss out on new possibilities.",
    "textdich": ""
  },
  {
    "start": 1530.0,
    "end": 1542.24,
    "text": "But if you're open to change, you can grow, learn, and take advantage of new opportunities that come your way. Real",
    "textdich": ""
  },
  {
    "start": 1538.32,
    "end": 1555.679,
    "text": "life example, let's look at Elon Musk, the CEO of Tesla and SpaceX. When he started Tesla, electric cars were seen as impractical, and many",
    "textdich": ""
  },
  {
    "start": 1552.4,
    "end": 1558.559,
    "text": "people doubted the company's success.",
    "textdich": ""
  },
  {
    "start": 1555.679,
    "end": 1569.08,
    "text": "But Elon Musk didn't stick to the old ways of thinking. He embraced change by pushing the boundaries of electric vehicle technology and even made cars",
    "textdich": ""
  },
  {
    "start": 1566.88,
    "end": 1582.08,
    "text": "that were stylish and high-erforming. Tesla's success shows how being adaptable to new ideas and technology can change the",
    "textdich": ""
  },
  {
    "start": 1578.039,
    "end": 1584.88,
    "text": "game. Another example is Microsoft.",
    "textdich": ""
  },
  {
    "start": 1582.08,
    "end": 1596.159,
    "text": "Microsoft was once known mainly for its Windows operating system, but the company saw a shift in the tech world where cloud computing was becoming more",
    "textdich": ""
  },
  {
    "start": 1593.32,
    "end": 1607.159,
    "text": "important instead of staying focused only on software. Microsoft adapted by moving into cloud services with Azure. Now,",
    "textdich": ""
  },
  {
    "start": 1604.48,
    "end": 1621.44,
    "text": "Microsoft is a major player in the cloud industry, proving that adapting to change can create new and better opportunities. How to apply this in your",
    "textdich": ""
  },
  {
    "start": 1617.559,
    "end": 1631.039,
    "text": "life? Embrace new technology. If you're in business or learning something new, don't be afraid of using new tools,",
    "textdich": ""
  },
  {
    "start": 1627.12,
    "end": 1644.24,
    "text": "apps, or systems. Technology is changing every day and those who embrace it stay ahead. Be open to feedback. Change often comes from listening to",
    "textdich": ""
  },
  {
    "start": 1640.76,
    "end": 1656.24,
    "text": "others. Accept constructive criticism, learn from it, and adjust accordingly. Stay curious, be open to new ideas, ways of thinking, and",
    "textdich": ""
  },
  {
    "start": 1654.24,
    "end": 1659.36,
    "text": "different perspectives.",
    "textdich": ""
  },
  {
    "start": 1656.24,
    "end": 1673.559,
    "text": "The more you learn and adapt, the more you grow. Don't fear failure. Sometimes change involves failure, but failure is often just a step toward",
    "textdich": ""
  },
  {
    "start": 1670.76,
    "end": 1684.84,
    "text": "improvement. Don't be afraid to try new things, even if they don't work out right away. For example, if you're learning English, don't be afraid to try",
    "textdich": ""
  },
  {
    "start": 1682.0,
    "end": 1696.32,
    "text": "new methods. Switch up your learning routine. Use different apps, watch movies in English, or join language exchange groups. Adapting your learning",
    "textdich": ""
  },
  {
    "start": 1693.6,
    "end": 1699.64,
    "text": "style will help you improve faster.",
    "textdich": ""
  },
  {
    "start": 1696.32,
    "end": 1710.0,
    "text": "Remember, the only constant in life is change. Embrace it and you'll always stay ahead. Rule 11, help others and build",
    "textdich": ""
  },
  {
    "start": 1707.559,
    "end": 1718.32,
    "text": "relationships. Success isn't just about reaching your own goals. It's also about helping others and building meaningful",
    "textdich": ""
  },
  {
    "start": 1716.039,
    "end": 1729.679,
    "text": "relationships. When you support and collaborate with others, you create a network of people who are willing to help you back. Building strong, genuine",
    "textdich": ""
  },
  {
    "start": 1727.08,
    "end": 1740.96,
    "text": "relationships is often the key to long-term success. Take Bill Gates for example. He is not only known for founding Microsoft",
    "textdich": ""
  },
  {
    "start": 1738.399,
    "end": 1752.159,
    "text": "but also for his philanthropy through the Bill and Melinda Gates Foundation. Bill Gates has helped improve health care and reduce poverty",
    "textdich": ""
  },
  {
    "start": 1748.88,
    "end": 1763.6,
    "text": "all over the world. What's amazing is that helping others and building relationships with people from all walks of life has expanded his network and",
    "textdich": ""
  },
  {
    "start": 1760.64,
    "end": 1766.399,
    "text": "influence beyond just business.",
    "textdich": ""
  },
  {
    "start": 1763.6,
    "end": 1776.559,
    "text": "Reputation for helping others has earned him respect and his relationships have opened countless opportunities. Another example is Dwayne",
    "textdich": ""
  },
  {
    "start": 1774.48,
    "end": 1779.559,
    "text": "the Rock Johnson.",
    "textdich": ""
  },
  {
    "start": 1776.559,
    "end": 1790.88,
    "text": "Not only is he a successful actor and entrepreneur, but he's also known for helping others and building strong connections. Whether it's giving back to",
    "textdich": ""
  },
  {
    "start": 1786.96,
    "end": 1804.72,
    "text": "his fans, helping those in need, or creating opportunities for other actors, The Rock's focus on relationships and support has made him loved and",
    "textdich": ""
  },
  {
    "start": 1800.52,
    "end": 1817.039,
    "text": "respected. His success is also a result of the meaningful relationships he's built with people in different industries. How to apply this",
    "textdich": ""
  },
  {
    "start": 1812.799,
    "end": 1819.76,
    "text": "in your life? Be kind and generous.",
    "textdich": ""
  },
  {
    "start": 1817.039,
    "end": 1830.559,
    "text": "Offer help when you can. Whether it's giving someone a hand at work or helping a friend with advice, showing kindness builds trust. Invest time in",
    "textdich": ""
  },
  {
    "start": 1828.559,
    "end": 1833.039,
    "text": "relationships.",
    "textdich": ""
  },
  {
    "start": 1830.559,
    "end": 1843.2,
    "text": "Take time to get to know people and build real connections. This isn't about what they can do for you, but about creating",
    "textdich": ""
  },
  {
    "start": 1839.76,
    "end": 1846.279,
    "text": "genuine bonds. Collaborate with others.",
    "textdich": ""
  },
  {
    "start": 1843.2,
    "end": 1854.48,
    "text": "Success often involves teamwork. Share ideas, listen to others, and work together to achieve goals. Be supportive.",
    "textdich": ""
  }
]