[
  {
    "start": 0.08,
    "end": 4.32,
    "text": "It's important for software developers to understand object oriented programming.",
    "textdich": ""
  },
  {
    "start": 4.88,
    "end": 10.16,
    "text": "In this course, Jim from JimShapeCoding will teach you all about object oriented programming and",
    "textdich": ""
  },
  {
    "start": 10.16,
    "end": 15.44,
    "text": "Python object oriented programming, it could be what is holding you back from being a great Python",
    "textdich": ""
  },
  {
    "start": 15.44,
    "end": 23.04,
    "text": "developer. And as well as lending your first job as a software engineer, Welcome everyone to Python",
    "textdich": ""
  },
  {
    "start": 23.04,
    "end": 28.309,
    "text": "object oriented programming course. Now if you struggle to understand the concepts of object",
    "textdich": ""
  },
  {
    "start": 28.309,
    "end": 33.04,
    "text": "oriented programming in the past, then you are totally fine. And you're in good hands. Because",
    "textdich": ""
  },
  {
    "start": 33.04,
    "end": 38.8,
    "text": "in this course, I'm going to make sure that this will be the last tutorial that you will ever watch",
    "textdich": ""
  },
  {
    "start": 38.8,
    "end": 45.68,
    "text": "about classes and the complex concepts that comes with object oriented programming. And we",
    "textdich": ""
  },
  {
    "start": 45.68,
    "end": 51.68,
    "text": "are going to do this by developing a real Python application, that is going to be very cool to",
    "textdich": ""
  },
  {
    "start": 51.68,
    "end": 58.08,
    "text": "write. And we will add to its complexity step by step. And throughout the way, we will understand",
    "textdich": ""
  },
  {
    "start": 58.08,
    "end": 62.72,
    "text": "everything that we need to know about object oriented programming. Now there are going to",
    "textdich": ""
  },
  {
    "start": 62.72,
    "end": 68.48,
    "text": "be some requirements to this course, I do expect from everybody to know at least about functions,",
    "textdich": ""
  },
  {
    "start": 68.48,
    "end": 74.08,
    "text": "variables, if statements and as well as for loops. And if you know those things from",
    "textdich": ""
  },
  {
    "start": 74.08,
    "end": 78.32,
    "text": "other programming languages, then this is also fine. So with that being said,",
    "textdich": ""
  },
  {
    "start": 78.32,
    "end": 82.72,
    "text": "let's get started. Now to explain why you should write object oriented programs,",
    "textdich": ""
  },
  {
    "start": 82.72,
    "end": 87.76,
    "text": "I will explain the concepts based on a store management system that we will start developing",
    "textdich": ""
  },
  {
    "start": 87.76,
    "end": 92.64,
    "text": "together. So starting to think about how to take our first steps with such a problem,",
    "textdich": ""
  },
  {
    "start": 92.64,
    "end": 97.52,
    "text": "we could first think about tracking after the items that we have right now in our store. So one",
    "textdich": ""
  },
  {
    "start": 97.52,
    "end": 103.44,
    "text": "way we could get started, we could create those four variables to start tracking after our items.",
    "textdich": ""
  },
  {
    "start": 103.44,
    "end": 108.56,
    "text": "So as you can see, we have our first variable item one equals to phone. And then we have three more",
    "textdich": ""
  },
  {
    "start": 108.56,
    "end": 114.64,
    "text": "variables that are intentionally starting with the prefix of item one, so that we could describe that",
    "textdich": ""
  },
  {
    "start": 114.64,
    "end": 120.4,
    "text": "those four variables are related to each other by following the correct naming conventions. Now,",
    "textdich": ""
  },
  {
    "start": 120.4,
    "end": 124.96,
    "text": "you might think that those four variables are related to each other only because it uses the",
    "textdich": ""
  },
  {
    "start": 124.96,
    "end": 131.12,
    "text": "same prefix of item one. For Python, those are just four variables with different data types.",
    "textdich": ""
  },
  {
    "start": 131.12,
    "end": 138.48,
    "text": "So if we were to print the type, for each of those four variables, now, we will receive their types",
    "textdich": ""
  },
  {
    "start": 138.48,
    "end": 145.12,
    "text": "with no surprises, right, we will receive string, and integer for price, quantity and price total.",
    "textdich": ""
  },
  {
    "start": 145.12,
    "end": 151.04,
    "text": "Now I want to focus on those specific outputs right now, because as you can see, for each of the",
    "textdich": ""
  },
  {
    "start": 151.04,
    "end": 160.16,
    "text": "types, we also see the key word of class. Now this means that those data types are actually instances",
    "textdich": ""
  },
  {
    "start": 160.16,
    "end": 167.12,
    "text": "of strings or integers. So in Python programming language, each data type is an object",
    "textdich": ""
  },
  {
    "start": 167.12,
    "end": 174.16,
    "text": "that has been instantiated earlier by some class. And for the item, one variable that has",
    "textdich": ""
  },
  {
    "start": 174.16,
    "end": 180.24,
    "text": "been instantiated from a string type of class. And for the price quantity and price total,",
    "textdich": ""
  },
  {
    "start": 180.24,
    "end": 186.4,
    "text": "those have been instantiated from a class that is named Iand, meaning integer. So it could",
    "textdich": ""
  },
  {
    "start": 186.4,
    "end": 192.4,
    "text": "have been nicer. If we call the tail Python that we want to create a datatype of our own,",
    "textdich": ""
  },
  {
    "start": 192.4,
    "end": 197.84,
    "text": "it will allow us to write a code that we can reuse in the future easily if needed. Now,",
    "textdich": ""
  },
  {
    "start": 197.84,
    "end": 202.4,
    "text": "each instance could have attributes to describe related information about it.",
    "textdich": ""
  },
  {
    "start": 202.4,
    "end": 208.0,
    "text": "And we can think about at least some good candidates for attributes we could have for our",
    "textdich": ""
  },
  {
    "start": 208.0,
    "end": 215.52,
    "text": "item datatype, like its name, price, or quantity. Alright, so let's go ahead and start creating our",
    "textdich": ""
  },
  {
    "start": 215.52,
    "end": 220.48,
    "text": "first class. So I will clean everything from here, and we'll go ahead with it. So it is going to be",
    "textdich": ""
  },
  {
    "start": 220.48,
    "end": 226.32,
    "text": "divided into two parts, the first one will be the creation of the class. And the second one will be",
    "textdich": ""
  },
  {
    "start": 226.32,
    "end": 232.96,
    "text": "the part that I will instantiate some objects of this class. Now when I say creating an instance,",
    "textdich": ""
  },
  {
    "start": 232.96,
    "end": 238.0,
    "text": "or creating an object, basically I mean to the same thing, so you might hear me saying one of",
    "textdich": ""
  },
  {
    "start": 238.0,
    "end": 244.08,
    "text": "those. Alright, so let's go ahead and say class. And then this needs to be followed by the name",
    "textdich": ""
  },
  {
    "start": 244.08,
    "end": 249.28,
    "text": "of the class that you want to create. So we would like to give it the name of item. And then inside",
    "textdich": ""
  },
  {
    "start": 249.28,
    "end": 255.2,
    "text": "of this class, in the future, we are going to write some code that will be very beneficial and",
    "textdich": ""
  },
  {
    "start": 255.2,
    "end": 261.44,
    "text": "very useful for us. So we won't repeat ourselves every time that we like to take similar actions.",
    "textdich": ""
  },
  {
    "start": 261.44,
    "end": 267.04,
    "text": "But for now, temporarily, I'm going to say here a pass so we will not receive any arrows inside this",
    "textdich": ""
  },
  {
    "start": 267.04,
    "end": 272.08,
    "text": "class definition. Alright, so now that we have created our class, then we are allowed to create",
    "textdich": ""
  },
  {
    "start": 272.08,
    "end": 279.12,
    "text": "some instances of this class. So let's go ahead and say item one is equal to item. And that action",
    "textdich": ""
  },
  {
    "start": 279.12,
    "end": 285.36,
    "text": "is equivalent to creating an instance of a class, just like if you were to create a random string,",
    "textdich": ""
  },
  {
    "start": 286.08,
    "end": 292.08,
    "text": "then you will say something like the following. This is equivalent to this one as well. So it",
    "textdich": ""
  },
  {
    "start": 292.08,
    "end": 297.84,
    "text": "is very important to understand how classes are working in Python. So I will delete this line",
    "textdich": ""
  },
  {
    "start": 297.84,
    "end": 303.84,
    "text": "because this was just for an example. And now I said that we are allowed to assign some attributes",
    "textdich": ""
  },
  {
    "start": 303.84,
    "end": 309.68,
    "text": "to instances of a class. So let's go ahead and start creating attributes. And that will be",
    "textdich": ""
  },
  {
    "start": 309.68,
    "end": 316.64,
    "text": "achievable by using the dot sign right after the instance of a class. And here you can say that you",
    "textdich": ""
  },
  {
    "start": 316.64,
    "end": 322.96,
    "text": "want to give it an attribute, like a name, that will be equal to phone, and item one, that price",
    "textdich": ""
  },
  {
    "start": 322.96,
    "end": 331.28,
    "text": "could be equal to 100. And I think one dot quantity could be equal to five, for example.",
    "textdich": ""
  },
  {
    "start": 331.28,
    "end": 336.56,
    "text": "Now in that stage, you might ask yourself, what is the difference between the random variables",
    "textdich": ""
  },
  {
    "start": 336.56,
    "end": 341.84,
    "text": "that we have created to those four lines? Well, here, we actually have a relationship",
    "textdich": ""
  },
  {
    "start": 341.84,
    "end": 347.68,
    "text": "between those four lines, because each one of the attributes are assigned to one instance of the",
    "textdich": ""
  },
  {
    "start": 347.68,
    "end": 355.52,
    "text": "class. And I could probably do this by going ahead and try to print the types of item one nil, and as",
    "textdich": ""
  },
  {
    "start": 355.52,
    "end": 362.48,
    "text": "well as the types of the attributes of name, price and quantity. Now with name, price and quantity,",
    "textdich": ""
  },
  {
    "start": 362.48,
    "end": 368.96,
    "text": "we are not going to have any surprises because we assign string type attributes to the item object.",
    "textdich": ""
  },
  {
    "start": 368.96,
    "end": 374.48,
    "text": "But if we were to print that, then check out the result if I was to run this program,",
    "textdich": ""
  },
  {
    "start": 374.48,
    "end": 380.88,
    "text": "so you can see that now we have a data type of item here. And that is the big difference between",
    "textdich": ""
  },
  {
    "start": 380.88,
    "end": 386.16,
    "text": "what we have seen previously to this thing that we have just created. So now we understand how",
    "textdich": ""
  },
  {
    "start": 386.16,
    "end": 391.68,
    "text": "we can create our own data types. Now let's go ahead and see what are the rest of the benefits",
    "textdich": ""
  },
  {
    "start": 391.68,
    "end": 397.52,
    "text": "using object oriented programming. Okay, so until now, we understood how to assign attributes to",
    "textdich": ""
  },
  {
    "start": 397.52,
    "end": 403.84,
    "text": "instances, we should also understand now how we can create some methods and execute them on our",
    "textdich": ""
  },
  {
    "start": 403.84,
    "end": 409.92,
    "text": "instances. Now, if we will take as an example, the building class of string, then you know that we",
    "textdich": ""
  },
  {
    "start": 409.92,
    "end": 415.6,
    "text": "have some methods that we can go ahead and execute for each of our strings. And for this example,",
    "textdich": ""
  },
  {
    "start": 415.6,
    "end": 421.36,
    "text": "you can see that I grabbed an instance of a string that I named random str, and then I go ahead in",
    "textdich": ""
  },
  {
    "start": 421.36,
    "end": 426.4,
    "text": "the next line and execute the opera method, which if you remember is it's possible to grab all",
    "textdich": ""
  },
  {
    "start": 426.4,
    "end": 432.64,
    "text": "the letters and turn them to uppercase. Now the biggest question here is how we can go ahead and",
    "textdich": ""
  },
  {
    "start": 432.64,
    "end": 437.76,
    "text": "design some methods that are going to be allowed to execute on our instances,",
    "textdich": ""
  },
  {
    "start": 437.76,
    "end": 444.88,
    "text": "Well, the answer is inside our class. So we could go inside our class and write some methods that",
    "textdich": ""
  },
  {
    "start": 444.88,
    "end": 453.6,
    "text": "will be accessible from our instances. So we could go ahead and say that and give our method a name.",
    "textdich": ""
  },
  {
    "start": 453.6,
    "end": 460.4,
    "text": "Now a good candidate for a metal that we'd like to create now is actually calculate total price,",
    "textdich": ""
  },
  {
    "start": 460.4,
    "end": 464.8,
    "text": "because as we understand, it could have been nice. If we were to have a method that will go",
    "textdich": ""
  },
  {
    "start": 464.8,
    "end": 471.44,
    "text": "ahead and calculate the result, multiplying it one dot price, with item one dot quantity, so we can",
    "textdich": ""
  },
  {
    "start": 471.44,
    "end": 477.36,
    "text": "get the total price for that specific item. Now before we go ahead and complete this function,",
    "textdich": ""
  },
  {
    "start": 477.36,
    "end": 482.72,
    "text": "then I'm going to just create one more instance of this item by also deleting those two lines,",
    "textdich": ""
  },
  {
    "start": 482.72,
    "end": 486.8,
    "text": "because we understood the example. So I'm just going to change those to item two,",
    "textdich": ""
  },
  {
    "start": 487.6,
    "end": 494.16,
    "text": "like that. And I'm going to use something like laptop and change the price to 1000. And say",
    "textdich": ""
  },
  {
    "start": 494.16,
    "end": 499.52,
    "text": "that we have three of those. Now just a quick side note, when you will hear me say methods,",
    "textdich": ""
  },
  {
    "start": 499.52,
    "end": 505.2,
    "text": "then I basically mean two functions that are inside the classes. Because in terms of Python,",
    "textdich": ""
  },
  {
    "start": 505.2,
    "end": 511.28,
    "text": "or in any programming language, when you have isolated definitions with this keyword, then those",
    "textdich": ""
  },
  {
    "start": 511.28,
    "end": 516.48,
    "text": "are considered to be called functions. But when you go ahead and create those functions inside",
    "textdich": ""
  },
  {
    "start": 516.48,
    "end": 522.4,
    "text": "classes, then those are called methods. So that is an important point that you should understand,",
    "textdich": ""
  },
  {
    "start": 522.4,
    "end": 527.28,
    "text": "because I'm going to call those methods from now. Okay, so now if I was to continue",
    "textdich": ""
  },
  {
    "start": 527.28,
    "end": 532.56,
    "text": "by opening up and closing those parentheses, then you are going to see one parameter that",
    "textdich": ""
  },
  {
    "start": 532.56,
    "end": 538.72,
    "text": "is autogenerated that Python wants us to receive intentionally. Now the reason that this happens,",
    "textdich": ""
  },
  {
    "start": 539.36,
    "end": 546.48,
    "text": "Python passes the object itself as a first argument, when you go ahead and call those",
    "textdich": ""
  },
  {
    "start": 546.48,
    "end": 554.24,
    "text": "methods. Now, if I was to go here, and say item one dot calculate total price,",
    "textdich": ""
  },
  {
    "start": 554.24,
    "end": 559.44,
    "text": "then the action that we are doing now is calling this method. But when you go ahead and call a",
    "textdich": ""
  },
  {
    "start": 559.44,
    "end": 567.92,
    "text": "method from an instance, then Python passes the object itself as the first argument every time.",
    "textdich": ""
  },
  {
    "start": 567.92,
    "end": 573.28,
    "text": "So that is why we are not allowed to create methods that will never receive parameters.",
    "textdich": ""
  },
  {
    "start": 573.28,
    "end": 580.24,
    "text": "Now you will see this if I was to remove the first parameter, and say something like pass. Now if I",
    "textdich": ""
  },
  {
    "start": 580.24,
    "end": 588.4,
    "text": "was to execute this program now, then you're going to see type zero, calculate total price takes",
    "textdich": ""
  },
  {
    "start": 588.4,
    "end": 595.12,
    "text": "zero positional arguments, but one was given. So in simple words, what this exception says",
    "textdich": ""
  },
  {
    "start": 595.12,
    "end": 601.6,
    "text": "is that Python tries to pass one argument and you are not received using any parameter, so that is",
    "textdich": ""
  },
  {
    "start": 601.6,
    "end": 607.52,
    "text": "very problematic. And that is why you always have to receive at least one parameter when you go",
    "textdich": ""
  },
  {
    "start": 607.52,
    "end": 614.08,
    "text": "ahead and create your methods. Now since we always receive this parameter, then it is just a common",
    "textdich": ""
  },
  {
    "start": 614.08,
    "end": 620.88,
    "text": "approach to call this self. It was okay if I was to call it something like my perm, or I don't know",
    "textdich": ""
  },
  {
    "start": 620.88,
    "end": 626.4,
    "text": "something else. But you never want to mess up with common conventions across different Python",
    "textdich": ""
  },
  {
    "start": 626.4,
    "end": 633.6,
    "text": "developers. So that is why just make sure that you leave it as self every time. Now, if I was to",
    "textdich": ""
  },
  {
    "start": 633.6,
    "end": 639.04,
    "text": "go ahead and run this program, then you got to see that we are not going to receive any errors. So",
    "textdich": ""
  },
  {
    "start": 639.04,
    "end": 644.16,
    "text": "this means that this method has been implemented correctly. Now let's see how we are going to",
    "textdich": ""
  },
  {
    "start": 644.16,
    "end": 649.12,
    "text": "benefit from creating this method, because it should go ahead and create a calculation for us",
    "textdich": ""
  },
  {
    "start": 649.68,
    "end": 656.48,
    "text": "using price and quantity. So I will intentionally receive here two more parameters, which we could",
    "textdich": ""
  },
  {
    "start": 656.48,
    "end": 664.08,
    "text": "name just x&y for now. And we could just say return x multiplied by y. And now I",
    "textdich": ""
  },
  {
    "start": 664.08,
    "end": 669.92,
    "text": "will go ahead and pass in here, two additional arguments. And it will be item one dot price.",
    "textdich": ""
  },
  {
    "start": 671.28,
    "end": 677.12,
    "text": "The second one will be quantity. So that is going to work because when you call this method",
    "textdich": ""
  },
  {
    "start": 677.12,
    "end": 682.8,
    "text": "in the background, Python passes this as an argument. And then it passes the second argument.",
    "textdich": ""
  },
  {
    "start": 682.8,
    "end": 688.08,
    "text": "And then this has been passed as a third argument. So that is perfect. And if I was to run that,",
    "textdich": ""
  },
  {
    "start": 688.08,
    "end": 694.96,
    "text": "and actually print this, so excuse me for running this before printing it, so I will surround this",
    "textdich": ""
  },
  {
    "start": 696.16,
    "end": 701.84,
    "text": "expression with this print built in function. And I will run that and you're gonna see 500 as",
    "textdich": ""
  },
  {
    "start": 701.84,
    "end": 708.56,
    "text": "expected, now I could do the exact same thing for calculating the total price of our second item.",
    "textdich": ""
  },
  {
    "start": 708.56,
    "end": 715.76,
    "text": "So if I was to grab this and paste this in, in this line, and actually change this to item",
    "textdich": ""
  },
  {
    "start": 715.76,
    "end": 721.6,
    "text": "two, and change this one to item two, and as well as this one, then I will receive",
    "textdich": ""
  },
  {
    "start": 722.64,
    "end": 728.64,
    "text": "3000 as expected. And that is how you can create a metal. Alright, so until that point,",
    "textdich": ""
  },
  {
    "start": 728.64,
    "end": 734.24,
    "text": "we understood that we can assign attributes and as well as creating some methods that we can go ahead",
    "textdich": ""
  },
  {
    "start": 734.24,
    "end": 741.28,
    "text": "and use them from our instances directly, like those two examples in that line, and as well as in",
    "textdich": ""
  },
  {
    "start": 741.28,
    "end": 746.64,
    "text": "that line. Now in that episode, we are going to solve some more problems that we have in terms of",
    "textdich": ""
  },
  {
    "start": 746.64,
    "end": 751.28,
    "text": "best practices in object oriented programming, and things that you're going to see in each",
    "textdich": ""
  },
  {
    "start": 751.28,
    "end": 756.72,
    "text": "project that is based on Opie. Alright, so let's get started. Now one of the first problems that",
    "textdich": ""
  },
  {
    "start": 756.72,
    "end": 762.64,
    "text": "we have here is the fact that we don't have a set of rules for the attributes that you would like to",
    "textdich": ""
  },
  {
    "start": 762.64,
    "end": 767.28,
    "text": "pass in in order to instantiate an instance successfully. And what that means, it means",
    "textdich": ""
  },
  {
    "start": 767.28,
    "end": 772.72,
    "text": "that for each item that I want to go ahead and create, I need to hard code in the attribute name",
    "textdich": ""
  },
  {
    "start": 773.52,
    "end": 780.56,
    "text": "like those in here. And it could have been nicer if we call somehow declaring the class that in",
    "textdich": ""
  },
  {
    "start": 780.56,
    "end": 786.96,
    "text": "order to instantiate an instance successfully, name, price and quantity must be passed,",
    "textdich": ""
  },
  {
    "start": 786.96,
    "end": 792.24,
    "text": "otherwise, the instance could not have been created successfully. So what that means, it means",
    "textdich": ""
  },
  {
    "start": 792.24,
    "end": 798.4,
    "text": "that it could have been a great option if we could somehow execute something in the background. The",
    "textdich": ""
  },
  {
    "start": 798.4,
    "end": 804.96,
    "text": "second that we instantiate an instance and there is a way that you can reach such a behavior. And",
    "textdich": ""
  },
  {
    "start": 804.96,
    "end": 810.64,
    "text": "that is by creating a special method with a very unique name, which is called double underscore",
    "textdich": ""
  },
  {
    "start": 810.64,
    "end": 817.6,
    "text": "init double underscore. Now you might hear this term as well as cold as constructor. Basically,",
    "textdich": ""
  },
  {
    "start": 817.6,
    "end": 824.24,
    "text": "that is a method with a unique name that you need to call it the way it is intentionally in order to",
    "textdich": ""
  },
  {
    "start": 824.24,
    "end": 832.16,
    "text": "use its special futures. Now, the way that this is going to work is by creating it the following way.",
    "textdich": ""
  },
  {
    "start": 832.16,
    "end": 838.4,
    "text": "So it will be double underscore. And as you can see, I already have auto completion for some very",
    "textdich": ""
  },
  {
    "start": 838.4,
    "end": 844.8,
    "text": "special methods that are starting and ending with double underscore. Now the collection of those",
    "textdich": ""
  },
  {
    "start": 844.8,
    "end": 850.88,
    "text": "methods are used to be called Magic methods. And we are going to learn a lot of more magic methods",
    "textdich": ""
  },
  {
    "start": 850.88,
    "end": 857.36,
    "text": "that you have in Opie, but the first one that we are going to start with will be the init double",
    "textdich": ""
  },
  {
    "start": 857.36,
    "end": 863.2,
    "text": "underscore, like that. Alright, so now that we have created this method, then let's actually see",
    "textdich": ""
  },
  {
    "start": 863.2,
    "end": 868.56,
    "text": "what this metal does in the background. So when you go ahead and create an instance of a class,",
    "textdich": ""
  },
  {
    "start": 868.56,
    "end": 874.88,
    "text": "then Python executes this double underscore init function automatically. So what that means,",
    "textdich": ""
  },
  {
    "start": 874.88,
    "end": 880.32,
    "text": "it means that now that we have declared our class, Python is going to run through this line.",
    "textdich": ""
  },
  {
    "start": 880.32,
    "end": 885.92,
    "text": "And then since an instance has been created, and we have double underscore init method designed,",
    "textdich": ""
  },
  {
    "start": 885.92,
    "end": 890.48,
    "text": "then it is going to call the actions that are inside this double underscore init",
    "textdich": ""
  },
  {
    "start": 890.48,
    "end": 896.56,
    "text": "double underscore method. Now in order to prove that, then I'm going to start with a very basic",
    "textdich": ""
  },
  {
    "start": 896.56,
    "end": 905.28,
    "text": "point here that will say I am created Like that. Now we got here, one instance. And here we got",
    "textdich": ""
  },
  {
    "start": 905.28,
    "end": 911.04,
    "text": "another one. So we should see I am created twice. And in order to avoid confusions, then I'm going",
    "textdich": ""
  },
  {
    "start": 911.04,
    "end": 917.76,
    "text": "to delete those print lines from here so we can see a cleaner picture. Alright, so if we were to",
    "textdich": ""
  },
  {
    "start": 917.76,
    "end": 924.24,
    "text": "run our program, then we can see that we have I am created twice. And that is because Python called",
    "textdich": ""
  },
  {
    "start": 924.24,
    "end": 929.2,
    "text": "this double underscore init double underscore method twice, thanks to those two instances that",
    "textdich": ""
  },
  {
    "start": 929.2,
    "end": 933.76,
    "text": "we have graded. Alright, so now that we use the double underscore init function in this class,",
    "textdich": ""
  },
  {
    "start": 933.76,
    "end": 939.04,
    "text": "we should take benefit from it and solve some more problems in order to implement Opie best",
    "textdich": ""
  },
  {
    "start": 939.04,
    "end": 943.92,
    "text": "practices. Now if you remember in the beginning of this tutorial, I said that one of the problems",
    "textdich": ""
  },
  {
    "start": 943.92,
    "end": 950.0,
    "text": "that we have till this point is the fact that we still hard code in the attributes in that way by",
    "textdich": ""
  },
  {
    "start": 950.0,
    "end": 956.4,
    "text": "saying dot name, dot price dot quantity. And that is something that we can for sure avoid.",
    "textdich": ""
  },
  {
    "start": 956.4,
    "end": 961.44,
    "text": "Now let's see how we can start avoiding creating those attributes hard coded for each of the",
    "textdich": ""
  },
  {
    "start": 961.44,
    "end": 965.76,
    "text": "instances here. So we can actually benefit from the double underscore init method that we have",
    "textdich": ""
  },
  {
    "start": 965.76,
    "end": 971.6,
    "text": "designed. And let's see how now we understand that for each instance that we will create, it",
    "textdich": ""
  },
  {
    "start": 971.6,
    "end": 977.12,
    "text": "will go ahead and call this double underscore init method automatically. So what that means, it means",
    "textdich": ""
  },
  {
    "start": 977.12,
    "end": 982.16,
    "text": "that not only we can allow ourselves to receive the self parameter, because this is a mandatory",
    "textdich": ""
  },
  {
    "start": 982.16,
    "end": 987.2,
    "text": "thing that we should do, because Python in the background, passes the instance itself as the",
    "textdich": ""
  },
  {
    "start": 987.2,
    "end": 993.84,
    "text": "first argument, we could, in addition, take some more parameters, and then do something with them.",
    "textdich": ""
  },
  {
    "start": 993.84,
    "end": 999.52,
    "text": "So as a solder, let's say that we would like to receive one more parameter that we could name it",
    "textdich": ""
  },
  {
    "start": 999.52,
    "end": 1006.0,
    "text": "name. And as you can see, automatically, Python is going to complain how the name argument is",
    "textdich": ""
  },
  {
    "start": 1006.0,
    "end": 1013.12,
    "text": "not filled in here. So now, I could go ahead and pass in the argument of phone for that one. And",
    "textdich": ""
  },
  {
    "start": 1013.12,
    "end": 1020.08,
    "text": "for the second one, I can go ahead and pass in the argument of laptop. Now once I have created this,",
    "textdich": ""
  },
  {
    "start": 1020.08,
    "end": 1024.96,
    "text": "then I can actually go ahead and change my print line a little bit. So it will be a unique",
    "textdich": ""
  },
  {
    "start": 1024.96,
    "end": 1031.2,
    "text": "print line where I can identify from where each print line came from. So I can go ahead and say",
    "textdich": ""
  },
  {
    "start": 1031.2,
    "end": 1039.44,
    "text": "an instance created and use a column here and then refer to the name like that. And now that",
    "textdich": ""
  },
  {
    "start": 1039.44,
    "end": 1045.36,
    "text": "we have created this, then if we were to run our program, then you're gonna see unique sentences,",
    "textdich": ""
  },
  {
    "start": 1045.36,
    "end": 1051.52,
    "text": "an instance created for the phone, and as well as for the laptop. Alright, so now that we have done",
    "textdich": ""
  },
  {
    "start": 1051.52,
    "end": 1056.64,
    "text": "this, then there is something that is still not quite perfect, because we still pass in",
    "textdich": ""
  },
  {
    "start": 1056.64,
    "end": 1064.08,
    "text": "the attribute of name here and here. So now pay attention to how the init method has to receive",
    "textdich": ""
  },
  {
    "start": 1064.08,
    "end": 1069.44,
    "text": "the self as a parameter as well. And we already know the reasons for that. And the fact that we",
    "textdich": ""
  },
  {
    "start": 1069.44,
    "end": 1075.68,
    "text": "have self as a parameter here could actually allow us to assign the attributes from the init method,",
    "textdich": ""
  },
  {
    "start": 1075.68,
    "end": 1081.04,
    "text": "so that we will not have to go ahead and assign the attribute of name for each of the instances",
    "textdich": ""
  },
  {
    "start": 1081.04,
    "end": 1087.04,
    "text": "we create. So what that means, it means that I can dynamically assign an attribute to an",
    "textdich": ""
  },
  {
    "start": 1087.04,
    "end": 1093.92,
    "text": "instance from this magic method, which is called double underscore in it. So if I was to say, self,",
    "textdich": ""
  },
  {
    "start": 1094.88,
    "end": 1100.8,
    "text": "dot name, so I'm assigning the attribute of name to each instance,",
    "textdich": ""
  },
  {
    "start": 1100.8,
    "end": 1106.8,
    "text": "that is going to be created or created yet, and I'm making that to be equal to the name",
    "textdich": ""
  },
  {
    "start": 1107.52,
    "end": 1114.0,
    "text": "that is passed in from here. So what that means, it means that now I can allow myself to delete",
    "textdich": ""
  },
  {
    "start": 1114.64,
    "end": 1122.32,
    "text": "this line. And then this line. So as you can see, now I have a dynamic attribute assignment,",
    "textdich": ""
  },
  {
    "start": 1122.32,
    "end": 1127.52,
    "text": "thanks to the self dot name equals name that we have wrote here in the to test that the",
    "textdich": ""
  },
  {
    "start": 1127.52,
    "end": 1132.64,
    "text": "attribute assignment world, then I can go down here and use two more lines that will look like",
    "textdich": ""
  },
  {
    "start": 1132.64,
    "end": 1141.36,
    "text": "the following. So I will print it one dot name, and I will also print item to that name. And in",
    "textdich": ""
  },
  {
    "start": 1141.36,
    "end": 1146.08,
    "text": "order to avoid confusions, then I'm going to get rid of this line. So we could only see",
    "textdich": ""
  },
  {
    "start": 1146.08,
    "end": 1150.32,
    "text": "the print lines from here. And now if I was to run that, then you can see that we",
    "textdich": ""
  },
  {
    "start": 1150.32,
    "end": 1156.24,
    "text": "receive a phone and laptop. So it means that we were able to assign the attributes dynamically.",
    "textdich": ""
  },
  {
    "start": 1156.24,
    "end": 1161.44,
    "text": "And that is perfect. And now that we get the idea of that, then we should also do the same for the",
    "textdich": ""
  },
  {
    "start": 1161.44,
    "end": 1167.52,
    "text": "rest of the attributes that we'd like to receive. So we also got the price and quantity to take",
    "textdich": ""
  },
  {
    "start": 1167.52,
    "end": 1171.84,
    "text": "care of. So I'm going to go to my init method, and I'm going to receive again,",
    "textdich": ""
  },
  {
    "start": 1172.4,
    "end": 1178.56,
    "text": "price and quantity. And I'm going to do the exact same thing. So I'm going to assign the attribute",
    "textdich": ""
  },
  {
    "start": 1178.56,
    "end": 1186.08,
    "text": "of price. And that will be equal to price. And the quantity will be equal to the quantity. And you",
    "textdich": ""
  },
  {
    "start": 1186.08,
    "end": 1191.76,
    "text": "can also see that again Python complains about the price and the quantity not being passed in here.",
    "textdich": ""
  },
  {
    "start": 1191.76,
    "end": 1199.36,
    "text": "So I can say 100 and then five, and then I can delete those. And then I can do the same here.",
    "textdich": ""
  },
  {
    "start": 1199.36,
    "end": 1206.64,
    "text": "I could pass In 1000, and then three, and delete those, and in order to prove that this is going",
    "textdich": ""
  },
  {
    "start": 1206.64,
    "end": 1215.12,
    "text": "to work, then I'm going to copy myself a couple of times and change this to quantity, I mean price,",
    "textdich": ""
  },
  {
    "start": 1216.16,
    "end": 1223.2,
    "text": "this one will be price as well. This one will be quantity and this one as well. Now if I was to",
    "textdich": ""
  },
  {
    "start": 1223.2,
    "end": 1228.48,
    "text": "run that, then you can see that the results are as expected. So that is a way that you should",
    "textdich": ""
  },
  {
    "start": 1228.48,
    "end": 1233.44,
    "text": "work with the double underscore init method, you should always take care of the attributes",
    "textdich": ""
  },
  {
    "start": 1233.44,
    "end": 1239.2,
    "text": "that you want to assign to an object inside the double underscore init method meaning inside the",
    "textdich": ""
  },
  {
    "start": 1239.2,
    "end": 1244.64,
    "text": "constructor. Now a couple of signs that are quite important to remember when we work with classes.",
    "textdich": ""
  },
  {
    "start": 1244.64,
    "end": 1249.6,
    "text": "Now when we go ahead and use the Ws coordinate method, this doesn't mean that we cannot",
    "textdich": ""
  },
  {
    "start": 1249.6,
    "end": 1256.64,
    "text": "differentiate between mandatory parameters to non mandatory parameters. So say that you currently",
    "textdich": ""
  },
  {
    "start": 1256.64,
    "end": 1263.12,
    "text": "don't know how much you have from a specific item, then you can go ahead and by default,",
    "textdich": ""
  },
  {
    "start": 1263.12,
    "end": 1268.32,
    "text": "received this quantity parameter as zero, because it is realistic situation that you currently don't",
    "textdich": ""
  },
  {
    "start": 1268.32,
    "end": 1273.36,
    "text": "know how much phones you have on your store. so we can directly go ahead and use a default",
    "textdich": ""
  },
  {
    "start": 1273.36,
    "end": 1280.48,
    "text": "value for that, for example, zero, and then this will mean that you will not have to pass in those",
    "textdich": ""
  },
  {
    "start": 1280.48,
    "end": 1286.72,
    "text": "five and three here. And now in order to show you the results of that, if I was to run our program,",
    "textdich": ""
  },
  {
    "start": 1286.72,
    "end": 1292.88,
    "text": "then you can see that we receive zero twice for those two prints in here. So that is something",
    "textdich": ""
  },
  {
    "start": 1292.88,
    "end": 1298.8,
    "text": "that you will want to remember. And one more quite important point that I'd like to talk about now",
    "textdich": ""
  },
  {
    "start": 1298.8,
    "end": 1305.2,
    "text": "is the fact that you can assign attributes to specific instances individually. So say that",
    "textdich": ""
  },
  {
    "start": 1305.2,
    "end": 1313.04,
    "text": "you want to know if the laptop has numpad are not because some laptops are not having the numpad on",
    "textdich": ""
  },
  {
    "start": 1313.04,
    "end": 1319.44,
    "text": "the right side of the keyboard. But this is not a realistic attribute that you will want to assign",
    "textdich": ""
  },
  {
    "start": 1319.44,
    "end": 1325.92,
    "text": "to a phone. And that is why you can go ahead and let me delete those print lines, by the way.",
    "textdich": ""
  },
  {
    "start": 1325.92,
    "end": 1333.52,
    "text": "And that is why you can go ahead and say something like item two that has numpad equals to false like",
    "textdich": ""
  },
  {
    "start": 1333.52,
    "end": 1338.72,
    "text": "that. And that is something that you want to remember, because the fact that you use some",
    "textdich": ""
  },
  {
    "start": 1338.72,
    "end": 1344.64,
    "text": "attribute assignments in the constructor doesn't mean that you cannot add some more attributes that",
    "textdich": ""
  },
  {
    "start": 1344.64,
    "end": 1350.8,
    "text": "you will like after you instantiate the instances that you would like to. Alright, so now that we",
    "textdich": ""
  },
  {
    "start": 1350.8,
    "end": 1355.92,
    "text": "understood this, then there is still one small problem that is left that we need to solve.",
    "textdich": ""
  },
  {
    "start": 1355.92,
    "end": 1362.8,
    "text": "Now pay attention how the calculate total price still receives the x and y as parameters.",
    "textdich": ""
  },
  {
    "start": 1362.8,
    "end": 1369.76,
    "text": "And the question that we asked now is why it still receives those parameters. Well, we could for sure",
    "textdich": ""
  },
  {
    "start": 1369.76,
    "end": 1376.24,
    "text": "now not received those parameters. Because as we know, for each metal that we design in classes,",
    "textdich": ""
  },
  {
    "start": 1376.24,
    "end": 1381.28,
    "text": "then the object itself is passed in argument. And I know that I repeated this a couple of times.",
    "textdich": ""
  },
  {
    "start": 1381.28,
    "end": 1387.12,
    "text": "But this is where I failed to understand classes. So that is why it is very important to understand",
    "textdich": ""
  },
  {
    "start": 1387.12,
    "end": 1392.4,
    "text": "this behavior. And we already know that the object itself passed as an argument. So that's",
    "textdich": ""
  },
  {
    "start": 1392.4,
    "end": 1401.28,
    "text": "why we receive self. And so this means that now we could just return self dot price multiplied",
    "textdich": ""
  },
  {
    "start": 1401.28,
    "end": 1407.04,
    "text": "by self dot quantity. And this will mean that we don't really have to receive those parameters,",
    "textdich": ""
  },
  {
    "start": 1407.04,
    "end": 1413.04,
    "text": "because we assign those attributes, once the instances has been graded. So this means that",
    "textdich": ""
  },
  {
    "start": 1413.04,
    "end": 1417.84,
    "text": "we have access to those attributes through how the methods that we are going to add here in",
    "textdich": ""
  },
  {
    "start": 1417.84,
    "end": 1422.48,
    "text": "this class in the future. So in order to test that this works, then I'm going to",
    "textdich": ""
  },
  {
    "start": 1423.04,
    "end": 1431.28,
    "text": "delete this example for now. And I'm going to say print item one dot, calculate total price. So we",
    "textdich": ""
  },
  {
    "start": 1431.28,
    "end": 1440.08,
    "text": "will be able to return the result here. And I will do the same for item two, sorry, only this one.",
    "textdich": ""
  },
  {
    "start": 1440.08,
    "end": 1447.28,
    "text": "Now to show some real number other than zero, then I will go ahead and pass in here, quantities. So I",
    "textdich": ""
  },
  {
    "start": 1447.28,
    "end": 1452.88,
    "text": "will say one and three, for example, because I don't want to multiply a large number which is",
    "textdich": ""
  },
  {
    "start": 1452.88,
    "end": 1459.52,
    "text": "zero. And that could come from here. So I will run that. And you'll see that we receive the expected",
    "textdich": ""
  },
  {
    "start": 1459.52,
    "end": 1466.0,
    "text": "results. So now we completely understand the big picture, how to work with the constructors in",
    "textdich": ""
  },
  {
    "start": 1466.0,
    "end": 1471.28,
    "text": "classes, and what are the best practices that you should go ahead and implement. Alright,",
    "textdich": ""
  },
  {
    "start": 1471.28,
    "end": 1476.24,
    "text": "so now that we understood this, then we might think that we have done everything perfectly.",
    "textdich": ""
  },
  {
    "start": 1476.24,
    "end": 1482.72,
    "text": "But actually I want to show you what will happen if we were to pass in here a string besides",
    "textdich": ""
  },
  {
    "start": 1483.28,
    "end": 1489.52,
    "text": "an integer and run our program. So if we were to run that, then you can see that we are screwing",
    "textdich": ""
  },
  {
    "start": 1489.52,
    "end": 1496.72,
    "text": "things up here. Because this function for example, things that he chose to print the string three",
    "textdich": ""
  },
  {
    "start": 1496.72,
    "end": 1502.72,
    "text": "times because you'll see we have 1000 multiply by three that is being returned in here. So it",
    "textdich": ""
  },
  {
    "start": 1502.72,
    "end": 1510.96,
    "text": "shows us 1000 once, 1000 twice, and then one more time. So what that means, it means that we have",
    "textdich": ""
  },
  {
    "start": 1510.96,
    "end": 1517.2,
    "text": "to validate the datatypes of the values that we are passing in. So there are a couple of ways to",
    "textdich": ""
  },
  {
    "start": 1517.2,
    "end": 1523.92,
    "text": "achieve this. And one way is by using typing's in the parameters that you're declaring inside here,",
    "textdich": ""
  },
  {
    "start": 1523.92,
    "end": 1530.48,
    "text": "so a great starter will be, for example, to declare that a name must be a string. Now, let me",
    "textdich": ""
  },
  {
    "start": 1530.48,
    "end": 1538.0,
    "text": "first take this back and change those to integer and then go here and design those parameters.",
    "textdich": ""
  },
  {
    "start": 1538.0,
    "end": 1543.84,
    "text": "So in order to specify a typing, then you should go ahead and create a colon sign, followed by the",
    "textdich": ""
  },
  {
    "start": 1543.84,
    "end": 1550.16,
    "text": "type of the datatype that you expect to receive here. So if I was to pass in here, only the object",
    "textdich": ""
  },
  {
    "start": 1550.16,
    "end": 1557.6,
    "text": "reference to the class of str, then it will mean that it will have to accept strings only. And I",
    "textdich": ""
  },
  {
    "start": 1557.6,
    "end": 1563.44,
    "text": "can prove that by changing this to an integer. And you're going to see that we have a complaint here",
    "textdich": ""
  },
  {
    "start": 1563.44,
    "end": 1571.44,
    "text": "that says expected type str God int instead. And that is perfect. So now that we have done this,",
    "textdich": ""
  },
  {
    "start": 1571.44,
    "end": 1577.76,
    "text": "then I'm going to do the same for the price itself. And the price, we could actually do the",
    "textdich": ""
  },
  {
    "start": 1577.76,
    "end": 1586.56,
    "text": "same thing with it by passing in float. Now when we pass float, it is okay to also pass integers.",
    "textdich": ""
  },
  {
    "start": 1586.56,
    "end": 1591.2,
    "text": "And that is something very unique with floats and integers together. So that is okay to",
    "textdich": ""
  },
  {
    "start": 1591.2,
    "end": 1598.16,
    "text": "use the typing of float. And for the quantity, we don't need to specify a typing, because the fact",
    "textdich": ""
  },
  {
    "start": 1598.16,
    "end": 1605.76,
    "text": "that we passed a default value of integer already marked these parameter as to be integer always. So",
    "textdich": ""
  },
  {
    "start": 1605.76,
    "end": 1613.04,
    "text": "that is why, for example, if I was to leave this as it is and change the quantity to a string, then",
    "textdich": ""
  },
  {
    "start": 1613.04,
    "end": 1618.08,
    "text": "you're gonna see that it is going to complain, because the default value is already an integer.",
    "textdich": ""
  },
  {
    "start": 1618.08,
    "end": 1624.88,
    "text": "So it expects for an integer. All right, so those things are actually great setups to make our init",
    "textdich": ""
  },
  {
    "start": 1624.88,
    "end": 1631.84,
    "text": "function more powerful. But we might still want to validate the received values in the following way.",
    "textdich": ""
  },
  {
    "start": 1631.84,
    "end": 1637.36,
    "text": "So say that you never want to receive a negative number of quantity. And you'll never want to",
    "textdich": ""
  },
  {
    "start": 1637.36,
    "end": 1642.64,
    "text": "receive a negative number of price. So that is something that you cannot achieve by the",
    "textdich": ""
  },
  {
    "start": 1642.64,
    "end": 1648.48,
    "text": "typing's in here. But there is actually a great way to work this around. And that will be by using",
    "textdich": ""
  },
  {
    "start": 1648.48,
    "end": 1658.0,
    "text": "assert statements. Now assert is a statement keyword that is used to check if there is a match",
    "textdich": ""
  },
  {
    "start": 1658.0,
    "end": 1664.0,
    "text": "between what is happening to your expectations. So let's see how we can get work with assert. So I'm",
    "textdich": ""
  },
  {
    "start": 1664.0,
    "end": 1669.84,
    "text": "actually going to delete this from here. And I'm going to organize our init method a little bit,",
    "textdich": ""
  },
  {
    "start": 1669.84,
    "end": 1677.6,
    "text": "I'm going to say here a comment and I will say assign to self object. And I will say up top",
    "textdich": ""
  },
  {
    "start": 1677.6,
    "end": 1686.4,
    "text": "something like run validations to the received arguments. Alright, so now it is a great idea",
    "textdich": ""
  },
  {
    "start": 1686.4,
    "end": 1693.52,
    "text": "to validate that the price and quantity are both greater than or equal to zero, because we probably",
    "textdich": ""
  },
  {
    "start": 1693.52,
    "end": 1699.12,
    "text": "don't want to handle with those when they are negative numbers and we want to crash the problem.",
    "textdich": ""
  },
  {
    "start": 1699.12,
    "end": 1704.96,
    "text": "So we could say assert and pay attention that I use it as a statement not a built in function",
    "textdich": ""
  },
  {
    "start": 1704.96,
    "end": 1714.32,
    "text": "or something like that. And I can say here, price is greater than or equal to zero. Now",
    "textdich": ""
  },
  {
    "start": 1714.32,
    "end": 1721.84,
    "text": "once I said this, then I can also do the same for quantity, actually. So let me do that quickly.",
    "textdich": ""
  },
  {
    "start": 1723.28,
    "end": 1730.88,
    "text": "By this way, and then once we have this, then I can actually go ahead and run our program.",
    "textdich": ""
  },
  {
    "start": 1730.88,
    "end": 1736.72,
    "text": "And you will see that I will not receive any arrows. But the second that I change this quantity",
    "textdich": ""
  },
  {
    "start": 1736.72,
    "end": 1742.96,
    "text": "to negative one, for example, and this one being negative three, then I will have some arrows",
    "textdich": ""
  },
  {
    "start": 1742.96,
    "end": 1750.24,
    "text": "that will say, assertion error. Now you can see that the fact that we see here, assertion error",
    "textdich": ""
  },
  {
    "start": 1750.8,
    "end": 1756.08,
    "text": "is quite a general exception, that doesn't mean anything. Now what is so beautiful with",
    "textdich": ""
  },
  {
    "start": 1756.08,
    "end": 1763.6,
    "text": "a third, you can add your own exception messages right near of it as a second argument. So let's go",
    "textdich": ""
  },
  {
    "start": 1763.6,
    "end": 1770.4,
    "text": "up top here and go back to those two lines. So the first argument that is passed to the statement is",
    "textdich": ""
  },
  {
    "start": 1770.4,
    "end": 1777.2,
    "text": "the statement that we'd like to check. But if we were to say here comma, and use a string to say,",
    "textdich": ""
  },
  {
    "start": 1777.76,
    "end": 1787.2,
    "text": "actually formatted string, and I can say price and then refer to the value of it is not greater than",
    "textdich": ""
  },
  {
    "start": 1789.68,
    "end": 1795.28,
    "text": "zero like that. They can add an explanation mark here, and they can use the same thing.",
    "textdich": ""
  },
  {
    "start": 1796.24,
    "end": 1801.2,
    "text": "Copy that with a comma and paste this in here. And changed this quantity",
    "textdich": ""
  },
  {
    "start": 1803.28,
    "end": 1809.92,
    "text": "and then refer to the value of it and say that it is not equal to i mean greater than or equal",
    "textdich": ""
  },
  {
    "start": 1809.92,
    "end": 1815.76,
    "text": "to zero. So we need to be actually changed to greater than or equal to, like that.",
    "textdich": ""
  },
  {
    "start": 1816.72,
    "end": 1824.08,
    "text": "And same goes for here, and I have some a space here that will be deleted. All right,",
    "textdich": ""
  },
  {
    "start": 1824.08,
    "end": 1830.64,
    "text": "so now if I was to execute our program, then you can see that we receive assertion error quantity",
    "textdich": ""
  },
  {
    "start": 1831.2,
    "end": 1838.24,
    "text": "minus one is not greater or equal than zero. So I should delete this, then here for that,",
    "textdich": ""
  },
  {
    "start": 1838.24,
    "end": 1842.96,
    "text": "and now it is perfect. So now we understand that using the assert statement could allow",
    "textdich": ""
  },
  {
    "start": 1842.96,
    "end": 1849.2,
    "text": "us to validate the arguments that we receive. And also, it allows us to catch up the bugs as",
    "textdich": ""
  },
  {
    "start": 1849.2,
    "end": 1854.48,
    "text": "soon as possible, before going forward with the rest of the actions that we'd like to take",
    "textdich": ""
  },
  {
    "start": 1854.48,
    "end": 1861.52,
    "text": "within this program. So let me actually change those back to valid values like that. And",
    "textdich": ""
  },
  {
    "start": 1861.52,
    "end": 1866.8,
    "text": "that is perfect. Alright, so until this point, we learned about how to work with the constructor.",
    "textdich": ""
  },
  {
    "start": 1866.8,
    "end": 1871.68,
    "text": "And we also learned about how to assign different attributes to instances that are going to be",
    "textdich": ""
  },
  {
    "start": 1871.68,
    "end": 1876.96,
    "text": "unique per instance, which means that you can go ahead and create as much as instances as you want,",
    "textdich": ""
  },
  {
    "start": 1876.96,
    "end": 1880.96,
    "text": "and you have the control to pass whatever values you would like to for the name,",
    "textdich": ""
  },
  {
    "start": 1880.96,
    "end": 1886.8,
    "text": "price and quantity. Now consider a situation that you'll want to make use of an attribute that is",
    "textdich": ""
  },
  {
    "start": 1886.8,
    "end": 1893.2,
    "text": "going to be global, or across all the instances now are a good candidate, for example of this",
    "textdich": ""
  },
  {
    "start": 1893.2,
    "end": 1898.64,
    "text": "could be a situation that you will want to apply a sale on your shop. So this means that you want to",
    "textdich": ""
  },
  {
    "start": 1898.64,
    "end": 1905.2,
    "text": "go ahead and having the control of applying some discount for each one of the items. And that is",
    "textdich": ""
  },
  {
    "start": 1905.2,
    "end": 1911.44,
    "text": "a good candidate for creating an attribute that is going to be shared across all the instances.",
    "textdich": ""
  },
  {
    "start": 1911.44,
    "end": 1917.68,
    "text": "Now we call those kinds of attributes, class attributes, and the kinds of attributes that we",
    "textdich": ""
  },
  {
    "start": 1917.68,
    "end": 1922.56,
    "text": "have learned that till this point is actually called in a full name instance attributes.",
    "textdich": ""
  },
  {
    "start": 1922.56,
    "end": 1926.88,
    "text": "So about instance attributes, we know everything, and we learned how to work with it,",
    "textdich": ""
  },
  {
    "start": 1926.88,
    "end": 1932.08,
    "text": "but we did not work it with the other kind of the attributes, which we will do in this tutorial,",
    "textdich": ""
  },
  {
    "start": 1932.08,
    "end": 1937.2,
    "text": "which is called again, a class attribute. So a class attribute is an attribute that is",
    "textdich": ""
  },
  {
    "start": 1937.2,
    "end": 1943.12,
    "text": "going to be belong to the class itself. But however, you can also access this attribute",
    "textdich": ""
  },
  {
    "start": 1943.12,
    "end": 1948.64,
    "text": "from the instance level as well. Let's go ahead and see a good candidate for a class attribute",
    "textdich": ""
  },
  {
    "start": 1948.64,
    "end": 1954.0,
    "text": "that you want to go ahead and create it. So that's going to be going to our class here.",
    "textdich": ""
  },
  {
    "start": 1954.0,
    "end": 1959.12,
    "text": "And just in the first line inside our class, I can go ahead and create a class attribute.",
    "textdich": ""
  },
  {
    "start": 1959.12,
    "end": 1964.72,
    "text": "So let's go ahead and create an attribute like pay rate equals to 0.8. And the reason that I'm",
    "textdich": ""
  },
  {
    "start": 1964.72,
    "end": 1970.72,
    "text": "doing this is because I said that there is going to be 20% of discount. So I probably want to store",
    "textdich": ""
  },
  {
    "start": 1970.72,
    "end": 1977.44,
    "text": "an attribute that will describe how much I still need to pay. So I will say here, the pay grade",
    "textdich": ""
  },
  {
    "start": 1977.44,
    "end": 1985.76,
    "text": "after 20% discount like that. Okay, so now that we have created this, then let's see what are the",
    "textdich": ""
  },
  {
    "start": 1985.76,
    "end": 1992.16,
    "text": "ways that we can access this attribute. Now, if I was to go down and actually deleting one of those,",
    "textdich": ""
  },
  {
    "start": 1992.16,
    "end": 1997.2,
    "text": "and say something inside this print line that will look like the following. So I will try to access",
    "textdich": ""
  },
  {
    "start": 1997.2,
    "end": 2002.24,
    "text": "to the reference of the class itself. So I'm not going to create an instance like that, besides,",
    "textdich": ""
  },
  {
    "start": 2002.24,
    "end": 2007.44,
    "text": "I'm just going to bring in the reference to the class level itself. And I'm going to try to access",
    "textdich": ""
  },
  {
    "start": 2007.44,
    "end": 2012.88,
    "text": "this attribute by saying the PE underscore rate. Now if I was to run that, then you're going to see",
    "textdich": ""
  },
  {
    "start": 2012.88,
    "end": 2018.24,
    "text": "that as expected, we see this class attribute, because that is a way that you can access",
    "textdich": ""
  },
  {
    "start": 2018.24,
    "end": 2023.2,
    "text": "those class attributes. Now this might be confusing, but I said a minute ago that you",
    "textdich": ""
  },
  {
    "start": 2023.2,
    "end": 2029.04,
    "text": "can also access those class attributes from the instance level. Well, let's see if that is true.",
    "textdich": ""
  },
  {
    "start": 2029.04,
    "end": 2036.48,
    "text": "So if I was to duplicate those lines twice, by using the shortcut of Ctrl D, then let's go ahead",
    "textdich": ""
  },
  {
    "start": 2036.48,
    "end": 2045.2,
    "text": "and change those to item one, and this one to item two. Now see how I try to access the pay rate",
    "textdich": ""
  },
  {
    "start": 2045.2,
    "end": 2051.04,
    "text": "attribute from the instance, although we don't have such an instance attribute. Now if I was to",
    "textdich": ""
  },
  {
    "start": 2051.04,
    "end": 2057.52,
    "text": "run that, then you're going to see that we still have the access to see that class attribute. Well,",
    "textdich": ""
  },
  {
    "start": 2057.52,
    "end": 2062.24,
    "text": "that might be confusing. And that might be hard to understand why that is happening.",
    "textdich": ""
  },
  {
    "start": 2062.24,
    "end": 2067.12,
    "text": "Well, there is actually something that we need to understand when we work with instances in Python.",
    "textdich": ""
  },
  {
    "start": 2067.12,
    "end": 2073.6,
    "text": "So when we have an instance on our hand, then At first this instance tries to bring the attribute",
    "textdich": ""
  },
  {
    "start": 2073.6,
    "end": 2080.8,
    "text": "from the instance level at first stage, but if it doesn't find it there, then it is going to try to",
    "textdich": ""
  },
  {
    "start": 2080.8,
    "end": 2087.28,
    "text": "bring that attribute from the class level. So what that means it means that item one did something in",
    "textdich": ""
  },
  {
    "start": 2087.28,
    "end": 2093.44,
    "text": "here and say to itself, okay, so I don't have this attribute right in here because that is just not",
    "textdich": ""
  },
  {
    "start": 2093.44,
    "end": 2098.16,
    "text": "an attribute that assigned to me. So I'm going to try to search that from the instance level",
    "textdich": ""
  },
  {
    "start": 2098.16,
    "end": 2103.2,
    "text": "and then I'm going to find it and if sprinted back. So that is exactly what is happening here.",
    "textdich": ""
  },
  {
    "start": 2103.2,
    "end": 2110.64,
    "text": "Item one and item two are instances that could not find the pay rate attribute on the instance level.",
    "textdich": ""
  },
  {
    "start": 2110.64,
    "end": 2116.56,
    "text": "So both of them went ahead and try to bring this attribute from the class level. And since",
    "textdich": ""
  },
  {
    "start": 2116.56,
    "end": 2120.88,
    "text": "it really exists in the class level, then we were able to access those. Now to even give",
    "textdich": ""
  },
  {
    "start": 2120.88,
    "end": 2126.48,
    "text": "you a better idea of what is going on here. Then I'm going to do one more additional thing. Now I",
    "textdich": ""
  },
  {
    "start": 2126.48,
    "end": 2131.6,
    "text": "will delete these first print line. And I will go ahead and delete those attributes from here",
    "textdich": ""
  },
  {
    "start": 2131.6,
    "end": 2138.56,
    "text": "as well. Now there is a built in magic attribute, not a magic method, that you can go ahead and see",
    "textdich": ""
  },
  {
    "start": 2138.56,
    "end": 2145.28,
    "text": "all the attributes that are belonging to that specific object. And that is achievable by using",
    "textdich": ""
  },
  {
    "start": 2145.28,
    "end": 2153.04,
    "text": "this double underscore vi CT double underscore like that. So this will go ahead and try to",
    "textdich": ""
  },
  {
    "start": 2153.04,
    "end": 2157.92,
    "text": "bring you all the attributes that are belonging to the object that you apply this attribute and",
    "textdich": ""
  },
  {
    "start": 2157.92,
    "end": 2163.68,
    "text": "want to see its content. So I will go ahead and copy this one and paste this in for the instance",
    "textdich": ""
  },
  {
    "start": 2163.68,
    "end": 2171.12,
    "text": "level as well. So this will give me all the attributes for class level. And the second line",
    "textdich": ""
  },
  {
    "start": 2171.76,
    "end": 2177.12,
    "text": "will do this for the instance level. Alright, and if I was to run that,",
    "textdich": ""
  },
  {
    "start": 2177.12,
    "end": 2183.52,
    "text": "then let's explore the results for a second. Now we can see that at the first line, we see this",
    "textdich": ""
  },
  {
    "start": 2183.52,
    "end": 2189.52,
    "text": "pay rate attribute. But in the second line, we never see it, we see name, price and quantity.",
    "textdich": ""
  },
  {
    "start": 2189.52,
    "end": 2194.48,
    "text": "And you can also pay attention that this magic attribute is actually responsible to take all the",
    "textdich": ""
  },
  {
    "start": 2194.48,
    "end": 2200.48,
    "text": "attributes and convert this to a dictionary. And that is from where the dict keyword coming from",
    "textdich": ""
  },
  {
    "start": 2200.48,
    "end": 2205.84,
    "text": "it is just a shortened version of a dictionary. So that is a very useful magic attribute that",
    "textdich": ""
  },
  {
    "start": 2205.84,
    "end": 2210.72,
    "text": "you can go ahead and use if you just want to see temporarily for debugging reasons,",
    "textdich": ""
  },
  {
    "start": 2210.72,
    "end": 2216.08,
    "text": "all the attributes that are belonging to some object. Alright, so now that we understood this,",
    "textdich": ""
  },
  {
    "start": 2216.08,
    "end": 2220.96,
    "text": "then let's take it to a real life example and come up with a method that will go ahead and apply",
    "textdich": ""
  },
  {
    "start": 2220.96,
    "end": 2227.28,
    "text": "a discount on our items price. So that will be by creating a method that will we belong to each of",
    "textdich": ""
  },
  {
    "start": 2227.28,
    "end": 2232.96,
    "text": "our instances in that means that we can go ahead and come up with a method that we could name apply",
    "textdich": ""
  },
  {
    "start": 2232.96,
    "end": 2239.12,
    "text": "discount. So let's go ahead and start working on this. So I'm going to say def apply, discount",
    "textdich": ""
  },
  {
    "start": 2239.12,
    "end": 2245.36,
    "text": "and pay attention that I'm using a new method inside a class here. So right inside of this,",
    "textdich": ""
  },
  {
    "start": 2245.36,
    "end": 2251.28,
    "text": "then add first we need to figure out how we are going to override an attribute that is belonging",
    "textdich": ""
  },
  {
    "start": 2251.28,
    "end": 2256.48,
    "text": "to an instance. And we already know that we can do that with the self keyword. So it will be",
    "textdich": ""
  },
  {
    "start": 2256.48,
    "end": 2264.4,
    "text": "self dot price. And that will be equal to self dot price, meaning the older value of this attribute",
    "textdich": ""
  },
  {
    "start": 2265.28,
    "end": 2272.88,
    "text": "multiplied by the pay rate. Now you might expect that we could access this directly like that. But",
    "textdich": ""
  },
  {
    "start": 2272.88,
    "end": 2278.48,
    "text": "if you remember, that is actually belonging to the item class itself. Now this might be confusing,",
    "textdich": ""
  },
  {
    "start": 2278.48,
    "end": 2283.84,
    "text": "because this method already inside this class. So you might think already that you can access",
    "textdich": ""
  },
  {
    "start": 2283.84,
    "end": 2289.04,
    "text": "it directly by saying pay rate, because it is already inside the class. But that is actually not",
    "textdich": ""
  },
  {
    "start": 2289.04,
    "end": 2294.16,
    "text": "going to work. Because you can either access it from the class level or the instance level as we",
    "textdich": ""
  },
  {
    "start": 2294.16,
    "end": 2300.08,
    "text": "understood previously. So we can go ahead and say item dot pay rate like that. And there you have a",
    "textdich": ""
  },
  {
    "start": 2300.08,
    "end": 2306.16,
    "text": "metal that can go ahead and basically override the price attribute for one of your items.",
    "textdich": ""
  },
  {
    "start": 2306.16,
    "end": 2313.6,
    "text": "Now to show you that this works, then I can only use one instance for now. And I can go ahead and",
    "textdich": ""
  },
  {
    "start": 2313.6,
    "end": 2321.68,
    "text": "call this method by saying apply discount. And I can also now try to print the attribute of price",
    "textdich": ""
  },
  {
    "start": 2321.68,
    "end": 2328.56,
    "text": "for this item one, and we should see ad right. So if we were to run that, then you're going to see",
    "textdich": ""
  },
  {
    "start": 2328.56,
    "end": 2333.6,
    "text": "that we are going to receive at point zero as expected. Now we should not forget the option",
    "textdich": ""
  },
  {
    "start": 2333.6,
    "end": 2339.52,
    "text": "that you might also want to have a different discount amount for a specific item. So say that",
    "textdich": ""
  },
  {
    "start": 2339.52,
    "end": 2346.32,
    "text": "one day you will have 20 items or in only for the laptop, you will want to have a 30% discount. But",
    "textdich": ""
  },
  {
    "start": 2346.32,
    "end": 2352.88,
    "text": "it is going to be a bad idea changing the class attribute to 0.7 because it will affect all the",
    "textdich": ""
  },
  {
    "start": 2352.88,
    "end": 2358.24,
    "text": "items that you have right now on your hand. So what you can do instead is you can assign this",
    "textdich": ""
  },
  {
    "start": 2358.24,
    "end": 2363.6,
    "text": "attribute directly to one of the instances that you would like to have a different discount amount",
    "textdich": ""
  },
  {
    "start": 2363.6,
    "end": 2368.64,
    "text": "for so let's go ahead and see an example for this. So I will allow myself to bring back the",
    "textdich": ""
  },
  {
    "start": 2368.64,
    "end": 2377.12,
    "text": "item or laptop and then what I can do to apply a 30% discount for this item is assigning the",
    "textdich": ""
  },
  {
    "start": 2377.12,
    "end": 2383.28,
    "text": "exact same attribute to the instance. So I can go ahead and use a item to that pay on the score rate",
    "textdich": ""
  },
  {
    "start": 2383.84,
    "end": 2391.76,
    "text": "is equal to 0.7. Now what will happen here is that for item two, it will find the attribute",
    "textdich": ""
  },
  {
    "start": 2391.76,
    "end": 2397.2,
    "text": "of pay rate in the instance level. So it does not really have to go ahead to the class level",
    "textdich": ""
  },
  {
    "start": 2397.2,
    "end": 2402.56,
    "text": "and bring back the value of pay rate because Add first look, it is going to find it in the",
    "textdich": ""
  },
  {
    "start": 2402.56,
    "end": 2408.08,
    "text": "instance level. But for item one, it is different, it is still going to read from the item level,",
    "textdich": ""
  },
  {
    "start": 2408.08,
    "end": 2416.24,
    "text": "which is going to be 0.8. So now, if we were to try to use item two dot apply discount,",
    "textdich": ""
  },
  {
    "start": 2416.24,
    "end": 2424.88,
    "text": "and as well as printing the price now, then let's see what will happen. So I will uncomment this",
    "textdich": ""
  },
  {
    "start": 2424.88,
    "end": 2431.84,
    "text": "line to not see this screen for now. And I will go ahead and execute our program. Now you can see",
    "textdich": ""
  },
  {
    "start": 2431.84,
    "end": 2438.96,
    "text": "that we still, however, receive 800. And what this means this means that the discount that has been",
    "textdich": ""
  },
  {
    "start": 2438.96,
    "end": 2446.88,
    "text": "applied is still a 20%. And where this is coming from, well, this is coming from this method here",
    "textdich": ""
  },
  {
    "start": 2446.88,
    "end": 2453.52,
    "text": "that no matter what we try to pull the pay rate from the class level. So a best practice here will",
    "textdich": ""
  },
  {
    "start": 2453.52,
    "end": 2460.8,
    "text": "be to change these two cells. And that way, if we override the pay rate for the instance level,",
    "textdich": ""
  },
  {
    "start": 2460.8,
    "end": 2468.56,
    "text": "then it is going to read from the instance level. But for item one, if we try to access the pay rate",
    "textdich": ""
  },
  {
    "start": 2468.56,
    "end": 2474.88,
    "text": "from the instance level, then this is still great, because we did not assign a specific pay rate for",
    "textdich": ""
  },
  {
    "start": 2474.88,
    "end": 2480.88,
    "text": "item one. So it is going to pull that from the class level. Now if we were to try to run that,",
    "textdich": ""
  },
  {
    "start": 2480.88,
    "end": 2486.32,
    "text": "then you're gonna see now that we have expected results. And if we were to also uncomment,",
    "textdich": ""
  },
  {
    "start": 2486.32,
    "end": 2493.12,
    "text": "the first print line for the item one and rerun our program, then you can see that for item one,",
    "textdich": ""
  },
  {
    "start": 2493.12,
    "end": 2500.24,
    "text": "we had 20% discount. And for item two, we had 30% discount. So when it comes to accessing",
    "textdich": ""
  },
  {
    "start": 2500.24,
    "end": 2505.52,
    "text": "class attributes, you might want to reconsider how you want to access them when you will come",
    "textdich": ""
  },
  {
    "start": 2505.52,
    "end": 2510.64,
    "text": "up with some methods. And specifically for creating a method like apply discount,",
    "textdich": ""
  },
  {
    "start": 2510.64,
    "end": 2516.48,
    "text": "it is a great idea to access it from the instance level. So you also allow the option of using a pay",
    "textdich": ""
  },
  {
    "start": 2516.48,
    "end": 2522.0,
    "text": "rate that is assigned to the instance level. Okay, so now that we understood completely",
    "textdich": ""
  },
  {
    "start": 2522.0,
    "end": 2526.16,
    "text": "about the differences between a class to an instance attribute, let's jump ahead to the",
    "textdich": ""
  },
  {
    "start": 2526.16,
    "end": 2531.28,
    "text": "next topic. Now you'll see that I have deleted those print lines that I have down below.",
    "textdich": ""
  },
  {
    "start": 2531.28,
    "end": 2536.16,
    "text": "And I came up with five instances that I have created here. So you might also want to create",
    "textdich": ""
  },
  {
    "start": 2536.16,
    "end": 2542.56,
    "text": "those five instances immediately. So that is why I will recommend you to go here to my repository,",
    "textdich": ""
  },
  {
    "start": 2542.56,
    "end": 2549.12,
    "text": "accessing these class attributes directory, and then code snippets, and then go ahead and copy",
    "textdich": ""
  },
  {
    "start": 2549.12,
    "end": 2555.6,
    "text": "the code from these five underscore items.py file. Okay, so considering a situation that your shop is",
    "textdich": ""
  },
  {
    "start": 2555.6,
    "end": 2560.88,
    "text": "going to be larger in the future, meaning that you are going to have more items, then the more items",
    "textdich": ""
  },
  {
    "start": 2560.88,
    "end": 2566.08,
    "text": "that you're going to have the more filtration like things that you want to do in the future.",
    "textdich": ""
  },
  {
    "start": 2566.08,
    "end": 2571.28,
    "text": "But what is problematic currently with our class is the fact that we don't have any resource where",
    "textdich": ""
  },
  {
    "start": 2571.28,
    "end": 2576.96,
    "text": "we can just access all the items that we have in our shop right now. Now, it could have been nicer",
    "textdich": ""
  },
  {
    "start": 2576.96,
    "end": 2583.52,
    "text": "if we could somehow have a list with all the item instances that have been created until this point.",
    "textdich": ""
  },
  {
    "start": 2583.52,
    "end": 2589.92,
    "text": "But currently, there is not an approach that will give us a list with five elements where each",
    "textdich": ""
  },
  {
    "start": 2589.92,
    "end": 2596.56,
    "text": "element will represent an instance of a class. So in order to come up with such a design, then",
    "textdich": ""
  },
  {
    "start": 2596.56,
    "end": 2603.68,
    "text": "here is a wonderful candidate for creating a class attribute that we could name all. And once we do",
    "textdich": ""
  },
  {
    "start": 2603.68,
    "end": 2609.76,
    "text": "this, then we're going to see how we are going to add our instances to that list. So I will go ahead",
    "textdich": ""
  },
  {
    "start": 2609.76,
    "end": 2620.24,
    "text": "and start by going here and use in all attributes. So it will be all equals to an empty list.",
    "textdich": ""
  },
  {
    "start": 2620.24,
    "end": 2627.04,
    "text": "Now we need to figure out how we are going to add our instances for each time that we are going to",
    "textdich": ""
  },
  {
    "start": 2627.04,
    "end": 2632.96,
    "text": "go ahead and create an instance. Now if you remember, the double underscore init method",
    "textdich": ""
  },
  {
    "start": 2632.96,
    "end": 2639.76,
    "text": "is being called immediately once the instance has been graded. So it might be a wonderful idea",
    "textdich": ""
  },
  {
    "start": 2640.32,
    "end": 2646.08,
    "text": "going down below inside this double underscore init method and use a code that will be",
    "textdich": ""
  },
  {
    "start": 2646.08,
    "end": 2651.92,
    "text": "responsible to append to that list every time that we create an instance and that will be as",
    "textdich": ""
  },
  {
    "start": 2651.92,
    "end": 2657.6,
    "text": "easy as saying something like the following. So first, you could pay attention that I actually",
    "textdich": ""
  },
  {
    "start": 2657.6,
    "end": 2662.88,
    "text": "wrote some commands in this double underscore init function like run validations and assigned",
    "textdich": ""
  },
  {
    "start": 2662.88,
    "end": 2667.76,
    "text": "to save object. So it might be a great idea to start with a comment here that will say actions",
    "textdich": ""
  },
  {
    "start": 2669.04,
    "end": 2674.16,
    "text": "to execute just to really have a great separation between the different things that we are doing.",
    "textdich": ""
  },
  {
    "start": 2674.16,
    "end": 2681.36,
    "text": "So now inside here I can say item dot all and you can see that I use the class object first",
    "textdich": ""
  },
  {
    "start": 2681.36,
    "end": 2689.84,
    "text": "and then that is a list so I can use dot append and then I will just append the self object. Now",
    "textdich": ""
  },
  {
    "start": 2689.84,
    "end": 2696.64,
    "text": "we know that self is actually the instance itself every time that it is being created. So once we",
    "textdich": ""
  },
  {
    "start": 2696.64,
    "end": 2703.76,
    "text": "go ahead and launch such a command inside the unit Then for each instance, that is going to be",
    "textdich": ""
  },
  {
    "start": 2703.76,
    "end": 2710.64,
    "text": "created, this all list is going to be filled with our instances. Now to show you that I can jump",
    "textdich": ""
  },
  {
    "start": 2710.64,
    "end": 2721.28,
    "text": "line after we create the instances, and we can say print item that all. And now if I was to run our",
    "textdich": ""
  },
  {
    "start": 2721.28,
    "end": 2726.96,
    "text": "program, then you're going to see that we're going to have a list with five instances. If I was to",
    "textdich": ""
  },
  {
    "start": 2726.96,
    "end": 2733.2,
    "text": "scroll right a bit, then you can see that I have exactly five elements. And that is perfect. Now",
    "textdich": ""
  },
  {
    "start": 2733.2,
    "end": 2738.16,
    "text": "that's going to be extremely useful if you want to do something with only one of the attributes",
    "textdich": ""
  },
  {
    "start": 2738.16,
    "end": 2744.4,
    "text": "of your instances. So say that you'd like to print all the names for all of your instances,",
    "textdich": ""
  },
  {
    "start": 2744.4,
    "end": 2750.96,
    "text": "then you can use easily a for loop to achieve such a task. So we can go ahead and say, for instance,",
    "textdich": ""
  },
  {
    "start": 2751.6,
    "end": 2760.08,
    "text": "in item dot all and you can say print instance, dot name. And once we come up with this, then",
    "textdich": ""
  },
  {
    "start": 2760.08,
    "end": 2765.12,
    "text": "you can see that we have all the names for all the instances that we have graded. So that is going to",
    "textdich": ""
  },
  {
    "start": 2765.12,
    "end": 2770.8,
    "text": "be useful here and there, especially if you know how to use the filter function, for example, to",
    "textdich": ""
  },
  {
    "start": 2770.8,
    "end": 2776.64,
    "text": "apply some special things on some of the instances that are matching your criteria. Alright, so now",
    "textdich": ""
  },
  {
    "start": 2776.64,
    "end": 2783.04,
    "text": "that we understood this, then let's also take care of one problem that we saw previously. Now if I",
    "textdich": ""
  },
  {
    "start": 2783.04,
    "end": 2790.88,
    "text": "was to use a Ctrl, D couple of times, and still use this print item dot all now you could see",
    "textdich": ""
  },
  {
    "start": 2790.88,
    "end": 2797.76,
    "text": "that the way that the object is being represented is not too friendly. Now, it could have been nicer",
    "textdich": ""
  },
  {
    "start": 2797.76,
    "end": 2804.72,
    "text": "if we could somehow change the way that the object is being represented in this list here.",
    "textdich": ""
  },
  {
    "start": 2804.72,
    "end": 2811.12,
    "text": "Now, there is actually a way to achieve this by using a magic method inside our class. Now there",
    "textdich": ""
  },
  {
    "start": 2811.12,
    "end": 2819.28,
    "text": "is a magic method that is called double underscore our EPR. And our EPR stands for representing your",
    "textdich": ""
  },
  {
    "start": 2819.28,
    "end": 2825.28,
    "text": "objects. So that is why you can actually go ahead and use this magic method. And then",
    "textdich": ""
  },
  {
    "start": 2825.28,
    "end": 2831.68,
    "text": "you will have the control to display your objects when you are printing them in the console. Now, I",
    "textdich": ""
  },
  {
    "start": 2831.68,
    "end": 2837.28,
    "text": "actually recommend watching a video that compares between a metal that is similar to it, which is",
    "textdich": ""
  },
  {
    "start": 2837.28,
    "end": 2842.96,
    "text": "called double underscore str. And you can take a look in the description of this entire series",
    "textdich": ""
  },
  {
    "start": 2842.96,
    "end": 2848.48,
    "text": "to actually watch the video that I'm talking about. Alright, so let's go ahead and use the RPM",
    "textdich": ""
  },
  {
    "start": 2848.48,
    "end": 2854.0,
    "text": "method to understand how this is going to work. So I'm going to say def inside our class. And",
    "textdich": ""
  },
  {
    "start": 2854.0,
    "end": 2861.6,
    "text": "I'm going to use double underscore r e, PR double underscore and as expected, it will receive the",
    "textdich": ""
  },
  {
    "start": 2861.6,
    "end": 2869.44,
    "text": "self. Now what we can do now is returning a string that will be responsible to represent this object.",
    "textdich": ""
  },
  {
    "start": 2869.44,
    "end": 2875.92,
    "text": "Now obviously, we don't want to use something that is not unique for each of the instances. Because",
    "textdich": ""
  },
  {
    "start": 2875.92,
    "end": 2882.96,
    "text": "say that I was to use now return items, something like that, and run our program, then you can see",
    "textdich": ""
  },
  {
    "start": 2882.96,
    "end": 2889.12,
    "text": "that I'm going to receive a list with this string five times. But it is going to be hard to identify",
    "textdich": ""
  },
  {
    "start": 2889.76,
    "end": 2896.8,
    "text": "which instance represents each string here. So it could be helpful if we were to return a string",
    "textdich": ""
  },
  {
    "start": 2896.8,
    "end": 2903.52,
    "text": "that could be unique. So I'm going to close the console here and go ahead here and use a formatted",
    "textdich": ""
  },
  {
    "start": 2903.52,
    "end": 2910.4,
    "text": "string. And in order to make this unique, it is a best practice to represent it exactly like we",
    "textdich": ""
  },
  {
    "start": 2910.4,
    "end": 2917.68,
    "text": "create the instance like that. So what I'm going to do here is living the item and use a",
    "textdich": ""
  },
  {
    "start": 2918.24,
    "end": 2924.72,
    "text": "brackets opener and the closure. And then I'm going to make the return string here as much",
    "textdich": ""
  },
  {
    "start": 2924.72,
    "end": 2933.12,
    "text": "as equal as possible to the way that we create those instances. So I will start by typing here",
    "textdich": ""
  },
  {
    "start": 2933.12,
    "end": 2939.12,
    "text": "single quotes to escape from the double quotes that are coming from here. And I'm going to refer",
    "textdich": ""
  },
  {
    "start": 2939.12,
    "end": 2947.84,
    "text": "to the value of name by using self dot name. And then I will leave my single quotes. And I will",
    "textdich": ""
  },
  {
    "start": 2947.84,
    "end": 2956.0,
    "text": "use a comma like that. And then I will go ahead and refer to the value of our price. I will use",
    "textdich": ""
  },
  {
    "start": 2956.0,
    "end": 2965.36,
    "text": "one more comma, and I will say self dot quantity. Now if we were to execute our program again, then",
    "textdich": ""
  },
  {
    "start": 2965.36,
    "end": 2972.48,
    "text": "you can see that now we receive a list that is way more friendly than what we have seen previously.",
    "textdich": ""
  },
  {
    "start": 2972.48,
    "end": 2980.72,
    "text": "And you can also see that this first element, for example, is quite equivalent to this line here.",
    "textdich": ""
  },
  {
    "start": 2980.72,
    "end": 2988.16,
    "text": "Now you might be curious why I worked so hard to return the representative version of our objects",
    "textdich": ""
  },
  {
    "start": 2988.16,
    "end": 2992.72,
    "text": "the same way that we create them. So that is just the best practice according to pythons",
    "textdich": ""
  },
  {
    "start": 2992.72,
    "end": 2998.72,
    "text": "documentations because it will help us to create instances immediately by only the effort of",
    "textdich": ""
  },
  {
    "start": 2998.72,
    "end": 3004.4,
    "text": "copying and pasting these To the Python console. So if you think about it right now, if you open a",
    "textdich": ""
  },
  {
    "start": 3004.4,
    "end": 3012.08,
    "text": "Python console, and you'll import this class, then it will be as easy as grabbing this and pasting to",
    "textdich": ""
  },
  {
    "start": 3012.08,
    "end": 3017.04,
    "text": "the Python console. And then you will have an instance being graded. So that is the single",
    "textdich": ""
  },
  {
    "start": 3017.04,
    "end": 3022.48,
    "text": "reason that I have came up with this approach. And also for sure, I just wanted to return a unique",
    "textdich": ""
  },
  {
    "start": 3022.48,
    "end": 3029.04,
    "text": "string that will really represent our instance. And you can see that it is very easy to identify",
    "textdich": ""
  },
  {
    "start": 3029.04,
    "end": 3036.16,
    "text": "the instances of our class with this list. And with this approach, alright, so until this point,",
    "textdich": ""
  },
  {
    "start": 3036.16,
    "end": 3041.6,
    "text": "we understood how we can change the way that we represent our objects. And we also understood",
    "textdich": ""
  },
  {
    "start": 3041.6,
    "end": 3049.84,
    "text": "how we can access to all of our instances by this class attribute that we intentionally named all.",
    "textdich": ""
  },
  {
    "start": 3049.84,
    "end": 3055.12,
    "text": "Now in this part, we are going to take a look to solve one more problem that we have in terms of",
    "textdich": ""
  },
  {
    "start": 3055.12,
    "end": 3060.08,
    "text": "best practices when we are going to extend this application and add more features. Now you can",
    "textdich": ""
  },
  {
    "start": 3060.08,
    "end": 3069.36,
    "text": "see that until this point, we maintain our data as code in this main.py file by only instantiating.",
    "textdich": ""
  },
  {
    "start": 3069.36,
    "end": 3074.4,
    "text": "Those five items. Now when we will look to extend this application and add some more futures,",
    "textdich": ""
  },
  {
    "start": 3074.4,
    "end": 3081.28,
    "text": "then we might have a harder life to add those features because the actual data and the code",
    "textdich": ""
  },
  {
    "start": 3081.28,
    "end": 3087.52,
    "text": "are maintained in the same location, meaning in the same main.py file. Now you could think",
    "textdich": ""
  },
  {
    "start": 3087.52,
    "end": 3093.44,
    "text": "about creating a database that will maintain this information. But I want to keep things more simple",
    "textdich": ""
  },
  {
    "start": 3093.44,
    "end": 3098.8,
    "text": "for the purposes of this tutorial. And that is why I'm going to use something that is called CSV",
    "textdich": ""
  },
  {
    "start": 3098.8,
    "end": 3105.44,
    "text": "that you might have heard of. csv stands for comma separated values. So this means that you could go",
    "textdich": ""
  },
  {
    "start": 3105.44,
    "end": 3113.52,
    "text": "ahead and use a CSV file, and you could store your values as comma separated where each line will",
    "textdich": ""
  },
  {
    "start": 3113.52,
    "end": 3120.4,
    "text": "represent a single structured data in CSV is a great option here because it allows the data",
    "textdich": ""
  },
  {
    "start": 3120.4,
    "end": 3126.0,
    "text": "to be saved in a table structured format. Alright, so let's go ahead and create a CSV",
    "textdich": ""
  },
  {
    "start": 3126.0,
    "end": 3133.04,
    "text": "file. And I will actually go ahead and name these items, dot c is V, like that, and I will",
    "textdich": ""
  },
  {
    "start": 3133.04,
    "end": 3140.48,
    "text": "go ahead and paste in some CSV content that will be responsible at the end of the day represent the",
    "textdich": ""
  },
  {
    "start": 3140.48,
    "end": 3146.8,
    "text": "same data that we look to have here. So you can see that at the first line, I have name, price",
    "textdich": ""
  },
  {
    "start": 3146.8,
    "end": 3152.48,
    "text": "and quantity. And you can see that those are comma separated. So those represents the columns that",
    "textdich": ""
  },
  {
    "start": 3152.48,
    "end": 3158.24,
    "text": "we're going to have as the data that we are going to maintain. And in the second line and further,",
    "textdich": ""
  },
  {
    "start": 3158.24,
    "end": 3164.4,
    "text": "we are going to have some data that will represent the actual data that we look to maintain. So if we",
    "textdich": ""
  },
  {
    "start": 3164.4,
    "end": 3172.16,
    "text": "were to now split the panes, then you can see that those are quite equivalent. And now we should only",
    "textdich": ""
  },
  {
    "start": 3172.16,
    "end": 3179.84,
    "text": "look for a way to read the CSV file and actually instantiate those objects. Now we can see that I",
    "textdich": ""
  },
  {
    "start": 3179.84,
    "end": 3186.0,
    "text": "have a suggestion by pi charm to install a plugin that will support CSV files. So I'm going to just",
    "textdich": ""
  },
  {
    "start": 3186.0,
    "end": 3193.04,
    "text": "click on that and install those plugins. And you can see that I will have a CSV reader here. And",
    "textdich": ""
  },
  {
    "start": 3193.04,
    "end": 3199.68,
    "text": "we will see if we will be able to see this data in a table, which will be a lot nicer. So let's",
    "textdich": ""
  },
  {
    "start": 3199.68,
    "end": 3204.8,
    "text": "go ahead and install this. And now you can see that I have some more options that I can actually",
    "textdich": ""
  },
  {
    "start": 3204.8,
    "end": 3211.36,
    "text": "go ahead and use from here, I know that this is quite small, but actually you have some tabs that",
    "textdich": ""
  },
  {
    "start": 3211.36,
    "end": 3218.4,
    "text": "you can go ahead and click on them. And if I was to click on table editor, and actually give this",
    "textdich": ""
  },
  {
    "start": 3219.2,
    "end": 3225.92,
    "text": "file more focus, then you can see that I actually have the best way to read this data. Now,",
    "textdich": ""
  },
  {
    "start": 3225.92,
    "end": 3233.44,
    "text": "you can see that I have my columns, you can see that I have my rows. And that is quite nice. Now",
    "textdich": ""
  },
  {
    "start": 3233.44,
    "end": 3240.08,
    "text": "I can really go ahead and visualize my data more nicer. And it's just more common way to maintain",
    "textdich": ""
  },
  {
    "start": 3240.08,
    "end": 3247.2,
    "text": "your data. Okay, so now that we understood how CSV files are working, let's go ahead and read our CSV",
    "textdich": ""
  },
  {
    "start": 3247.2,
    "end": 3254.08,
    "text": "files and instantiate the instances in a generic way. So it makes sense to delete those five lines.",
    "textdich": ""
  },
  {
    "start": 3254.08,
    "end": 3260.96,
    "text": "And I'm going to use those lines below the apply discount and use a metal that",
    "textdich": ""
  },
  {
    "start": 3260.96,
    "end": 3269.68,
    "text": "I could name instantiate from CSV like that. Now, you can see that this one is also going to receive",
    "textdich": ""
  },
  {
    "start": 3269.68,
    "end": 3274.4,
    "text": "itself because if you remember I said that in each metal that we will design,",
    "textdich": ""
  },
  {
    "start": 3274.4,
    "end": 3282.4,
    "text": "we need to receive at least one parameter that will be passed as the instance itself, because",
    "textdich": ""
  },
  {
    "start": 3282.4,
    "end": 3290.0,
    "text": "this is how Python op works. Now, the problem is, we are not going to have any instances on our hand",
    "textdich": ""
  },
  {
    "start": 3290.0,
    "end": 3296.48,
    "text": "to call this method from the instance because this method is actually designed for instantiating",
    "textdich": ""
  },
  {
    "start": 3296.48,
    "end": 3302.56,
    "text": "the object itself. So this means that this method could not be called from an instance.",
    "textdich": ""
  },
  {
    "start": 3302.56,
    "end": 3310.72,
    "text": "So the way that this is going to be solved is by converting this method into a class method. Now, a",
    "textdich": ""
  },
  {
    "start": 3310.72,
    "end": 3318.48,
    "text": "class method is a method that could be accessed in the following way. So I will use this line tool,",
    "textdich": ""
  },
  {
    "start": 3318.48,
    "end": 3326.4,
    "text": "delete that, and it could be accessed from the class level only. So this will look like item dot",
    "textdich": ""
  },
  {
    "start": 3326.4,
    "end": 3334.0,
    "text": "instantiate from CSV, and then in here, we will probably pass our CSV file. So this method should",
    "textdich": ""
  },
  {
    "start": 3334.0,
    "end": 3340.4,
    "text": "take full responsibility to instantiate those objects for us. So now that we understood this,",
    "textdich": ""
  },
  {
    "start": 3340.4,
    "end": 3346.56,
    "text": "let's go ahead and see how we can create a class method. So for sure, we need to delete the self.",
    "textdich": ""
  },
  {
    "start": 3346.56,
    "end": 3352.24,
    "text": "And I know that we have arrows, but we are going to solve each one of those just in a second. Now",
    "textdich": ""
  },
  {
    "start": 3352.24,
    "end": 3358.56,
    "text": "in order to convert this to a class method, we need to use a decorator that will be responsible",
    "textdich": ""
  },
  {
    "start": 3358.56,
    "end": 3365.44,
    "text": "to convert this method into a class method. Now decorators in Python is just a quick way to change",
    "textdich": ""
  },
  {
    "start": 3365.44,
    "end": 3371.04,
    "text": "the behavior of the functions that we will write by basically calling them just before the line",
    "textdich": ""
  },
  {
    "start": 3371.04,
    "end": 3379.44,
    "text": "that we create our function. So we could use the Add sign and use the class method in here and then",
    "textdich": ""
  },
  {
    "start": 3379.44,
    "end": 3385.76,
    "text": "this instantiate from CSV method will be a class method. Alright, so now that we understood this,",
    "textdich": ""
  },
  {
    "start": 3385.76,
    "end": 3391.04,
    "text": "then we should also understand one more piece of information before we go ahead and design this",
    "textdich": ""
  },
  {
    "start": 3391.04,
    "end": 3397.44,
    "text": "method. Now I want to show you what will happen if I was to delete the entire name and try to",
    "textdich": ""
  },
  {
    "start": 3397.44,
    "end": 3404.88,
    "text": "recreate this function here. And I will just say instantiate from CSV again, Now pay attention",
    "textdich": ""
  },
  {
    "start": 3404.88,
    "end": 3410.56,
    "text": "what will happen if I was to open up and close the parentheses, now we can see that it still receives",
    "textdich": ""
  },
  {
    "start": 3410.56,
    "end": 3418.16,
    "text": "a parameter, but this time, it is named CLS. Now, what is going on here, and the thing that is going",
    "textdich": ""
  },
  {
    "start": 3418.16,
    "end": 3426.0,
    "text": "on here is the fact that when we call our class methods, then the class object itself is passed",
    "textdich": ""
  },
  {
    "start": 3426.0,
    "end": 3432.8,
    "text": "as the first argument always in the background. So it is a bit alike the instance where it is also",
    "textdich": ""
  },
  {
    "start": 3432.8,
    "end": 3438.24,
    "text": "passed as the first argument. But this time, when we call a class method in this approach,",
    "textdich": ""
  },
  {
    "start": 3438.24,
    "end": 3445.36,
    "text": "then the class reference must be passed as a first argument. So that is why you should still",
    "textdich": ""
  },
  {
    "start": 3445.36,
    "end": 3451.28,
    "text": "receive at least one parameter, but we probably understand that we could not name this self,",
    "textdich": ""
  },
  {
    "start": 3451.28,
    "end": 3456.56,
    "text": "because that is just going to be too much confusing. Okay, so now let's go ahead and write",
    "textdich": ""
  },
  {
    "start": 3456.56,
    "end": 3462.8,
    "text": "some code to read the CSV file and instantiate some objects. Now, I'm going to go up top first,",
    "textdich": ""
  },
  {
    "start": 3462.8,
    "end": 3470.56,
    "text": "and I'm going to import a library that is called CSV. So I will go here and I will use an import",
    "textdich": ""
  },
  {
    "start": 3470.56,
    "end": 3476.24,
    "text": "CSV line, because that will be the library that will take full responsibility to read the CSV",
    "textdich": ""
  },
  {
    "start": 3476.24,
    "end": 3482.32,
    "text": "file. And then we will see how we can instantiate some objects. All right, so now I can go ahead and",
    "textdich": ""
  },
  {
    "start": 3482.32,
    "end": 3489.44,
    "text": "use a context manager to read the items dot CSV file. Now both of those files are located in the",
    "textdich": ""
  },
  {
    "start": 3489.44,
    "end": 3497.04,
    "text": "same location. So I can just directly say, Wait, open items dot CSV, and the permission that I",
    "textdich": ""
  },
  {
    "start": 3497.04,
    "end": 3504.56,
    "text": "will be passing here could be hour because we only look to read this. And I will say as f like that.",
    "textdich": ""
  },
  {
    "start": 3504.56,
    "end": 3512.88,
    "text": "Now inside this open, I will go ahead and use some metadata to directly read the CSV, which at the",
    "textdich": ""
  },
  {
    "start": 3512.88,
    "end": 3519.6,
    "text": "end of the day will be responsible to convert this into a Python dictionary. So I will say reader",
    "textdich": ""
  },
  {
    "start": 3519.6,
    "end": 3530.56,
    "text": "is equal to CSV, dot d ICT reader like that. And I will pass in the content of our file like that.",
    "textdich": ""
  },
  {
    "start": 3530.56,
    "end": 3537.04,
    "text": "Now, this method should go ahead and read our content as a list of dictionaries. But at the end",
    "textdich": ""
  },
  {
    "start": 3537.04,
    "end": 3541.2,
    "text": "of the day, we should also go ahead and convert this into a list. So I will go ahead and create",
    "textdich": ""
  },
  {
    "start": 3541.2,
    "end": 3547.44,
    "text": "one more variable that will be equal to items. And I will just convert the reader into a list.",
    "textdich": ""
  },
  {
    "start": 3547.44,
    "end": 3552.88,
    "text": "And that's it. And now that we have completed the actions that we want to complete by reading",
    "textdich": ""
  },
  {
    "start": 3552.88,
    "end": 3560.24,
    "text": "the CSV file, let's go ahead and use a Shift Tab to indent out. And now before we go ahead",
    "textdich": ""
  },
  {
    "start": 3560.24,
    "end": 3566.08,
    "text": "and instantiate some objects, let's go ahead and see the results of iterating over the items list.",
    "textdich": ""
  },
  {
    "start": 3566.08,
    "end": 3574.0,
    "text": "Now I will go ahead and use for item in items. And then I will just use print items to show you",
    "textdich": ""
  },
  {
    "start": 3574.0,
    "end": 3580.08,
    "text": "the behavior of that. And excuse me, it should be item. All right, so now that we understood this,",
    "textdich": ""
  },
  {
    "start": 3580.08,
    "end": 3585.52,
    "text": "then let's go ahead and see what we have in those lines. So after our class definition, we only go",
    "textdich": ""
  },
  {
    "start": 3585.52,
    "end": 3591.84,
    "text": "ahead and call this item dot instantiate from CSV method. So if I was to run that,",
    "textdich": ""
  },
  {
    "start": 3591.84,
    "end": 3597.92,
    "text": "then you can see that I received some dictionaries in separate lines. And that is because I iterate",
    "textdich": ""
  },
  {
    "start": 3597.92,
    "end": 3603.84,
    "text": "over a list of dictionaries in Here, and that is just perfect. All right, so the only thing that we",
    "textdich": ""
  },
  {
    "start": 3603.84,
    "end": 3610.72,
    "text": "miss right now is creating instances. Now besides printing those, then we could now say something",
    "textdich": ""
  },
  {
    "start": 3610.72,
    "end": 3617.84,
    "text": "like item and open up and close parentheses. And this will be enough to instantiate our instances.",
    "textdich": ""
  },
  {
    "start": 3617.84,
    "end": 3625.2,
    "text": "Now I can go ahead and pass my arguments in here by basically reading the keys from a dictionary.",
    "textdich": ""
  },
  {
    "start": 3625.2,
    "end": 3635.36,
    "text": "So I can say name is equal to item dot get, and that will receive name. And now I can add a comma",
    "textdich": ""
  },
  {
    "start": 3635.36,
    "end": 3642.32,
    "text": "and duplicate this line twice, and change those accordingly. So this will be price.",
    "textdich": ""
  },
  {
    "start": 3642.32,
    "end": 3649.52,
    "text": "And this will be quantity. And now I need to replace my key names. So it will be price here,",
    "textdich": ""
  },
  {
    "start": 3649.52,
    "end": 3656.48,
    "text": "and then quantity right there. And now let's go ahead and see what will happen if I was to call",
    "textdich": ""
  },
  {
    "start": 3656.48,
    "end": 3664.48,
    "text": "this method. And as well as calling the attribute of item dot all because this one stores all the",
    "textdich": ""
  },
  {
    "start": 3664.48,
    "end": 3670.96,
    "text": "instances inside the list. Now if I was to go ahead and run it, then you can see that I have",
    "textdich": ""
  },
  {
    "start": 3670.96,
    "end": 3679.52,
    "text": "some arrows. Now you'll see that the arrows are related to the price. And you can see that we",
    "textdich": ""
  },
  {
    "start": 3679.52,
    "end": 3685.28,
    "text": "receive is not greater than or equal to zero. Now let's go ahead and fix this very quickly.",
    "textdich": ""
  },
  {
    "start": 3685.28,
    "end": 3691.6,
    "text": "So in the items dot CSV, you can see that those are actually integers that are greater than",
    "textdich": ""
  },
  {
    "start": 3691.6,
    "end": 3697.28,
    "text": "zero. So the problem is probably the fact that those are passed as strings. So we",
    "textdich": ""
  },
  {
    "start": 3697.28,
    "end": 3706.24,
    "text": "need to go ahead and pass those as integers. So I'm going to convert those into int, like that.",
    "textdich": ""
  },
  {
    "start": 3706.24,
    "end": 3712.56,
    "text": "And now let's go ahead and see if we will have any problems as I expect to have any problem, because",
    "textdich": ""
  },
  {
    "start": 3712.56,
    "end": 3717.28,
    "text": "the quantity should complain about the same thing. And you can see that this is exactly what is going",
    "textdich": ""
  },
  {
    "start": 3717.28,
    "end": 3728.0,
    "text": "on here. So we can use the same for quantity like that, and work with that. And you can see that now",
    "textdich": ""
  },
  {
    "start": 3728.0,
    "end": 3733.76,
    "text": "we see our instances perfectly. Now I want to show one more problem that we could have in the future",
    "textdich": ""
  },
  {
    "start": 3733.76,
    "end": 3741.12,
    "text": "and we should avoid now. So those three lines are going to work with this structural of Aveda.",
    "textdich": ""
  },
  {
    "start": 3741.12,
    "end": 3749.44,
    "text": "But if I was to change the price of our keyboard to something like 74 dot 90, something like that,",
    "textdich": ""
  },
  {
    "start": 3750.0,
    "end": 3757.6,
    "text": "and re execute our file, then you can see that we will receive some problems. So we need to convert",
    "textdich": ""
  },
  {
    "start": 3757.6,
    "end": 3764.16,
    "text": "the price not to an integer but to a float like that. And that is the only way to get over this",
    "textdich": ""
  },
  {
    "start": 3764.16,
    "end": 3768.88,
    "text": "because we don't want to convert the price to an industrial directly because it could be",
    "textdich": ""
  },
  {
    "start": 3768.88,
    "end": 3775.68,
    "text": "float. So now we could go ahead and execute and you can see that now it works perfectly,",
    "textdich": ""
  },
  {
    "start": 3775.68,
    "end": 3783.52,
    "text": "although we see the prices as 100.0 but that is something that we will look into it in the future",
    "textdich": ""
  },
  {
    "start": 3783.52,
    "end": 3789.68,
    "text": "but for now it works perfect. And now we are ready to jump on to our next topic. Okay, so now that we",
    "textdich": ""
  },
  {
    "start": 3789.68,
    "end": 3795.44,
    "text": "completely understood the class methods, let's go ahead and also understand what static methods are",
    "textdich": ""
  },
  {
    "start": 3795.44,
    "end": 3801.92,
    "text": "now established metal show do some work for you, that has some logical connection to a class. So",
    "textdich": ""
  },
  {
    "start": 3801.92,
    "end": 3807.6,
    "text": "for example, if you want to check if a number is an integer or a float, then this is a good",
    "textdich": ""
  },
  {
    "start": 3807.6,
    "end": 3813.52,
    "text": "candidate for creating a static method, because this has some connection to the class that we",
    "textdich": ""
  },
  {
    "start": 3813.52,
    "end": 3821.2,
    "text": "work with. So it makes sense to check if a price of an item has a decimal point and by saying has",
    "textdich": ""
  },
  {
    "start": 3821.2,
    "end": 3829.44,
    "text": "a decimal point, I obviously count out those that are point zero. Now to be honest, static in class",
    "textdich": ""
  },
  {
    "start": 3829.44,
    "end": 3834.88,
    "text": "methods could look very alike to you. But we will explain the main differences very soon.",
    "textdich": ""
  },
  {
    "start": 3834.88,
    "end": 3841.12,
    "text": "Okay, so I will use those lines to create our first static method. Now let's go ahead and",
    "textdich": ""
  },
  {
    "start": 3841.12,
    "end": 3847.04,
    "text": "use the def keyword. And we will name this method is underscore integer because we said that we'd",
    "textdich": ""
  },
  {
    "start": 3847.04,
    "end": 3852.56,
    "text": "like to write a static method that will check if a received number is an integer or not. Now",
    "textdich": ""
  },
  {
    "start": 3852.56,
    "end": 3857.76,
    "text": "if I was to open up and close parentheses, this would obviously receive itself now I want you",
    "textdich": ""
  },
  {
    "start": 3857.76,
    "end": 3863.04,
    "text": "to take a closer look what will happen if I was to change this method into being a static method",
    "textdich": ""
  },
  {
    "start": 3863.04,
    "end": 3867.92,
    "text": "and the approach is going to be pretty much the same like we have done with the class method, we",
    "textdich": ""
  },
  {
    "start": 3867.92,
    "end": 3873.84,
    "text": "will use a decorator that is called static method and this will be responsible to the conversion. So",
    "textdich": ""
  },
  {
    "start": 3873.84,
    "end": 3881.84,
    "text": "I will go ahead and use this line and I will say add static method like that. Now pay attention",
    "textdich": ""
  },
  {
    "start": 3882.4,
    "end": 3888.48,
    "text": "how the received parameter turned into the regular orange color that we are familiar",
    "textdich": ""
  },
  {
    "start": 3888.48,
    "end": 3895.6,
    "text": "because that is just a regular parameter that we receive. Now this means that this static methods",
    "textdich": ""
  },
  {
    "start": 3895.6,
    "end": 3902.56,
    "text": "are never sending in the background, the instance as As a first argument and that is",
    "textdich": ""
  },
  {
    "start": 3902.56,
    "end": 3910.48,
    "text": "unlike the class methods, the class methods are sending the class reference as a first argument.",
    "textdich": ""
  },
  {
    "start": 3910.48,
    "end": 3916.88,
    "text": "And that is why we had to receive the CLS. And that is why it is intentionally colored with",
    "textdich": ""
  },
  {
    "start": 3916.88,
    "end": 3924.56,
    "text": "purple. But with static methods, we never send the object as the first argument. So that is why",
    "textdich": ""
  },
  {
    "start": 3924.56,
    "end": 3931.04,
    "text": "we should relate to the static method, like a regular function that just receives parameters",
    "textdich": ""
  },
  {
    "start": 3931.04,
    "end": 3936.56,
    "text": "like we are familiar with isolated functions. Now I will go deeper on this just in a few minutes.",
    "textdich": ""
  },
  {
    "start": 3936.56,
    "end": 3942.56,
    "text": "But let's go ahead and finish up our static method first. So this should receive num as a one",
    "textdich": ""
  },
  {
    "start": 3942.56,
    "end": 3947.28,
    "text": "parameter because we should receive at least something to check if it is an integer or not.",
    "textdich": ""
  },
  {
    "start": 3947.28,
    "end": 3953.44,
    "text": "All right, so now that we are inside this method, then I can go ahead and use a couple of statements",
    "textdich": ""
  },
  {
    "start": 3953.44,
    "end": 3958.88,
    "text": "to check if the received argument is an integer or mark. Now if you remember, we said that we'd",
    "textdich": ""
  },
  {
    "start": 3958.88,
    "end": 3968.96,
    "text": "like to, we will count out the floats that are decimal that are point zero, okay? Meaning,",
    "textdich": ""
  },
  {
    "start": 3970.4,
    "end": 3978.4,
    "text": "for example, 5.0 10.0, and so on. Alright, so now that we understood this, let's go ahead",
    "textdich": ""
  },
  {
    "start": 3978.4,
    "end": 3984.56,
    "text": "and use an if statement view. So if in we will call the built in function that is called is",
    "textdich": ""
  },
  {
    "start": 3984.56,
    "end": 3990.32,
    "text": "instance. And this should receive two arguments. And we can understand what this function is going",
    "textdich": ""
  },
  {
    "start": 3990.32,
    "end": 3998.96,
    "text": "to do for us, it is going to check if the received parameter is an instance of a float or an integer.",
    "textdich": ""
  },
  {
    "start": 3998.96,
    "end": 4005.6,
    "text": "So we will pass in as the first argument the num and as the second argument, the float without",
    "textdich": ""
  },
  {
    "start": 4005.6,
    "end": 4012.88,
    "text": "calling those parentheses, so only the reference to the float keyword. So this conditional",
    "textdich": ""
  },
  {
    "start": 4012.88,
    "end": 4019.12,
    "text": "should go ahead and check if the num is a folding number or not. Now inside this if statement,",
    "textdich": ""
  },
  {
    "start": 4019.12,
    "end": 4028.0,
    "text": "I will say return num.is integer, so by saying.is integer, then I basically say",
    "textdich": ""
  },
  {
    "start": 4028.64,
    "end": 4037.28,
    "text": "count out the floats that are decimal that are point zero. So this means that if I was to",
    "textdich": ""
  },
  {
    "start": 4037.28,
    "end": 4044.08,
    "text": "pass in here a number like 10.0, then this will return false, but remember that this will enter",
    "textdich": ""
  },
  {
    "start": 4044.08,
    "end": 4050.0,
    "text": "here because he thinks it is a flaw because it is represented in that way. And so the East amisco",
    "textdich": ""
  },
  {
    "start": 4050.0,
    "end": 4056.64,
    "text": "interview should check if the point is zero, and true return false accordingly. Now, I will also",
    "textdich": ""
  },
  {
    "start": 4056.64,
    "end": 4064.32,
    "text": "use an else if statement here to basically check if it is integer by itself. So I will say l E is",
    "textdich": ""
  },
  {
    "start": 4065.28,
    "end": 4073.52,
    "text": "instance num, and check if it is an instance of an integer, then I will just return true. And",
    "textdich": ""
  },
  {
    "start": 4073.52,
    "end": 4080.08,
    "text": "if it is just something else, then I will just say return false like that. So now that we have",
    "textdich": ""
  },
  {
    "start": 4080.08,
    "end": 4087.12,
    "text": "designed this method, then let's take a look how we can call it. So now I will just remove this",
    "textdich": ""
  },
  {
    "start": 4087.12,
    "end": 4091.76,
    "text": "and this, I'm not actually going to instantiate anything, I'm just going to show you how you can",
    "textdich": ""
  },
  {
    "start": 4092.32,
    "end": 4100.32,
    "text": "access to the static method. So I will just call this item.is interview and I will just pass in",
    "textdich": ""
  },
  {
    "start": 4100.32,
    "end": 4106.08,
    "text": "a number that I will like to check if it is an interview or not. Now for sure, we'd like to print",
    "textdich": ""
  },
  {
    "start": 4106.08,
    "end": 4111.76,
    "text": "this. So we will see the result. Now let's go ahead and pass in seven. So, you can see that we",
    "textdich": ""
  },
  {
    "start": 4111.76,
    "end": 4118.8,
    "text": "receive through now if I was to pass in 7.5 then I would receive false and what is happening in the",
    "textdich": ""
  },
  {
    "start": 4118.8,
    "end": 4126.24,
    "text": "background it is the fact that it enters here, but it sees that it is not an integer so it returns",
    "textdich": ""
  },
  {
    "start": 4126.24,
    "end": 4133.52,
    "text": "false. But if I was to change this to 7.0 then this show Sorry about that, this should",
    "textdich": ""
  },
  {
    "start": 4133.52,
    "end": 4139.6,
    "text": "still return true because what is happening it is entering inside this conditional and",
    "textdich": ""
  },
  {
    "start": 4139.6,
    "end": 4145.44,
    "text": "then it checks if it is an integer, but we said that this method counts out the floats that are",
    "textdich": ""
  },
  {
    "start": 4145.44,
    "end": 4152.16,
    "text": "point zero. So it returns true still so that is a perfect design Alright. So I have came up with a",
    "textdich": ""
  },
  {
    "start": 4152.16,
    "end": 4157.52,
    "text": "new file, which I will just explain here when to use a class method and when to use a static",
    "textdich": ""
  },
  {
    "start": 4157.52,
    "end": 4161.52,
    "text": "method. So we can completely understand the differences between those because I remember",
    "textdich": ""
  },
  {
    "start": 4161.52,
    "end": 4168.24,
    "text": "myself I had a very tough time to understand why I need this and why I need the other one. So that",
    "textdich": ""
  },
  {
    "start": 4168.24,
    "end": 4172.56,
    "text": "will be the main question that I will be answering in this Python file. So don't feel like you have",
    "textdich": ""
  },
  {
    "start": 4172.56,
    "end": 4178.0,
    "text": "to copy and paste the code following along what I am explaining here by listening should be enough",
    "textdich": ""
  },
  {
    "start": 4178.64,
    "end": 4184.16,
    "text": "Alright. So in this file, I will just go ahead and create this class item that we have",
    "textdich": ""
  },
  {
    "start": 4185.04,
    "end": 4191.36,
    "text": "right and i will use pass to not receive arrows. Now when we will use a static method.",
    "textdich": ""
  },
  {
    "start": 4191.36,
    "end": 4198.96,
    "text": "So we will use a static method when we want to do something that should not be unique per instance.",
    "textdich": ""
  },
  {
    "start": 4198.96,
    "end": 4204.88,
    "text": "Exactly like we have I have done previously. So his interview is a method that is just going to",
    "textdich": ""
  },
  {
    "start": 4204.88,
    "end": 4210.64,
    "text": "be responsible to check if a number is integer or not. So that is why I could allow myself to",
    "textdich": ""
  },
  {
    "start": 4210.64,
    "end": 4217.36,
    "text": "include this under the item, just like I could use this def as an isolated function right above the",
    "textdich": ""
  },
  {
    "start": 4217.36,
    "end": 4224.16,
    "text": "class. And that was also okay. But I prefer to not do that, because although this is a",
    "textdich": ""
  },
  {
    "start": 4224.16,
    "end": 4230.64,
    "text": "metal that has nothing to do with instance, that is somehow related to the item class.",
    "textdich": ""
  },
  {
    "start": 4230.64,
    "end": 4237.84,
    "text": "So that is the reason you want to create this as a static method, like we have designed previously.",
    "textdich": ""
  },
  {
    "start": 4237.84,
    "end": 4244.88,
    "text": "And the reason that you would like to create a class method is for instantiating instances",
    "textdich": ""
  },
  {
    "start": 4244.88,
    "end": 4250.64,
    "text": "from some structured data that you own. So exactly like we have done, we have created",
    "textdich": ""
  },
  {
    "start": 4250.64,
    "end": 4258.56,
    "text": "a class metal that was responsible to read the CSV file and creating some instances. So as I",
    "textdich": ""
  },
  {
    "start": 4258.56,
    "end": 4265.84,
    "text": "wrote here, those are used to manipulate different structures of data to instantiate objects, like we",
    "textdich": ""
  },
  {
    "start": 4265.84,
    "end": 4271.84,
    "text": "have done with the CSV file, we could also use a class method like instantiate from a JSON file,",
    "textdich": ""
  },
  {
    "start": 4272.56,
    "end": 4280.4,
    "text": "or from a yamo file, those just are different ways to maintain data in the best practice way in that",
    "textdich": ""
  },
  {
    "start": 4280.4,
    "end": 4286.0,
    "text": "is the code that you will look to include inside your class methods. That is why they should be",
    "textdich": ""
  },
  {
    "start": 4286.0,
    "end": 4291.28,
    "text": "existing in any class, especially if you look to instantiate hundreds of objects",
    "textdich": ""
  },
  {
    "start": 4291.28,
    "end": 4298.08,
    "text": "on your programs. So it is a great idea to have at least one class method, like we have done in the",
    "textdich": ""
  },
  {
    "start": 4298.08,
    "end": 4307.12,
    "text": "item class. Now the only main difference between a class method and to a static method is the fact",
    "textdich": ""
  },
  {
    "start": 4307.12,
    "end": 4313.6,
    "text": "that static methods are not passing the object reference as the first argument in the background,",
    "textdich": ""
  },
  {
    "start": 4313.6,
    "end": 4319.28,
    "text": "it is noticeable from the fact that we don't have a special highlight purple, in my case",
    "textdich": ""
  },
  {
    "start": 4319.28,
    "end": 4325.76,
    "text": "for the first parameter. So if you remember, if I was to go ahead and use here a first fundamental",
    "textdich": ""
  },
  {
    "start": 4325.76,
    "end": 4330.72,
    "text": "like num, then you will see that this is the first parameter that is colored with orange,",
    "textdich": ""
  },
  {
    "start": 4330.72,
    "end": 4336.88,
    "text": "because that is a regular parameter. But that is purple, because this is a mandatory parameter that",
    "textdich": ""
  },
  {
    "start": 4336.88,
    "end": 4342.48,
    "text": "we should receive, because what I have just explained, so those are the main differences",
    "textdich": ""
  },
  {
    "start": 4342.48,
    "end": 4348.32,
    "text": "between a static method to a class metal. Now if you remember, I intentionally said that the",
    "textdich": ""
  },
  {
    "start": 4348.32,
    "end": 4354.48,
    "text": "class methods and the static methods could only be called from the class level. But however,",
    "textdich": ""
  },
  {
    "start": 4354.48,
    "end": 4360.8,
    "text": "those also could be called from instances. So as you can see, I can actually instantiate an object",
    "textdich": ""
  },
  {
    "start": 4360.8,
    "end": 4366.0,
    "text": "and call the integer in as well as the instantiate from something can just pass in here in number",
    "textdich": ""
  },
  {
    "start": 4366.0,
    "end": 4370.56,
    "text": "like five and I will not receive any arrows. And if I was to run the helper, then you can",
    "textdich": ""
  },
  {
    "start": 4370.56,
    "end": 4376.32,
    "text": "see that I don't have an error. Now, I'm going to be honest with you, I never saw a reason to",
    "textdich": ""
  },
  {
    "start": 4376.32,
    "end": 4382.4,
    "text": "call a static method, or a class method from the instance level. But that is just an option that",
    "textdich": ""
  },
  {
    "start": 4382.4,
    "end": 4387.44,
    "text": "exists, I know that it is very, very confusing. But that is something you are rarely going to",
    "textdich": ""
  },
  {
    "start": 4387.44,
    "end": 4394.16,
    "text": "see. And like I said, I never saw a great reason to call a static method or to call a class method",
    "textdich": ""
  },
  {
    "start": 4394.16,
    "end": 4399.12,
    "text": "from an instance. So my recommendation to not confuse you is just not going with",
    "textdich": ""
  },
  {
    "start": 4399.12,
    "end": 4404.48,
    "text": "calling those from the instance level. All right, so I minimize the code that we wrote so far",
    "textdich": ""
  },
  {
    "start": 4404.48,
    "end": 4410.0,
    "text": "in the class item. Now in order to start solving the problems that we will solve in this episode,",
    "textdich": ""
  },
  {
    "start": 4410.0,
    "end": 4416.16,
    "text": "then I'm going to create here two instances. So I will say form one is equal to an item.",
    "textdich": ""
  },
  {
    "start": 4416.16,
    "end": 4424.72,
    "text": "And let's give it a name like JC phone v 10. And then just use a random price and quantity.",
    "textdich": ""
  },
  {
    "start": 4424.72,
    "end": 4430.64,
    "text": "And I will copy and paste this and use another variable like phone two in there, we'll increase",
    "textdich": ""
  },
  {
    "start": 4430.64,
    "end": 4436.64,
    "text": "the version by 10. And let's say that this price for the phone two should be 700. All right, so",
    "textdich": ""
  },
  {
    "start": 4436.64,
    "end": 4443.04,
    "text": "now that we have created two instances of a phone, pay attention that those two items are phones. So",
    "textdich": ""
  },
  {
    "start": 4443.04,
    "end": 4449.12,
    "text": "we could think about some attributes that could represent phones in real life. Think about an",
    "textdich": ""
  },
  {
    "start": 4449.12,
    "end": 4454.24,
    "text": "attribute like broken phones, because we could have some phones that could have been broken.",
    "textdich": ""
  },
  {
    "start": 4454.24,
    "end": 4460.88,
    "text": "And so we cannot really mark it as a phone that we could really sell. So this means that we could go",
    "textdich": ""
  },
  {
    "start": 4460.88,
    "end": 4467.28,
    "text": "ahead and say phone one that broken phones, let's say that we have unfortunately one broken phone",
    "textdich": ""
  },
  {
    "start": 4467.28,
    "end": 4472.32,
    "text": "on our hand right now. So I will go ahead and assign the same attribute for our second phone.",
    "textdich": ""
  },
  {
    "start": 4472.32,
    "end": 4477.6,
    "text": "And now that we have came up with this realistic attribute, then the next step that we might think",
    "textdich": ""
  },
  {
    "start": 4477.6,
    "end": 4482.72,
    "text": "about, could be creating a method that will go ahead and calculate the phones that are actually",
    "textdich": ""
  },
  {
    "start": 4482.72,
    "end": 4488.88,
    "text": "not broken, meaning subtracting the quantity by the broken phones amount because this is totally",
    "textdich": ""
  },
  {
    "start": 4488.88,
    "end": 4494.72,
    "text": "making sense. And then we can understand what are the phones that we could go actually and sell them",
    "textdich": ""
  },
  {
    "start": 4494.72,
    "end": 4500.0,
    "text": "in the future. But we have couple of problems creating a method that will go ahead and calculate",
    "textdich": ""
  },
  {
    "start": 4500.0,
    "end": 4505.44,
    "text": "Such a thing because we cannot we'll go ahead inside our item. And do this smooth enough,",
    "textdich": ""
  },
  {
    "start": 4505.44,
    "end": 4512.16,
    "text": "because we don't really have the broken phones attribute assigned to self. And we cannot actually",
    "textdich": ""
  },
  {
    "start": 4512.16,
    "end": 4517.04,
    "text": "go ahead and create this method inside this item class, because this method is not going",
    "textdich": ""
  },
  {
    "start": 4517.04,
    "end": 4523.12,
    "text": "to be useful for other hundreds of items that you will go ahead and create. These just represent a",
    "textdich": ""
  },
  {
    "start": 4523.12,
    "end": 4529.44,
    "text": "phone kind of item. So in order to solve this problem in terms of best practices in object",
    "textdich": ""
  },
  {
    "start": 4529.44,
    "end": 4534.88,
    "text": "oriented programming, then we could go ahead and create a separate class that will inherit the",
    "textdich": ""
  },
  {
    "start": 4534.88,
    "end": 4540.48,
    "text": "functionalities that the item class brings with it. And that is exactly where we could benefit",
    "textdich": ""
  },
  {
    "start": 4540.48,
    "end": 4546.24,
    "text": "from inheritance. And we could go ahead and create a separate class that we call name phone. And then",
    "textdich": ""
  },
  {
    "start": 4546.24,
    "end": 4554.64,
    "text": "this phone class will inherit all the methods in all the attributes that item class has. So let's",
    "textdich": ""
  },
  {
    "start": 4554.64,
    "end": 4559.92,
    "text": "go ahead and simulate that. So I'm not going to delete the instances yet, but I'm going to",
    "textdich": ""
  },
  {
    "start": 4559.92,
    "end": 4566.8,
    "text": "go ahead here and create a class that I will name it phone. Now pay attention that I will not use a",
    "textdich": ""
  },
  {
    "start": 4566.8,
    "end": 4574.0,
    "text": "semicolon and I will use those brackets and I will specify what class I would like to inherit from.",
    "textdich": ""
  },
  {
    "start": 4574.0,
    "end": 4580.64,
    "text": "So I will inherit from item. And then I will just use a pass temporarily because I will not like",
    "textdich": ""
  },
  {
    "start": 4580.64,
    "end": 4585.92,
    "text": "to use additional functionality right now inside this class. Okay, so now that we have created this",
    "textdich": ""
  },
  {
    "start": 4585.92,
    "end": 4592.16,
    "text": "class, then let's go ahead and first execute our program, where at the first stage, the instances",
    "textdich": ""
  },
  {
    "start": 4592.16,
    "end": 4598.4,
    "text": "will be item instances. And this should not have any problems because we know that we can create",
    "textdich": ""
  },
  {
    "start": 4598.4,
    "end": 4604.0,
    "text": "those item instances and we will not receive any arrows. But if we were to change those to",
    "textdich": ""
  },
  {
    "start": 4604.72,
    "end": 4611.52,
    "text": "phone like that, then we should still not receive any arrows. And that's just",
    "textdich": ""
  },
  {
    "start": 4611.52,
    "end": 4618.08,
    "text": "a basic way that you could use inheritance in order to represent different kinds of objects",
    "textdich": ""
  },
  {
    "start": 4618.08,
    "end": 4622.96,
    "text": "when you want to do that. Now, this could also be applied to other real estate programs that you",
    "textdich": ""
  },
  {
    "start": 4622.96,
    "end": 4628.56,
    "text": "want to come up with them and buy your own. But in my case, it totally makes sense to create some",
    "textdich": ""
  },
  {
    "start": 4628.56,
    "end": 4634.96,
    "text": "classes where each class will represent a kind of an item. And then I could go ahead and inherit",
    "textdich": ""
  },
  {
    "start": 4634.96,
    "end": 4640.64,
    "text": "from the item class in each of the child classes that I will go ahead and create in the future,",
    "textdich": ""
  },
  {
    "start": 4640.64,
    "end": 4646.48,
    "text": "I could also use another class for a kind of item like laptop, and then I could go ahead and use the",
    "textdich": ""
  },
  {
    "start": 4646.48,
    "end": 4652.88,
    "text": "separated functionality for that. Now when we talk about classes that we inherit from, then those are",
    "textdich": ""
  },
  {
    "start": 4652.88,
    "end": 4659.36,
    "text": "considered to be called parent classes. And when we use multiple classes that inherits from that",
    "textdich": ""
  },
  {
    "start": 4659.36,
    "end": 4665.44,
    "text": "parent class, then those are considered to be called child classes. So those are just terms",
    "textdich": ""
  },
  {
    "start": 4665.44,
    "end": 4670.08,
    "text": "that you want to be familiar with when we talk about object oriented programming. And from here,",
    "textdich": ""
  },
  {
    "start": 4670.08,
    "end": 4676.16,
    "text": "we will see more advanced things that you can go ahead and do with your child classes. Alright,",
    "textdich": ""
  },
  {
    "start": 4676.16,
    "end": 4681.2,
    "text": "so now let's go ahead and understand some more advanced things about inheritance. Now to help",
    "textdich": ""
  },
  {
    "start": 4681.2,
    "end": 4687.6,
    "text": "this series, we learned that it is not a great idea to assign attributes manually, once we create",
    "textdich": ""
  },
  {
    "start": 4687.6,
    "end": 4693.28,
    "text": "those instances. And the better way to do that is actually going ahead and creating our constructor",
    "textdich": ""
  },
  {
    "start": 4693.28,
    "end": 4700.64,
    "text": "and pass the value that we'd like to immediately in the instance creation exactly like here.",
    "textdich": ""
  },
  {
    "start": 4700.64,
    "end": 4705.28,
    "text": "So in order to solve this, then we're going to need to figure out how we are going to do that,",
    "textdich": ""
  },
  {
    "start": 4705.28,
    "end": 4710.64,
    "text": "because creating the constructor inside this phone class is going to will be tricky,",
    "textdich": ""
  },
  {
    "start": 4710.64,
    "end": 4715.92,
    "text": "because we don't really want to break the logic that the development score in it brings with the",
    "textdich": ""
  },
  {
    "start": 4715.92,
    "end": 4721.92,
    "text": "parent class. But we'd also like to pass in an additional attribute like broken phones, that",
    "textdich": ""
  },
  {
    "start": 4721.92,
    "end": 4728.64,
    "text": "we will go ahead and deal with that attribute and assign it to the self object exactly like we have",
    "textdich": ""
  },
  {
    "start": 4728.64,
    "end": 4735.76,
    "text": "done in the second part of our series. So in order to keep the logic the same for this child class,",
    "textdich": ""
  },
  {
    "start": 4735.76,
    "end": 4743.04,
    "text": "and as well as received some more attributes. Then for now, I am going to go ahead and copy the code",
    "textdich": ""
  },
  {
    "start": 4743.04,
    "end": 4751.92,
    "text": "in our constructor and just paste this in right inside our phone class. And that's making sense",
    "textdich": ""
  },
  {
    "start": 4751.92,
    "end": 4758.56,
    "text": "temporarily, because we received the exact same parameters that we should receive when",
    "textdich": ""
  },
  {
    "start": 4758.56,
    "end": 4765.52,
    "text": "we instantiate an instance. And we also have now the control to receive some more parameters,",
    "textdich": ""
  },
  {
    "start": 4765.52,
    "end": 4771.76,
    "text": "like we want to do with the broken phones. So let's go ahead here and say broken.",
    "textdich": ""
  },
  {
    "start": 4773.2,
    "end": 4779.92,
    "text": "So I will just scroll here, and I will say broken phones is equal to zero. Let's also receive a",
    "textdich": ""
  },
  {
    "start": 4779.92,
    "end": 4786.4,
    "text": "default value for that. And let's go ahead and type in a validation for the broken phones. So",
    "textdich": ""
  },
  {
    "start": 4786.4,
    "end": 4792.96,
    "text": "I will allow myself to just copy that and paste this in. And we'll use assert quantity I mean",
    "textdich": ""
  },
  {
    "start": 4792.96,
    "end": 4802.72,
    "text": "broken phones is greater than or equal to zero and I will change this to broken phone Like that,",
    "textdich": ""
  },
  {
    "start": 4802.72,
    "end": 4808.64,
    "text": "actually broken phones, and this should be exactly like we have done with the quantity.",
    "textdich": ""
  },
  {
    "start": 4808.64,
    "end": 4814.8,
    "text": "And now let's go ahead to the section of assigned to self object. And we can use self dot broken",
    "textdich": ""
  },
  {
    "start": 4815.52,
    "end": 4822.56,
    "text": "phones is equal to broken phones like that. And you can see that here we have actions to",
    "textdich": ""
  },
  {
    "start": 4822.56,
    "end": 4828.08,
    "text": "execute. Now it could have been nicer if we could also create a class attribute for the",
    "textdich": ""
  },
  {
    "start": 4828.08,
    "end": 4835.04,
    "text": "phone class. And that will mean that we could go ahead here and say all is equal to an empty list,",
    "textdich": ""
  },
  {
    "start": 4835.76,
    "end": 4844.16,
    "text": "then we could go ahead and use a form dot all dot append, like that. And now if I was to go",
    "textdich": ""
  },
  {
    "start": 4844.16,
    "end": 4851.28,
    "text": "ahead and run this program, then you can see that I will not receive any arrows. Now to check that",
    "textdich": ""
  },
  {
    "start": 4851.28,
    "end": 4857.68,
    "text": "this works, then I'm also going to pass in here one. And I'm going to do the same here",
    "textdich": ""
  },
  {
    "start": 4857.68,
    "end": 4863.2,
    "text": "as well. And I'm going to remove those. All right, I'm going to remove the hardcoded attributes,",
    "textdich": ""
  },
  {
    "start": 4863.2,
    "end": 4868.4,
    "text": "and the program still works. Now I'd also like to test this by applying one of the methods that",
    "textdich": ""
  },
  {
    "start": 4868.4,
    "end": 4873.92,
    "text": "we have wrote so far in that will be obviously a method that I like to use from the parent class,",
    "textdich": ""
  },
  {
    "start": 4873.92,
    "end": 4880.08,
    "text": "because we inherit those methods. So I can go ahead and use phone one dot,",
    "textdich": ""
  },
  {
    "start": 4880.72,
    "end": 4886.48,
    "text": "calculate total price, and it makes sense to print this. So I will go ahead and print that.",
    "textdich": ""
  },
  {
    "start": 4886.48,
    "end": 4892.96,
    "text": "And you can see that print phone one dot calculate total price. And now if I was to run that,",
    "textdich": ""
  },
  {
    "start": 4892.96,
    "end": 4897.84,
    "text": "then you can see that I received a result. So this means that I don't have any arrows.",
    "textdich": ""
  },
  {
    "start": 4897.84,
    "end": 4902.88,
    "text": "Now I'm not sure if you pay attention to this. But if I was to scroll up a bit,",
    "textdich": ""
  },
  {
    "start": 4902.88,
    "end": 4908.16,
    "text": "then you're gonna see that the constructor in the child class is complaining about something. And",
    "textdich": ""
  },
  {
    "start": 4908.16,
    "end": 4913.84,
    "text": "let's Hover the mouse and see what is the warning. Now you can see that it says to us call to double",
    "textdich": ""
  },
  {
    "start": 4913.84,
    "end": 4921.04,
    "text": "underscore in it of super class is missed. And what that means, it means that when we initialize",
    "textdich": ""
  },
  {
    "start": 4921.04,
    "end": 4926.96,
    "text": "the double underscore init method inside the child class, then Python expects for some function to be",
    "textdich": ""
  },
  {
    "start": 4926.96,
    "end": 4933.04,
    "text": "called intentionally. Now this function is named super. And what super allows us to do, it allows",
    "textdich": ""
  },
  {
    "start": 4933.04,
    "end": 4939.28,
    "text": "us to have full access to all the attributes of the parent class. And by using the super function,",
    "textdich": ""
  },
  {
    "start": 4939.28,
    "end": 4944.72,
    "text": "we don't really need to hard code in the attribute assignment, like we have done with the name,",
    "textdich": ""
  },
  {
    "start": 4944.72,
    "end": 4950.56,
    "text": "price and quantity. And as well as for the other validations that we have executed every time",
    "textdich": ""
  },
  {
    "start": 4950.56,
    "end": 4956.96,
    "text": "that we want to come up with a child class. Now imagine how hard that is going to be. If",
    "textdich": ""
  },
  {
    "start": 4956.96,
    "end": 4962.56,
    "text": "for each of the child classes that we will create in the future, we will have to go through copying",
    "textdich": ""
  },
  {
    "start": 4962.56,
    "end": 4969.6,
    "text": "and pasting assert price and quantity. And as well as doing the assigned to self object thing in",
    "textdich": ""
  },
  {
    "start": 4969.6,
    "end": 4976.0,
    "text": "those three lines. That is going to be a lot of duplication of code. Now to save us that time,",
    "textdich": ""
  },
  {
    "start": 4976.0,
    "end": 4981.76,
    "text": "that is exactly why we needed to use the super function, the super function will allow us to have",
    "textdich": ""
  },
  {
    "start": 4981.76,
    "end": 4988.64,
    "text": "the attributes access from the parent classes. And therefore, we will be able to fully implement",
    "textdich": ""
  },
  {
    "start": 4988.64,
    "end": 4995.28,
    "text": "the best practices in inheritance when it comes to object oriented programs. Now again, this program",
    "textdich": ""
  },
  {
    "start": 4995.28,
    "end": 5002.16,
    "text": "works because we assign the attributes of name, price and quantity for the sales object in the",
    "textdich": ""
  },
  {
    "start": 5002.16,
    "end": 5010.56,
    "text": "trial class. But if I was to remove those three lines, and as well as those two lines, now those",
    "textdich": ""
  },
  {
    "start": 5010.56,
    "end": 5016.08,
    "text": "lines are happen to be the lines that I have copied and pasted and try to run this program,",
    "textdich": ""
  },
  {
    "start": 5016.08,
    "end": 5021.36,
    "text": "then you can see that we receive attribute error phone object has no attribute price,",
    "textdich": ""
  },
  {
    "start": 5021.36,
    "end": 5027.6,
    "text": "and pay attention from what line it comes from. It comes from line 21 from the item class,",
    "textdich": ""
  },
  {
    "start": 5027.6,
    "end": 5033.2,
    "text": "because it thinks that it has the attribute of price. But we never have the price attribute in",
    "textdich": ""
  },
  {
    "start": 5033.2,
    "end": 5038.64,
    "text": "the phone level. Because we just deleted the self dot price is equal to price. And that's",
    "textdich": ""
  },
  {
    "start": 5038.64,
    "end": 5044.64,
    "text": "why now we have some problems. And we are going to replace all the lines that we have deleted",
    "textdich": ""
  },
  {
    "start": 5044.64,
    "end": 5050.72,
    "text": "with the following thing that I'm going to just execute now. So I'm going to go to the first line",
    "textdich": ""
  },
  {
    "start": 5050.72,
    "end": 5061.52,
    "text": "of our constructor, and I'm going to say call to Super function to have access to all attributes",
    "textdich": ""
  },
  {
    "start": 5063.04,
    "end": 5069.84,
    "text": "slash methods. And then I'm going to say super, net I'm going to open up and close parentheses.",
    "textdich": ""
  },
  {
    "start": 5069.84,
    "end": 5075.36,
    "text": "And then I'm going to use the double underscore init method like that. Now you can see that the",
    "textdich": ""
  },
  {
    "start": 5075.36,
    "end": 5079.6,
    "text": "second that I have completed this, then there are no more warnings about the constructor in",
    "textdich": ""
  },
  {
    "start": 5079.6,
    "end": 5085.36,
    "text": "this child class. And you can also see that these double underscore init method expects for some",
    "textdich": ""
  },
  {
    "start": 5085.36,
    "end": 5090.8,
    "text": "special arguments. Now those special arguments obviously coming from the item class that we",
    "textdich": ""
  },
  {
    "start": 5090.8,
    "end": 5101.04,
    "text": "inherit from. So if I was to pass in here, name and also price and also quantity Then this should",
    "textdich": ""
  },
  {
    "start": 5101.04,
    "end": 5107.6,
    "text": "be fine. Now, you can also ask yourself isn't the duplication of code, the fact that we also",
    "textdich": ""
  },
  {
    "start": 5107.6,
    "end": 5113.76,
    "text": "copied and pasted the parameters that we receive in the child class. And yeah, that is a perfect",
    "textdich": ""
  },
  {
    "start": 5113.76,
    "end": 5118.64,
    "text": "question. That is something that could be solved by something more advanced. If you heard about",
    "textdich": ""
  },
  {
    "start": 5118.64,
    "end": 5124.16,
    "text": "keyword arguments, that is something that we can solve it with that way. And then we will not have",
    "textdich": ""
  },
  {
    "start": 5124.16,
    "end": 5128.96,
    "text": "to duplicate the parameters that will receive for the constructor, that is not something that I'm",
    "textdich": ""
  },
  {
    "start": 5128.96,
    "end": 5134.72,
    "text": "going to show for that stage, I'm going to stick with it. And I'm just going to leave it as it is",
    "textdich": ""
  },
  {
    "start": 5134.72,
    "end": 5140.88,
    "text": "now calling the super function. And as well as the init method right after it should be",
    "textdich": ""
  },
  {
    "start": 5140.88,
    "end": 5148.24,
    "text": "responsible to have the same behavior like we had previously. So we should still see 2500",
    "textdich": ""
  },
  {
    "start": 5148.24,
    "end": 5153.12,
    "text": "for this print line, and we should not see any arrows. And if I was to run the program,",
    "textdich": ""
  },
  {
    "start": 5153.12,
    "end": 5158.24,
    "text": "then you can see that we receive the expected result. So that way, we implement the best",
    "textdich": ""
  },
  {
    "start": 5158.24,
    "end": 5164.96,
    "text": "practices of object oriented programming for each child class that we use a separated constructor,",
    "textdich": ""
  },
  {
    "start": 5164.96,
    "end": 5171.6,
    "text": "we also are going to need to call the super function in order to have fully access for all the",
    "textdich": ""
  },
  {
    "start": 5171.6,
    "end": 5176.88,
    "text": "attributes and methods that are coming from the class that we inherit from. Alright,",
    "textdich": ""
  },
  {
    "start": 5176.88,
    "end": 5183.12,
    "text": "so I minimize the code for our classes. And I also left with one instance of foam here. Now",
    "textdich": ""
  },
  {
    "start": 5183.12,
    "end": 5189.12,
    "text": "I want to show you the results of the following things. So I will say print, and I will see what",
    "textdich": ""
  },
  {
    "start": 5189.12,
    "end": 5195.84,
    "text": "is the list of all in the item class is going to bring us back. So I'm going to say item dot all.",
    "textdich": ""
  },
  {
    "start": 5195.84,
    "end": 5201.28,
    "text": "And then I'm also going to say phone that all if you remember, we implemented this class attribute",
    "textdich": ""
  },
  {
    "start": 5201.28,
    "end": 5207.68,
    "text": "as well here. So I will minimize the code back. And then I will run our program. Now you can see",
    "textdich": ""
  },
  {
    "start": 5207.68,
    "end": 5214.56,
    "text": "something very weird in here we see item. And then we basically see the result of the array PR method",
    "textdich": ""
  },
  {
    "start": 5214.56,
    "end": 5219.52,
    "text": "that comes from the item class. Now the reason that this happens, because we never implemented",
    "textdich": ""
  },
  {
    "start": 5219.52,
    "end": 5227.28,
    "text": "in our EPR method inside the form class. So that's why we see this on generic result of item. Now you",
    "textdich": ""
  },
  {
    "start": 5227.28,
    "end": 5233.28,
    "text": "can also pay attention that we only create an instance of the phone class. So that's not so",
    "textdich": ""
  },
  {
    "start": 5233.28,
    "end": 5240.32,
    "text": "good that we see item in those outputs. So what we call use, instead of hard coding in the name",
    "textdich": ""
  },
  {
    "start": 5240.32,
    "end": 5246.96,
    "text": "of the class in the rppr method inside the item class, then we go to access to the name of the",
    "textdich": ""
  },
  {
    "start": 5246.96,
    "end": 5253.28,
    "text": "class generically. Now if I was to replace this with some special magic attribute that will be",
    "textdich": ""
  },
  {
    "start": 5253.28,
    "end": 5258.96,
    "text": "responsible to give me the name of the class, then this will be perfect. So I'm going to delete that.",
    "textdich": ""
  },
  {
    "start": 5258.96,
    "end": 5265.84,
    "text": "And I'm going to use curly brackets, and I'm going to say self, dot double underscore class,",
    "textdich": ""
  },
  {
    "start": 5266.4,
    "end": 5272.88,
    "text": "dot double underscore name. So that is a generic way to access to the name of the class",
    "textdich": ""
  },
  {
    "start": 5272.88,
    "end": 5279.76,
    "text": "from the instance. And by doing this, then besides receiving item, hard coded string, then I should",
    "textdich": ""
  },
  {
    "start": 5279.76,
    "end": 5284.48,
    "text": "receive the name of the class that I initialize from the very beginning. So this should be",
    "textdich": ""
  },
  {
    "start": 5285.04,
    "end": 5289.76,
    "text": "phone, because that is the only single instance that I have right now. And you can see that this",
    "textdich": ""
  },
  {
    "start": 5289.76,
    "end": 5295.36,
    "text": "is exactly the result that I'm receiving back. So that is perfect. Now I said earlier that by",
    "textdich": ""
  },
  {
    "start": 5295.36,
    "end": 5301.68,
    "text": "using the super function, then we basically have access to all the attributes and the methods that",
    "textdich": ""
  },
  {
    "start": 5301.68,
    "end": 5307.12,
    "text": "are coming from the class that we inherit from. So what that means, it means that we will also have",
    "textdich": ""
  },
  {
    "start": 5307.12,
    "end": 5314.8,
    "text": "the access to the class attribute of all that is inside the item class. And I'm talking about that",
    "textdich": ""
  },
  {
    "start": 5314.8,
    "end": 5321.76,
    "text": "attribute, right. Now to show you that, then I'm going to open back the code from the form class.",
    "textdich": ""
  },
  {
    "start": 5321.76,
    "end": 5327.36,
    "text": "And I'm going to remove the old attribute. And I'm just going to do that right now. And",
    "textdich": ""
  },
  {
    "start": 5327.36,
    "end": 5333.76,
    "text": "I'm also going to delete the actions to execute where I use form dot all dot append, because we",
    "textdich": ""
  },
  {
    "start": 5333.76,
    "end": 5339.84,
    "text": "no longer having the old attribute in the form class. And if I was to remove those,",
    "textdich": ""
  },
  {
    "start": 5339.84,
    "end": 5345.76,
    "text": "and execute our program now, then you can see that I still receive the same result. So that",
    "textdich": ""
  },
  {
    "start": 5345.76,
    "end": 5353.28,
    "text": "is a great idea removing the old attribute in the child class level, it is a great idea to only use",
    "textdich": ""
  },
  {
    "start": 5353.28,
    "end": 5358.48,
    "text": "the old attribute in the parent class, because by using the super function in the child class,",
    "textdich": ""
  },
  {
    "start": 5358.48,
    "end": 5363.92,
    "text": "we will have access to the old attribute. So this means that if one day we'd like to have",
    "textdich": ""
  },
  {
    "start": 5363.92,
    "end": 5370.0,
    "text": "access to all the items instances that have been initialized, including the child classes,",
    "textdich": ""
  },
  {
    "start": 5370.0,
    "end": 5376.56,
    "text": "then accessing them from item dot all should also be enough. Now you might be confused how this line",
    "textdich": ""
  },
  {
    "start": 5376.56,
    "end": 5382.72,
    "text": "is responsible to add this instance inside the all attribute that is happened to be a list.",
    "textdich": ""
  },
  {
    "start": 5382.72,
    "end": 5389.04,
    "text": "And that's happening because by using the super function and as well as the in it, then we",
    "textdich": ""
  },
  {
    "start": 5389.04,
    "end": 5395.68,
    "text": "basically call the init method inside the parent class. Now in the latest line inside this method,",
    "textdich": ""
  },
  {
    "start": 5395.68,
    "end": 5401.68,
    "text": "we also use item dot all dot append, which is also going to be accessible From the form class,",
    "textdich": ""
  },
  {
    "start": 5401.68,
    "end": 5408.4,
    "text": "so that's why calling the all class attribute from the item class is a better idea, because",
    "textdich": ""
  },
  {
    "start": 5408.4,
    "end": 5414.4,
    "text": "it will give us the complete picture. Okay, so before diving into the topic of that episode,",
    "textdich": ""
  },
  {
    "start": 5414.4,
    "end": 5419.12,
    "text": "then we're going to need to do some code organization in here, because as you can see,",
    "textdich": ""
  },
  {
    "start": 5419.12,
    "end": 5423.44,
    "text": "for each of the child classes that we will go ahead and create in the future to extend this",
    "textdich": ""
  },
  {
    "start": 5423.44,
    "end": 5428.8,
    "text": "project, then we're going to need to do this in the main.py file, because that was the only single",
    "textdich": ""
  },
  {
    "start": 5428.8,
    "end": 5434.24,
    "text": "file that we were working with. And now that our project grows, we need to start working with",
    "textdich": ""
  },
  {
    "start": 5434.24,
    "end": 5439.76,
    "text": "multiple files. So that's why it may be working with a file that will represent the class of item",
    "textdich": ""
  },
  {
    "start": 5439.76,
    "end": 5444.8,
    "text": "and working with a separate file that will represent the foreign child class will be a better",
    "textdich": ""
  },
  {
    "start": 5444.8,
    "end": 5452.88,
    "text": "idea. So we will have the main.py file dedicated for only creating instances of those classes. So",
    "textdich": ""
  },
  {
    "start": 5452.88,
    "end": 5458.0,
    "text": "let's get started with this. So I'm going to go to the project directory and create two Python files.",
    "textdich": ""
  },
  {
    "start": 5458.56,
    "end": 5465.84,
    "text": "First one, we will name the item.pi. The other one should be named phone.pi.",
    "textdich": ""
  },
  {
    "start": 5465.84,
    "end": 5472.44,
    "text": "And I'm going to take the code from our item class. And I'm just going to grab everything. Why,",
    "textdich": ""
  },
  {
    "start": 5473.6,
    "end": 5480.32,
    "text": "while the following, and I'm going to cut this and then I'm going to paste this in inside of that.",
    "textdich": ""
  },
  {
    "start": 5480.32,
    "end": 5486.08,
    "text": "Now pay attention that I use the CSV library. So that's actually the location that I need this",
    "textdich": ""
  },
  {
    "start": 5486.08,
    "end": 5492.48,
    "text": "library. So I'm going to just copy the import line. And that should be good enough. Now I'm",
    "textdich": ""
  },
  {
    "start": 5492.48,
    "end": 5500.4,
    "text": "going to do the same process for the form dot p y, I'm going to be copying this into the form.py file",
    "textdich": ""
  },
  {
    "start": 5500.4,
    "end": 5506.48,
    "text": "as well. But now this file needs to import the item class because as you can see, we got an arrow",
    "textdich": ""
  },
  {
    "start": 5506.48,
    "end": 5514.4,
    "text": "here. So we should say from item, import items like the following in the arrows should be gone.",
    "textdich": ""
  },
  {
    "start": 5514.4,
    "end": 5520.48,
    "text": "And then in the main.py file, we can basically use this file to only instantiate instances,",
    "textdich": ""
  },
  {
    "start": 5520.48,
    "end": 5525.52,
    "text": "meaning creating data that will represent something to Python. So this means that",
    "textdich": ""
  },
  {
    "start": 5525.52,
    "end": 5532.4,
    "text": "we can go ahead and import the class from the item file, we can do the same from the",
    "textdich": ""
  },
  {
    "start": 5532.96,
    "end": 5538.4,
    "text": "form file. And then we can go ahead and do the stuff that we use to do so we can say item dot",
    "textdich": ""
  },
  {
    "start": 5538.96,
    "end": 5547.76,
    "text": "instantiate from CSV. into verify that this works, we can also say print, and item dot all like that.",
    "textdich": ""
  },
  {
    "start": 5548.32,
    "end": 5552.96,
    "text": "And if we want to run this file now to see that this works, then we can do that. And you can see",
    "textdich": ""
  },
  {
    "start": 5552.96,
    "end": 5558.48,
    "text": "that everything works just as expected. Now just a quick side note, I'm not going to rely too much on",
    "textdich": ""
  },
  {
    "start": 5558.48,
    "end": 5563.44,
    "text": "the child class that we have created in the latest episode, to show the problems that we're going to",
    "textdich": ""
  },
  {
    "start": 5563.44,
    "end": 5569.92,
    "text": "solve in that episode, I'm going to rely more on the item class so that it will be easier to",
    "textdich": ""
  },
  {
    "start": 5569.92,
    "end": 5575.2,
    "text": "follow. And we will not complex things too much. Now that doesn't mean that I do not recommend",
    "textdich": ""
  },
  {
    "start": 5575.2,
    "end": 5580.64,
    "text": "using child classes or something like that. But it will be just easier to show you the cases that I'm",
    "textdich": ""
  },
  {
    "start": 5580.64,
    "end": 5586.24,
    "text": "going to show in the parent class. So that's why For example, I deleted temporarily the",
    "textdich": ""
  },
  {
    "start": 5586.24,
    "end": 5593.76,
    "text": "input line of the form class. And I just came up with a random item instance that name is my item",
    "textdich": ""
  },
  {
    "start": 5593.76,
    "end": 5598.56,
    "text": "in the price happened to be that number I did not specify quantity because we have a default value.",
    "textdich": ""
  },
  {
    "start": 5598.56,
    "end": 5604.08,
    "text": "And now after this line, you can see that I override this attribute by the string of",
    "textdich": ""
  },
  {
    "start": 5604.08,
    "end": 5609.28,
    "text": "other items. Now the expected result is not going to surprise anyone because we see at the",
    "textdich": ""
  },
  {
    "start": 5609.28,
    "end": 5615.6,
    "text": "right time when we print this attribute. But we might want to ask ourselves is that the behavior",
    "textdich": ""
  },
  {
    "start": 5615.6,
    "end": 5622.4,
    "text": "that we always want? What if we want to restrict our users to change the attribute of name, once",
    "textdich": ""
  },
  {
    "start": 5622.4,
    "end": 5627.92,
    "text": "the name has been set up in the initialization, meaning in that line? Well, that's something that",
    "textdich": ""
  },
  {
    "start": 5627.92,
    "end": 5634.4,
    "text": "we might want to achieve for critical attributes like the name of your instances, and in our case,",
    "textdich": ""
  },
  {
    "start": 5635.12,
    "end": 5641.02,
    "text": "the name of our item. So what we could do, we could actually go ahead and create read only so",
    "textdich": ""
  },
  {
    "start": 5641.02,
    "end": 5648.72,
    "text": "called attributes, meaning that we have only one opportunity to set the name of our item. And then",
    "textdich": ""
  },
  {
    "start": 5648.72,
    "end": 5654.4,
    "text": "we cannot touch the value of that anymore. So what that means it means that we can set up this in the",
    "textdich": ""
  },
  {
    "start": 5654.4,
    "end": 5660.48,
    "text": "initialization. And we should have arrows if we try to override the value of that. Now that's",
    "textdich": ""
  },
  {
    "start": 5660.48,
    "end": 5667.2,
    "text": "also known as encapsulation when we talk about the principles of object oriented programming,",
    "textdich": ""
  },
  {
    "start": 5667.2,
    "end": 5672.48,
    "text": "which I will be focusing more on the future episodes. But now let's go ahead and see how",
    "textdich": ""
  },
  {
    "start": 5672.48,
    "end": 5679.28,
    "text": "we can come up with read only attributes how we can restrict our users to override the attributes",
    "textdich": ""
  },
  {
    "start": 5679.28,
    "end": 5685.92,
    "text": "after the initialization of our instances. Okay, so on the left side we have the main.py file, and",
    "textdich": ""
  },
  {
    "start": 5685.92,
    "end": 5691.2,
    "text": "on the right side we have the item.py file which we are going to work on and inside the class I'm",
    "textdich": ""
  },
  {
    "start": 5691.2,
    "end": 5697.68,
    "text": "going to create our first read only attribute. Now the way that you can start doing this is by first",
    "textdich": ""
  },
  {
    "start": 5697.68,
    "end": 5702.48,
    "text": "using a decorator and if you remember from the previous episodes decorators are like",
    "textdich": ""
  },
  {
    "start": 5702.48,
    "end": 5708.96,
    "text": "functions that you can pre execute before another function. So I could go ahead and use the property",
    "textdich": ""
  },
  {
    "start": 5708.96,
    "end": 5715.52,
    "text": "decorator, and then go ahead and create a function. And here is the exact location that I",
    "textdich": ""
  },
  {
    "start": 5715.52,
    "end": 5722.4,
    "text": "could set up the name of our read only attribute. So for testing reasons, let's go ahead and call",
    "textdich": ""
  },
  {
    "start": 5722.4,
    "end": 5728.08,
    "text": "this read only name something in that time, all right, and then I will open up and close",
    "textdich": ""
  },
  {
    "start": 5728.08,
    "end": 5733.28,
    "text": "parentheses, and this will obviously receive self because it's going to be belong to each of the",
    "textdich": ""
  },
  {
    "start": 5733.28,
    "end": 5738.88,
    "text": "instances. And now for testing purposes, let's only go ahead and return a random string like",
    "textdich": ""
  },
  {
    "start": 5739.84,
    "end": 5746.64,
    "text": "a three times. Alright, and then now that we have done this, I can go to our main dot php file and",
    "textdich": ""
  },
  {
    "start": 5746.64,
    "end": 5752.56,
    "text": "try to access this property. Now pay attention that I'm going to call those properties and not",
    "textdich": ""
  },
  {
    "start": 5753.28,
    "end": 5761.76,
    "text": "attributes. So I'm going to go here, and I'm going to try to print item one, that name and now that I",
    "textdich": ""
  },
  {
    "start": 5761.76,
    "end": 5768.0,
    "text": "have wrote name, pay attention to the differences in this drop down for read only name, we receive",
    "textdich": ""
  },
  {
    "start": 5768.0,
    "end": 5774.4,
    "text": "a totally different icon here on the left side, which stands for a property where in here we see",
    "textdich": ""
  },
  {
    "start": 5774.4,
    "end": 5781.2,
    "text": "the flutter which stands for irregular field. So if I was to try to print that and run our program,",
    "textdich": ""
  },
  {
    "start": 5781.2,
    "end": 5787.84,
    "text": "then obviously we will receive the expected result. But if I was to try to set a new value,",
    "textdich": ""
  },
  {
    "start": 5787.84,
    "end": 5792.4,
    "text": "for the read only name, say that we want to change this to something like that,",
    "textdich": ""
  },
  {
    "start": 5792.4,
    "end": 5797.44,
    "text": "then you're going to see that Python is going to complain about this. And even if we try to execute",
    "textdich": ""
  },
  {
    "start": 5797.44,
    "end": 5804.16,
    "text": "that, then we will end up with an exception that says attribute error can set attribute. So that is",
    "textdich": ""
  },
  {
    "start": 5804.16,
    "end": 5811.44,
    "text": "how read only attributes, so called are working in Python, you can create those by using a property",
    "textdich": ""
  },
  {
    "start": 5811.44,
    "end": 5817.2,
    "text": "decorator before your functions and return whatever value you'd like to return. Now the",
    "textdich": ""
  },
  {
    "start": 5817.2,
    "end": 5823.12,
    "text": "biggest challenge here is going to be converting the name attribute that we actually have,",
    "textdich": ""
  },
  {
    "start": 5823.92,
    "end": 5830.48,
    "text": "which is happened to be exactly here into obeying a read only attribute. And that is going to be a",
    "textdich": ""
  },
  {
    "start": 5830.48,
    "end": 5835.68,
    "text": "little bit challenging. But let's go ahead and start working on that. So first things first,",
    "textdich": ""
  },
  {
    "start": 5835.68,
    "end": 5840.32,
    "text": "I'm going to delete those three lines, because we are not going to use this property anymore.",
    "textdich": ""
  },
  {
    "start": 5840.32,
    "end": 5846.8,
    "text": "And I'm going to scroll up a bit and work underneath this constructor here. So",
    "textdich": ""
  },
  {
    "start": 5846.8,
    "end": 5853.6,
    "text": "you might think that converting the name attribute into being read only meaning a property is as easy",
    "textdich": ""
  },
  {
    "start": 5853.6,
    "end": 5859.76,
    "text": "as doing something like first using the property decorator, and then go ahead and say def name,",
    "textdich": ""
  },
  {
    "start": 5860.32,
    "end": 5866.16,
    "text": "then receive self as the parameter. And then use something like return self dot name, because we",
    "textdich": ""
  },
  {
    "start": 5866.16,
    "end": 5871.84,
    "text": "already have the self type name assigned to the self object. But actually doing something like",
    "textdich": ""
  },
  {
    "start": 5871.84,
    "end": 5879.12,
    "text": "this is like saying to that class, hey, from now on, you're going to have a name attribute that is",
    "textdich": ""
  },
  {
    "start": 5879.12,
    "end": 5885.92,
    "text": "going to be rain only. And that is straightforward the effect of the property decorator. So I'm going",
    "textdich": ""
  },
  {
    "start": 5885.92,
    "end": 5892.32,
    "text": "to leave a comment here that is going to look like the following. But if you remember, we try to set",
    "textdich": ""
  },
  {
    "start": 5892.32,
    "end": 5901.6,
    "text": "the self dot name into a new value inside our constructor. So you can see that this action is",
    "textdich": ""
  },
  {
    "start": 5901.6,
    "end": 5908.32,
    "text": "illegal because we have a read only property here. So when you go ahead and create a property with",
    "textdich": ""
  },
  {
    "start": 5908.32,
    "end": 5914.8,
    "text": "the name of basically name, then you are normally allowed to set this value anymore,",
    "textdich": ""
  },
  {
    "start": 5914.8,
    "end": 5921.36,
    "text": "you are only allowed to have access to see this back in whatever instance you will create.",
    "textdich": ""
  },
  {
    "start": 5921.36,
    "end": 5925.92,
    "text": "So that is why if I was to hover my mouse here, then we're going to see an arrow that is saying",
    "textdich": ""
  },
  {
    "start": 5925.92,
    "end": 5933.92,
    "text": "property name cannot be saved. So the pythonic way to doing this workaround to get over this is",
    "textdich": ""
  },
  {
    "start": 5933.92,
    "end": 5941.6,
    "text": "using one underscore before the name of our actual attribute name that we assign to the self object.",
    "textdich": ""
  },
  {
    "start": 5941.6,
    "end": 5947.92,
    "text": "And by doing this, we earn a couple of things that are quite important. So first, let me add here and",
    "textdich": ""
  },
  {
    "start": 5947.92,
    "end": 5954.88,
    "text": "underscore and just use something like that. And then now I need to go to my property function,",
    "textdich": ""
  },
  {
    "start": 5954.88,
    "end": 5960.16,
    "text": "meaning the property attribute. And I'm going to need to add here the double underscore as well.",
    "textdich": ""
  },
  {
    "start": 5960.16,
    "end": 5965.12,
    "text": "Because First things first I go ahead and set up the value for my double underscore,",
    "textdich": ""
  },
  {
    "start": 5965.12,
    "end": 5971.84,
    "text": "excuse me single underscore name into being equal to the value of this parameter here. And then I go",
    "textdich": ""
  },
  {
    "start": 5971.84,
    "end": 5977.6,
    "text": "ahead and use one more read only attribute that I intentionally give the name of name and I and then",
    "textdich": ""
  },
  {
    "start": 5977.6,
    "end": 5986.0,
    "text": "I return self dot underscore name. Now I can go back to my main.py file and see what effects those",
    "textdich": ""
  },
  {
    "start": 5986.0,
    "end": 5992.96,
    "text": "lines are having right now on our instances. So first, I can go ahead and set a name for my item.",
    "textdich": ""
  },
  {
    "start": 5992.96,
    "end": 6000.4,
    "text": "And I can access to the name of this item by saying something like I didn't want that name.",
    "textdich": ""
  },
  {
    "start": 6000.4,
    "end": 6004.8,
    "text": "So I don't really have to go ahead and use item one dot underscore name, because that is going to",
    "textdich": ""
  },
  {
    "start": 6004.8,
    "end": 6011.12,
    "text": "be a little bit ugly, and not convenient. Because accessing attributes with always an underscore",
    "textdich": ""
  },
  {
    "start": 6011.12,
    "end": 6017.2,
    "text": "before is not nice for each of the instances that you look to access to the attributes. Doing this",
    "textdich": ""
  },
  {
    "start": 6017.2,
    "end": 6022.8,
    "text": "one time inside the class is going to make it okay. But trying to access those attributes",
    "textdich": ""
  },
  {
    "start": 6022.8,
    "end": 6028.16,
    "text": "outside of your class, meaning from the instances is not going to turn it into too much pretty. So",
    "textdich": ""
  },
  {
    "start": 6028.16,
    "end": 6035.84,
    "text": "that is the best way to overcome such a thing. And now if I was to try to print that, then, excuse",
    "textdich": ""
  },
  {
    "start": 6035.84,
    "end": 6043.2,
    "text": "me, let me fix that quickly by item one dot name, and run our program, then you can see that that is",
    "textdich": ""
  },
  {
    "start": 6043.2,
    "end": 6049.84,
    "text": "working. And now let's go ahead and also see if we can set our name into being equal to another",
    "textdich": ""
  },
  {
    "start": 6050.72,
    "end": 6057.92,
    "text": "thing like that, see, if that works, I can see that I cannot set that attribute. But how ever,",
    "textdich": ""
  },
  {
    "start": 6057.92,
    "end": 6064.96,
    "text": "I can still see these underscore name from the instance level. And that is maybe something",
    "textdich": ""
  },
  {
    "start": 6064.96,
    "end": 6071.84,
    "text": "that you look to avoid, it could have been a lot nicer if we could somehow prevent totally",
    "textdich": ""
  },
  {
    "start": 6071.84,
    "end": 6078.56,
    "text": "the axis from this underscore naming here. So the way that this is achievable, is by adding",
    "textdich": ""
  },
  {
    "start": 6078.56,
    "end": 6084.32,
    "text": "one more underscore to the attribute name. Now, this might remind you something that is called",
    "textdich": ""
  },
  {
    "start": 6084.32,
    "end": 6090.24,
    "text": "private attribute. If you're familiar with programming languages, like Java, or C sharp,",
    "textdich": ""
  },
  {
    "start": 6090.24,
    "end": 6096.08,
    "text": "that is pretty much the same behavior of using the private key word before your attributes in",
    "textdich": ""
  },
  {
    "start": 6096.08,
    "end": 6101.074,
    "text": "those kinds of programming languages, where it has different principles when it comes to object",
    "textdich": ""
  },
  {
    "start": 6101.074,
    "end": 6105.76,
    "text": "oriented programming. So to sum up, if you add one more underscore to your attribute names,",
    "textdich": ""
  },
  {
    "start": 6105.76,
    "end": 6111.68,
    "text": "meaning you use double underscore, then you basically prevented the access to those attributes",
    "textdich": ""
  },
  {
    "start": 6111.68,
    "end": 6117.28,
    "text": "totally outside of the class. So let's see a simulation of that. So I'm going to minimize",
    "textdich": ""
  },
  {
    "start": 6117.28,
    "end": 6124.0,
    "text": "the terminal, and I'm going to go to my item.py file. And besides using here, single underscore,",
    "textdich": ""
  },
  {
    "start": 6124.0,
    "end": 6129.12,
    "text": "I'm going to add one more. And then I'm going to change this to double underscore as well.",
    "textdich": ""
  },
  {
    "start": 6129.12,
    "end": 6138.88,
    "text": "And now if we were to go to our main.py file, and let's use here it one dot and try to basically use",
    "textdich": ""
  },
  {
    "start": 6139.52,
    "end": 6144.32,
    "text": "double underscore and try to access to name now we can see that I don't even have an auto completion",
    "textdich": ""
  },
  {
    "start": 6144.32,
    "end": 6150.48,
    "text": "from my drop down, because I don't have access to see this attribute from the instance level. And",
    "textdich": ""
  },
  {
    "start": 6150.48,
    "end": 6156.08,
    "text": "that is something that you look to achieve when you want to have a clean read only attribute. And",
    "textdich": ""
  },
  {
    "start": 6156.08,
    "end": 6161.28,
    "text": "that is the way that you can do that. So if I was to try to print this, then that's",
    "textdich": ""
  },
  {
    "start": 6161.28,
    "end": 6166.24,
    "text": "just going to complain about how it does not have the attribute of double underscore name",
    "textdich": ""
  },
  {
    "start": 6166.8,
    "end": 6173.04,
    "text": "in this instance. And again, if I was to remove those double underscores, then I will just access",
    "textdich": ""
  },
  {
    "start": 6173.04,
    "end": 6179.52,
    "text": "it as a property meaning as a read only attribute. And that is exactly what I looked to have here.",
    "textdich": ""
  },
  {
    "start": 6179.52,
    "end": 6184.56,
    "text": "Alright, so now that we got the idea of that, then we still might be curious about how to",
    "textdich": ""
  },
  {
    "start": 6185.12,
    "end": 6190.48,
    "text": "set a new value for the name attribute. Now obviously using the property decorator",
    "textdich": ""
  },
  {
    "start": 6190.48,
    "end": 6195.52,
    "text": "is going to turn this into being a read only attribute. But there are still some decorators",
    "textdich": ""
  },
  {
    "start": 6195.52,
    "end": 6201.68,
    "text": "that will allow you to however, set a new value for this property of name. So let's",
    "textdich": ""
  },
  {
    "start": 6201.68,
    "end": 6207.68,
    "text": "see how that is achievable. So obviously, that is not going to work. Because it says can't",
    "textdich": ""
  },
  {
    "start": 6207.68,
    "end": 6214.48,
    "text": "set attribute. So what we can do is we can use a new method, where we can declare that we like to",
    "textdich": ""
  },
  {
    "start": 6214.48,
    "end": 6223.36,
    "text": "also set a new value for this attribute that we named name. So the way that that's going to work",
    "textdich": ""
  },
  {
    "start": 6223.36,
    "end": 6229.84,
    "text": "is by going to our class here. And using here one more method with a special decorator. Now",
    "textdich": ""
  },
  {
    "start": 6229.84,
    "end": 6233.92,
    "text": "this decorator is going to look like the following. So I'm going to refer to the",
    "textdich": ""
  },
  {
    "start": 6234.64,
    "end": 6241.84,
    "text": "name because that's the property name. And then I'm going to use the dot setter. So by doing this,",
    "textdich": ""
  },
  {
    "start": 6241.84,
    "end": 6248.72,
    "text": "then I basically say, hey, so I still want to set a new value for that name, although that",
    "textdich": ""
  },
  {
    "start": 6248.72,
    "end": 6255.52,
    "text": "is a property meaning a read only attribute. So now if I was to go down and say something like",
    "textdich": ""
  },
  {
    "start": 6255.52,
    "end": 6262.08,
    "text": "def name, and this will receive self and as well as one additional parameter because the additional",
    "textdich": ""
  },
  {
    "start": 6262.08,
    "end": 6267.2,
    "text": "parameter should refer to the new value that I want to set to that name. So I will receive",
    "textdich": ""
  },
  {
    "start": 6267.2,
    "end": 6272.72,
    "text": "a parameter that I could name something like value. And then inside here, I'm only going to",
    "textdich": ""
  },
  {
    "start": 6272.72,
    "end": 6280.32,
    "text": "set the new value for our double underscore name. Because if you remember, when an instance tries to",
    "textdich": ""
  },
  {
    "start": 6280.32,
    "end": 6288.0,
    "text": "see the value of name, then we basically return self dot double underscore name. So when a user",
    "textdich": ""
  },
  {
    "start": 6288.0,
    "end": 6297.04,
    "text": "will try to set the name again to a new value, then it should execute self dot name equals to",
    "textdich": ""
  },
  {
    "start": 6297.04,
    "end": 6305.36,
    "text": "value and by doing this, I basically allow our users to yet set a new value for name. So now",
    "textdich": ""
  },
  {
    "start": 6305.36,
    "end": 6311.12,
    "text": "let's show what effect those three lines are going to have in our main.py. You can see that now the",
    "textdich": ""
  },
  {
    "start": 6311.12,
    "end": 6319.84,
    "text": "arrows gone, I can now go down here and use print item one dot name. And that's going to work I can",
    "textdich": ""
  },
  {
    "start": 6319.84,
    "end": 6328.28,
    "text": "see that I have other item. So this means not only I can set a new value for my underscore name, so",
    "textdich": ""
  },
  {
    "start": 6328.28,
    "end": 6336.4,
    "text": "called in the initialisation, I can also do that later on, if I only use this convention in here.",
    "textdich": ""
  },
  {
    "start": 6336.4,
    "end": 6342.64,
    "text": "Now those getters and setters thing are always confusing in normal programming language you work.",
    "textdich": ""
  },
  {
    "start": 6342.64,
    "end": 6349.28,
    "text": "So I will do a final summary of all what we have learned until this point. All right. So using",
    "textdich": ""
  },
  {
    "start": 6349.28,
    "end": 6356.88,
    "text": "add property will basically give you a control of what you'd like to do when you get a an attribute.",
    "textdich": ""
  },
  {
    "start": 6356.88,
    "end": 6363.6,
    "text": "And also by using this then you basically convert this attribute into being read only if I was not",
    "textdich": ""
  },
  {
    "start": 6363.6,
    "end": 6371.2,
    "text": "implemented these setters in here. So you can see that now, when I commented those out,",
    "textdich": ""
  },
  {
    "start": 6371.2,
    "end": 6376.88,
    "text": "then this line is going to have some problems, because by not doing this, then I basically say",
    "textdich": ""
  },
  {
    "start": 6376.88,
    "end": 6382.56,
    "text": "that hey, name is read only, you cannot set that if I was to again uncomment those back,",
    "textdich": ""
  },
  {
    "start": 6382.56,
    "end": 6387.44,
    "text": "then I will have the control to set this attribute to whatever attribute I'd like to",
    "textdich": ""
  },
  {
    "start": 6387.44,
    "end": 6394.48,
    "text": "now by using this statement here, basically getting the attribute, then I basically call",
    "textdich": ""
  },
  {
    "start": 6394.48,
    "end": 6402.08,
    "text": "the bunch of codes that are being executed in here. So whenever I use item one dot name, then",
    "textdich": ""
  },
  {
    "start": 6402.08,
    "end": 6407.84,
    "text": "Python says to itself, okay, you try to get that attribute. So, I will go ahead and try to execute",
    "textdich": ""
  },
  {
    "start": 6407.84,
    "end": 6414.32,
    "text": "all the lines of codes are that are here. So that is what exactly happening here. And to",
    "textdich": ""
  },
  {
    "start": 6414.32,
    "end": 6421.04,
    "text": "show you that, then I can just use a random print function here that will say, you are trying to",
    "textdich": ""
  },
  {
    "start": 6422.32,
    "end": 6430.8,
    "text": "get name like that, then you should see this line being printed right before what the actual value",
    "textdich": ""
  },
  {
    "start": 6430.8,
    "end": 6437.52,
    "text": "is. Because at first, we print you're trying to fit the name, and then we return the self",
    "textdich": ""
  },
  {
    "start": 6437.52,
    "end": 6443.28,
    "text": "dot underscore name, so it prints that over here. So that is what happening when you try to",
    "textdich": ""
  },
  {
    "start": 6443.92,
    "end": 6450.56,
    "text": "get an attitude. But when you try to set an attitude, then Python says to itself, okay,",
    "textdich": ""
  },
  {
    "start": 6450.56,
    "end": 6456.56,
    "text": "so here, you try to set an attribute. So because you set an attribute, then I should go ahead and",
    "textdich": ""
  },
  {
    "start": 6457.52,
    "end": 6464.8,
    "text": "execute the code that is inside here, because that is the center of that attribute. So that",
    "textdich": ""
  },
  {
    "start": 6464.8,
    "end": 6471.84,
    "text": "is why when you go ahead and use this decorator, then you should always receive a parameter because",
    "textdich": ""
  },
  {
    "start": 6471.84,
    "end": 6477.52,
    "text": "the other item is going to be passed as an argument to that parameter,",
    "textdich": ""
  },
  {
    "start": 6477.52,
    "end": 6483.36,
    "text": "it is very important to understand that. And that is why I can only allow myself to use one line of",
    "textdich": ""
  },
  {
    "start": 6483.36,
    "end": 6492.64,
    "text": "code that will say self dot double underscore name is equal to the new value that you try to set.",
    "textdich": ""
  },
  {
    "start": 6492.64,
    "end": 6501.68,
    "text": "And to show you that again, I can go here and say print you are trying to set in this line should",
    "textdich": ""
  },
  {
    "start": 6501.68,
    "end": 6508.64,
    "text": "appear just before this print line because at first I tried to set a different value for name,",
    "textdich": ""
  },
  {
    "start": 6508.64,
    "end": 6513.92,
    "text": "and then I just print it back like that. Okay, so if I was to run that, then you can see that",
    "textdich": ""
  },
  {
    "start": 6513.92,
    "end": 6520.0,
    "text": "at first we see the line of you're trying to set then right after it we actually see",
    "textdich": ""
  },
  {
    "start": 6520.0,
    "end": 6526.32,
    "text": "whatever item one dot name is equal to. Now the reason that the value is set is because",
    "textdich": ""
  },
  {
    "start": 6526.32,
    "end": 6531.92,
    "text": "we set it over here and then the next time I try to get the value, then those lines are getting",
    "textdich": ""
  },
  {
    "start": 6531.92,
    "end": 6537.36,
    "text": "executed. So that is the lifecycle of getters and setters. And that is the way that it works.",
    "textdich": ""
  },
  {
    "start": 6537.36,
    "end": 6543.44,
    "text": "By having the control of whatever you'd like to do when you set a new value, you can also restrict",
    "textdich": ""
  },
  {
    "start": 6543.44,
    "end": 6549.2,
    "text": "it, you can go ahead and do some conditioning, or you can go ahead and raise some exceptions.",
    "textdich": ""
  },
  {
    "start": 6549.2,
    "end": 6554.64,
    "text": "If you don't like the value that you receive, let's say that you want to restrict the length",
    "textdich": ""
  },
  {
    "start": 6554.64,
    "end": 6560.16,
    "text": "of the characters for the name of that attribute. Alright, so that is something that you can do,",
    "textdich": ""
  },
  {
    "start": 6560.16,
    "end": 6570.72,
    "text": "you can actually go here and say if when of the value is greater than 10, then you'd like",
    "textdich": ""
  },
  {
    "start": 6570.72,
    "end": 6582.24,
    "text": "to raise exception, that will say something like your, the name is too long, something like that.",
    "textdich": ""
  },
  {
    "start": 6582.24,
    "end": 6587.36,
    "text": "And then you can say else and then you can execute the line that will be responsible to",
    "textdich": ""
  },
  {
    "start": 6587.36,
    "end": 6592.24,
    "text": "set that value. So intentionally I'm going to leave it as it is because the length of that is",
    "textdich": ""
  },
  {
    "start": 6592.8,
    "end": 6600.32,
    "text": "nine characters. So we should not have any arrows. But if I was to add here, two more characters,",
    "textdich": ""
  },
  {
    "start": 6600.32,
    "end": 6605.76,
    "text": "Like that, and executed, then you can see that we are going to receive an exception that will say",
    "textdich": ""
  },
  {
    "start": 6605.76,
    "end": 6611.84,
    "text": "the name is too long. So that's how getters and setters are working in Python, you will now have",
    "textdich": ""
  },
  {
    "start": 6611.84,
    "end": 6616.88,
    "text": "all the knowledge that you need to play around with different attributes, and manage them the way",
    "textdich": ""
  },
  {
    "start": 6616.88,
    "end": 6622.72,
    "text": "that you would like to. So I believe that after the information that you received in that episode,",
    "textdich": ""
  },
  {
    "start": 6622.72,
    "end": 6627.76,
    "text": "you have everything that you need to manage your attributes successfully and play around with it,",
    "textdich": ""
  },
  {
    "start": 6627.76,
    "end": 6633.12,
    "text": "as well as coming up with rich classes that will have multiple attributes. And then you can set up",
    "textdich": ""
  },
  {
    "start": 6633.12,
    "end": 6638.88,
    "text": "special behaviors to those attributes. And also you can decide that you will not like to force",
    "textdich": ""
  },
  {
    "start": 6638.88,
    "end": 6644.08,
    "text": "to receive those attributes in the constructor, you can decide that you can delete some parameters",
    "textdich": ""
  },
  {
    "start": 6644.08,
    "end": 6649.92,
    "text": "in your constructor. And you can say that, you will not like to assign those to the self",
    "textdich": ""
  },
  {
    "start": 6649.92,
    "end": 6655.2,
    "text": "object immediately when you create an instance. So whatever you would like, do you have all the tools",
    "textdich": ""
  },
  {
    "start": 6655.2,
    "end": 6662.32,
    "text": "to play around with how to manage your attributes, object oriented programming comes with four key",
    "textdich": ""
  },
  {
    "start": 6662.32,
    "end": 6668.48,
    "text": "principles that you should be aware of. So you will understand how you should design your large",
    "textdich": ""
  },
  {
    "start": 6668.48,
    "end": 6674.48,
    "text": "programs, so it will be easier to keep developing it. And I'm going to talk about those principles",
    "textdich": ""
  },
  {
    "start": 6674.48,
    "end": 6680.72,
    "text": "which are encapsulation, abstraction, inheritance and polymorphism. So the first principle will",
    "textdich": ""
  },
  {
    "start": 6680.72,
    "end": 6687.04,
    "text": "be encapsulation. And we will talk about this a little bit. So encapsulation refers to a mechanism",
    "textdich": ""
  },
  {
    "start": 6687.04,
    "end": 6694.16,
    "text": "of restricting the direct access to some of our attributes in a program. Now notice how we did a",
    "textdich": ""
  },
  {
    "start": 6694.16,
    "end": 6699.68,
    "text": "great job in the last part, where we implemented the encapsulation principle on our project.",
    "textdich": ""
  },
  {
    "start": 6699.68,
    "end": 6705.84,
    "text": "So pay attention to how the name attribute could not be set to a new value, before it goes through",
    "textdich": ""
  },
  {
    "start": 6705.84,
    "end": 6712.32,
    "text": "some conditions that we set here, like the length of the character being less than 10 characters.",
    "textdich": ""
  },
  {
    "start": 6712.32,
    "end": 6719.52,
    "text": "So restricting the ability to override the values for your objects within your saddles, is exactly",
    "textdich": ""
  },
  {
    "start": 6719.52,
    "end": 6725.04,
    "text": "what the encapsulation principle is about. Now to even give you a better example of encapsulation",
    "textdich": ""
  },
  {
    "start": 6725.04,
    "end": 6730.32,
    "text": "principle, then we are going to apply similar things to an additional attribute, which is going",
    "textdich": ""
  },
  {
    "start": 6730.32,
    "end": 6735.84,
    "text": "to be the price attribute. Now if you take a quick look in that program that I have just executed,",
    "textdich": ""
  },
  {
    "start": 6736.56,
    "end": 6742.08,
    "text": "then you can already see that I have the ability to directly set these objects into whatever number",
    "textdich": ""
  },
  {
    "start": 6742.08,
    "end": 6748.48,
    "text": "that I like to also negative 900 will work here. So that's probably something that we look to",
    "textdich": ""
  },
  {
    "start": 6748.48,
    "end": 6755.2,
    "text": "change. And the way that we can change that is by implementing some methods that will restrict the",
    "textdich": ""
  },
  {
    "start": 6755.2,
    "end": 6761.36,
    "text": "access to this price attribute. So it could have been nice if we could have two methods that will",
    "textdich": ""
  },
  {
    "start": 6761.36,
    "end": 6767.04,
    "text": "be responsible to increment these price by some percentage amount. And the same goes for the",
    "textdich": ""
  },
  {
    "start": 6767.04,
    "end": 6773.6,
    "text": "discount. Now if remember, we already came up with a similar method that looks like apply discount",
    "textdich": ""
  },
  {
    "start": 6773.6,
    "end": 6780.08,
    "text": "when we talk about class attributes, because self dot pay rate multiplied by the actual price",
    "textdich": ""
  },
  {
    "start": 6780.64,
    "end": 6787.92,
    "text": "is actually going to change this attribute being decreased by 20%. Because pay rate is set to 0.8,",
    "textdich": ""
  },
  {
    "start": 6787.92,
    "end": 6793.6,
    "text": "if you remember from the previous episodes, so let's go ahead and continue designing this price",
    "textdich": ""
  },
  {
    "start": 6793.6,
    "end": 6799.44,
    "text": "attribute to totally support the encapsulation principle. So first things first, I'm going to",
    "textdich": ""
  },
  {
    "start": 6799.44,
    "end": 6805.28,
    "text": "convert this prize into being a private attribute. So it will be a great start avoiding to set this",
    "textdich": ""
  },
  {
    "start": 6805.28,
    "end": 6810.64,
    "text": "price directly like we have seen previously. Now I'm not going to just add here double underscore,",
    "textdich": ""
  },
  {
    "start": 6810.64,
    "end": 6816.08,
    "text": "besides I'm going to grab this whole thing. And I'm going to right click,",
    "textdich": ""
  },
  {
    "start": 6816.08,
    "end": 6822.08,
    "text": "and then I'm going to say refactor, rename, and then I'm just going to rename this price by",
    "textdich": ""
  },
  {
    "start": 6822.08,
    "end": 6827.92,
    "text": "setting it like that double underscore before that now doing this is actually going to refactor this",
    "textdich": ""
  },
  {
    "start": 6827.92,
    "end": 6834.32,
    "text": "change on the entire class where we try to access the price attribute. So that is a great thing. So",
    "textdich": ""
  },
  {
    "start": 6834.32,
    "end": 6839.12,
    "text": "we don't really have to change everywhere. So once I have done that, then if we will also take a look",
    "textdich": ""
  },
  {
    "start": 6839.12,
    "end": 6845.04,
    "text": "in the apply discount, then you can see that we have this being set to a new variable name",
    "textdich": ""
  },
  {
    "start": 6845.04,
    "end": 6851.44,
    "text": "that we came up with. So now that we have done this, then let's go ahead and create a property.",
    "textdich": ""
  },
  {
    "start": 6851.44,
    "end": 6857.92,
    "text": "So we will have the ability to access the price attribute temporarily being only read only. So",
    "textdich": ""
  },
  {
    "start": 6857.92,
    "end": 6865.6,
    "text": "I'm going to say add property. And then I'm going to say def price, then I'm just going to return",
    "textdich": ""
  },
  {
    "start": 6866.56,
    "end": 6873.28,
    "text": "self dot price. So that's a great starter to restrict the access to the price attribute,",
    "textdich": ""
  },
  {
    "start": 6873.28,
    "end": 6880.08,
    "text": "because now we still have access to the price attribute. And then we cannot set that. So you can",
    "textdich": ""
  },
  {
    "start": 6880.08,
    "end": 6887.6,
    "text": "see that if we were to try to access item one dot price, we will have some errors, but we can just",
    "textdich": ""
  },
  {
    "start": 6887.6,
    "end": 6894.4,
    "text": "access the actual value of that where it comes from the initialisation. So that's a",
    "textdich": ""
  },
  {
    "start": 6894.96,
    "end": 6900.08,
    "text": "oh actually I see that we hit an error that says recursion error and that's probably because I did",
    "textdich": ""
  },
  {
    "start": 6900.08,
    "end": 6905.52,
    "text": "not add the double underscore in here by mistake. So that's actually a great exception that we came",
    "textdich": ""
  },
  {
    "start": 6905.52,
    "end": 6911.2,
    "text": "across right now, you can see that we are going to hit recursion error, maximum recursion depth",
    "textdich": ""
  },
  {
    "start": 6911.2,
    "end": 6916.16,
    "text": "exceeded. And that happened because I tried to return the price without the double underscore. So",
    "textdich": ""
  },
  {
    "start": 6916.72,
    "end": 6922.56,
    "text": "if we try to call the self dot price, then it is going to try to call this function. And if we try",
    "textdich": ""
  },
  {
    "start": 6922.56,
    "end": 6927.76,
    "text": "to return that, then it's just going to loop over it again. And in some time, it's going to fail",
    "textdich": ""
  },
  {
    "start": 6927.76,
    "end": 6933.92,
    "text": "with the recursion error as you see. So that's actually a great exception that we see. Now,",
    "textdich": ""
  },
  {
    "start": 6933.92,
    "end": 6938.72,
    "text": "if you see this exception in your object oriented programs, now you know how to handle it.",
    "textdich": ""
  },
  {
    "start": 6938.72,
    "end": 6944.88,
    "text": "And if I was to come back now to Maine and execute that, then you can see that the expected result is",
    "textdich": ""
  },
  {
    "start": 6944.88,
    "end": 6950.56,
    "text": "here. Alright, so now that we have done this, then let's go back to our class and try to work",
    "textdich": ""
  },
  {
    "start": 6950.56,
    "end": 6957.6,
    "text": "on our methods that will modify the attributes of double underscore price. So I will actually",
    "textdich": ""
  },
  {
    "start": 6957.6,
    "end": 6965.6,
    "text": "cut this metal from here. And I will just put that right under the property price that we",
    "textdich": ""
  },
  {
    "start": 6965.6,
    "end": 6971.36,
    "text": "came up with. So we will have a cleaner look. Now First things first, you can see that we have the",
    "textdich": ""
  },
  {
    "start": 6971.36,
    "end": 6981.28,
    "text": "apply discount. And we will also like to come up with a ply. increment like the following. And we",
    "textdich": ""
  },
  {
    "start": 6981.28,
    "end": 6990.24,
    "text": "will like to say here, self dot double underscore price is equal to self dot level underscore price",
    "textdich": ""
  },
  {
    "start": 6990.96,
    "end": 6999.28,
    "text": "plus self dot level underscore price multiplied by some value that we can receive as a parameter.",
    "textdich": ""
  },
  {
    "start": 6999.28,
    "end": 7007.12,
    "text": "So we could actually receive a parameter that we could name implement value, and then we could",
    "textdich": ""
  },
  {
    "start": 7007.12,
    "end": 7013.68,
    "text": "just multiply it by that number. So now that we came up with this, then let's test this up. Okay,",
    "textdich": ""
  },
  {
    "start": 7013.68,
    "end": 7022.16,
    "text": "I'm going to go back to our my main.py. And then I'm going to call it one dot apply increment,",
    "textdich": ""
  },
  {
    "start": 7022.16,
    "end": 7032.08,
    "text": "and then I'm just going to pass in 0.2. So we will increment the value of 750 by 20%. Now the",
    "textdich": ""
  },
  {
    "start": 7032.08,
    "end": 7039.28,
    "text": "next time that I access the item one dot price, we should be able to see the actual value of price,",
    "textdich": ""
  },
  {
    "start": 7039.28,
    "end": 7045.76,
    "text": "which should be 900. And if I was to run that, then you can see that the price has been",
    "textdich": ""
  },
  {
    "start": 7045.76,
    "end": 7053.44,
    "text": "incremented to 900 as expected. So that is exactly encapsulation in action, because you go ahead and",
    "textdich": ""
  },
  {
    "start": 7053.44,
    "end": 7060.8,
    "text": "you don't allow the access directly to the price attribute. Besides you modify this attribute",
    "textdich": ""
  },
  {
    "start": 7060.8,
    "end": 7066.4,
    "text": "by using methods like apply increments, or apply discount. Now the same will happen if",
    "textdich": ""
  },
  {
    "start": 7066.4,
    "end": 7074.64,
    "text": "I was to now go ahead and use item one dot apply, discount, and you can actually modify this method",
    "textdich": ""
  },
  {
    "start": 7074.64,
    "end": 7081.12,
    "text": "in the way that you'd like to. But this currently refers to a class attribute that we use here. So",
    "textdich": ""
  },
  {
    "start": 7081.12,
    "end": 7090.08,
    "text": "this should also again, apply a discount of 20% to the 900 price, we should be able to see 720. And",
    "textdich": ""
  },
  {
    "start": 7090.08,
    "end": 7095.6,
    "text": "that's exactly what is happening here. Alright, so the next principle that I'm going to talk about is",
    "textdich": ""
  },
  {
    "start": 7095.6,
    "end": 7102.64,
    "text": "called abstraction. Now abstraction is the concept of object oriented programming that only shows",
    "textdich": ""
  },
  {
    "start": 7102.64,
    "end": 7110.56,
    "text": "the necessary attributes and hides the unnecessary information. Now the main purpose of abstraction",
    "textdich": ""
  },
  {
    "start": 7110.56,
    "end": 7117.12,
    "text": "is basically hiding unnecessary details from the users. Now by seeing users, I basically mean",
    "textdich": ""
  },
  {
    "start": 7117.12,
    "end": 7124.32,
    "text": "people like me or you that are going to use the item class to create some item objects. Now we can",
    "textdich": ""
  },
  {
    "start": 7124.32,
    "end": 7131.04,
    "text": "see that now we have a new program here that has one item object that it's name is my item price",
    "textdich": ""
  },
  {
    "start": 7131.04,
    "end": 7137.6,
    "text": "being that number, and we have six from this item. Now we can also see that I came up with a method",
    "textdich": ""
  },
  {
    "start": 7137.6,
    "end": 7143.28,
    "text": "that doesn't really exist, which is called send email. So that method at the end of the day should",
    "textdich": ""
  },
  {
    "start": 7143.28,
    "end": 7150.0,
    "text": "send an email to someone that would like to decide about this item. And it will send info about how",
    "textdich": ""
  },
  {
    "start": 7150.0,
    "end": 7156.56,
    "text": "much money we can earn by selling all the items and maybe about some more info that is related to",
    "textdich": ""
  },
  {
    "start": 7156.56,
    "end": 7163.68,
    "text": "this item. Now sending an email is not as easy action just by calling it with that way.",
    "textdich": ""
  },
  {
    "start": 7164.24,
    "end": 7170.96,
    "text": "Because in the background, email sending has to go a lot of processes like connecting to an SMTP",
    "textdich": ""
  },
  {
    "start": 7170.96,
    "end": 7177.6,
    "text": "server. And as well as preparing the body of the email with an auto message that will display some",
    "textdich": ""
  },
  {
    "start": 7177.6,
    "end": 7182.8,
    "text": "info about this item. So as we can understand we have to go through a lot of new methods",
    "textdich": ""
  },
  {
    "start": 7182.8,
    "end": 7189.28,
    "text": "before we go ahead and just call a Send Email method. So to simulate that, then I can actually",
    "textdich": ""
  },
  {
    "start": 7189.28,
    "end": 7195.04,
    "text": "go ahead and say send email. So I will just create the method that is necessary. Temporarily I will",
    "textdich": ""
  },
  {
    "start": 7195.04,
    "end": 7201.84,
    "text": "use pass. Now as I said we also have to go through a lot of other processes. So it is a great idea to",
    "textdich": ""
  },
  {
    "start": 7201.84,
    "end": 7210.0,
    "text": "create methods for each of those processes, like connecting to an SMTP, server SMTP server like",
    "textdich": ""
  },
  {
    "start": 7210.0,
    "end": 7215.76,
    "text": "that. And I will just say pass because we only try to simulate the idea of abstraction here,",
    "textdich": ""
  },
  {
    "start": 7215.76,
    "end": 7221.12,
    "text": "I'm not really going to send an actual email to someone, I'm just simulating an idea of sending",
    "textdich": ""
  },
  {
    "start": 7221.12,
    "end": 7230.0,
    "text": "an email. And we will also have to go to preparing a body for an automatic mail prepare body, right,",
    "textdich": ""
  },
  {
    "start": 7230.0,
    "end": 7237.52,
    "text": "and then I can just return a formatted string that will say something like hello.",
    "textdich": ""
  },
  {
    "start": 7240.16,
    "end": 7251.84,
    "text": "Someone, we could receive this as a parameter as well. And then we can say, we have self dot name,",
    "textdich": ""
  },
  {
    "start": 7251.84,
    "end": 7259.12,
    "text": "six times, right, so it should be six. So quantity times like that, then I can say regards",
    "textdich": ""
  },
  {
    "start": 7261.12,
    "end": 7267.2,
    "text": "to shave. So that is just a very simple email that we can send to someone. Now we",
    "textdich": ""
  },
  {
    "start": 7267.2,
    "end": 7273.76,
    "text": "can understand that we have to call those methods inside the same email. So simulating that will be",
    "textdich": ""
  },
  {
    "start": 7273.76,
    "end": 7284.24,
    "text": "self dot Connect, and then self dot, prepare body. And probably we also need to go through sending it",
    "textdich": ""
  },
  {
    "start": 7284.24,
    "end": 7291.84,
    "text": "right, so we can just say something like send here, then us passing it. Now you can see that",
    "textdich": ""
  },
  {
    "start": 7291.84,
    "end": 7297.28,
    "text": "those metals at the end of the day are only going to be called from the Send Email.",
    "textdich": ""
  },
  {
    "start": 7297.28,
    "end": 7304.24,
    "text": "Because those are just parts of the email sending process, that is a bigger process",
    "textdich": ""
  },
  {
    "start": 7304.24,
    "end": 7310.96,
    "text": "that we divided into multiple steps in this class. Now the biggest problem is, we will have",
    "textdich": ""
  },
  {
    "start": 7310.96,
    "end": 7318.24,
    "text": "access calling those methods from the instance. And that is exactly what abstraction is about.",
    "textdich": ""
  },
  {
    "start": 7318.24,
    "end": 7325.44,
    "text": "abstraction principle says to you that you should hide unnecessary information from the instances.",
    "textdich": ""
  },
  {
    "start": 7325.44,
    "end": 7332.8,
    "text": "So that is why by converting those methods into being private methods, then we actually apply",
    "textdich": ""
  },
  {
    "start": 7332.8,
    "end": 7338.64,
    "text": "abstraction principles. And that is achievable in Python in a way, which I'm going to be honest,",
    "textdich": ""
  },
  {
    "start": 7338.64,
    "end": 7345.68,
    "text": "is not too much convenient, but it is achievable by adding double underscore. Now again, in other",
    "textdich": ""
  },
  {
    "start": 7345.68,
    "end": 7352.0,
    "text": "programming languages, this is achievable by having access modifiers for your methods,",
    "textdich": ""
  },
  {
    "start": 7352.0,
    "end": 7359.04,
    "text": "like private or public. And I'm talking about programming languages like Java, C sharp, etc.",
    "textdich": ""
  },
  {
    "start": 7359.04,
    "end": 7365.28,
    "text": "So if we were to convert those methods to private methods, by only adding level underscore,",
    "textdich": ""
  },
  {
    "start": 7365.28,
    "end": 7372.64,
    "text": "then those only cool to be cold from the class level, meaning inside the class. So if we were to",
    "textdich": ""
  },
  {
    "start": 7372.64,
    "end": 7378.96,
    "text": "try to access it, then you can see that I am going to have auto completion, meaning I will have the",
    "textdich": ""
  },
  {
    "start": 7378.96,
    "end": 7386.4,
    "text": "ability to access those methods. And then I will just do the same for the other methods. Now this",
    "textdich": ""
  },
  {
    "start": 7386.4,
    "end": 7391.76,
    "text": "arrow comes from here, because we did not really specify some argument, I'm just going to add an",
    "textdich": ""
  },
  {
    "start": 7391.76,
    "end": 7396.56,
    "text": "empty string. Now if I was to go back to our main.py file, then you're going to see that we",
    "textdich": ""
  },
  {
    "start": 7396.56,
    "end": 7401.6,
    "text": "are going to have some troubles. Even if I'm going to try to access it with a double underscore,",
    "textdich": ""
  },
  {
    "start": 7401.6,
    "end": 7406.56,
    "text": "I'm not even going to have an auto completion. And the reason for that is because that is a",
    "textdich": ""
  },
  {
    "start": 7406.56,
    "end": 7411.76,
    "text": "private method. So you really have to think about your methods if you want to make them",
    "textdich": ""
  },
  {
    "start": 7411.76,
    "end": 7418.08,
    "text": "accessible outside of your class, meaning from the instances. And that is exactly what abstraction",
    "textdich": ""
  },
  {
    "start": 7418.08,
    "end": 7425.2,
    "text": "is about. You want to abstract the information that is unnecessary to call it or to access it",
    "textdich": ""
  },
  {
    "start": 7425.2,
    "end": 7431.68,
    "text": "from your instances. Okay, so inheritance is the third principle of object oriented programming.",
    "textdich": ""
  },
  {
    "start": 7431.68,
    "end": 7438.56,
    "text": "inheritance is a mechanism that allows us to reuse code across our classes. Now, that's something",
    "textdich": ""
  },
  {
    "start": 7438.56,
    "end": 7444.96,
    "text": "that we have totally designed well throughout this course, because we came up with more classes that",
    "textdich": ""
  },
  {
    "start": 7444.96,
    "end": 7452.56,
    "text": "are child classes of the item class, where each child class represents a kind of an item. Now pay",
    "textdich": ""
  },
  {
    "start": 7452.56,
    "end": 7460.08,
    "text": "attention how I change the import line from phone import from, and I use the child class of item,",
    "textdich": ""
  },
  {
    "start": 7460.08,
    "end": 7465.92,
    "text": "which we came up with, which is called the phone, you can see that I'm passing similar arguments",
    "textdich": ""
  },
  {
    "start": 7465.92,
    "end": 7471.68,
    "text": "in they can still use a code that is implemented in the parent class. If we were to execute this",
    "textdich": ""
  },
  {
    "start": 7471.68,
    "end": 7478.72,
    "text": "program, then we are not going to receive any problems. Because phone uses all the methods",
    "textdich": ""
  },
  {
    "start": 7478.72,
    "end": 7485.04,
    "text": "and the attributes that it inherits from the item class, which is exactly here. And if we",
    "textdich": ""
  },
  {
    "start": 7485.04,
    "end": 7489.84,
    "text": "remember we designed the Send Email method in the parent class and we can use it from",
    "textdich": ""
  },
  {
    "start": 7489.84,
    "end": 7495.68,
    "text": "the instance of a phone and we can also do that for the rest of the methods that we came up with",
    "textdich": ""
  },
  {
    "start": 7495.68,
    "end": 7501.84,
    "text": "that really affect some of the attributes like in the interview. capsulation part where we applied",
    "textdich": ""
  },
  {
    "start": 7502.72,
    "end": 7508.48,
    "text": "the apply increments method that receives an increment value. And if we were to test this",
    "textdich": ""
  },
  {
    "start": 7509.44,
    "end": 7516.48,
    "text": "incrementing, the price by 0.2, and then printing item one dot price, then we should",
    "textdich": ""
  },
  {
    "start": 7516.48,
    "end": 7522.56,
    "text": "see 1200. So if we were to print that, then you can see that that is exactly the result.",
    "textdich": ""
  },
  {
    "start": 7522.56,
    "end": 7529.28,
    "text": "So that is mainly what inheritance is about. It is about reusing the code across all the classes.",
    "textdich": ""
  },
  {
    "start": 7529.28,
    "end": 7534.72,
    "text": "And that's exactly the scenario here. And the beauty behind that is that you can come up with",
    "textdich": ""
  },
  {
    "start": 7534.72,
    "end": 7541.28,
    "text": "more child classes that will represent the kinds of items like laptop, keyboard, camera, everything",
    "textdich": ""
  },
  {
    "start": 7541.28,
    "end": 7547.52,
    "text": "that you will think about. And then you can just modify specific methods that you'd like to calling",
    "textdich": ""
  },
  {
    "start": 7547.52,
    "end": 7554.24,
    "text": "to the kind of item that you have. So that's perfectly describing what inheritance is about.",
    "textdich": ""
  },
  {
    "start": 7554.24,
    "end": 7560.8,
    "text": "Alright, so the last principle that we have now is polymorphism. Now polymorphism is a very important",
    "textdich": ""
  },
  {
    "start": 7560.8,
    "end": 7567.76,
    "text": "concept in programming. It refers to use of a single type entity to represent different types",
    "textdich": ""
  },
  {
    "start": 7567.76,
    "end": 7574.24,
    "text": "in different scenarios. Now, a perfect example for this definition, will be some of the functions",
    "textdich": ""
  },
  {
    "start": 7574.24,
    "end": 7580.8,
    "text": "that we already know that exists in Python. Now just a quick side note, polymorphism refers to",
    "textdich": ""
  },
  {
    "start": 7580.8,
    "end": 7589.04,
    "text": "many forms Paulie being many, and morphism being forms. So again, the idea of applying polymorphism",
    "textdich": ""
  },
  {
    "start": 7589.04,
    "end": 7596.56,
    "text": "on our programs is the ability to have different scenarios, when we call the exact same entity and",
    "textdich": ""
  },
  {
    "start": 7596.56,
    "end": 7601.52,
    "text": "an entity could be a function that we just call. Now, as you can understand polymorphism isn't",
    "textdich": ""
  },
  {
    "start": 7601.52,
    "end": 7607.2,
    "text": "something that is specifically applied to how you create your classes. That is actually something",
    "textdich": ""
  },
  {
    "start": 7607.2,
    "end": 7611.76,
    "text": "that refers globally to your entire project. And in the next few minutes, we are going to",
    "textdich": ""
  },
  {
    "start": 7611.76,
    "end": 7617.28,
    "text": "see some bad practices where polymorphism is not applied. And we're also going to see where in",
    "textdich": ""
  },
  {
    "start": 7617.28,
    "end": 7623.68,
    "text": "Python the polymorphism is perfectly applied. So a great example of where polymorphism is applied,",
    "textdich": ""
  },
  {
    "start": 7623.68,
    "end": 7630.88,
    "text": "is in the lane built in function. Because the land building function in Python knows how to handle",
    "textdich": ""
  },
  {
    "start": 7630.88,
    "end": 7636.88,
    "text": "different kinds of objects that it receives as an argument, and it returns you a result",
    "textdich": ""
  },
  {
    "start": 7636.88,
    "end": 7644.56,
    "text": "accordingly. So as you can see in here, if we were to use the Len built in function in a string,",
    "textdich": ""
  },
  {
    "start": 7644.56,
    "end": 7651.6,
    "text": "then we will have received the total amount of characters. But if we will do this in a list,",
    "textdich": ""
  },
  {
    "start": 7651.6,
    "end": 7656.8,
    "text": "then we will not receive the length of characters of this entire expression in here. Besides,",
    "textdich": ""
  },
  {
    "start": 7656.8,
    "end": 7663.2,
    "text": "we will receive back the amount of elements that are inside this list. And to show you how",
    "textdich": ""
  },
  {
    "start": 7663.2,
    "end": 7668.56,
    "text": "this is going to work, then I'm just going to run this program and for sure, the results are just",
    "textdich": ""
  },
  {
    "start": 7668.56,
    "end": 7675.2,
    "text": "as expected. So as the definition of polymorphism says, it is just a single entity that does know",
    "textdich": ""
  },
  {
    "start": 7675.2,
    "end": 7680.96,
    "text": "how to handle different kinds of objects, as expected. All right. So now that we understood",
    "textdich": ""
  },
  {
    "start": 7680.96,
    "end": 7686.32,
    "text": "that the polymorphism is applied everywhere in Python, especially in the land building function,",
    "textdich": ""
  },
  {
    "start": 7686.32,
    "end": 7691.84,
    "text": "let's also understand where it is implemented on our project here. Now we can see that I tried to",
    "textdich": ""
  },
  {
    "start": 7691.84,
    "end": 7696.88,
    "text": "call the apply discount method that is never implemented inside the phone class. And the",
    "textdich": ""
  },
  {
    "start": 7696.88,
    "end": 7702.64,
    "text": "fact that I can use it from the item class, it is because we inherit from this class.",
    "textdich": ""
  },
  {
    "start": 7702.64,
    "end": 7709.44,
    "text": "And that is the basically reason. Now if I was to go back to that main dot php file and run this,",
    "textdich": ""
  },
  {
    "start": 7709.44,
    "end": 7714.56,
    "text": "then you can see that that is going to work because the apply discount is a method that",
    "textdich": ""
  },
  {
    "start": 7714.56,
    "end": 7721.36,
    "text": "I can use from the inherited item class. Now that's exactly what polymorphism is also inaction.",
    "textdich": ""
  },
  {
    "start": 7721.36,
    "end": 7728.16,
    "text": "Because polymorphism again, refers to one single entity that you can use for multiple objects. Now,",
    "textdich": ""
  },
  {
    "start": 7728.16,
    "end": 7734.72,
    "text": "if I was one day to go ahead and create more kinds of items, meaning more classes",
    "textdich": ""
  },
  {
    "start": 7734.72,
    "end": 7740.08,
    "text": "that will represent different kinds of items, and from them to call the apply discount method,",
    "textdich": ""
  },
  {
    "start": 7740.08,
    "end": 7745.2,
    "text": "that's also going to work because the apply discount is a method that is going to be",
    "textdich": ""
  },
  {
    "start": 7745.2,
    "end": 7750.48,
    "text": "accessible from all the kinds of objects so that's exactly why you might have heard about the terms",
    "textdich": ""
  },
  {
    "start": 7750.48,
    "end": 7756.96,
    "text": "of inheritance and polymorphism together combined. Now to show you that, then let's try to create one",
    "textdich": ""
  },
  {
    "start": 7756.96,
    "end": 7762.32,
    "text": "more class that is going to be identical to the phone class, right, I'm going to create a keyboard",
    "textdich": ""
  },
  {
    "start": 7762.32,
    "end": 7770.24,
    "text": "file. And then I'm just going to say here, class. You know what, before that, let's go to phone and",
    "textdich": ""
  },
  {
    "start": 7771.04,
    "end": 7777.68,
    "text": "copy everything from here and paste this in like that. I'm going to get rid from those lines.",
    "textdich": ""
  },
  {
    "start": 7778.32,
    "end": 7783.04,
    "text": "And I'm just going to leave the init as it is I'm going to change the class name",
    "textdich": ""
  },
  {
    "start": 7783.6,
    "end": 7789.68,
    "text": "from phone to keyboard and I'm also going to delete that attribute that we don't need broken",
    "textdich": ""
  },
  {
    "start": 7789.68,
    "end": 7796.24,
    "text": "phones. Alright, so now that we have this, then I can actually go ahead to my main dot php file",
    "textdich": ""
  },
  {
    "start": 7796.24,
    "end": 7802.08,
    "text": "and use one more important line that will say from key board import keyboard,",
    "textdich": ""
  },
  {
    "start": 7802.08,
    "end": 7809.2,
    "text": "and then I'm going to change this to keyboard will replace this name, just to make it more realistic,",
    "textdich": ""
  },
  {
    "start": 7809.2,
    "end": 7815.44,
    "text": "then I'm going to run the same problem, you can see that this works. So that's again exactly where",
    "textdich": ""
  },
  {
    "start": 7815.44,
    "end": 7821.12,
    "text": "polymorphism is in action, because we can use this single entity from different kinds of objects,",
    "textdich": ""
  },
  {
    "start": 7821.12,
    "end": 7827.6,
    "text": "and it will know how to handle it properly. Now by saying handle it properly, then I basically mean,",
    "textdich": ""
  },
  {
    "start": 7827.6,
    "end": 7832.88,
    "text": "you can have the control of how many amount of discount you want to apply",
    "textdich": ""
  },
  {
    "start": 7832.88,
    "end": 7842.0,
    "text": "inside your classes now, because if we were to go to keyboard and use a class attributes,",
    "textdich": ""
  },
  {
    "start": 7842.0,
    "end": 7848.56,
    "text": "exactly like we used in the item class, which was pay rate, then we're going to have full",
    "textdich": ""
  },
  {
    "start": 7848.56,
    "end": 7854.0,
    "text": "control for all the discounts that are going to apply to the keyboard. And to show you that",
    "textdich": ""
  },
  {
    "start": 7854.0,
    "end": 7859.2,
    "text": "I am going to attempt the typing in pay rate. And you can see that I even have auto completion",
    "textdich": ""
  },
  {
    "start": 7859.2,
    "end": 7865.52,
    "text": "because overriding in the child class that is legal, alright, so I can just say pay rate is",
    "textdich": ""
  },
  {
    "start": 7865.52,
    "end": 7873.44,
    "text": "equal to 0.7. And that will be it. Now I have the same discount amount for all my keyboards.",
    "textdich": ""
  },
  {
    "start": 7873.44,
    "end": 7880.08,
    "text": "If I was again to run the main.py file, then you can see that the results are just as expected, we",
    "textdich": ""
  },
  {
    "start": 7880.08,
    "end": 7887.76,
    "text": "see 700. So that is the beauty behind inheritance and polymorphism together. And the same will go",
    "textdich": ""
  },
  {
    "start": 7887.76,
    "end": 7893.68,
    "text": "for sure if we were to decide that we would like to have 50% discount. So it will only take for me",
    "textdich": ""
  },
  {
    "start": 7893.68,
    "end": 7900.4,
    "text": "to go ahead and say pay rate is equal to 0.5. And that's it. So I hope that you understand",
    "textdich": ""
  },
  {
    "start": 7900.4,
    "end": 7906.56,
    "text": "about polymorphism a bit better now. Now just a quick side note polymorphism is perfectly cool,",
    "textdich": ""
  },
  {
    "start": 7906.56,
    "end": 7913.36,
    "text": "we implemented by using abstract classes. And that is just the identical way of using interfaces in",
    "textdich": ""
  },
  {
    "start": 7913.36,
    "end": 7920.16,
    "text": "other programming languages like Java interface is a way that you can implement how a class should be",
    "textdich": ""
  },
  {
    "start": 7920.72,
    "end": 7926.16,
    "text": "designed. Alright, so it is like a template for a class. And that is achievable by using",
    "textdich": ""
  },
  {
    "start": 7926.16,
    "end": 7932.64,
    "text": "abstract classes, which I'm not going to cover in that part. But again, polymorphism, like I said,",
    "textdich": ""
  },
  {
    "start": 7932.64,
    "end": 7939.44,
    "text": "is a term that is implemented in different areas in the whole python programming language.",
    "textdich": ""
  },
  {
    "start": 7939.44,
    "end": 7943.52,
    "text": "So I hope you had a great time learning the object oriented programming course.",
    "textdich": ""
  },
  {
    "start": 7943.52,
    "end": 7949.28,
    "text": "Now you have a lot of tools that you can go ahead and try to implement by yourself on your projects,",
    "textdich": ""
  },
  {
    "start": 7949.28,
    "end": 7954.48,
    "text": "which will really help you to take you to the next step as a developer. See you next time.",
    "textdich": ""
  }
]