[
  {
    "start": 0.45,
    "end": 7.98,
    "text": "Hi there, friends in this session, we will be introduced to A Whole New World,",
    "textdich": ""
  },
  {
    "start": 7.98,
    "end": 16.71,
    "text": "a world of physics in this beautiful planet that we call Earth. There are a lot of interesting",
    "textdich": ""
  },
  {
    "start": 16.71,
    "end": 24.78,
    "text": "events that take place. These events are around us, which we see, or do or experience almost",
    "textdich": ""
  },
  {
    "start": 24.78,
    "end": 31.68,
    "text": "regularly at some point in time. Your curiosity would have definitely got the better of you,",
    "textdich": ""
  },
  {
    "start": 31.68,
    "end": 36.81,
    "text": "and would have pushed you to ask questions like what's going on. How does that happen? Well,",
    "textdich": ""
  },
  {
    "start": 36.81,
    "end": 44.04,
    "text": "leaving Miracles apart. The answer to all these questions is physics. You see, there is more to",
    "textdich": ""
  },
  {
    "start": 44.04,
    "end": 50.97,
    "text": "events in our everyday lives than what meets the eye. So to appreciate the events that you see,",
    "textdich": ""
  },
  {
    "start": 50.97,
    "end": 58.98,
    "text": "you have to first understand events that you don't see confused. Don't worry. Let's make it simple by",
    "textdich": ""
  },
  {
    "start": 58.98,
    "end": 68.16,
    "text": "looking into 10 of our everyday life examples at random. We all know what that sound is,",
    "textdich": ""
  },
  {
    "start": 68.16,
    "end": 75.21,
    "text": "don't we? It is a very annoying, yet important sound, which tells us that we have to be up and",
    "textdich": ""
  },
  {
    "start": 75.21,
    "end": 82.26,
    "text": "about. We wake up in the morning at the sound of the alarm sound is something which we can't see,",
    "textdich": ""
  },
  {
    "start": 82.26,
    "end": 88.74,
    "text": "but can hear our experience. It is used in important medical equipment like the ultrasound",
    "textdich": ""
  },
  {
    "start": 88.74,
    "end": 97.98,
    "text": "scanner, and buy ships to estimate the depth of the ocean physics studies, the origin, propagation",
    "textdich": ""
  },
  {
    "start": 97.98,
    "end": 105.6,
    "text": "and properties of sound. Let's make a note of this event of sound and other events yet to come in the",
    "textdich": ""
  },
  {
    "start": 105.6,
    "end": 117.18,
    "text": "session before we Define what physics has in the end, to have a cup of coffee, we boil water. After",
    "textdich": ""
  },
  {
    "start": 117.18,
    "end": 122.43,
    "text": "turning on the stove, we noticed that the water is hot enough when it starts boiling. And when we see",
    "textdich": ""
  },
  {
    "start": 122.43,
    "end": 129.9,
    "text": "Steam this gradual rise in temperature that causes the water to bubble and later changed to steam is",
    "textdich": ""
  },
  {
    "start": 129.9,
    "end": 138.2,
    "text": "called heat. Thus, we get hot water by heating that is, increasing. The temperature of water.",
    "textdich": ""
  },
  {
    "start": 138.2,
    "end": 146.45,
    "text": "Heat is used in the industry to melt metal and make various types of heavy-duty Machinery like",
    "textdich": ""
  },
  {
    "start": 146.45,
    "end": 153.2,
    "text": "Automobiles and generators. It is also used in household appliances, like the electric or steam",
    "textdich": ""
  },
  {
    "start": 153.2,
    "end": 161.51,
    "text": "iron heat. And its properties is an important topic of physics as well. While we take a walk",
    "textdich": ""
  },
  {
    "start": 161.51,
    "end": 169.28,
    "text": "in the park on at our road, we have a good grip without slipping because of a sort of roughness",
    "textdich": ""
  },
  {
    "start": 169.28,
    "end": 175.55,
    "text": "or resistance between the soles of our shoes and the surface of the road. This resistance",
    "textdich": ""
  },
  {
    "start": 175.55,
    "end": 183.77,
    "text": "that's responsible for grip is called friction or traction. But say, if we're busy on our cell",
    "textdich": ""
  },
  {
    "start": 183.77,
    "end": 191.78,
    "text": "phones or waving at our friends, and we do not notice a banana peel in front of us, what makes",
    "textdich": ""
  },
  {
    "start": 191.78,
    "end": 198.11,
    "text": "us fall 12. Apart from our absent-mindedness, it is due to the reduced friction between our",
    "textdich": ""
  },
  {
    "start": 198.11,
    "end": 204.05,
    "text": "shoes and the road because of the slippery banana. Peel friction, which is an important",
    "textdich": ""
  },
  {
    "start": 204.05,
    "end": 216.08,
    "text": "factor in the making of tires, is also explained by physics. We have all observed apples falling",
    "textdich": ""
  },
  {
    "start": 216.08,
    "end": 224.63,
    "text": "from a tree or balloons floating away in are how is this possible? The apples fall down while the",
    "textdich": ""
  },
  {
    "start": 224.63,
    "end": 232.43,
    "text": "balloons float up. This is nothing to be puzzled about. The answer is simple. Earth has a kind of a",
    "textdich": ""
  },
  {
    "start": 232.43,
    "end": 239.51,
    "text": "pull that draws every object to its surface. This bull is called gravity or gravitational force,",
    "textdich": ""
  },
  {
    "start": 239.51,
    "end": 245.69,
    "text": "which keeps every object grounded to the surface of the Earth and prevents them from floating away.",
    "textdich": ""
  },
  {
    "start": 245.69,
    "end": 251.96,
    "text": "This is why Apple's fall to the ground and why people or objects on the underside of the earth",
    "textdich": ""
  },
  {
    "start": 251.96,
    "end": 259.37,
    "text": "do not fall into space. So why did the balloon float away and not fall to the ground? Hmm again,",
    "textdich": ""
  },
  {
    "start": 259.37,
    "end": 266.12,
    "text": "it's no big deal. We know the air is light. So imagine something which is lighter than air like,",
    "textdich": ""
  },
  {
    "start": 266.12,
    "end": 273.57,
    "text": "say, helium gas filled into the balloon because it is light. It rises to a level higher than air,",
    "textdich": ""
  },
  {
    "start": 273.57,
    "end": 281.73,
    "text": "and thus Works Against Gravity, which now cannot keep the balloon grounded. Gravity is study to a",
    "textdich": ""
  },
  {
    "start": 281.73,
    "end": 289.41,
    "text": "great extent by astronauts to mimic conditions in outer space. In fact, gravity is the very event",
    "textdich": ""
  },
  {
    "start": 289.41,
    "end": 299.52,
    "text": "that was studied by Sir Isaac Newton, who is now considered one of the fathers of physics. When",
    "textdich": ""
  },
  {
    "start": 299.52,
    "end": 307.29,
    "text": "we use a compass, we notice that the direction of the needle is constant. That is the needle points",
    "textdich": ""
  },
  {
    "start": 307.29,
    "end": 315.51,
    "text": "in Only One Direction. Not this is because of a force of attraction between two oppositely charged",
    "textdich": ""
  },
  {
    "start": 315.51,
    "end": 323.22,
    "text": "ends called magnetism. All materials that follow magnetism can be termed as magnets. Did you know",
    "textdich": ""
  },
  {
    "start": 323.22,
    "end": 330.0,
    "text": "that apart from being just a planet, our Earth is actually one big giant magnet. The geographic",
    "textdich": ""
  },
  {
    "start": 330.0,
    "end": 335.88,
    "text": "North Pole of the earth that is the Arctic region is actually the magnetic South Pole,",
    "textdich": ""
  },
  {
    "start": 335.88,
    "end": 343.14,
    "text": "which attracts the Magnetic North Pole of the compass is why the compass always points North,",
    "textdich": ""
  },
  {
    "start": 343.14,
    "end": 351.6,
    "text": "no matter where it is. We all know Opposites Attract, don't we? Physics looks into the property",
    "textdich": ""
  },
  {
    "start": 351.6,
    "end": 358.05,
    "text": "of magnetism, which is used in modes of Transport, like the Metro trains and in parts of electronic",
    "textdich": ""
  },
  {
    "start": 358.05,
    "end": 372.93,
    "text": "speakers.We would have all seen or done at least a few of these tricks. So what makes objects",
    "textdich": ""
  },
  {
    "start": 372.93,
    "end": 379.86,
    "text": "remain still or maintain its position? Even if there is a pull or tug on it, it is the inertia",
    "textdich": ""
  },
  {
    "start": 379.86,
    "end": 388.35,
    "text": "or unwillingness or laziness of a body to change its state of rest or motion. This means if a body",
    "textdich": ""
  },
  {
    "start": 388.35,
    "end": 394.59,
    "text": "moves, it prefers to remain in motion and finds it difficult to stop unless an outside force acts on",
    "textdich": ""
  },
  {
    "start": 394.59,
    "end": 402.66,
    "text": "it. Similarly, when a body is not moving or at rest, it prefers to stay that way and finds it",
    "textdich": ""
  },
  {
    "start": 402.66,
    "end": 411.33,
    "text": "difficult to start moving unless an outside force acts on it. This property of inertia is important",
    "textdich": ""
  },
  {
    "start": 411.33,
    "end": 418.02,
    "text": "for the automobile industry while mimicking accidents for safer cars to be manufactured. Thus,",
    "textdich": ""
  },
  {
    "start": 418.02,
    "end": 431.62,
    "text": "physics also involves inertia. Speaking of Doug's or pushes, what do we do when we open or close the",
    "textdich": ""
  },
  {
    "start": 431.62,
    "end": 439.48,
    "text": "door? We use Force when the door is heavy, we use more strength to move it, which simply means that",
    "textdich": ""
  },
  {
    "start": 439.48,
    "end": 446.62,
    "text": "we use more force force is something that we use on a daily basis. In almost all tasks, we",
    "textdich": ""
  },
  {
    "start": 446.62,
    "end": 453.49,
    "text": "undertake like brushing our teeth. Pushing buttons on a keyboard or cell phone force is also involved",
    "textdich": ""
  },
  {
    "start": 453.49,
    "end": 460.72,
    "text": "in various processes like coughing, sneezing and blood flow due to the contraction of certain",
    "textdich": ""
  },
  {
    "start": 460.72,
    "end": 468.28,
    "text": "muscles in our body. Simply put, force is nothing but the pressure exerted by one body on another",
    "textdich": ""
  },
  {
    "start": 468.28,
    "end": 476.47,
    "text": "body sports like swimming or running also employ Force for this reason, force is also dealt with by",
    "textdich": ""
  },
  {
    "start": 476.47,
    "end": 486.37,
    "text": "physics. Let's look into our daily gadgets like the cell phone. What makes the cell phone work",
    "textdich": ""
  },
  {
    "start": 486.37,
    "end": 492.58,
    "text": "is the electricity that supplied by the battery. What charges the battery is, the electricity that",
    "textdich": ""
  },
  {
    "start": 492.58,
    "end": 498.43,
    "text": "supplied by the power source, electricity, as we all know, is an important part of our daily",
    "textdich": ""
  },
  {
    "start": 498.43,
    "end": 505.9,
    "text": "lives. Beat for transportation like buses, cars or trains of a powering, a household appliances",
    "textdich": ""
  },
  {
    "start": 505.9,
    "end": 512.98,
    "text": "like the television, the fridge, the microwave, or even to watch this video. Did you know that",
    "textdich": ""
  },
  {
    "start": 512.98,
    "end": 518.86,
    "text": "our body is also like an appliance and the part of run it comes from certain cells which produce",
    "textdich": ""
  },
  {
    "start": 518.86,
    "end": 526.48,
    "text": "electricity. This type of electricity is called as bioelectricity, which we will see in our biology",
    "textdich": ""
  },
  {
    "start": 526.48,
    "end": 533.44,
    "text": "videos, though we all are biological systems. The mechanism of electricity production is explained",
    "textdich": ""
  },
  {
    "start": 533.44,
    "end": 540.55,
    "text": "by physics. Remember, if electricity can rock your world, it can also shock Your World. The Many",
    "textdich": ""
  },
  {
    "start": 540.55,
    "end": 551.64,
    "text": "usages of electricity is enough proof to justify why we include electricity in physics. After a",
    "textdich": ""
  },
  {
    "start": 551.64,
    "end": 558.93,
    "text": "while of rain, we see a rainbow in the sky. It is beautiful and has seven different colors. This is",
    "textdich": ""
  },
  {
    "start": 558.93,
    "end": 565.56,
    "text": "a property of light, particularly white light. Do we call it white light? It is actually a mixture",
    "textdich": ""
  },
  {
    "start": 565.56,
    "end": 570.84,
    "text": "of Lights of many different colors. Rainbows are formed due to the splitting of sun rays,",
    "textdich": ""
  },
  {
    "start": 570.84,
    "end": 577.44,
    "text": "which is white light through raindrops. Study of light is an important part of physics because of",
    "textdich": ""
  },
  {
    "start": 577.44,
    "end": 588.63,
    "text": "the various usages of light, like in decorations and lasers. Did you know that we are all made",
    "textdich": ""
  },
  {
    "start": 588.63,
    "end": 593.34,
    "text": "up of many, many smaller particles which we cannot see individually with our Naked Eyes,",
    "textdich": ""
  },
  {
    "start": 593.34,
    "end": 599.04,
    "text": "or even with a microscope. They are even smaller than the smallest cell. And in fact, these are",
    "textdich": ""
  },
  {
    "start": 599.04,
    "end": 604.32,
    "text": "the very building blocks of cells and everything in the universe. Do you know what these particles",
    "textdich": ""
  },
  {
    "start": 604.32,
    "end": 611.4,
    "text": "are? They called atoms. Two or more atoms come together to form a molecule. And many molecules",
    "textdich": ""
  },
  {
    "start": 611.4,
    "end": 618.78,
    "text": "come together to form visible matter. Just imagine how many molecules, and consequently, how many",
    "textdich": ""
  },
  {
    "start": 618.78,
    "end": 626.13,
    "text": "more atoms we are made up of billions, trillions, zillions, even things that we can't see,",
    "textdich": ""
  },
  {
    "start": 626.13,
    "end": 632.4,
    "text": "like my new dust particles, are made up of atoms. The theory of atoms and molecules is involved with",
    "textdich": ""
  },
  {
    "start": 632.4,
    "end": 639.27,
    "text": "the original of the universe, life on Earth and everything around us. Hence, physics just cannot",
    "textdich": ""
  },
  {
    "start": 639.27,
    "end": 646.56,
    "text": "do without it from all of these events. Let us now Define physics. The word physics comes from the",
    "textdich": ""
  },
  {
    "start": 646.56,
    "end": 653.85,
    "text": "Greek word fizzes, meaning nature and physique meaning, knowledge of nature. Thus simply put,",
    "textdich": ""
  },
  {
    "start": 653.85,
    "end": 660.48,
    "text": "physics is nothing but the study of nature and the Universe on the whole, and the various occurrences",
    "textdich": ""
  },
  {
    "start": 660.48,
    "end": 666.72,
    "text": "or events taking place in it. For each of the previously mentioned examples. There are other",
    "textdich": ""
  },
  {
    "start": 666.72,
    "end": 672.39,
    "text": "events that are occurring at the same time, which are invisible, or which we considered physics,",
    "textdich": ""
  },
  {
    "start": 672.39,
    "end": 679.77,
    "text": "explains all these unseen events to its goal is to answer all questions, right from Elemental",
    "textdich": ""
  },
  {
    "start": 679.77,
    "end": 686.48,
    "text": "particles like atoms to gigantic structures like planets. It gives us an understanding of how and",
    "textdich": ""
  },
  {
    "start": 686.48,
    "end": 692.42,
    "text": "why things are the way they are. The events mentioned earlier were just minut examples of",
    "textdich": ""
  },
  {
    "start": 692.42,
    "end": 697.85,
    "text": "how physics is involved in our everyday lives. So now, do you see how important studying physics is?",
    "textdich": ""
  },
  {
    "start": 697.85,
    "end": 705.62,
    "text": "Physics is a lot like a mountain, which is not difficult to scale. And when you reach the top,",
    "textdich": ""
  },
  {
    "start": 705.62,
    "end": 713.27,
    "text": "the view is beautiful. Just don't accept things the way they are. Follow your curiosity wide",
    "textdich": ""
  },
  {
    "start": 713.27,
    "end": 719.24,
    "text": "and far. Please give us your comments on the session. If you like the session and uninterested",
    "textdich": ""
  },
  {
    "start": 719.24,
    "end": 724.07,
    "text": "to watch more of these sessions, click on the like button and subscribe to let stood.",
    "textdich": ""
  }
]