[
    {
        "start": 0.48,
        "end": 18.88,
        "text": "Hello my friends. Let me tell you something shocking. English language has more than 170,000 vocabulary words. Yes, 170,000",
        "textdich": ""
    },
    {
        "start": 14.96,
        "end": 26.16,
        "text": "words. Now, be honest. Do you think you can learn 170,000 words? Of course not.",
        "textdich": ""
    },
    {
        "start": 23.6,
        "end": 43.76,
        "text": "But here is the good news. You do not need 170,000 words to speak English fluently. In fact, you can speak clear, confident daily English with just 521",
        "textdich": ""
    },
    {
        "start": 38.32,
        "end": 46.559,
        "text": "words. Yes, only 521 simple words.",
        "textdich": ""
    },
    {
        "start": 43.76,
        "end": 56.64,
        "text": "Today's topic is how to speak English fluently with just 521 words. In this video, I will explain how English really",
        "textdich": ""
    },
    {
        "start": 53.199,
        "end": 69.6,
        "text": "works, why most people fail, and how using only 521 words, you can speak English in daily life. No difficult grammar, no long word, no pressure, just",
        "textdich": ""
    },
    {
        "start": 66.799,
        "end": 81.2,
        "text": "simple thinking and smart practice. So, please do not skip this video because by the end, your fear of English will disappear. Relax, take a slow, deep",
        "textdich": ""
    },
    {
        "start": 78.24,
        "end": 91.759,
        "text": "breath and let us begin. Part number one. First, we must understand one very important truth. Why English feels difficult. Most people think English is",
        "textdich": ""
    },
    {
        "start": 89.92,
        "end": 97.759,
        "text": "difficult because they do not know enough words. But this is a big mistake.",
        "textdich": ""
    },
    {
        "start": 94.88,
        "end": 103.28,
        "text": "The real problem is not vocabulary. The real problem is wrong learning method.",
        "textdich": ""
    },
    {
        "start": 100.479,
        "end": 109.36,
        "text": "Let me explain very simply. English language has more than 170,000 words.",
        "textdich": ""
    },
    {
        "start": 107.04,
        "end": 117.36,
        "text": "But even native English speakers do not use all these words. A normal English speaker uses only about 2,000 to 3,000",
        "textdich": ""
    },
    {
        "start": 114.88,
        "end": 131.44,
        "text": "words in daily life. And here is the shocking truth. Most daily conversations use only a very small group of words.",
        "textdich": ""
    },
    {
        "start": 123.04,
        "end": 143.52,
        "text": "Words like I, you, we, they, go, come, do, make, take, good, bad, happy, sad.",
        "textdich": ""
    },
    {
        "start": 139.76,
        "end": 153.519,
        "text": "These words appear again and again every day. This means English speaking is not about knowing many words. English",
        "textdich": ""
    },
    {
        "start": 150.08,
        "end": 163.84,
        "text": "speaking is about using small words many times. Now think when a child learns English does the child learn dictionary?",
        "textdich": ""
    },
    {
        "start": 160.319,
        "end": 176.64,
        "text": "No. The child hears simple words again and again. The child repeats the same patterns. This is how language is learned. Not by memorizing but by using.",
        "textdich": ""
    },
    {
        "start": 173.44,
        "end": 187.599,
        "text": "Now let me tell you what these 521 words are. These are highfrequency words. This means they are used most of the time.",
        "textdich": ""
    },
    {
        "start": 183.84,
        "end": 203.84,
        "text": "These words include pronouns like I, you, he, she. Basic verbs like go, come, eat, drink, work. Simple adjectives like",
        "textdich": ""
    },
    {
        "start": 198.48,
        "end": 217.519,
        "text": "good, bad, big, small. daily nouns like time, food, home, money. With these words, you can create thousands of sentences. For example, I go home, you",
        "textdich": ""
    },
    {
        "start": 214.0,
        "end": 226.879,
        "text": "go work, we go market. Same word, different sentence. Now, here is a very important point. Fluency does not mean",
        "textdich": ""
    },
    {
        "start": 223.599,
        "end": 236.959,
        "text": "using big words. Fluency means speaking smoothly without stopping. And this happens when your brain feels safe. Your brain feels safe when words are",
        "textdich": ""
    },
    {
        "start": 234.4,
        "end": 249.12,
        "text": "familiar. That is why limiting your words actually helps you. Now tell me when you try to use big words what happens? You stop. You think you feel",
        "textdich": ""
    },
    {
        "start": 246.0,
        "end": 258.479,
        "text": "fear. But when you use simple words you speak faster. You feel relaxed. This is why 521 words are powerful. They remove",
        "textdich": ""
    },
    {
        "start": 255.68,
        "end": 271.28,
        "text": "fear. They build confidence. Now remember this, English is a tool, not a test. You are not here to impress. You are here to express. And 521 words are",
        "textdich": ""
    },
    {
        "start": 268.56,
        "end": 280.0,
        "text": "enough for expression. Now in the next part, I will show you how sentence patterns work with these words and how you can speak hundreds of sentences",
        "textdich": ""
    },
    {
        "start": 277.28,
        "end": 291.199,
        "text": "without learning new words. So please stay with me and move to part number two. Part number two. Now let us understand the most powerful secret of",
        "textdich": ""
    },
    {
        "start": 288.32,
        "end": 300.08,
        "text": "speaking English. This secret is called sentence patterns. Sentence patterns are like roads. Words are like cars. If the",
        "textdich": ""
    },
    {
        "start": 297.28,
        "end": 308.32,
        "text": "road is clear, the car moves easily. If there is no road, the car stops. This is exactly how English works. Most learners",
        "textdich": ""
    },
    {
        "start": 306.0,
        "end": 317.28,
        "text": "collect words, but they do not learn how to use them. That is why they know words but cannot speak. Now listen carefully.",
        "textdich": ""
    },
    {
        "start": 314.0,
        "end": 325.759,
        "text": "You do not need many words. You need a few strong sentence patterns. Let me show you the most useful patterns.",
        "textdich": ""
    },
    {
        "start": 322.4,
        "end": 334.16,
        "text": "Pattern one, I want to. This pattern is very powerful. With this one line, you can say many things. I want to eat. I",
        "textdich": ""
    },
    {
        "start": 331.52,
        "end": 336.72,
        "text": "want to sleep. I want to learn English.",
        "textdich": ""
    },
    {
        "start": 334.16,
        "end": 346.0,
        "text": "I want to work. Same pattern, different action. Pattern two, I need to. This pattern is used every day. I need to go.",
        "textdich": ""
    },
    {
        "start": 343.199,
        "end": 354.32,
        "text": "I need to study. I need to rest. I need to call him. Pattern three, I am going to. This pattern talks about future. I",
        "textdich": ""
    },
    {
        "start": 351.919,
        "end": 364.72,
        "text": "am going to eat. I am going to work. I am going to learn English. Pattern four, I like to. This pattern talks about feelings. I like to read. I like to",
        "textdich": ""
    },
    {
        "start": 362.08,
        "end": 372.639,
        "text": "talk. I like to learn English. Pattern five, I have to. This pattern talks about responsibility. I have to work. I",
        "textdich": ""
    },
    {
        "start": 370.0,
        "end": 375.039,
        "text": "have to study. I have to wake up early.",
        "textdich": ""
    },
    {
        "start": 372.639,
        "end": 382.319,
        "text": "Now stop for a moment. With only five sentence patterns and only simple verbs, you can speak hundreds of sentences.",
        "textdich": ""
    },
    {
        "start": 379.919,
        "end": 391.6,
        "text": "This is the magic. Now let me explain why this works. Your brain likes patterns. When your brain sees the same structure again and again, it becomes",
        "textdich": ""
    },
    {
        "start": 388.96,
        "end": 401.199,
        "text": "automatic. You do not think, you just speak. This is called fluency. Fluency is not speed. Fluency is flow. Now here",
        "textdich": ""
    },
    {
        "start": 397.84,
        "end": 406.72,
        "text": "is a common mistake. Many learners learn grammar rules but they never speak.",
        "textdich": ""
    },
    {
        "start": 404.08,
        "end": 417.84,
        "text": "Grammar stays in the book not in the mouth. But sentence patterns go directly to your mouth. This is why native speakers do not think about grammar.",
        "textdich": ""
    },
    {
        "start": 414.96,
        "end": 429.919,
        "text": "They think in patterns. Now let us practice very slowly. Listen. I want to eat. I need to eat. I am going to eat. I",
        "textdich": ""
    },
    {
        "start": 425.759,
        "end": 442.96,
        "text": "like to eat. I have to eat. See, same word, same idea, different feeling. Now imagine you do this practice every day for 10 minutes. Your mouth becomes",
        "textdich": ""
    },
    {
        "start": 439.199,
        "end": 447.12,
        "text": "trained. Your fear starts to disappear.",
        "textdich": ""
    },
    {
        "start": 442.96,
        "end": 453.84,
        "text": "This is why 521 words work because they repeat. Repetition builds confidence.",
        "textdich": ""
    },
    {
        "start": 450.56,
        "end": 462.96,
        "text": "Confidence builds fluency. Now in the next part I will show you how to use these words in real daily life. Morning,",
        "textdich": ""
    },
    {
        "start": 459.52,
        "end": 473.039,
        "text": "work, home, talking to people. So please stay with me and move to part number three. Part number three. Now let us use",
        "textdich": ""
    },
    {
        "start": 469.12,
        "end": 483.039,
        "text": "our 521 words in real life because English is not for books. English is for life. Most learners study English but",
        "textdich": ""
    },
    {
        "start": 479.28,
        "end": 493.84,
        "text": "they do not live English. Today we will change this. Now listen carefully. Your daily life is already full of English",
        "textdich": ""
    },
    {
        "start": 488.8,
        "end": 505.599,
        "text": "topics. Morning, work, home, people, feelings. You do not need special topics. You need daily situations. Let us start with morning. In the morning,",
        "textdich": ""
    },
    {
        "start": 502.72,
        "end": 511.759,
        "text": "you can say I wake up early. I feel tired. I need water. I want to rest.",
        "textdich": ""
    },
    {
        "start": 509.28,
        "end": 515.36,
        "text": "Very simple, very real.",
        "textdich": ""
    },
    {
        "start": 511.759,
        "end": 524.88,
        "text": "Now go to work or study. I go to work. I go to class. I feel busy. I feel stressed. Same words, same structure.",
        "textdich": ""
    },
    {
        "start": 521.76,
        "end": 534.959,
        "text": "Now talking to people. I need help. Can you help me? I want to ask something. I do not understand. These sentences use very small words, but they work",
        "textdich": ""
    },
    {
        "start": 532.56,
        "end": 546.64,
        "text": "everywhere. Now let us talk about feelings. This is very important. Most learners know words but they cannot express feelings. With 521 words, you",
        "textdich": ""
    },
    {
        "start": 543.04,
        "end": 555.36,
        "text": "can say I feel happy. I feel sad. I feel tired. I feel nervous. People understand you. Communication is successful. Now",
        "textdich": ""
    },
    {
        "start": 552.959,
        "end": 563.92,
        "text": "let us talk about past. Many learners fear past tense but do not fear. Simple English still works. Yesterday I go to",
        "textdich": ""
    },
    {
        "start": 561.04,
        "end": 570.8,
        "text": "work. Yesterday I feel tired. Is it perfect grammar? No. But is it clear?",
        "textdich": ""
    },
    {
        "start": 567.12,
        "end": 574.399,
        "text": "Yes. Now future. Tomorrow I go work.",
        "textdich": ""
    },
    {
        "start": 570.8,
        "end": 576.64,
        "text": "Tomorrow I study English. Simple clear.",
        "textdich": ""
    },
    {
        "start": 574.399,
        "end": 583.76,
        "text": "This is called survival English. And survival English is fluency. Now let me tell you something very important.",
        "textdich": ""
    },
    {
        "start": 581.6,
        "end": 591.76,
        "text": "People do not judge your grammar. They judge your confidence. When you speak without fear, people listen. Now here is",
        "textdich": ""
    },
    {
        "start": 589.04,
        "end": 599.04,
        "text": "your daily exercise. Choose one daily situation. morning or work or home.",
        "textdich": ""
    },
    {
        "start": 595.68,
        "end": 602.24,
        "text": "Speak five sentences out loud every day.",
        "textdich": ""
    },
    {
        "start": 599.04,
        "end": 611.2,
        "text": "Do not write, speak. Your mouth must work. This is how fluency grows. Now remember, you are not learning English.",
        "textdich": ""
    },
    {
        "start": 608.0,
        "end": 620.32,
        "text": "You are training your mouth. And 521 words are enough for training. In the next part, I will show you how to practice these 521 words daily without",
        "textdich": ""
    },
    {
        "start": 617.76,
        "end": 624.32,
        "text": "stress. And move to part number four.",
        "textdich": ""
    },
    {
        "start": 620.32,
        "end": 637.04,
        "text": "Part number four. Now let us talk about practice because without practice nothing changes. Many people watch English videos but they do not speak.",
        "textdich": ""
    },
    {
        "start": 633.519,
        "end": 651.68,
        "text": "Watching is easy. Speaking is hard but speaking is the real work. Now listen carefully. You do not need 1 hour, 2 hours or 3 hours. You only need 10",
        "textdich": ""
    },
    {
        "start": 647.44,
        "end": 661.6,
        "text": "minutes a day but every day. Consistency is more important than time. Now, let me show you a very simple daily practice",
        "textdich": ""
    },
    {
        "start": 657.6,
        "end": 674.16,
        "text": "plan. First, choose 10 words from your 521 words. Only 10. Second, make five sentences with those words. Speak them",
        "textdich": ""
    },
    {
        "start": 670.32,
        "end": 684.72,
        "text": "out loud. Do not whisper, do not think, just speak. Third, repeat the same sentences for three days. Yes, 3 days.",
        "textdich": ""
    },
    {
        "start": 682.0,
        "end": 698.64,
        "text": "Repetition builds muscle memory. Your mouth learns movement. Now, here is a powerful method. It is called shadow speaking. Listen to a sentence. Pause.",
        "textdich": ""
    },
    {
        "start": 695.2,
        "end": 706.16,
        "text": "Repeat. For example, I want to learn English. Pause. I want to learn English.",
        "textdich": ""
    },
    {
        "start": 703.36,
        "end": 716.24,
        "text": "This trains your mouth and your brain together. Now let me tell you one mistake. Many learners want fast results",
        "textdich": ""
    },
    {
        "start": 711.92,
        "end": 719.12,
        "text": "but language is slow and slow is strong.",
        "textdich": ""
    },
    {
        "start": 716.24,
        "end": 727.68,
        "text": "When you speak slowly, you speak clearly. Clear speaking builds confidence.",
        "textdich": ""
    },
    {
        "start": 723.76,
        "end": 738.24,
        "text": "Now let us talk about mistakes. Mistakes are not your enemy. Mistakes are your teachers. Every mistake means you are",
        "textdich": ""
    },
    {
        "start": 734.72,
        "end": 746.56,
        "text": "trying. If you wait for perfect English, you will never speak. So speak even with mistakes.",
        "textdich": ""
    },
    {
        "start": 743.279,
        "end": 756.399,
        "text": "Now remember, English is not math. There is no one correct answer. If people understand you, you are successful. Now",
        "textdich": ""
    },
    {
        "start": 753.2,
        "end": 770.399,
        "text": "let me give you one rule. Never learn a word without a sentence. A word alone is useless. A word in a sentence is powerful. Now let me ask you, can you",
        "textdich": ""
    },
    {
        "start": 766.56,
        "end": 783.519,
        "text": "speak 10 sentences every day? Yes, you can. And with 521 words, those 10 sentences become easy. In the next part, I will show you how confidence grows",
        "textdich": ""
    },
    {
        "start": 780.48,
        "end": 793.519,
        "text": "when your word list is small and how fear slowly disappears. So please stay with me and move to part number five.",
        "textdich": ""
    },
    {
        "start": 789.68,
        "end": 802.16,
        "text": "Part number five. Now let us talk about fear because fear is the biggest enemy of English speaking. Most learners do",
        "textdich": ""
    },
    {
        "start": 799.68,
        "end": 812.16,
        "text": "not fail because of words. They fail because of fear. Fear of mistakes, fear of people, fear of sounding stupid. Now",
        "textdich": ""
    },
    {
        "start": 809.279,
        "end": 818.48,
        "text": "listen carefully. Fear does not come from English. Fear comes from pressure.",
        "textdich": ""
    },
    {
        "start": 815.92,
        "end": 827.839,
        "text": "When you try to speak perfect English, your mind stops. your mouth closes. But when you use simple English, your mind",
        "textdich": ""
    },
    {
        "start": 824.399,
        "end": 831.6,
        "text": "feels safe and this is very important.",
        "textdich": ""
    },
    {
        "start": 827.839,
        "end": 840.88,
        "text": "Your brain needs safety to speak. This is why 521 words work. They reduce pressure. You already know these words.",
        "textdich": ""
    },
    {
        "start": 837.839,
        "end": 847.44,
        "text": "So your brain says, \"I am safe. I can speak.\" Now let me explain confidence.",
        "textdich": ""
    },
    {
        "start": 844.8,
        "end": 851.12,
        "text": "Confidence does not come from knowledge.",
        "textdich": ""
    },
    {
        "start": 847.44,
        "end": 860.32,
        "text": "Confidence comes from repetition. The more you repeat, the more confident you become. Even if your English is simple.",
        "textdich": ""
    },
    {
        "start": 856.959,
        "end": 869.839,
        "text": "Now think a child speaks broken English but speaks confidently. Why? Because the child is not afraid. Now let us talk",
        "textdich": ""
    },
    {
        "start": 866.88,
        "end": 881.68,
        "text": "about people. Many learners think people will laugh. But this is not true. Most people respect effort and those who laugh do not matter. Your goal is",
        "textdich": ""
    },
    {
        "start": 878.48,
        "end": 891.68,
        "text": "communication not perfection. Now let me give you a confidence exercise. Stand alone in your room. Speak five sentences",
        "textdich": ""
    },
    {
        "start": 888.0,
        "end": 905.92,
        "text": "about your day. For example, today I wake up early. I feel tired. I go to work. I eat food. I rest. Very simple but very powerful. Now repeat the same",
        "textdich": ""
    },
    {
        "start": 902.959,
        "end": 917.279,
        "text": "story every day. Your confidence will grow. Now remember, fluency is not fast speaking. Fluency is comfortable speaking. When you feel comfortable, you",
        "textdich": ""
    },
    {
        "start": 914.8,
        "end": 927.04,
        "text": "speak more. When you speak more, you improve. Now let me tell you one strong truth. You will never feel ready. Ready",
        "textdich": ""
    },
    {
        "start": 923.76,
        "end": 937.92,
        "text": "comes after speaking, not before. So start now with your 521 words. In the next part, I will show you how to build a daily English routine that really",
        "textdich": ""
    },
    {
        "start": 934.88,
        "end": 952.639,
        "text": "works and move to part number six. Part number six. Now, let us build a simple daily English routine because routine creates results. Many people study",
        "textdich": ""
    },
    {
        "start": 949.279,
        "end": 956.399,
        "text": "English but they do not have a system.",
        "textdich": ""
    },
    {
        "start": 952.639,
        "end": 968.32,
        "text": "Without a system, progress is slow. Now listen carefully. This routine is very simple. Anyone can follow it even if you",
        "textdich": ""
    },
    {
        "start": 963.68,
        "end": 984.88,
        "text": "are busy. First part morning. In the morning do not read, do not write, just speak. Speak for 5 minutes about anything. Your sleep, your plan, your",
        "textdich": ""
    },
    {
        "start": 981.12,
        "end": 997.199,
        "text": "feeling. For example, today I wake up early. I feel fresh. I want to learn English. Very simple. Second part.",
        "textdich": ""
    },
    {
        "start": 993.04,
        "end": 1013.92,
        "text": "Daytime. During the day, listen. Listen to slow English. Podcast, video, audio. Do not try to understand everything. Just listen. Your brain is",
        "textdich": ""
    },
    {
        "start": 1008.639,
        "end": 1017.279,
        "text": "learning. Third part. Night. At night.",
        "textdich": ""
    },
    {
        "start": 1013.92,
        "end": 1020.48,
        "text": "Speak again for five minutes.",
        "textdich": ""
    },
    {
        "start": 1017.279,
        "end": 1033.36,
        "text": "Talk about your day, what you do, how you feel. For example, today I work a lot. I feel tired. I learn English. Now,",
        "textdich": ""
    },
    {
        "start": 1029.199,
        "end": 1045.52,
        "text": "here is the key rule. Same words every day. This is important. Do not change words every day. Repeat the same words.",
        "textdich": ""
    },
    {
        "start": 1042.079,
        "end": 1057.44,
        "text": "Repetition builds fluency. Now let me tell you a big mistake. Many learners change methods. Today this video, tomorrow another teacher. This creates",
        "textdich": ""
    },
    {
        "start": 1055.919,
        "end": 1060.96,
        "text": "confusion.",
        "textdich": ""
    },
    {
        "start": 1057.44,
        "end": 1069.2,
        "text": "Choose one method and stay with it. Now remember your goal is not fast progress.",
        "textdich": ""
    },
    {
        "start": 1065.28,
        "end": 1079.919,
        "text": "Your goal is steady progress. Slow but daily. This always wins. Now let me explain why this routine works. Morning",
        "textdich": ""
    },
    {
        "start": 1076.64,
        "end": 1090.4,
        "text": "speaking wakes your mouth. Day listening feeds your brain. Night speaking fixes memory. This is complete learning. Now",
        "textdich": ""
    },
    {
        "start": 1087.12,
        "end": 1101.76,
        "text": "let me ask you, can you give 10 minutes a day? Yes, you can. And 10 minutes with 521 words is powerful. In the next part,",
        "textdich": ""
    },
    {
        "start": 1099.44,
        "end": 1115.039,
        "text": "I will explain why you should stop chasing big words and how simple English makes you fluent faster. Part number six. Now, let us build a simple daily",
        "textdich": ""
    },
    {
        "start": 1111.919,
        "end": 1122.24,
        "text": "English routine because without routine, motivation dies. Routine creates habit.",
        "textdich": ""
    },
    {
        "start": 1119.2,
        "end": 1137.919,
        "text": "Habit creates fluency. Now, listen carefully. Your routine must be small, easy, and repeatable. Not heavy, not stressful. Now, here is the best routine",
        "textdich": ""
    },
    {
        "start": 1132.96,
        "end": 1140.96,
        "text": "using only 521 words. Morning routine.",
        "textdich": ""
    },
    {
        "start": 1137.919,
        "end": 1151.44,
        "text": "In the morning, speak English for just 5 minutes. Say simple lines. I wake up. I feel sleepy. I drink water. I get ready.",
        "textdich": ""
    },
    {
        "start": 1147.84,
        "end": 1154.4,
        "text": "I go to work. Speak slowly out loud.",
        "textdich": ""
    },
    {
        "start": 1151.44,
        "end": 1165.84,
        "text": "This wakes up your English mind. Now, afternoon routine. In the afternoon, speak again for 5 minutes. Talk about work or study. I feel busy. I do my",
        "textdich": ""
    },
    {
        "start": 1162.48,
        "end": 1174.72,
        "text": "work. I need a break. I eat food. Again, out loud. Now, night routine. At night, speak for 5 minutes. Talk about your",
        "textdich": ""
    },
    {
        "start": 1171.679,
        "end": 1181.2,
        "text": "day. Today was good. Today was hard. I feel tired. I need rest. That is all.",
        "textdich": ""
    },
    {
        "start": 1177.76,
        "end": 1183.679,
        "text": "Only 15 minutes a day, but every day.",
        "textdich": ""
    },
    {
        "start": 1181.2,
        "end": 1185.76,
        "text": "Now, let me tell you why this works.",
        "textdich": ""
    },
    {
        "start": 1183.679,
        "end": 1194.64,
        "text": "Because you are speaking real life English, not book English. Your brain connects English with life. This is very",
        "textdich": ""
    },
    {
        "start": 1191.36,
        "end": 1197.76,
        "text": "powerful. Now let me give you one rule.",
        "textdich": ""
    },
    {
        "start": 1194.64,
        "end": 1209.44,
        "text": "Do not skip even one day. If you miss one day, fear comes back. So even 2 minutes is okay. Now remember, English is like a muscle. If you use it, it",
        "textdich": ""
    },
    {
        "start": 1206.16,
        "end": 1215.44,
        "text": "grows. If you stop, it becomes weak. Now here is one more tip. Record your voice.",
        "textdich": ""
    },
    {
        "start": 1212.4,
        "end": 1218.08,
        "text": "Listen again. You will hear improvement.",
        "textdich": ""
    },
    {
        "start": 1215.44,
        "end": 1227.919,
        "text": "This builds confidence. Now, let me say this. You do not need a teacher every day. You need practice every day. And",
        "textdich": ""
    },
    {
        "start": 1224.24,
        "end": 1230.96,
        "text": "521 words are enough for daily practice.",
        "textdich": ""
    },
    {
        "start": 1227.919,
        "end": 1233.28,
        "text": "Now, we are near the end of this lesson.",
        "textdich": ""
    },
    {
        "start": 1230.96,
        "end": 1248.32,
        "text": "And before you leave, I want you to remember one thing. English is not magic. English is not talent. English is not luck. English is a skill and every",
        "textdich": ""
    },
    {
        "start": 1244.08,
        "end": 1251.6,
        "text": "skill grows with small daily practice.",
        "textdich": ""
    },
    {
        "start": 1248.32,
        "end": 1263.12,
        "text": "Today you learned a big truth. English has more than 170,000 words, but you do not need all of them. You only need the",
        "textdich": ""
    },
    {
        "start": 1259.039,
        "end": 1269.679,
        "text": "right words. And 521 words are enough to speak clear, daily, confident English.",
        "textdich": ""
    },
    {
        "start": 1266.72,
        "end": 1274.559,
        "text": "Do not wait for perfect English. Perfect never comes.",
        "textdich": ""
    },
    {
        "start": 1271.2,
        "end": 1278.24,
        "text": "Start with simple English. Speak slowly.",
        "textdich": ""
    },
    {
        "start": 1274.559,
        "end": 1290.799,
        "text": "Speak calmly. Speak daily. Even five sentences a day are enough. Remember, your goal is not to impress. Your goal is to express. And you can express",
        "textdich": ""
    },
    {
        "start": 1287.52,
        "end": 1301.6,
        "text": "yourself with simple words. Now, let me ask you, will you stop after this video or will you start your English journey",
        "textdich": ""
    },
    {
        "start": 1297.52,
        "end": 1312.799,
        "text": "today? The choice is yours. If this lesson helped you even a little, please like this video, share it with someone who feels afraid of English, and",
        "textdich": ""
    },
    {
        "start": 1309.679,
        "end": 1322.559,
        "text": "subscribe to Easy English the podcast because here we learn English slowly, calmly, and with confidence. Thank you",
        "textdich": ""
    },
    {
        "start": 1319.52,
        "end": 1327.52,
        "text": "so much for listening. Keep practicing, keep speaking, and I will see you in the next",
        "textdich": ""
    }
]