[
    {
        "start": 0.4,
        "end": 13.12,
        "text": "Welcome to my channel. Before we begin, let me ask you something very honest and very personal. Have you ever understood",
        "textdich": ""
    },
    {
        "start": 10.24,
        "end": 20.4,
        "text": "English clearly in your mind, but the moment you try to speak, your mind goes blank?",
        "textdich": ""
    },
    {
        "start": 18.08,
        "end": 23.199,
        "text": "The words disappear.",
        "textdich": ""
    },
    {
        "start": 20.4,
        "end": 30.0,
        "text": "Your heart beats faster. You feel nervous, slow, and unsure.",
        "textdich": ""
    },
    {
        "start": 26.88,
        "end": 40.079,
        "text": "You know grammar rules. You know many words but speaking still feels difficult, scary and confusing.",
        "textdich": ""
    },
    {
        "start": 37.28,
        "end": 43.6,
        "text": "Now listen to this carefully.",
        "textdich": ""
    },
    {
        "start": 40.079,
        "end": 55.76,
        "text": "What if I told you that in 2026 speaking fluent English is not about having a special talent. It is not about sounding like a native speaker.",
        "textdich": ""
    },
    {
        "start": 52.96,
        "end": 62.719,
        "text": "And it is definitely not about studying harder or memorizing more grammar books.",
        "textdich": ""
    },
    {
        "start": 59.68,
        "end": 70.0,
        "text": "It is about learning in the right way with the right mindset and the right daily habits.",
        "textdich": ""
    },
    {
        "start": 67.76,
        "end": 77.119,
        "text": "If you stay with me till the end of this lesson, I promise you something important.",
        "textdich": ""
    },
    {
        "start": 73.84,
        "end": 86.32,
        "text": "I will show you a clear, simple, stepbystep path to speak fluent English in 2026.",
        "textdich": ""
    },
    {
        "start": 83.439,
        "end": 97.439,
        "text": "A path that works even if you are an absolute beginner. A path that removes fear, builds confidence, and finally helps you use the English you already",
        "textdich": ""
    },
    {
        "start": 95.28,
        "end": 100.88,
        "text": "know.",
        "textdich": ""
    },
    {
        "start": 97.439,
        "end": 107.2,
        "text": "Take a deep breath, relax, and let's begin this journey together.",
        "textdich": ""
    },
    {
        "start": 104.72,
        "end": 110.88,
        "text": "Chapter 1.",
        "textdich": ""
    },
    {
        "start": 107.2,
        "end": 118.32,
        "text": "Why most people never become fluent and how 2026 is different.",
        "textdich": ""
    },
    {
        "start": 115.439,
        "end": 127.759,
        "text": "Before we talk about how to speak fluent English in 2026, we need to talk about something very important.",
        "textdich": ""
    },
    {
        "start": 124.799,
        "end": 138.48,
        "text": "We need to talk about why so many people study English for years, sometimes even for 10 or 15 years, and still feel",
        "textdich": ""
    },
    {
        "start": 134.319,
        "end": 148.4,
        "text": "afraid to speak. If this is you, please listen carefully because what I am about to say may change the way you see yourself as an English learner. Many",
        "textdich": ""
    },
    {
        "start": 146.48,
        "end": 162.0,
        "text": "English learners believe there is something wrong with them. They think maybe I am not smart enough or maybe English is just too hard for me or maybe",
        "textdich": ""
    },
    {
        "start": 159.04,
        "end": 164.239,
        "text": "I started too late.",
        "textdich": ""
    },
    {
        "start": 162.0,
        "end": 170.4,
        "text": "But let me tell you something clearly and honestly.",
        "textdich": ""
    },
    {
        "start": 166.72,
        "end": 179.28,
        "text": "This is not true. If you can understand English when you read it, if you can understand English when you listen to",
        "textdich": ""
    },
    {
        "start": 175.36,
        "end": 184.56,
        "text": "it, then your brain is already capable of English.",
        "textdich": ""
    },
    {
        "start": 181.36,
        "end": 194.08,
        "text": "The problem is not you. The problem is the way you were taught. Most people never become fluent because they learned",
        "textdich": ""
    },
    {
        "start": 190.239,
        "end": 203.44,
        "text": "English in a very old, broken way. They learned English like a school subject, not like a living language. They learned",
        "textdich": ""
    },
    {
        "start": 200.159,
        "end": 213.84,
        "text": "grammar rules first. They memorized vocabulary lists. They took tests. They filled in blanks. But they were never",
        "textdich": ""
    },
    {
        "start": 210.159,
        "end": 222.64,
        "text": "trained to use English in real life. So their English stayed trapped in their head. This is why you may understand",
        "textdich": ""
    },
    {
        "start": 219.519,
        "end": 227.84,
        "text": "English, but when it is time to speak, your mouth feels frozen.",
        "textdich": ""
    },
    {
        "start": 225.519,
        "end": 233.04,
        "text": "Let's talk about something I call the silent learner problem.",
        "textdich": ""
    },
    {
        "start": 230.56,
        "end": 242.319,
        "text": "This happens when learners spend years listening, reading, and studying, but almost no time speaking. They become",
        "textdich": ""
    },
    {
        "start": 239.28,
        "end": 249.599,
        "text": "very good at understanding English, but very weak at producing English.",
        "textdich": ""
    },
    {
        "start": 246.0,
        "end": 254.4,
        "text": "Speaking is a skill and like any skill it must be practiced.",
        "textdich": ""
    },
    {
        "start": 252.159,
        "end": 267.04,
        "text": "You cannot learn to swim by reading about swimming. You cannot learn to drive by watching videos only. In the same way, you cannot learn to speak",
        "textdich": ""
    },
    {
        "start": 262.88,
        "end": 269.68,
        "text": "English by only studying English.",
        "textdich": ""
    },
    {
        "start": 267.04,
        "end": 274.96,
        "text": "Another big reason people never become fluent is fear.",
        "textdich": ""
    },
    {
        "start": 272.24,
        "end": 277.6,
        "text": "Fear of making mistakes.",
        "textdich": ""
    },
    {
        "start": 274.96,
        "end": 285.28,
        "text": "Fear of sounding stupid, fear of being judged, fear of their accent.",
        "textdich": ""
    },
    {
        "start": 283.04,
        "end": 290.08,
        "text": "Many learners wait for the perfect moment to speak.",
        "textdich": ""
    },
    {
        "start": 287.68,
        "end": 306.32,
        "text": "They think, \"I will speak when my grammar is perfect or I will speak when I know more words.\" But that perfect moment never comes. And so they wait and",
        "textdich": ""
    },
    {
        "start": 301.6,
        "end": 309.28,
        "text": "wait and years pass.",
        "textdich": ""
    },
    {
        "start": 306.32,
        "end": 319.12,
        "text": "Here is something very important that most learners never hear. Mistakes are not the enemy of fluency.",
        "textdich": ""
    },
    {
        "start": 315.52,
        "end": 329.199,
        "text": "Silence is. Every fluent speaker you admire today made thousands of mistakes in the past. They said wrong sentences.",
        "textdich": ""
    },
    {
        "start": 326.0,
        "end": 340.479,
        "text": "They used wrong words. They sounded awkward but they kept speaking and slowly naturally they improved.",
        "textdich": ""
    },
    {
        "start": 337.12,
        "end": 344.16,
        "text": "Fluency grows from use not from perfection.",
        "textdich": ""
    },
    {
        "start": 342.0,
        "end": 353.84,
        "text": "Now let's talk about schools and traditional classes. In many schools, students are punished for mistakes.",
        "textdich": ""
    },
    {
        "start": 350.24,
        "end": 361.12,
        "text": "Teachers correct every sentence. Exams focus on grammar accuracy, not communication.",
        "textdich": ""
    },
    {
        "start": 358.24,
        "end": 367.36,
        "text": "This trains students to be afraid. It teaches them that being wrong is bad.",
        "textdich": ""
    },
    {
        "start": 364.4,
        "end": 371.44,
        "text": "But language does not work like that.",
        "textdich": ""
    },
    {
        "start": 367.36,
        "end": 374.4,
        "text": "Language is messy. Language is flexible.",
        "textdich": ""
    },
    {
        "start": 371.44,
        "end": 388.08,
        "text": "Language is about connection. When learners are trained to fear mistakes, they stop trying. And when they stop trying, fluency becomes impossible.",
        "textdich": ""
    },
    {
        "start": 384.319,
        "end": 391.199,
        "text": "So why am I telling you all this?",
        "textdich": ""
    },
    {
        "start": 388.08,
        "end": 403.28,
        "text": "Because I want you to feel relief. If you are not fluent yet, it does not mean you failed. It means the system failed",
        "textdich": ""
    },
    {
        "start": 397.84,
        "end": 416.08,
        "text": "you. And here is the good news. In 2026, everything is different. We live in a completely new time for learning English. Today, you have access to real",
        "textdich": ""
    },
    {
        "start": 412.8,
        "end": 421.44,
        "text": "English. every day. You can listen to real conversations.",
        "textdich": ""
    },
    {
        "start": 418.16,
        "end": 432.16,
        "text": "You can hear real accents. You can watch real stories. You can practice speaking alone, safely, without fear. You no",
        "textdich": ""
    },
    {
        "start": 429.52,
        "end": 445.36,
        "text": "longer need to wait for a classroom or a perfect teacher. English is everywhere now. In 2026, fluency is no longer about memorizing",
        "textdich": ""
    },
    {
        "start": 441.44,
        "end": 456.16,
        "text": "rules. It is about building habits. It is about small daily actions. It is about listening, repeating, thinking and",
        "textdich": ""
    },
    {
        "start": 452.8,
        "end": 467.36,
        "text": "speaking a little every day. The tools are better. The methods are better. And most importantly, the mindset is better.",
        "textdich": ""
    },
    {
        "start": 464.16,
        "end": 474.479,
        "text": "Another big change in 2026 is understanding what fluency really is.",
        "textdich": ""
    },
    {
        "start": 471.12,
        "end": 483.44,
        "text": "Fluency is not speaking fast like a native speaker. Fluency is not having a perfect accent.",
        "textdich": ""
    },
    {
        "start": 480.319,
        "end": 497.68,
        "text": "Fluency is being able to express your thoughts without panic. It is being able to continue speaking even when you make a mistake. It is being able to",
        "textdich": ""
    },
    {
        "start": 493.28,
        "end": 503.28,
        "text": "communicate even with simple words. And here is something powerful.",
        "textdich": ""
    },
    {
        "start": 500.16,
        "end": 513.76,
        "text": "Once you stop trying to be perfect, your English starts to flow. When you allow yourself to be a learner, your confidence grows.",
        "textdich": ""
    },
    {
        "start": 510.96,
        "end": 520.479,
        "text": "When you focus on communication, not correctness, fluency becomes possible.",
        "textdich": ""
    },
    {
        "start": 518.159,
        "end": 531.92,
        "text": "So, if you have ever felt stuck, frustrated, or disappointed with your English, I want you to pause for a moment,",
        "textdich": ""
    },
    {
        "start": 527.6,
        "end": 540.08,
        "text": "take a breath, and tell yourself this. I am not bad at English. I just learned it the wrong way.",
        "textdich": ""
    },
    {
        "start": 537.279,
        "end": 545.44,
        "text": "Because from this moment, we are going to learn it the right way.",
        "textdich": ""
    },
    {
        "start": 543.12,
        "end": 551.2,
        "text": "In the next chapter, we are going to talk about what fluency really means.",
        "textdich": ""
    },
    {
        "start": 548.64,
        "end": 562.64,
        "text": "Not the scary version, not the impossible version, but a simple realistic definition that you can actually reach. And when you understand",
        "textdich": ""
    },
    {
        "start": 559.92,
        "end": 569.519,
        "text": "that, everything will start to feel lighter, clearer, and more achievable.",
        "textdich": ""
    },
    {
        "start": 567.44,
        "end": 572.64,
        "text": "Chapter 2.",
        "textdich": ""
    },
    {
        "start": 569.519,
        "end": 578.24,
        "text": "The new definition of fluency. what fluent really means.",
        "textdich": ""
    },
    {
        "start": 575.44,
        "end": 591.44,
        "text": "Before we go any further, we need to reset something very important in your mind. We need to reset your idea of what it means to be fluent in English.",
        "textdich": ""
    },
    {
        "start": 588.8,
        "end": 602.48,
        "text": "Because if your definition of fluency is wrong, your learning journey will always feel stressful, heavy, and disappointing.",
        "textdich": ""
    },
    {
        "start": 599.76,
        "end": 610.16,
        "text": "Many English learners are chasing a goal that is not only unnecessary but also harmful.",
        "textdich": ""
    },
    {
        "start": 607.519,
        "end": 618.72,
        "text": "When you hear the word fluent, what do you imagine? Maybe you imagine someone speaking very fast.",
        "textdich": ""
    },
    {
        "start": 616.079,
        "end": 628.64,
        "text": "Maybe you imagine a perfect American or British accent. Maybe you imagine someone who never makes grammar mistakes.",
        "textdich": ""
    },
    {
        "start": 625.12,
        "end": 635.6,
        "text": "If that is your idea of fluency, I want you to relax because that is not real fluency.",
        "textdich": ""
    },
    {
        "start": 633.44,
        "end": 649.12,
        "text": "That is a performance and it is not the goal. Real fluency is much simpler than you think. Fluency means you can express your ideas without",
        "textdich": ""
    },
    {
        "start": 646.24,
        "end": 652.16,
        "text": "stopping every two seconds.",
        "textdich": ""
    },
    {
        "start": 649.12,
        "end": 665.92,
        "text": "It means you can continue speaking even if your sentence is not perfect. It means you can understand and be understood.",
        "textdich": ""
    },
    {
        "start": 660.16,
        "end": 668.0,
        "text": "That is it. Nothing more, nothing less.",
        "textdich": ""
    },
    {
        "start": 665.92,
        "end": 680.959,
        "text": "Think about children when they learn their first language. Do they speak perfectly? No. They make mistakes all the time. They say sentences that are",
        "textdich": ""
    },
    {
        "start": 677.279,
        "end": 690.88,
        "text": "not correct, but they keep talking. They keep trying and nobody tells them to stop. That is why they become fluent.",
        "textdich": ""
    },
    {
        "start": 687.76,
        "end": 693.6,
        "text": "They are allowed to be imperfect.",
        "textdich": ""
    },
    {
        "start": 690.88,
        "end": 703.44,
        "text": "Many adult learners are not fluent because they are trying to speak like a textbook. They are trying to build perfect sentences in their head before",
        "textdich": ""
    },
    {
        "start": 701.36,
        "end": 705.44,
        "text": "they speak.",
        "textdich": ""
    },
    {
        "start": 703.44,
        "end": 709.04,
        "text": "This is very slow.",
        "textdich": ""
    },
    {
        "start": 705.44,
        "end": 720.88,
        "text": "Your brain is working too hard. When you try to think about grammar, vocabulary, pronunciation, and correctness at the same time, your mouth freezes.",
        "textdich": ""
    },
    {
        "start": 718.0,
        "end": 727.6,
        "text": "Speaking becomes stressful. So, your brain chooses silence instead.",
        "textdich": ""
    },
    {
        "start": 724.959,
        "end": 731.92,
        "text": "Here is something very important.",
        "textdich": ""
    },
    {
        "start": 727.6,
        "end": 734.8,
        "text": "Fluency is about flow, not accuracy.",
        "textdich": ""
    },
    {
        "start": 731.92,
        "end": 742.24,
        "text": "Accuracy will improve naturally over time, but flow must come first.",
        "textdich": ""
    },
    {
        "start": 739.279,
        "end": 754.88,
        "text": "When you allow yourself to speak freely, even with mistakes, your brain starts to build speed and speed creates confidence. Confidence creates more",
        "textdich": ""
    },
    {
        "start": 751.76,
        "end": 759.68,
        "text": "speaking and more speaking creates fluency.",
        "textdich": ""
    },
    {
        "start": 756.639,
        "end": 773.68,
        "text": "Let me give you an example. Imagine you want to say, \"Yesterday I went to the market and bought some vegetables.\" A learner who is chasing perfection",
        "textdich": ""
    },
    {
        "start": 769.2,
        "end": 776.959,
        "text": "might stop and think, \"Is it go or went?",
        "textdich": ""
    },
    {
        "start": 773.68,
        "end": 786.8,
        "text": "Is it buy or bought? Should I say some or any?\" By the time they decide, the conversation is already over. A fluent",
        "textdich": ""
    },
    {
        "start": 783.839,
        "end": 793.04,
        "text": "speaker might say, \"Yesterday I go to market and buy vegetables.",
        "textdich": ""
    },
    {
        "start": 789.6,
        "end": 796.48,
        "text": "Is it perfect?\" No. Is it understandable?",
        "textdich": ""
    },
    {
        "start": 794.959,
        "end": 798.959,
        "text": "Yes.",
        "textdich": ""
    },
    {
        "start": 796.48,
        "end": 801.04,
        "text": "And that is fluency.",
        "textdich": ""
    },
    {
        "start": 798.959,
        "end": 810.16,
        "text": "This is why many people who live in English-speaking countries become fluent faster than people who study English in",
        "textdich": ""
    },
    {
        "start": 806.72,
        "end": 813.76,
        "text": "classrooms for years. They are forced to communicate.",
        "textdich": ""
    },
    {
        "start": 811.68,
        "end": 825.36,
        "text": "They are not thinking about grammar rules. They are thinking about meaning and their English improves naturally through use.",
        "textdich": ""
    },
    {
        "start": 822.8,
        "end": 837.92,
        "text": "Another important part of fluency is confidence with simple English. Many learners believe they need advanced vocabulary to be fluent. This is not",
        "textdich": ""
    },
    {
        "start": 834.079,
        "end": 848.32,
        "text": "true. In real life, most conversations use simple words. Native speakers use basic vocabulary again and again.",
        "textdich": ""
    },
    {
        "start": 845.68,
        "end": 858.0,
        "text": "Fluency grows from mastering simple language, not from collecting rare words. You do not need to sound smart.",
        "textdich": ""
    },
    {
        "start": 854.959,
        "end": 868.72,
        "text": "You need to sound clear. You do not need long sentences. You need natural sentences. When learners focus on simple",
        "textdich": ""
    },
    {
        "start": 865.199,
        "end": 876.0,
        "text": "useful phrases, their speaking becomes smoother and faster.",
        "textdich": ""
    },
    {
        "start": 872.079,
        "end": 879.199,
        "text": "And that is what people feel as fluency.",
        "textdich": ""
    },
    {
        "start": 876.0,
        "end": 882.639,
        "text": "Accent is another big fear.",
        "textdich": ""
    },
    {
        "start": 879.199,
        "end": 891.76,
        "text": "Let me be very clear, accent does not stop fluency. Communication stops fluency.",
        "textdich": ""
    },
    {
        "start": 887.76,
        "end": 894.959,
        "text": "The world today is full of accents.",
        "textdich": ""
    },
    {
        "start": 891.76,
        "end": 901.519,
        "text": "English is a global language. Millions of fluent English speakers have accents.",
        "textdich": ""
    },
    {
        "start": 898.32,
        "end": 916.399,
        "text": "They work, travel, study, and communicate successfully every day. Your accent is not a problem. Your fear of your accent is fluency also means being",
        "textdich": ""
    },
    {
        "start": 913.519,
        "end": 919.6,
        "text": "comfortable with not knowing everything.",
        "textdich": ""
    },
    {
        "start": 916.399,
        "end": 925.68,
        "text": "Even native speakers forget words. Even native speakers make mistakes.",
        "textdich": ""
    },
    {
        "start": 922.48,
        "end": 934.32,
        "text": "The difference is they do not stop, they rephrase, they use another word, they keep going.",
        "textdich": ""
    },
    {
        "start": 931.12,
        "end": 936.48,
        "text": "And that is a skill you can learn too.",
        "textdich": ""
    },
    {
        "start": 934.32,
        "end": 949.519,
        "text": "So in 2026, fluency means this. You can speak without panic. You can continue even when you make mistakes. You can use",
        "textdich": ""
    },
    {
        "start": 945.6,
        "end": 952.56,
        "text": "simple English to express real ideas.",
        "textdich": ""
    },
    {
        "start": 949.519,
        "end": 957.199,
        "text": "You are not silent anymore. You are active.",
        "textdich": ""
    },
    {
        "start": 954.16,
        "end": 964.32,
        "text": "This new definition of fluency should feel lighter. It should feel possible.",
        "textdich": ""
    },
    {
        "start": 960.88,
        "end": 976.56,
        "text": "It should feel kind to you because language learning is not a race. It is a process and you are allowed to be a learner.",
        "textdich": ""
    },
    {
        "start": 973.68,
        "end": 984.88,
        "text": "In the next chapter, we will talk about something very practical. We will talk about what you should actually do every",
        "textdich": ""
    },
    {
        "start": 981.68,
        "end": 996.399,
        "text": "day to build this kind of fluency. Not long study sessions, not boring methods, but a simple daily system that works",
        "textdich": ""
    },
    {
        "start": 991.6,
        "end": 1001.36,
        "text": "even if you are busy, tired, or afraid.",
        "textdich": ""
    },
    {
        "start": 996.399,
        "end": 1007.759,
        "text": "Chapter 3. The daily fluency system. what you should do every day.",
        "textdich": ""
    },
    {
        "start": 1005.36,
        "end": 1018.8,
        "text": "Now that you understand what fluency really means, the next important question is this. What should you actually do every day to become fluent",
        "textdich": ""
    },
    {
        "start": 1016.56,
        "end": 1021.279,
        "text": "in English?",
        "textdich": ""
    },
    {
        "start": 1018.8,
        "end": 1034.559,
        "text": "Many learners feel confused at this point. They watch many videos. They download many apps. They start and stop again and again. They feel motivated.",
        "textdich": ""
    },
    {
        "start": 1030.88,
        "end": 1040.799,
        "text": "one day and tired the next and slowly they lose direction.",
        "textdich": ""
    },
    {
        "start": 1037.439,
        "end": 1050.24,
        "text": "The truth is fluency does not come from doing many things. It comes from doing a few right things consistently.",
        "textdich": ""
    },
    {
        "start": 1047.199,
        "end": 1060.08,
        "text": "You do not need to study English for 3 hours every day. In fact, that often leads to burnout. What you need is a",
        "textdich": ""
    },
    {
        "start": 1057.28,
        "end": 1066.48,
        "text": "simple daily system that fits into your life and becomes a habit, not a struggle.",
        "textdich": ""
    },
    {
        "start": 1064.64,
        "end": 1070.08,
        "text": "Let's start with something very important.",
        "textdich": ""
    },
    {
        "start": 1068.0,
        "end": 1076.64,
        "text": "Your brain learns language through repetition and exposure, not pressure.",
        "textdich": ""
    },
    {
        "start": 1074.0,
        "end": 1084.32,
        "text": "When you give your brain small, regular contact with English every day, it starts to feel familiar.",
        "textdich": ""
    },
    {
        "start": 1082.08,
        "end": 1095.44,
        "text": "English stops feeling like a foreign object. It starts to feel normal. And when something feels normal, fear disappears.",
        "textdich": ""
    },
    {
        "start": 1092.96,
        "end": 1101.28,
        "text": "This is why studying once a week for a long time does not work.",
        "textdich": ""
    },
    {
        "start": 1098.32,
        "end": 1110.4,
        "text": "If you study English only on weekends, your brain forgets most of it during the week. Every time you come back, it feels",
        "textdich": ""
    },
    {
        "start": 1107.12,
        "end": 1122.96,
        "text": "like starting again. But when you touch English every day, even for a short time, your brain stays connected to the language. So what does a good daily",
        "textdich": ""
    },
    {
        "start": 1119.44,
        "end": 1133.919,
        "text": "fluency system look like? It has three simple parts. Listening, speaking, and thinking in English. These three things",
        "textdich": ""
    },
    {
        "start": 1130.4,
        "end": 1140.24,
        "text": "work together. When one part is missing, progress becomes slow.",
        "textdich": ""
    },
    {
        "start": 1136.72,
        "end": 1143.679,
        "text": "First, let's talk about listening.",
        "textdich": ""
    },
    {
        "start": 1140.24,
        "end": 1146.48,
        "text": "Listening is the foundation of fluency.",
        "textdich": ""
    },
    {
        "start": 1143.679,
        "end": 1153.52,
        "text": "Before you can speak naturally, you need to hear natural English again and again.",
        "textdich": ""
    },
    {
        "start": 1150.48,
        "end": 1156.559,
        "text": "But not all listening is helpful.",
        "textdich": ""
    },
    {
        "start": 1153.52,
        "end": 1167.28,
        "text": "Passive listening, where English plays in the background and you are not paying attention, does very little. Active",
        "textdich": ""
    },
    {
        "start": 1163.52,
        "end": 1173.12,
        "text": "listening is what helps. This means you listen with curiosity.",
        "textdich": ""
    },
    {
        "start": 1170.08,
        "end": 1183.52,
        "text": "You notice how sentences are formed. You notice common phrases. You do not need to understand every word. You only need",
        "textdich": ""
    },
    {
        "start": 1180.0,
        "end": 1192.4,
        "text": "to understand the general meaning. You can listen to short English videos, simple stories, or slow conversations.",
        "textdich": ""
    },
    {
        "start": 1189.76,
        "end": 1196.08,
        "text": "The key is consistency.",
        "textdich": ""
    },
    {
        "start": 1192.4,
        "end": 1199.52,
        "text": "10 to 15 minutes every day is enough.",
        "textdich": ""
    },
    {
        "start": 1196.08,
        "end": 1208.16,
        "text": "The goal is not to test yourself. The goal is to feed your brain with real English.",
        "textdich": ""
    },
    {
        "start": 1205.039,
        "end": 1218.64,
        "text": "Now let's move to speaking. This is where many learners feel fear. They say I cannot speak because I have no one to",
        "textdich": ""
    },
    {
        "start": 1215.2,
        "end": 1228.159,
        "text": "practice with. But speaking does not always mean having a conversation with another person. Speaking means using",
        "textdich": ""
    },
    {
        "start": 1225.039,
        "end": 1239.2,
        "text": "your voice to produce English sounds and sentences. You can do this alone. You can do this safely and you should do",
        "textdich": ""
    },
    {
        "start": 1235.12,
        "end": 1249.84,
        "text": "this every day. You can repeat sentences you hear. You can answer simple questions out loud. You can describe what you are doing.",
        "textdich": ""
    },
    {
        "start": 1246.799,
        "end": 1263.28,
        "text": "You can speak slowly. You can speak simply. What matters is that you open your mouth and use English. Speaking every day, even for 5 minutes, trains",
        "textdich": ""
    },
    {
        "start": 1260.64,
        "end": 1267.84,
        "text": "your brain to connect thoughts with words.",
        "textdich": ""
    },
    {
        "start": 1264.88,
        "end": 1271.84,
        "text": "This is how fluency begins.",
        "textdich": ""
    },
    {
        "start": 1267.84,
        "end": 1274.08,
        "text": "The third part is thinking in English.",
        "textdich": ""
    },
    {
        "start": 1271.84,
        "end": 1283.36,
        "text": "Many learners translate from their native language to English in their head. This is very slow and tiring.",
        "textdich": ""
    },
    {
        "start": 1280.799,
        "end": 1294.32,
        "text": "Fluency becomes much easier when you start thinking directly in English. You do not need to think in perfect sentences. You can think in simple words",
        "textdich": ""
    },
    {
        "start": 1292.08,
        "end": 1297.36,
        "text": "and short phrases.",
        "textdich": ""
    },
    {
        "start": 1294.32,
        "end": 1304.72,
        "text": "For example, when you wake up, you can think, \"Morning, I feel tired.",
        "textdich": ""
    },
    {
        "start": 1301.679,
        "end": 1314.159,
        "text": "When you eat, you can think this food is good. When you walk, you can think I am going to work.",
        "textdich": ""
    },
    {
        "start": 1311.36,
        "end": 1321.6,
        "text": "These small moments train your brain to use English naturally without translation.",
        "textdich": ""
    },
    {
        "start": 1318.799,
        "end": 1335.84,
        "text": "Now you might be thinking, \"This sounds easy, but will it really work?\" The answer is yes. If you are consistent, consistency is more powerful than",
        "textdich": ""
    },
    {
        "start": 1332.0,
        "end": 1345.52,
        "text": "motivation. Motivation comes and goes, but habits stay. When you attach English to your daily life, it becomes part of",
        "textdich": ""
    },
    {
        "start": 1342.32,
        "end": 1357.52,
        "text": "who you are. Another important part of the daily fluency system is removing pressure. You do not need to do everything every day. Some days you",
        "textdich": ""
    },
    {
        "start": 1354.32,
        "end": 1365.76,
        "text": "might only listen. Some days you might only speak a little. That is okay.",
        "textdich": ""
    },
    {
        "start": 1361.919,
        "end": 1369.76,
        "text": "Progress is not about being perfect.",
        "textdich": ""
    },
    {
        "start": 1365.76,
        "end": 1372.08,
        "text": "It is about not stopping.",
        "textdich": ""
    },
    {
        "start": 1369.76,
        "end": 1376.559,
        "text": "Let me give you a simple example of a daily routine.",
        "textdich": ""
    },
    {
        "start": 1374.159,
        "end": 1387.039,
        "text": "You listen to English for 10 minutes in the morning. You speak out loud for 5 minutes in the afternoon. You think in English for a few minutes before",
        "textdich": ""
    },
    {
        "start": 1383.84,
        "end": 1398.88,
        "text": "sleeping. That is all. This small routine repeated every day is more powerful than long study sessions that happen once in a while. When learners",
        "textdich": ""
    },
    {
        "start": 1396.64,
        "end": 1412.64,
        "text": "follow this system, something interesting happens. English stops feeling heavy. It stops feeling like homework. It starts to feel like a tool,",
        "textdich": ""
    },
    {
        "start": 1408.64,
        "end": 1419.84,
        "text": "a tool you use every day. and slowly without forcing it speaking becomes easier.",
        "textdich": ""
    },
    {
        "start": 1417.12,
        "end": 1432.4,
        "text": "In the next chapter we will go deeper into speaking. We will talk about how to speak English even when you are completely alone. No partner, no",
        "textdich": ""
    },
    {
        "start": 1428.48,
        "end": 1441.6,
        "text": "teacher, no pressure, just you, your voice and a clear method to build confidence step by step.",
        "textdich": ""
    },
    {
        "start": 1439.6,
        "end": 1446.799,
        "text": "Chapter 4.",
        "textdich": ""
    },
    {
        "start": 1441.6,
        "end": 1449.36,
        "text": "How to speak even when you are alone.",
        "textdich": ""
    },
    {
        "start": 1446.799,
        "end": 1460.0,
        "text": "One of the most common problems English learners face is this simple thought. I want to speak English but I have no one to practice with.",
        "textdich": ""
    },
    {
        "start": 1457.52,
        "end": 1464.96,
        "text": "This thought stops many people from making progress.",
        "textdich": ""
    },
    {
        "start": 1462.0,
        "end": 1473.36,
        "text": "They wait for a speaking partner. They wait for a class. They wait for the perfect situation.",
        "textdich": ""
    },
    {
        "start": 1470.32,
        "end": 1477.76,
        "text": "And while they wait, their English stays silent.",
        "textdich": ""
    },
    {
        "start": 1475.279,
        "end": 1482.48,
        "text": "But here is something very important you need to understand.",
        "textdich": ""
    },
    {
        "start": 1479.919,
        "end": 1490.48,
        "text": "You do not need another person to start speaking English. You need a system.",
        "textdich": ""
    },
    {
        "start": 1486.88,
        "end": 1493.039,
        "text": "Speaking is not only conversation.",
        "textdich": ""
    },
    {
        "start": 1490.48,
        "end": 1504.72,
        "text": "Speaking is a skill that your brain and mouth must practice together. And you can train this skill alone, safely, and confidently.",
        "textdich": ""
    },
    {
        "start": 1501.6,
        "end": 1508.4,
        "text": "Let's start with something very simple.",
        "textdich": ""
    },
    {
        "start": 1504.72,
        "end": 1515.84,
        "text": "Your voice. Many learners almost never hear their own English voice. They read silently.",
        "textdich": ""
    },
    {
        "start": 1513.36,
        "end": 1527.919,
        "text": "They listen silently, but they do not speak out loud. This creates a big gap between understanding and speaking.",
        "textdich": ""
    },
    {
        "start": 1524.64,
        "end": 1537.44,
        "text": "The first step to close this gap is to make English sounds with your mouth every day. It may feel strange at first.",
        "textdich": ""
    },
    {
        "start": 1535.36,
        "end": 1541.2,
        "text": "That is normal.",
        "textdich": ""
    },
    {
        "start": 1537.44,
        "end": 1547.2,
        "text": "New habits always feel strange. One powerful method is repetition.",
        "textdich": ""
    },
    {
        "start": 1544.24,
        "end": 1554.24,
        "text": "When you hear a simple English sentence, pause the audio and repeat it out loud.",
        "textdich": ""
    },
    {
        "start": 1551.12,
        "end": 1559.6,
        "text": "Do not rush. Do not try to sound perfect.",
        "textdich": ""
    },
    {
        "start": 1555.919,
        "end": 1562.08,
        "text": "Focus on saying the sentence smoothly.",
        "textdich": ""
    },
    {
        "start": 1559.6,
        "end": 1572.72,
        "text": "This trains your mouth muscles and your brain together. Over time, sentences that felt difficult will start to feel natural.",
        "textdich": ""
    },
    {
        "start": 1570.4,
        "end": 1577.279,
        "text": "Another very effective method is shadowing.",
        "textdich": ""
    },
    {
        "start": 1574.32,
        "end": 1587.12,
        "text": "Shadowing means you listen to a short sentence and repeat it immediately almost at the same time as the speaker.",
        "textdich": ""
    },
    {
        "start": 1583.919,
        "end": 1594.24,
        "text": "You do not stop to think. You do not translate. You simply follow the sound.",
        "textdich": ""
    },
    {
        "start": 1591.52,
        "end": 1600.08,
        "text": "This method helps you build rhythm, speed, and confidence.",
        "textdich": ""
    },
    {
        "start": 1597.12,
        "end": 1604.88,
        "text": "Even 5 minutes of shadowing every day can make a big difference.",
        "textdich": ""
    },
    {
        "start": 1602.88,
        "end": 1609.12,
        "text": "Now, let's talk about talking to yourself.",
        "textdich": ""
    },
    {
        "start": 1606.4,
        "end": 1618.159,
        "text": "Many learners think this is strange or useless, but in reality, it is one of the best ways to practice speaking.",
        "textdich": ""
    },
    {
        "start": 1615.76,
        "end": 1623.919,
        "text": "When you talk to yourself in English, you remove fear.",
        "textdich": ""
    },
    {
        "start": 1620.4,
        "end": 1633.52,
        "text": "There is no judgment, no pressure, no embarrassment. You are free to make mistakes. You can start very simply.",
        "textdich": ""
    },
    {
        "start": 1630.24,
        "end": 1640.24,
        "text": "Describe what you are doing. I am making tea. I am opening my laptop.",
        "textdich": ""
    },
    {
        "start": 1637.6,
        "end": 1643.76,
        "text": "I am going outside.",
        "textdich": ""
    },
    {
        "start": 1640.24,
        "end": 1656.799,
        "text": "These sentences may seem too easy, but they are building blocks. Fluency grows from simple actions. You can also talk about your thoughts and feelings.",
        "textdich": ""
    },
    {
        "start": 1654.24,
        "end": 1661.2,
        "text": "I feel tired today.",
        "textdich": ""
    },
    {
        "start": 1656.799,
        "end": 1663.76,
        "text": "I am happy because the weather is nice.",
        "textdich": ""
    },
    {
        "start": 1661.2,
        "end": 1674.64,
        "text": "This helps you connect English with real emotions. When language is connected to emotion, your brain remembers it better.",
        "textdich": ""
    },
    {
        "start": 1671.76,
        "end": 1685.36,
        "text": "Another powerful technique is answering questions out loud. You can ask yourself simple questions like, \"What did I do",
        "textdich": ""
    },
    {
        "start": 1680.88,
        "end": 1696.0,
        "text": "today?\" or \"What will I do tomorrow?\" Then answer slowly in English. You do not need long answers. Short answers are",
        "textdich": ""
    },
    {
        "start": 1692.799,
        "end": 1705.12,
        "text": "enough. This trains you to organize your thoughts in English. Many learners worry about making mistakes when speaking",
        "textdich": ""
    },
    {
        "start": 1701.84,
        "end": 1711.919,
        "text": "alone. But this is actually the best place to make mistakes.",
        "textdich": ""
    },
    {
        "start": 1708.24,
        "end": 1716.72,
        "text": "Mistakes made in private are lessons, not failures.",
        "textdich": ""
    },
    {
        "start": 1713.76,
        "end": 1721.279,
        "text": "Every mistake shows you what you need to learn next.",
        "textdich": ""
    },
    {
        "start": 1718.64,
        "end": 1725.76,
        "text": "And when you make mistakes without fear, you learn faster.",
        "textdich": ""
    },
    {
        "start": 1723.76,
        "end": 1731.52,
        "text": "Let's talk about thinking in English again, but this time with speaking.",
        "textdich": ""
    },
    {
        "start": 1729.36,
        "end": 1741.039,
        "text": "When you think in English and then say those thoughts out loud, you strengthen the connection between your mind and your mouth.",
        "textdich": ""
    },
    {
        "start": 1738.48,
        "end": 1752.159,
        "text": "At first, your thoughts will be very simple. That is good. Simple English is powerful English. Another useful idea is",
        "textdich": ""
    },
    {
        "start": 1749.2,
        "end": 1765.279,
        "text": "recording yourself. You can use your phone. Speak for one or two minutes about your day. Then listen to it. Do not judge yourself. Just notice. Are you",
        "textdich": ""
    },
    {
        "start": 1762.24,
        "end": 1778.0,
        "text": "speaking more smoothly than before? Are there pauses? This awareness helps improvement. Now you might be wondering how long should I do this.",
        "textdich": ""
    },
    {
        "start": 1774.96,
        "end": 1790.64,
        "text": "The answer is simple. Do a little every day. 5 minutes is better than zero. 10 minutes is even better. The goal is not long practice. The goal is daily",
        "textdich": ""
    },
    {
        "start": 1787.76,
        "end": 1802.96,
        "text": "practice. Something important happens when you speak alone regularly. Your fear of speaking with others slowly decreases. Your brain becomes used to",
        "textdich": ""
    },
    {
        "start": 1799.6,
        "end": 1814.0,
        "text": "producing English. So when you finally speak with a real person, it feels less scary. Your mouth already knows what to",
        "textdich": ""
    },
    {
        "start": 1809.52,
        "end": 1822.88,
        "text": "do. Remember, fluency is not built in big moments. It is built in small, quiet moments.",
        "textdich": ""
    },
    {
        "start": 1819.919,
        "end": 1830.72,
        "text": "Moments when you choose to speak, even when no one is listening. These moments add up.",
        "textdich": ""
    },
    {
        "start": 1827.919,
        "end": 1842.0,
        "text": "In the next chapter, we will talk about input. We will talk about what kind of listening actually helps you speak better. Because what you listen to",
        "textdich": ""
    },
    {
        "start": 1839.12,
        "end": 1853.679,
        "text": "shapes how you speak. And when you listen the right way, speaking becomes easier and more natural.",
        "textdich": ""
    },
    {
        "start": 1848.799,
        "end": 1856.799,
        "text": "Chapter 5. Input that creates output.",
        "textdich": ""
    },
    {
        "start": 1853.679,
        "end": 1859.2,
        "text": "Listening that makes you fluent.",
        "textdich": ""
    },
    {
        "start": 1856.799,
        "end": 1867.12,
        "text": "Now that you know how to speak even when you are alone, we need to talk about something just as important.",
        "textdich": ""
    },
    {
        "start": 1864.88,
        "end": 1869.679,
        "text": "Listening.",
        "textdich": ""
    },
    {
        "start": 1867.12,
        "end": 1881.2,
        "text": "Many English learners listen to English every day, but they still do not become fluent. This can feel confusing and frustrating.",
        "textdich": ""
    },
    {
        "start": 1877.84,
        "end": 1887.6,
        "text": "You might think, I listen a lot, so why am I not speaking better?",
        "textdich": ""
    },
    {
        "start": 1884.0,
        "end": 1898.559,
        "text": "The answer is simple. Not all listening creates fluency. The type of listening matters. Listening is called input.",
        "textdich": ""
    },
    {
        "start": 1895.36,
        "end": 1902.32,
        "text": "Speaking is called output.",
        "textdich": ""
    },
    {
        "start": 1898.559,
        "end": 1908.799,
        "text": "Good input creates good output. Weak input creates weak output.",
        "textdich": ""
    },
    {
        "start": 1905.919,
        "end": 1917.36,
        "text": "So if you want to speak better English, you must be careful about what you listen to and how you listen.",
        "textdich": ""
    },
    {
        "start": 1915.039,
        "end": 1921.44,
        "text": "First, let's talk about a common mistake.",
        "textdich": ""
    },
    {
        "start": 1918.96,
        "end": 1935.039,
        "text": "Many learners listen to English that is too difficult. They listen to fast conversations, advanced news or complicated shows. They understand only",
        "textdich": ""
    },
    {
        "start": 1930.88,
        "end": 1940.0,
        "text": "a few words. Their brain feels tired and they stop listening.",
        "textdich": ""
    },
    {
        "start": 1937.76,
        "end": 1945.679,
        "text": "This kind of listening does not help fluency. It creates stress.",
        "textdich": ""
    },
    {
        "start": 1943.6,
        "end": 1949.76,
        "text": "Your listening input should be understandable.",
        "textdich": ""
    },
    {
        "start": 1947.44,
        "end": 1960.96,
        "text": "You do not need to understand every word, but you should understand the general meaning. When your brain understands most of what it hears, it",
        "textdich": ""
    },
    {
        "start": 1957.919,
        "end": 1964.0,
        "text": "starts to learn naturally.",
        "textdich": ""
    },
    {
        "start": 1960.96,
        "end": 1967.36,
        "text": "This is how children learn language.",
        "textdich": ""
    },
    {
        "start": 1964.0,
        "end": 1975.36,
        "text": "They listen to simple language first, then slowly it becomes more complex.",
        "textdich": ""
    },
    {
        "start": 1972.159,
        "end": 1980.08,
        "text": "Another mistake is listening without attention.",
        "textdich": ""
    },
    {
        "start": 1977.76,
        "end": 1986.0,
        "text": "Many learners play English in the background while doing other things.",
        "textdich": ""
    },
    {
        "start": 1983.12,
        "end": 1993.84,
        "text": "This is okay sometimes, but it should not be your main practice.",
        "textdich": ""
    },
    {
        "start": 1989.76,
        "end": 1997.84,
        "text": "Active listening is what builds fluency.",
        "textdich": ""
    },
    {
        "start": 1993.84,
        "end": 2001.84,
        "text": "Active listening means you are present.",
        "textdich": ""
    },
    {
        "start": 1997.84,
        "end": 2006.24,
        "text": "You are curious. You notice patterns.",
        "textdich": ""
    },
    {
        "start": 2001.84,
        "end": 2010.559,
        "text": "You notice how sentences start and end.",
        "textdich": ""
    },
    {
        "start": 2006.24,
        "end": 2012.559,
        "text": "One powerful idea is repetition.",
        "textdich": ""
    },
    {
        "start": 2010.559,
        "end": 2023.519,
        "text": "Instead of listening to many different things, choose one short audio or video and listen to it many times. The first",
        "textdich": ""
    },
    {
        "start": 2020.0,
        "end": 2027.279,
        "text": "time you may understand only part of it.",
        "textdich": ""
    },
    {
        "start": 2023.519,
        "end": 2034.64,
        "text": "The second time you understand more. The third time sentences become familiar.",
        "textdich": ""
    },
    {
        "start": 2031.36,
        "end": 2045.44,
        "text": "This familiarity builds confidence and speed. Listening to the same content again and again may feel boring, but it",
        "textdich": ""
    },
    {
        "start": 2041.84,
        "end": 2052.48,
        "text": "is very effective. Fluency comes from hearing the same phrases many times.",
        "textdich": ""
    },
    {
        "start": 2048.96,
        "end": 2059.28,
        "text": "When phrases become familiar, your brain can use them easily when you speak.",
        "textdich": ""
    },
    {
        "start": 2056.32,
        "end": 2071.04,
        "text": "Another important idea is listening for phrases, not single words. Many learners try to understand every word. This is exhausting.",
        "textdich": ""
    },
    {
        "start": 2068.159,
        "end": 2082.8,
        "text": "Real fluency comes from learning chunks of language. Phrases like I think that in my opinion the reason is are used",
        "textdich": ""
    },
    {
        "start": 2078.96,
        "end": 2088.96,
        "text": "again and again. When you learn phrases you speak faster and more naturally.",
        "textdich": ""
    },
    {
        "start": 2086.399,
        "end": 2095.119,
        "text": "Stories are especially powerful for learning English. Stories have context.",
        "textdich": ""
    },
    {
        "start": 2092.879,
        "end": 2099.52,
        "text": "They have emotions. They have repetition.",
        "textdich": ""
    },
    {
        "start": 2096.72,
        "end": 2104.72,
        "text": "When you listen to stories, your brain stays engaged.",
        "textdich": ""
    },
    {
        "start": 2101.52,
        "end": 2107.76,
        "text": "You want to know what happens next.",
        "textdich": ""
    },
    {
        "start": 2104.72,
        "end": 2115.44,
        "text": "This keeps you listening longer and longer listening means more exposure to English.",
        "textdich": ""
    },
    {
        "start": 2112.4,
        "end": 2118.96,
        "text": "Subtitles are another big question.",
        "textdich": ""
    },
    {
        "start": 2115.44,
        "end": 2129.76,
        "text": "Should you use them or not? The answer is yes and no. Subtitles can help beginners understand meaning. They can",
        "textdich": ""
    },
    {
        "start": 2126.48,
        "end": 2139.44,
        "text": "reduce stress, but you should not depend on them forever. A good method is to listen once with subtitles, then listen",
        "textdich": ""
    },
    {
        "start": 2136.4,
        "end": 2148.56,
        "text": "again without them. This trains your ears. It is also important to listen to English that matches your goals.",
        "textdich": ""
    },
    {
        "start": 2145.68,
        "end": 2154.24,
        "text": "If you want to speak about daily life, listen to daily conversations.",
        "textdich": ""
    },
    {
        "start": 2151.2,
        "end": 2164.8,
        "text": "If you want to speak at work, listen to workrelated English. Your brain learns best when input matches output.",
        "textdich": ""
    },
    {
        "start": 2161.44,
        "end": 2174.96,
        "text": "Now let's talk about time. You do not need hours of listening. Even 10 to 20 minutes of focused listening every day",
        "textdich": ""
    },
    {
        "start": 2170.88,
        "end": 2180.24,
        "text": "is powerful. What matters is regular exposure.",
        "textdich": ""
    },
    {
        "start": 2177.76,
        "end": 2187.04,
        "text": "When English becomes part of your daily routine, it stops feeling foreign.",
        "textdich": ""
    },
    {
        "start": 2184.32,
        "end": 2191.68,
        "text": "Another important point is emotional connection.",
        "textdich": ""
    },
    {
        "start": 2188.56,
        "end": 2202.0,
        "text": "When you enjoy what you listen to, you listen longer. When you listen longer, you learn more.",
        "textdich": ""
    },
    {
        "start": 2198.16,
        "end": 2211.359,
        "text": "So, choose content you like. It could be simple stories, slow podcasts, or calm conversations.",
        "textdich": ""
    },
    {
        "start": 2208.0,
        "end": 2223.68,
        "text": "Enjoyment is not a luxury. It is a learning tool. As you listen more, something interesting happens. You start to hear patterns. You start to predict",
        "textdich": ""
    },
    {
        "start": 2219.76,
        "end": 2233.359,
        "text": "sentences. Your brain becomes faster and slowly without forcing it. These patterns appear when you speak.",
        "textdich": ""
    },
    {
        "start": 2229.28,
        "end": 2236.48,
        "text": "Listening also helps pronunciation.",
        "textdich": ""
    },
    {
        "start": 2233.359,
        "end": 2243.359,
        "text": "When you hear words many times, your brain learns how they sound together.",
        "textdich": ""
    },
    {
        "start": 2239.76,
        "end": 2247.359,
        "text": "You stop pronouncing words separately.",
        "textdich": ""
    },
    {
        "start": 2243.359,
        "end": 2259.76,
        "text": "Your speech becomes smoother. Remember, listening is not passive. It is training. When you listen the right way, you are preparing your brain to speak.",
        "textdich": ""
    },
    {
        "start": 2256.88,
        "end": 2269.839,
        "text": "Every sentence you hear is a sentence you might use one day. In the next chapter, we will talk about your fluency timeline.",
        "textdich": ""
    },
    {
        "start": 2267.359,
        "end": 2283.359,
        "text": "We will talk about how long fluency really takes, what progress looks like, and how to stay calm and consistent on your journey in 2026.",
        "textdich": ""
    },
    {
        "start": 2279.28,
        "end": 2292.48,
        "text": "Chapter 6, your 2026 fluency road map. What to expect and how to stay consistent.",
        "textdich": ""
    },
    {
        "start": 2289.92,
        "end": 2303.52,
        "text": "Now that you understand how fluency really works, how to build a daily system, how to speak alone, and how to listen in a way that creates real",
        "textdich": ""
    },
    {
        "start": 2300.88,
        "end": 2313.68,
        "text": "progress. We need to talk about the future. We need to talk about what your journey in 2026 will actually look like.",
        "textdich": ""
    },
    {
        "start": 2311.44,
        "end": 2326.16,
        "text": "Because many learners quit not because they cannot learn English, but because they expect progress to look different than it really does.",
        "textdich": ""
    },
    {
        "start": 2322.4,
        "end": 2333.76,
        "text": "Fluency does not arrive suddenly. It grows slowly, quietly, and sometimes invisibly.",
        "textdich": ""
    },
    {
        "start": 2331.599,
        "end": 2342.32,
        "text": "If you are waiting for a big moment where you suddenly become fluent, you may feel disappointed.",
        "textdich": ""
    },
    {
        "start": 2338.72,
        "end": 2346.64,
        "text": "Instead, fluency shows itself in small signs.",
        "textdich": ""
    },
    {
        "start": 2344.079,
        "end": 2356.96,
        "text": "One day you speak a little longer, another day you understand a sentence without translating, another day you feel less afraid to open",
        "textdich": ""
    },
    {
        "start": 2353.599,
        "end": 2361.76,
        "text": "your mouth. These are real signs of progress.",
        "textdich": ""
    },
    {
        "start": 2359.359,
        "end": 2373.28,
        "text": "In the beginning of your journey, progress feels exciting. You learn new words. You understand more than before.",
        "textdich": ""
    },
    {
        "start": 2369.92,
        "end": 2382.079,
        "text": "But after some time, progress feels slower. This is normal. This is called a plateau.",
        "textdich": ""
    },
    {
        "start": 2379.2,
        "end": 2386.32,
        "text": "Many learners think this means they are failing.",
        "textdich": ""
    },
    {
        "start": 2383.599,
        "end": 2392.079,
        "text": "But it actually means their brain is organizing information.",
        "textdich": ""
    },
    {
        "start": 2389.04,
        "end": 2401.92,
        "text": "If you continue during this stage, fluency will grow. Again, it is important to have realistic expectations.",
        "textdich": ""
    },
    {
        "start": 2399.359,
        "end": 2415.44,
        "text": "You do not need to be perfect in 3 months. You do not need to sound native in 6 months. Your goal in 2026 is not perfection.",
        "textdich": ""
    },
    {
        "start": 2411.68,
        "end": 2418.56,
        "text": "Your goal is confidence and consistency.",
        "textdich": ""
    },
    {
        "start": 2415.44,
        "end": 2426.64,
        "text": "If you speak English every day, even a little, you are succeeding. Let's talk about time.",
        "textdich": ""
    },
    {
        "start": 2423.599,
        "end": 2435.52,
        "text": "If you practice English daily, you will see changes within weeks. You may not notice them yourself at first, but they",
        "textdich": ""
    },
    {
        "start": 2432.8,
        "end": 2443.119,
        "text": "are happening. Your thinking becomes faster. Your listening becomes easier.",
        "textdich": ""
    },
    {
        "start": 2439.52,
        "end": 2455.28,
        "text": "Your speaking becomes less scary. Over months, these small changes become big ones. Another important part of your road map is identity.",
        "textdich": ""
    },
    {
        "start": 2451.68,
        "end": 2462.4,
        "text": "Stop saying I am learning English. Start saying I am an English speaker.",
        "textdich": ""
    },
    {
        "start": 2459.28,
        "end": 2473.839,
        "text": "Even if you are a beginner, this mindset matters. When you see yourself as a speaker, you behave like one. You speak",
        "textdich": ""
    },
    {
        "start": 2468.56,
        "end": 2477.359,
        "text": "more. You take risks and fluency grows.",
        "textdich": ""
    },
    {
        "start": 2473.839,
        "end": 2487.28,
        "text": "Consistency is your strongest tool. You do not need motivation every day. You need a routine. Some days you will feel",
        "textdich": ""
    },
    {
        "start": 2483.599,
        "end": 2497.599,
        "text": "tired. Some days you will feel busy. On those days do the minimum. Listen for 5 minutes. Say one sentence.",
        "textdich": ""
    },
    {
        "start": 2495.119,
        "end": 2500.079,
        "text": "Keep the habit alive.",
        "textdich": ""
    },
    {
        "start": 2497.599,
        "end": 2503.76,
        "text": "Never stop completely.",
        "textdich": ""
    },
    {
        "start": 2500.079,
        "end": 2510.8,
        "text": "Fear will appear again and again. Fear of mistakes. Fear of forgetting words.",
        "textdich": ""
    },
    {
        "start": 2507.76,
        "end": 2522.079,
        "text": "Fear of speaking with others. This is normal. Courage is not the absence of fear. Courage is speaking even when fear",
        "textdich": ""
    },
    {
        "start": 2518.0,
        "end": 2535.119,
        "text": "is present. Each time you speak, fear becomes smaller. Another important idea is patience. Language learning is not fast, but it is reliable.",
        "textdich": ""
    },
    {
        "start": 2532.319,
        "end": 2539.599,
        "text": "If you show up every day, your brain will change.",
        "textdich": ""
    },
    {
        "start": 2536.88,
        "end": 2546.8,
        "text": "You cannot see your brain changing but it is happening. Trust the process.",
        "textdich": ""
    },
    {
        "start": 2543.44,
        "end": 2548.96,
        "text": "You may also compare yourself to others.",
        "textdich": ""
    },
    {
        "start": 2546.8,
        "end": 2551.92,
        "text": "Try not to.",
        "textdich": ""
    },
    {
        "start": 2548.96,
        "end": 2557.2,
        "text": "Everyone has a different journey. Focus on your own progress.",
        "textdich": ""
    },
    {
        "start": 2554.319,
        "end": 2563.839,
        "text": "Look back at where you started. That is your real comparison.",
        "textdich": ""
    },
    {
        "start": 2559.68,
        "end": 2567.2,
        "text": "In 2026, you have something powerful.",
        "textdich": ""
    },
    {
        "start": 2563.839,
        "end": 2581.68,
        "text": "You have access to real English. You have tools. You have knowledge. But most importantly, you have control. You decide to speak. You decide to listen.",
        "textdich": ""
    },
    {
        "start": 2578.24,
        "end": 2594.48,
        "text": "You decide to continue. Your road map is simple. Listen every day. Speak every day. Think in English.",
        "textdich": ""
    },
    {
        "start": 2590.079,
        "end": 2598.64,
        "text": "Be kind to yourself. Stay consistent.",
        "textdich": ""
    },
    {
        "start": 2594.48,
        "end": 2611.839,
        "text": "That is enough. If you do these things, fluency will not be a dream. It will be a result. And now before we finish, let me say this.",
        "textdich": ""
    },
    {
        "start": 2608.56,
        "end": 2622.4,
        "text": "You are not late. You are not bad at English. You are not incapable. You are just at the beginning of a better way.",
        "textdich": ""
    },
    {
        "start": 2619.119,
        "end": 2631.44,
        "text": "2026 can be the year English becomes part of your life, not a problem in your head. And you do not have to do this",
        "textdich": ""
    },
    {
        "start": 2628.16,
        "end": 2643.44,
        "text": "alone. We are on this journey together here on Bookish English. Many people know English words. Many people understand English when they listen or",
        "textdich": ""
    },
    {
        "start": 2639.92,
        "end": 2655.76,
        "text": "read, but when it is time to speak, they feel shy. Their mind works but their mouth stays quiet. If this is you, you are not alone.",
        "textdich": ""
    },
    {
        "start": 2653.359,
        "end": 2666.079,
        "text": "This happens to many English learners around the world. Do you feel nervous when someone asks you to speak English?",
        "textdich": ""
    },
    {
        "start": 2662.16,
        "end": 2672.079,
        "text": "Do you think what if I make a mistake or what if people laugh at me?",
        "textdich": ""
    },
    {
        "start": 2669.28,
        "end": 2677.04,
        "text": "These thoughts stop you. They make English speaking feel hard.",
        "textdich": ""
    },
    {
        "start": 2675.119,
        "end": 2681.68,
        "text": "But what if I tell you something important?",
        "textdich": ""
    },
    {
        "start": 2678.88,
        "end": 2692.0,
        "text": "You do not need perfect English to start speaking. You do not need to wait. You can start today. You can start now. In",
        "textdich": ""
    },
    {
        "start": 2689.44,
        "end": 2703.359,
        "text": "this video, I will show you how to improve your English speaking step by step in a very simple and easy way. Even",
        "textdich": ""
    },
    {
        "start": 2700.079,
        "end": 2715.44,
        "text": "if you are a beginner, even if you feel afraid, stay with me till the end because this video can change the way you speak English forever.",
        "textdich": ""
    },
    {
        "start": 2713.119,
        "end": 2718.24,
        "text": "Chapter 1.",
        "textdich": ""
    },
    {
        "start": 2715.44,
        "end": 2731.44,
        "text": "Why English speaking feels difficult and how your mind can change it. Many English learners ask the same question again and again. They say why can I",
        "textdich": ""
    },
    {
        "start": 2727.44,
        "end": 2734.8,
        "text": "understand English but I cannot speak.",
        "textdich": ""
    },
    {
        "start": 2731.44,
        "end": 2744.64,
        "text": "They listen to English videos. They read English books. They know many words. But when someone says please speak in",
        "textdich": ""
    },
    {
        "start": 2741.359,
        "end": 2757.359,
        "text": "English, their heart beats fast. Their mouth feels dry. Their mind becomes empty. This is very common. If this happens to you, please remember one",
        "textdich": ""
    },
    {
        "start": 2753.839,
        "end": 2770.96,
        "text": "thing. You are not weak. You are not stupid. You are not bad at English. You are human. For beginners, English speaking feels difficult because of",
        "textdich": ""
    },
    {
        "start": 2767.04,
        "end": 2784.4,
        "text": "fear. Fear is the biggest problem. Fear of mistakes, fear of being laughed at, fear of sounding stupid, fear of thinking too much before speaking. Many",
        "textdich": ""
    },
    {
        "start": 2780.4,
        "end": 2794.319,
        "text": "learners think my grammar is not good or my pronunciation is bad or other people speak better than me. These thoughts",
        "textdich": ""
    },
    {
        "start": 2791.04,
        "end": 2805.92,
        "text": "stay in the mind all the time. Because of these thoughts, the mouth stops working. The words stay inside the head.",
        "textdich": ""
    },
    {
        "start": 2802.319,
        "end": 2811.52,
        "text": "This is not an English problem. This is a mind problem.",
        "textdich": ""
    },
    {
        "start": 2809.2,
        "end": 2823.119,
        "text": "Many people believe that good English speakers are born with talent. They think speaking English is a gift. This is not true. Speaking English is not",
        "textdich": ""
    },
    {
        "start": 2821.599,
        "end": 2826.16,
        "text": "talent.",
        "textdich": ""
    },
    {
        "start": 2823.119,
        "end": 2829.119,
        "text": "Speaking English is a habit.",
        "textdich": ""
    },
    {
        "start": 2826.16,
        "end": 2839.119,
        "text": "Just like walking, just like driving, just like using a phone. When you do something every day, it becomes easy.",
        "textdich": ""
    },
    {
        "start": 2835.599,
        "end": 2842.4,
        "text": "When you do not do it, it feels hard.",
        "textdich": ""
    },
    {
        "start": 2839.119,
        "end": 2854.96,
        "text": "English speaking is the same. If you do not practice speaking, your mouth feels scared. If you practice speaking every day, your mouth becomes brave.",
        "textdich": ""
    },
    {
        "start": 2852.0,
        "end": 2861.44,
        "text": "Let me tell you a simple story. There was a learner named Ali.",
        "textdich": ""
    },
    {
        "start": 2857.92,
        "end": 2872.0,
        "text": "Ali studied English for many years. He watched English movies. He listened to English songs. He understood almost",
        "textdich": ""
    },
    {
        "start": 2867.2,
        "end": 2874.48,
        "text": "everything but he never spoke English.",
        "textdich": ""
    },
    {
        "start": 2872.0,
        "end": 2883.2,
        "text": "One day a foreign guest came to his office. The guest asked a simple question. How are you?",
        "textdich": ""
    },
    {
        "start": 2880.64,
        "end": 2893.119,
        "text": "Ally knew the answer. He knew many answers but he could not speak. He smiled. He stayed silent.",
        "textdich": ""
    },
    {
        "start": 2889.68,
        "end": 2896.96,
        "text": "After that day, Ally felt very sad.",
        "textdich": ""
    },
    {
        "start": 2893.119,
        "end": 2907.92,
        "text": "He said, \"My English is bad.\" But his English was not bad. His fear was strong. His silence became a habit.",
        "textdich": ""
    },
    {
        "start": 2904.72,
        "end": 2911.119,
        "text": "This is very important to understand.",
        "textdich": ""
    },
    {
        "start": 2907.92,
        "end": 2920.96,
        "text": "Silence feels safe, but it does not help you grow. Silence feels comfortable, but it teaches you nothing. That is why I",
        "textdich": ""
    },
    {
        "start": 2918.24,
        "end": 2926.48,
        "text": "want you to remember this line again and again.",
        "textdich": ""
    },
    {
        "start": 2922.48,
        "end": 2939.92,
        "text": "Mistakes mean learning. Silence means nothing. When you make mistakes, your brain learns. When you speak wrong English, your brain improves. When you",
        "textdich": ""
    },
    {
        "start": 2936.079,
        "end": 2942.559,
        "text": "stay silent, nothing changes.",
        "textdich": ""
    },
    {
        "start": 2939.92,
        "end": 2954.4,
        "text": "Many beginners also think too much before speaking. They think about grammar. They think about tense. They think about correct words. They think",
        "textdich": ""
    },
    {
        "start": 2951.28,
        "end": 2964.559,
        "text": "about sentence order. While they are thinking, the moment is gone. The conversation is finished.",
        "textdich": ""
    },
    {
        "start": 2960.88,
        "end": 2968.88,
        "text": "Speaking is not thinking. Speaking is doing.",
        "textdich": ""
    },
    {
        "start": 2966.559,
        "end": 2973.52,
        "text": "You do not think about grammar when you speak your mother language.",
        "textdich": ""
    },
    {
        "start": 2971.44,
        "end": 2977.359,
        "text": "You just speak.",
        "textdich": ""
    },
    {
        "start": 2973.52,
        "end": 2988.8,
        "text": "English should be the same. Simple, natural, free. You don't need perfect English. You need brave English.",
        "textdich": ""
    },
    {
        "start": 2986.079,
        "end": 2998.96,
        "text": "Brave English means you speak even when you are not sure. Brave English means you speak even when you make mistakes.",
        "textdich": ""
    },
    {
        "start": 2995.92,
        "end": 3010.24,
        "text": "Brave English means you open your mouth and try. This is how confidence is built. Confidence does not come before speaking. Confidence comes after",
        "textdich": ""
    },
    {
        "start": 3008.64,
        "end": 3013.359,
        "text": "speaking.",
        "textdich": ""
    },
    {
        "start": 3010.24,
        "end": 3025.52,
        "text": "Many learners say I will speak when my English becomes good. This is a big mistake. Your English becomes good because you speak.",
        "textdich": ""
    },
    {
        "start": 3022.0,
        "end": 3036.559,
        "text": "Speaking comes first. Improvement comes later. Think about a baby. A baby does not wait to speak perfectly. A baby",
        "textdich": ""
    },
    {
        "start": 3032.96,
        "end": 3044.559,
        "text": "speaks wrong words. A baby makes funny sounds. But the baby keeps speaking.",
        "textdich": ""
    },
    {
        "start": 3040.4,
        "end": 3048.0,
        "text": "That is why the baby learns fast.",
        "textdich": ""
    },
    {
        "start": 3044.559,
        "end": 3060.72,
        "text": "Adults forget this simple truth. Your age is not the problem. Your intelligence is not the problem. Your background is not the problem. The",
        "textdich": ""
    },
    {
        "start": 3057.52,
        "end": 3063.92,
        "text": "problem is fear and overthinking.",
        "textdich": ""
    },
    {
        "start": 3060.72,
        "end": 3073.92,
        "text": "When you remove fear, English becomes easy. When you stop overthinking, words start coming. You must allow yourself to",
        "textdich": ""
    },
    {
        "start": 3071.04,
        "end": 3078.64,
        "text": "be a beginner. You must allow yourself to be imperfect.",
        "textdich": ""
    },
    {
        "start": 3076.0,
        "end": 3081.2,
        "text": "Say simple sentences.",
        "textdich": ""
    },
    {
        "start": 3078.64,
        "end": 3083.92,
        "text": "Very simple sentences.",
        "textdich": ""
    },
    {
        "start": 3081.2,
        "end": 3088.24,
        "text": "I am learning English.",
        "textdich": ""
    },
    {
        "start": 3083.92,
        "end": 3091.359,
        "text": "I like tea. I am happy today.",
        "textdich": ""
    },
    {
        "start": 3088.24,
        "end": 3099.28,
        "text": "These sentences are enough. You do not need big words. You do not need long sentences.",
        "textdich": ""
    },
    {
        "start": 3095.92,
        "end": 3102.64,
        "text": "Simple English is powerful English.",
        "textdich": ""
    },
    {
        "start": 3099.28,
        "end": 3109.04,
        "text": "Simple English helps you speak more. And when you speak more, you improve faster.",
        "textdich": ""
    },
    {
        "start": 3106.8,
        "end": 3124.319,
        "text": "I want you to repeat this again in your mind. Mistakes mean learning. Silence means nothing. Every time you feel afraid, remember this. Every time you",
        "textdich": ""
    },
    {
        "start": 3121.2,
        "end": 3126.4,
        "text": "want to stay quiet, remember this.",
        "textdich": ""
    },
    {
        "start": 3124.319,
        "end": 3139.119,
        "text": "Speaking badly is better than not speaking at all. Speaking slowly is better than not speaking. Speaking wrong English is better than perfect silence.",
        "textdich": ""
    },
    {
        "start": 3135.52,
        "end": 3141.76,
        "text": "In this journey, be kind to yourself.",
        "textdich": ""
    },
    {
        "start": 3139.119,
        "end": 3147.92,
        "text": "Talk to yourself like a friend. Tell yourself it is okay.",
        "textdich": ""
    },
    {
        "start": 3144.64,
        "end": 3162.24,
        "text": "Tell yourself, I am learning. Tell yourself, \"I will improve.\" Your mind listens to your words. When your mind feels safe, your mouth opens.",
        "textdich": ""
    },
    {
        "start": 3158.8,
        "end": 3167.44,
        "text": "When your mind feels relaxed, English flows.",
        "textdich": ""
    },
    {
        "start": 3164.24,
        "end": 3173.76,
        "text": "This chapter is not about grammar. This chapter is not about vocabulary.",
        "textdich": ""
    },
    {
        "start": 3170.319,
        "end": 3182.88,
        "text": "This chapter is about your mind. Change your thinking and your speaking will change. In the next chapter, I will show",
        "textdich": ""
    },
    {
        "start": 3180.079,
        "end": 3195.04,
        "text": "you how to start speaking English every day with very small steps. Steps that anyone can do, steps that really work.",
        "textdich": ""
    },
    {
        "start": 3190.88,
        "end": 3199.28,
        "text": "Stay with me. You are doing great.",
        "textdich": ""
    },
    {
        "start": 3195.04,
        "end": 3203.04,
        "text": "Chapter 2. Daily speaking practice.",
        "textdich": ""
    },
    {
        "start": 3199.28,
        "end": 3205.52,
        "text": "Small steps that change everything.",
        "textdich": ""
    },
    {
        "start": 3203.04,
        "end": 3215.68,
        "text": "Now that you understand why English speaking feels difficult, let us talk about the most important solution.",
        "textdich": ""
    },
    {
        "start": 3211.599,
        "end": 3218.16,
        "text": "The solution is daily speaking practice.",
        "textdich": ""
    },
    {
        "start": 3215.68,
        "end": 3226.8,
        "text": "Many learners think speaking practice means long conversations with fluent people. They think it means speaking for",
        "textdich": ""
    },
    {
        "start": 3224.079,
        "end": 3234.72,
        "text": "one hour. They think it means perfect sentences. This thinking stops them.",
        "textdich": ""
    },
    {
        "start": 3231.04,
        "end": 3238.24,
        "text": "But the truth is very simple.",
        "textdich": ""
    },
    {
        "start": 3234.72,
        "end": 3241.04,
        "text": "Speaking practice means small steps.",
        "textdich": ""
    },
    {
        "start": 3238.24,
        "end": 3246.0,
        "text": "Speaking practice means little actions every day.",
        "textdich": ""
    },
    {
        "start": 3242.96,
        "end": 3249.04,
        "text": "You do not need long conversations.",
        "textdich": ""
    },
    {
        "start": 3246.0,
        "end": 3260.4,
        "text": "You do not need big words. You do not need a partner. You just need a few minutes and a little courage. Let me say this very clearly.",
        "textdich": ""
    },
    {
        "start": 3257.52,
        "end": 3269.28,
        "text": "Five minutes every day is stronger than one hour once a week. This one sentence can change your English speaking. When",
        "textdich": ""
    },
    {
        "start": 3266.8,
        "end": 3282.4,
        "text": "you practice a little every day, your brain stays active. Your mouth stays ready. English becomes part of your life. But when you practice only one day",
        "textdich": ""
    },
    {
        "start": 3278.96,
        "end": 3295.44,
        "text": "in a week, your brain forgets. Your mouth becomes shy again. Small daily practice builds a strong habit and speaking English is a habit.",
        "textdich": ""
    },
    {
        "start": 3292.96,
        "end": 3301.2,
        "text": "The easiest way to start speaking is talking to yourself in English.",
        "textdich": ""
    },
    {
        "start": 3298.88,
        "end": 3308.8,
        "text": "Many learners feel strange when they hear this. They think talking to myself is crazy.",
        "textdich": ""
    },
    {
        "start": 3306.8,
        "end": 3321.359,
        "text": "But this is one of the best ways to practice. When you talk to yourself, there is no fear. No one listens, no one laughs, no one corrects you. You feel",
        "textdich": ""
    },
    {
        "start": 3319.839,
        "end": 3324.64,
        "text": "safe.",
        "textdich": ""
    },
    {
        "start": 3321.359,
        "end": 3331.44,
        "text": "Safety helps your mind relax. And when your mind is relaxed, speaking becomes easy.",
        "textdich": ""
    },
    {
        "start": 3329.52,
        "end": 3336.16,
        "text": "You can start with very simple sentences.",
        "textdich": ""
    },
    {
        "start": 3332.96,
        "end": 3341.839,
        "text": "Do not try to be smart. Do not try to sound advanced.",
        "textdich": ""
    },
    {
        "start": 3338.16,
        "end": 3352.559,
        "text": "Simple sentences are enough. Say I am happy. Say I am tired. Say I like tea.",
        "textdich": ""
    },
    {
        "start": 3348.64,
        "end": 3355.44,
        "text": "Say I am learning English.",
        "textdich": ""
    },
    {
        "start": 3352.559,
        "end": 3368.319,
        "text": "These sentences may look small but they are powerful. When you say them every day, your mouth becomes familiar with English sounds. Your tongue learns",
        "textdich": ""
    },
    {
        "start": 3364.559,
        "end": 3375.68,
        "text": "English movement. Your brain connects thoughts with English words.",
        "textdich": ""
    },
    {
        "start": 3371.52,
        "end": 3378.24,
        "text": "Speak alone at home. Speak in your room.",
        "textdich": ""
    },
    {
        "start": 3375.68,
        "end": 3382.0,
        "text": "Speak in the kitchen. Speak while walking.",
        "textdich": ""
    },
    {
        "start": 3379.76,
        "end": 3384.24,
        "text": "Speak while cooking.",
        "textdich": ""
    },
    {
        "start": 3382.0,
        "end": 3388.4,
        "text": "Speak while cleaning.",
        "textdich": ""
    },
    {
        "start": 3384.24,
        "end": 3391.92,
        "text": "You do not need a special time or place.",
        "textdich": ""
    },
    {
        "start": 3388.4,
        "end": 3394.88,
        "text": "English speaking can happen anywhere.",
        "textdich": ""
    },
    {
        "start": 3391.92,
        "end": 3398.24,
        "text": "You can look in the mirror and speak.",
        "textdich": ""
    },
    {
        "start": 3394.88,
        "end": 3400.72,
        "text": "You can sit on your bed and speak.",
        "textdich": ""
    },
    {
        "start": 3398.24,
        "end": 3412.0,
        "text": "The important thing is to open your mouth. Even if your voice is low, even if your sentence is short, open your",
        "textdich": ""
    },
    {
        "start": 3408.24,
        "end": 3417.839,
        "text": "mouth and speak. Many beginners wait for confidence before speaking.",
        "textdich": ""
    },
    {
        "start": 3414.64,
        "end": 3429.359,
        "text": "This is a mistake. Confidence comes after practice, not before. When you speak every day, even for a few minutes, your fear",
        "textdich": ""
    },
    {
        "start": 3426.0,
        "end": 3434.559,
        "text": "becomes smaller. Your confidence becomes bigger.",
        "textdich": ""
    },
    {
        "start": 3430.88,
        "end": 3438.079,
        "text": "One day you will speak without thinking.",
        "textdich": ""
    },
    {
        "start": 3434.559,
        "end": 3440.48,
        "text": "That day comes faster than you imagine.",
        "textdich": ""
    },
    {
        "start": 3438.079,
        "end": 3451.92,
        "text": "You can practice speaking by describing your day. For example, you can say, \"Today I woke up early. I brushed my",
        "textdich": ""
    },
    {
        "start": 3447.28,
        "end": 3455.119,
        "text": "teeth. I ate breakfast. I went to work.",
        "textdich": ""
    },
    {
        "start": 3451.92,
        "end": 3463.599,
        "text": "These sentences are very simple, but they help you think and speak in English. You do not need grammar rules.",
        "textdich": ""
    },
    {
        "start": 3460.799,
        "end": 3475.68,
        "text": "You do not need perfect tense. You just need to speak. If you make mistakes, it is okay. Do not stop. Do not correct",
        "textdich": ""
    },
    {
        "start": 3472.0,
        "end": 3484.079,
        "text": "every sentence. Keep going. Remember this again. Mistakes mean learning.",
        "textdich": ""
    },
    {
        "start": 3480.72,
        "end": 3486.079,
        "text": "Silence means nothing.",
        "textdich": ""
    },
    {
        "start": 3484.079,
        "end": 3492.319,
        "text": "When you stop speaking because of mistakes, you lose practice.",
        "textdich": ""
    },
    {
        "start": 3489.52,
        "end": 3498.799,
        "text": "When you continue speaking, even with mistakes, you improve.",
        "textdich": ""
    },
    {
        "start": 3495.28,
        "end": 3502.4,
        "text": "Another powerful method is repetition.",
        "textdich": ""
    },
    {
        "start": 3498.799,
        "end": 3507.44,
        "text": "Repeat the same sentences every day.",
        "textdich": ""
    },
    {
        "start": 3502.4,
        "end": 3511.599,
        "text": "Yes, repeat. Repetition is not boring.",
        "textdich": ""
    },
    {
        "start": 3507.44,
        "end": 3521.52,
        "text": "Repetition is training. When you repeat, your brain becomes faster. Your mouth becomes smoother. Say the same sentence",
        "textdich": ""
    },
    {
        "start": 3517.92,
        "end": 3527.92,
        "text": "five times. Say it slowly. Say it clearly. Say it with confidence.",
        "textdich": ""
    },
    {
        "start": 3524.64,
        "end": 3531.599,
        "text": "Repetition builds fluency.",
        "textdich": ""
    },
    {
        "start": 3527.92,
        "end": 3537.119,
        "text": "Here is a very important line. If you can think it, you can say it.",
        "textdich": ""
    },
    {
        "start": 3534.559,
        "end": 3548.0,
        "text": "Many learners think in their language then try to translate into English. This makes speaking slow and difficult.",
        "textdich": ""
    },
    {
        "start": 3544.16,
        "end": 3551.92,
        "text": "Try to think simple thoughts in English.",
        "textdich": ""
    },
    {
        "start": 3548.0,
        "end": 3558.72,
        "text": "For example, when you feel hungry, think I am hungry.",
        "textdich": ""
    },
    {
        "start": 3554.0,
        "end": 3563.599,
        "text": "When you feel tired, think I am tired.",
        "textdich": ""
    },
    {
        "start": 3558.72,
        "end": 3566.4,
        "text": "When you feel happy, think I am happy.",
        "textdich": ""
    },
    {
        "start": 3563.599,
        "end": 3582.24,
        "text": "These are small thoughts but they are powerful. You do not need to practice for a long time. 5 to 10 minutes is enough. Set a small time. Do not make",
        "textdich": ""
    },
    {
        "start": 3577.359,
        "end": 3585.68,
        "text": "big plans. Big plans break easily.",
        "textdich": ""
    },
    {
        "start": 3582.24,
        "end": 3588.88,
        "text": "Small plans stay strong.",
        "textdich": ""
    },
    {
        "start": 3585.68,
        "end": 3594.64,
        "text": "Tell yourself I will speak English for 5 minutes today.",
        "textdich": ""
    },
    {
        "start": 3590.88,
        "end": 3600.72,
        "text": "This is easy. Anyone can do this. When something is easy, you do it every day.",
        "textdich": ""
    },
    {
        "start": 3597.76,
        "end": 3608.079,
        "text": "And when you do it every day, it becomes a habit. Some days you will feel lazy.",
        "textdich": ""
    },
    {
        "start": 3604.799,
        "end": 3621.28,
        "text": "Some days you will feel tired. Some days you will not want to speak. This is normal. On those days, speak for one minute. Even one sentence is okay. Do",
        "textdich": ""
    },
    {
        "start": 3619.04,
        "end": 3623.599,
        "text": "not break the habit.",
        "textdich": ""
    },
    {
        "start": 3621.28,
        "end": 3626.559,
        "text": "Keep the chain unbroken.",
        "textdich": ""
    },
    {
        "start": 3623.599,
        "end": 3629.68,
        "text": "Small action is better than no action.",
        "textdich": ""
    },
    {
        "start": 3626.559,
        "end": 3641.599,
        "text": "Speak slowly. Take your time. There is no hurry. English is not a race. English is a journey. When you speak slowly, you",
        "textdich": ""
    },
    {
        "start": 3637.28,
        "end": 3647.119,
        "text": "feel calm. When you feel calm, you speak better.",
        "textdich": ""
    },
    {
        "start": 3643.68,
        "end": 3650.64,
        "text": "Speed will come later.",
        "textdich": ""
    },
    {
        "start": 3647.119,
        "end": 3653.28,
        "text": "First focus on speaking.",
        "textdich": ""
    },
    {
        "start": 3650.64,
        "end": 3664.559,
        "text": "This chapter is about making speaking easy and possible. You do not need pressure. You do not need perfection.",
        "textdich": ""
    },
    {
        "start": 3660.48,
        "end": 3676.72,
        "text": "You need daily action, small action, simple action. When you practice speaking every day, English stops being scary. English becomes friendly.",
        "textdich": ""
    },
    {
        "start": 3674.24,
        "end": 3686.48,
        "text": "In the next chapter, we will talk about listening and copying English. You will learn how listening helps your speaking.",
        "textdich": ""
    },
    {
        "start": 3682.96,
        "end": 3698.88,
        "text": "Stay with me. You are moving forward step by step. Chapter 3. Listening, imitating and speaking like a real English user.",
        "textdich": ""
    },
    {
        "start": 3696.799,
        "end": 3708.48,
        "text": "Now let us talk about something very important. If you want to speak English better, you must listen to English every",
        "textdich": ""
    },
    {
        "start": 3705.04,
        "end": 3720.72,
        "text": "day. Many learners want to speak more but they forget listening. Speaking and listening are not separate. They work together. Good speakers are good",
        "textdich": ""
    },
    {
        "start": 3716.88,
        "end": 3723.839,
        "text": "listeners first. This is a simple truth.",
        "textdich": ""
    },
    {
        "start": 3720.72,
        "end": 3736.0,
        "text": "When you listen, your brain learns how English sounds. When your brain learns the sound, your mouth learns how to speak. Remember this line. Your mouth",
        "textdich": ""
    },
    {
        "start": 3733.599,
        "end": 3738.559,
        "text": "learns from your ears.",
        "textdich": ""
    },
    {
        "start": 3736.0,
        "end": 3752.0,
        "text": "If your ears listen to English every day, your mouth will slowly start speaking English naturally. But if your ears hear only your own language, your",
        "textdich": ""
    },
    {
        "start": 3748.079,
        "end": 3755.119,
        "text": "mouth will stay shy with English.",
        "textdich": ""
    },
    {
        "start": 3752.0,
        "end": 3767.52,
        "text": "Listening is the door. Speaking comes after. You do not need fast English. You do not need difficult English. Start with slow English videos.",
        "textdich": ""
    },
    {
        "start": 3764.72,
        "end": 3774.16,
        "text": "There are many slow English lessons, stories, and conversations made for beginners.",
        "textdich": ""
    },
    {
        "start": 3771.599,
        "end": 3784.24,
        "text": "Slow English helps you hear every word clearly. It helps you understand the sound. When English is slow, your brain",
        "textdich": ""
    },
    {
        "start": 3781.119,
        "end": 3789.92,
        "text": "feels relaxed. When your brain feels relaxed, learning becomes easy.",
        "textdich": ""
    },
    {
        "start": 3787.52,
        "end": 3796.4,
        "text": "Listening to simple English stories is also very powerful. Stories are natural.",
        "textdich": ""
    },
    {
        "start": 3793.52,
        "end": 3807.52,
        "text": "Stories are interesting. Stories keep your attention. When you listen to a story, you do not feel like you are studying. You feel like you are",
        "textdich": ""
    },
    {
        "start": 3804.24,
        "end": 3811.359,
        "text": "enjoying. This is very important.",
        "textdich": ""
    },
    {
        "start": 3807.52,
        "end": 3824.559,
        "text": "Enjoyment helps learning. Choose simple stories, short stories, stories with easy words. Listen again and again.",
        "textdich": ""
    },
    {
        "start": 3820.72,
        "end": 3835.839,
        "text": "Repetition is good. Do not worry if you do not understand everything. This is very important. Many learners stop listening because they want to",
        "textdich": ""
    },
    {
        "start": 3833.039,
        "end": 3847.839,
        "text": "understand every word. This is a mistake. Babies do not understand every word. Babies listen again and again.",
        "textdich": ""
    },
    {
        "start": 3843.839,
        "end": 3854.96,
        "text": "Slowly understanding comes. English learning is the same. Listen first.",
        "textdich": ""
    },
    {
        "start": 3851.599,
        "end": 3868.64,
        "text": "Understanding comes later. Now let us talk about repeating. Repeating is a bridge. Remember when you listen, try to repeat the words and sentences.",
        "textdich": ""
    },
    {
        "start": 3864.799,
        "end": 3872.559,
        "text": "Pause the video. Say the sentence again.",
        "textdich": ""
    },
    {
        "start": 3868.64,
        "end": 3875.28,
        "text": "Say it slowly. Say it clearly.",
        "textdich": ""
    },
    {
        "start": 3872.559,
        "end": 3884.4,
        "text": "This trains your mouth. This trains your tongue. This builds confidence. You do not need to repeat perfectly.",
        "textdich": ""
    },
    {
        "start": 3881.839,
        "end": 3890.16,
        "text": "You do not need to sound like a native speaker.",
        "textdich": ""
    },
    {
        "start": 3886.0,
        "end": 3897.92,
        "text": "Just try. That is enough. Every time you repeat, you get better.",
        "textdich": ""
    },
    {
        "start": 3892.96,
        "end": 3901.92,
        "text": "Even if you repeat wrong, it is okay.",
        "textdich": ""
    },
    {
        "start": 3897.92,
        "end": 3912.0,
        "text": "Remember, mistakes mean learning. One very powerful method is called shadowing. Do not worry about the name.",
        "textdich": ""
    },
    {
        "start": 3908.24,
        "end": 3918.0,
        "text": "The idea is very simple. Shadowing means you listen and speak at the same time.",
        "textdich": ""
    },
    {
        "start": 3915.359,
        "end": 3927.76,
        "text": "You play a sentence and you try to speak with the speaker. You do not stop the audio. You follow the voice like a",
        "textdich": ""
    },
    {
        "start": 3923.599,
        "end": 3934.079,
        "text": "shadow. At first, this feels difficult, but this method is very powerful.",
        "textdich": ""
    },
    {
        "start": 3930.559,
        "end": 3937.28,
        "text": "Shadowing helps your speaking speed.",
        "textdich": ""
    },
    {
        "start": 3934.079,
        "end": 3943.52,
        "text": "Shadowing helps your rhythm. Shadowing helps your pronunciation.",
        "textdich": ""
    },
    {
        "start": 3939.76,
        "end": 3949.2,
        "text": "When you shadow, you stop thinking. You start copying.",
        "textdich": ""
    },
    {
        "start": 3945.76,
        "end": 3960.0,
        "text": "This is very important. Speaking becomes natural. When thinking stops. Copying is not bad. Copying is learning. Babies",
        "textdich": ""
    },
    {
        "start": 3957.28,
        "end": 3973.76,
        "text": "copy their parents. Students copy teachers. English learners copy speakers. When you copy good English, your English becomes good. Copy",
        "textdich": ""
    },
    {
        "start": 3969.039,
        "end": 3977.52,
        "text": "pronunciation, copy rhythm, copy tone.",
        "textdich": ""
    },
    {
        "start": 3973.76,
        "end": 3988.4,
        "text": "Do not worry about grammar. Grammar will come later. Pronunciation does not mean sounding perfect. Pronunciation means",
        "textdich": ""
    },
    {
        "start": 3984.799,
        "end": 4002.079,
        "text": "being clear. Listen carefully to how words are said. Listen to stress. Listen to pauses. Listen to music in the sentence. English has music. When you",
        "textdich": ""
    },
    {
        "start": 3999.119,
        "end": 4009.839,
        "text": "copy the music, your English sounds better. Rhythm is also important.",
        "textdich": ""
    },
    {
        "start": 4006.0,
        "end": 4020.96,
        "text": "English has strong and weak sounds. When you listen often, your brain understands this naturally. You do not need rules.",
        "textdich": ""
    },
    {
        "start": 4016.96,
        "end": 4027.839,
        "text": "You need listening. Again, remember your mouth learns from your ears.",
        "textdich": ""
    },
    {
        "start": 4024.16,
        "end": 4029.92,
        "text": "Tone is how your voice goes up and down.",
        "textdich": ""
    },
    {
        "start": 4027.839,
        "end": 4032.16,
        "text": "Listen to questions.",
        "textdich": ""
    },
    {
        "start": 4029.92,
        "end": 4035.52,
        "text": "Listen to statements.",
        "textdich": ""
    },
    {
        "start": 4032.16,
        "end": 4048.16,
        "text": "Copy the voice movement. This makes your English sound real. This makes you feel like a real English user, not a student.",
        "textdich": ""
    },
    {
        "start": 4044.559,
        "end": 4051.599,
        "text": "Many learners feel shy to repeat loudly.",
        "textdich": ""
    },
    {
        "start": 4048.16,
        "end": 4054.799,
        "text": "They feel silly but this is normal.",
        "textdich": ""
    },
    {
        "start": 4051.599,
        "end": 4063.839,
        "text": "Speaking aloud is very important. Your mouth needs practice. Silent reading does not help speaking. Silent listening",
        "textdich": ""
    },
    {
        "start": 4060.96,
        "end": 4074.0,
        "text": "does not help speaking much. You must use your voice. Repeat simple sentences many times. For example, how are you?",
        "textdich": ""
    },
    {
        "start": 4071.839,
        "end": 4075.44,
        "text": "I am fine.",
        "textdich": ""
    },
    {
        "start": 4074.0,
        "end": 4078.079,
        "text": "Thank you.",
        "textdich": ""
    },
    {
        "start": 4075.44,
        "end": 4092.559,
        "text": "These sentences are common. These sentences are useful. When you repeat them often, they come naturally when you need them. Listen every day. Even 5",
        "textdich": ""
    },
    {
        "start": 4088.72,
        "end": 4095.68,
        "text": "minutes is enough. Listen while walking.",
        "textdich": ""
    },
    {
        "start": 4092.559,
        "end": 4108.239,
        "text": "Listen while resting. Listen before sleeping. Make English sound part of your life. Do not make it heavy. Do not make it stressful. Keep it light. Keep",
        "textdich": ""
    },
    {
        "start": 4106.239,
        "end": 4111.679,
        "text": "it simple.",
        "textdich": ""
    },
    {
        "start": 4108.239,
        "end": 4121.92,
        "text": "Here is another important idea. You do not need to understand everything to repeat. This is very important. Repeat",
        "textdich": ""
    },
    {
        "start": 4117.92,
        "end": 4130.08,
        "text": "first. Understanding will follow. Many learners wait to understand then repeat.",
        "textdich": ""
    },
    {
        "start": 4125.92,
        "end": 4136.799,
        "text": "This slows progress. Reverse it. Repeat first. Let your brain learn naturally.",
        "textdich": ""
    },
    {
        "start": 4133.759,
        "end": 4147.52,
        "text": "Think again about babies. Babies listen for months before speaking. They do not study grammar. They do not memorize",
        "textdich": ""
    },
    {
        "start": 4142.64,
        "end": 4159.52,
        "text": "words. They listen, they copy, then they speak. You can learn English the same way. This chapter is about becoming a real English user.",
        "textdich": ""
    },
    {
        "start": 4156.4,
        "end": 4170.719,
        "text": "Real English users listen, copy, and speak naturally. They do not think about rules all the time. They use English.",
        "textdich": ""
    },
    {
        "start": 4167.6,
        "end": 4175.679,
        "text": "You are learning to use English, not study English.",
        "textdich": ""
    },
    {
        "start": 4172.88,
        "end": 4183.44,
        "text": "In the next chapter, we will talk about words, sentences, and thinking in English.",
        "textdich": ""
    },
    {
        "start": 4180.799,
        "end": 4190.08,
        "text": "This will help you speak faster and easier.",
        "textdich": ""
    },
    {
        "start": 4185.199,
        "end": 4194.159,
        "text": "Stay with me. You are doing very well.",
        "textdich": ""
    },
    {
        "start": 4190.08,
        "end": 4200.56,
        "text": "Chapter 4 words, sentences and thinking in English every day.",
        "textdich": ""
    },
    {
        "start": 4197.92,
        "end": 4202.719,
        "text": "Now let us talk about words.",
        "textdich": ""
    },
    {
        "start": 4200.56,
        "end": 4211.76,
        "text": "Many English learners believe that speaking English means knowing thousands of words. They think they must memorize",
        "textdich": ""
    },
    {
        "start": 4208.719,
        "end": 4224.96,
        "text": "long word lists. They think they must know difficult words. This idea makes English feel heavy and stressful. But the truth is very simple. You do not",
        "textdich": ""
    },
    {
        "start": 4221.76,
        "end": 4234.8,
        "text": "need many words to start speaking. You need the right words. You need useful words and you need to use them every day.",
        "textdich": ""
    },
    {
        "start": 4232.32,
        "end": 4246.08,
        "text": "Learning English is not about collecting words. It is about using words. A small number of words used again and again can",
        "textdich": ""
    },
    {
        "start": 4242.96,
        "end": 4256.8,
        "text": "help you speak a lot. Think about your daily life. You use the same words every day. You talk about food. You talk about",
        "textdich": ""
    },
    {
        "start": 4253.6,
        "end": 4272.0,
        "text": "work. You talk about feelings. You talk about simple things. English is the same. Learn a few useful words every day. Not 20, not 50, just 3 to five",
        "textdich": ""
    },
    {
        "start": 4268.159,
        "end": 4285.36,
        "text": "words. This is enough. Choose words you can use. Words like eat, drink, go, come, like, want, happy, tired.",
        "textdich": ""
    },
    {
        "start": 4282.0,
        "end": 4295.76,
        "text": "These words are powerful. When you know how to use these words, you can say many things. When you learn a word, do not",
        "textdich": ""
    },
    {
        "start": 4292.0,
        "end": 4298.0,
        "text": "keep it alone. Put it in a sentence.",
        "textdich": ""
    },
    {
        "start": 4295.76,
        "end": 4300.88,
        "text": "Words need sentences.",
        "textdich": ""
    },
    {
        "start": 4298.0,
        "end": 4316.159,
        "text": "For example, if you learn the word happy, say I am happy. If you learn the word food, say I like food. Simple sentences are best. Do not make long",
        "textdich": ""
    },
    {
        "start": 4314.56,
        "end": 4319.36,
        "text": "sentences.",
        "textdich": ""
    },
    {
        "start": 4316.159,
        "end": 4329.199,
        "text": "Long sentences create fear. Short sentences create confidence. Say the sentence out loud. Use your voice.",
        "textdich": ""
    },
    {
        "start": 4325.92,
        "end": 4332.48,
        "text": "Repeat the sentence many times.",
        "textdich": ""
    },
    {
        "start": 4329.199,
        "end": 4335.12,
        "text": "This helps your mouth remember the word.",
        "textdich": ""
    },
    {
        "start": 4332.48,
        "end": 4345.199,
        "text": "This helps your brain connect the word with sound. Reading silently is not enough. Speaking is important.",
        "textdich": ""
    },
    {
        "start": 4343.44,
        "end": 4351.44,
        "text": "Now let us talk about thinking in English. This is a very powerful habit.",
        "textdich": ""
    },
    {
        "start": 4348.96,
        "end": 4362.32,
        "text": "Many learners think in their language and then translate into English. His makes speaking slow. This makes speaking",
        "textdich": ""
    },
    {
        "start": 4358.4,
        "end": 4372.0,
        "text": "hard. Translation is like carrying a heavy bag. It slows you down. Thinking in English removes the bag.",
        "textdich": ""
    },
    {
        "start": 4369.84,
        "end": 4375.92,
        "text": "Start thinking in English during your daily life.",
        "textdich": ""
    },
    {
        "start": 4373.92,
        "end": 4382.08,
        "text": "Start small, very small.",
        "textdich": ""
    },
    {
        "start": 4378.48,
        "end": 4386.8,
        "text": "When you see a chair, think this is a chair.",
        "textdich": ""
    },
    {
        "start": 4383.6,
        "end": 4391.92,
        "text": "When you see your phone, think this is my phone.",
        "textdich": ""
    },
    {
        "start": 4388.64,
        "end": 4396.64,
        "text": "When you drink water, think I am drinking water.",
        "textdich": ""
    },
    {
        "start": 4394.08,
        "end": 4406.48,
        "text": "These thoughts are simple, but they train your brain. English is everywhere around you if you allow it. Look around",
        "textdich": ""
    },
    {
        "start": 4402.56,
        "end": 4422.159,
        "text": "you now. There is a table. There is a door. There is a window. Name them in English. Table. door window. You are already thinking in English. This is",
        "textdich": ""
    },
    {
        "start": 4418.719,
        "end": 4428.8,
        "text": "learning. This is living English. Do this every day. Do not force yourself.",
        "textdich": ""
    },
    {
        "start": 4425.52,
        "end": 4439.92,
        "text": "Do not stress. Just notice things and name them. Chair, book, bag, food, water, phone.",
        "textdich": ""
    },
    {
        "start": 4437.12,
        "end": 4446.56,
        "text": "These are common words. When you repeat them every day, they become part of you.",
        "textdich": ""
    },
    {
        "start": 4443.6,
        "end": 4459.84,
        "text": "You can also think about actions. When you walk, think I am walking. When you sit, think I am sitting. When you eat,",
        "textdich": ""
    },
    {
        "start": 4455.44,
        "end": 4464.88,
        "text": "think I am eating. These sentences help you think in English naturally.",
        "textdich": ""
    },
    {
        "start": 4462.8,
        "end": 4467.28,
        "text": "Stop translating.",
        "textdich": ""
    },
    {
        "start": 4464.88,
        "end": 4470.239,
        "text": "This is very important.",
        "textdich": ""
    },
    {
        "start": 4467.28,
        "end": 4476.08,
        "text": "Translation is useful at the beginning but do not stay there.",
        "textdich": ""
    },
    {
        "start": 4472.8,
        "end": 4481.199,
        "text": "Slowly move to thinking directly in English.",
        "textdich": ""
    },
    {
        "start": 4477.679,
        "end": 4491.679,
        "text": "At first it feels strange. This is normal. Your brain is learning something new. With time it becomes natural.",
        "textdich": ""
    },
    {
        "start": 4489.6,
        "end": 4500.64,
        "text": "Do not worry about grammar when thinking. Thinking is free. Thinking is fast.",
        "textdich": ""
    },
    {
        "start": 4496.8,
        "end": 4503.12,
        "text": "Grammar comes later. Focus on meaning.",
        "textdich": ""
    },
    {
        "start": 4500.64,
        "end": 4505.92,
        "text": "Focus on message.",
        "textdich": ""
    },
    {
        "start": 4503.12,
        "end": 4513.199,
        "text": "Your brain understands meaning before rules. Use English in your daily life.",
        "textdich": ""
    },
    {
        "start": 4510.0,
        "end": 4522.0,
        "text": "Write small notes in English. Write your shopping list in English. Write reminders in English.",
        "textdich": ""
    },
    {
        "start": 4518.32,
        "end": 4525.52,
        "text": "This keeps English in your mind all day.",
        "textdich": ""
    },
    {
        "start": 4522.0,
        "end": 4527.76,
        "text": "English becomes part of your routine.",
        "textdich": ""
    },
    {
        "start": 4525.52,
        "end": 4540.159,
        "text": "Another good habit is talking about what you see. For example, you can say, \"I see a car. The car is red. I like this car.\"",
        "textdich": ""
    },
    {
        "start": 4537.52,
        "end": 4544.8,
        "text": "These sentences are simple, but they help you build confidence.",
        "textdich": ""
    },
    {
        "start": 4542.96,
        "end": 4554.96,
        "text": "Many learners feel they are not improving because they are not learning new words every day. But improvement is",
        "textdich": ""
    },
    {
        "start": 4550.8,
        "end": 4566.96,
        "text": "not only new words. Improvement is using old words better. When you can use the same words in many situations, your speaking becomes smooth.",
        "textdich": ""
    },
    {
        "start": 4564.32,
        "end": 4574.32,
        "text": "Living English means using English naturally, not studying it all the time.",
        "textdich": ""
    },
    {
        "start": 4571.199,
        "end": 4584.56,
        "text": "When English becomes part of your life, speaking becomes easy. You do not need to sit with a book all day.",
        "textdich": ""
    },
    {
        "start": 4580.719,
        "end": 4590.239,
        "text": "You do not need to memorize rules. You need to use English around you.",
        "textdich": ""
    },
    {
        "start": 4587.92,
        "end": 4605.28,
        "text": "This chapter is about a change in mindset. From learning English to living English. When you live English, you speak English slowly, naturally,",
        "textdich": ""
    },
    {
        "start": 4602.88,
        "end": 4607.92,
        "text": "confidently.",
        "textdich": ""
    },
    {
        "start": 4605.28,
        "end": 4620.719,
        "text": "In the next chapter, we will talk about mistakes, confidence, and speaking without fear. This will help you speak freely. Stay with me. You are doing",
        "textdich": ""
    },
    {
        "start": 4618.32,
        "end": 4622.8,
        "text": "amazing.",
        "textdich": ""
    },
    {
        "start": 4620.719,
        "end": 4630.88,
        "text": "Chapter 5, mistakes, confidence, and speaking without fear.",
        "textdich": ""
    },
    {
        "start": 4628.64,
        "end": 4644.56,
        "text": "Now we are going to talk about something very important. Something that many beginners worry about. Mistakes, fear, shyness. These are the main reasons",
        "textdich": ""
    },
    {
        "start": 4641.6,
        "end": 4656.32,
        "text": "people do not speak English. Many learners feel scared to open their mouth. They think, \"What if I say it wrong?\" or \"What if people laugh at me?\"",
        "textdich": ""
    },
    {
        "start": 4653.679,
        "end": 4669.04,
        "text": "These thoughts stop you. They make English feel impossible. But let me tell you a secret. Mistakes are not a problem. Mistakes are a gift. Mistakes",
        "textdich": ""
    },
    {
        "start": 4665.44,
        "end": 4675.12,
        "text": "are proof that you are trying. Yes, your mistakes are proof that you are trying.",
        "textdich": ""
    },
    {
        "start": 4672.4,
        "end": 4688.08,
        "text": "Every time you make a mistake, your brain is learning. Every mistake teaches you something new. Mistakes are your friends, not your enemies.",
        "textdich": ""
    },
    {
        "start": 4684.96,
        "end": 4697.52,
        "text": "You must understand this first. Everyone makes mistakes. Native speakers make mistakes. Teachers make mistakes. Even",
        "textdich": ""
    },
    {
        "start": 4695.04,
        "end": 4701.92,
        "text": "people who speak English everyday make mistakes.",
        "textdich": ""
    },
    {
        "start": 4699.04,
        "end": 4704.4,
        "text": "English is not about being perfect.",
        "textdich": ""
    },
    {
        "start": 4701.92,
        "end": 4708.4,
        "text": "English is about communicating.",
        "textdich": ""
    },
    {
        "start": 4704.4,
        "end": 4717.36,
        "text": "Perfection comes later. At first, it is more important to speak than to be correct. Speaking is the action.",
        "textdich": ""
    },
    {
        "start": 4714.32,
        "end": 4728.56,
        "text": "Mistakes are part of that action. When you speak, you move forward. When you stay silent because of fear, you stay in the same place.",
        "textdich": ""
    },
    {
        "start": 4726.32,
        "end": 4740.4,
        "text": "Many learners are shy because they compare themselves with others. They see someone who speaks well and think I will never be like them.",
        "textdich": ""
    },
    {
        "start": 4737.28,
        "end": 4744.88,
        "text": "This thinking is dangerous. It stops you.",
        "textdich": ""
    },
    {
        "start": 4741.44,
        "end": 4756.159,
        "text": "Stop comparing. Stop thinking you must be perfect. You do not need perfect English to start speaking. You need brave English. You need to open your",
        "textdich": ""
    },
    {
        "start": 4753.199,
        "end": 4759.28,
        "text": "mouth even if your sentence is short.",
        "textdich": ""
    },
    {
        "start": 4756.159,
        "end": 4764.0,
        "text": "Even if it is not perfect, even if you make mistakes.",
        "textdich": ""
    },
    {
        "start": 4761.28,
        "end": 4773.04,
        "text": "Brave English is more powerful than perfect English. Here is another very important idea.",
        "textdich": ""
    },
    {
        "start": 4769.28,
        "end": 4782.08,
        "text": "Fluency is more important than accuracy at the start. Fluency means speaking smoothly.",
        "textdich": ""
    },
    {
        "start": 4778.88,
        "end": 4793.28,
        "text": "Accuracy means speaking perfectly. At the beginning, fluency builds confidence. When you speak fluently, your brain and mouth work together.",
        "textdich": ""
    },
    {
        "start": 4790.08,
        "end": 4807.04,
        "text": "Words flow naturally. Mistakes happen, but you keep going. This is how real learning happens. When you focus only on being correct, you stop speaking.",
        "textdich": ""
    },
    {
        "start": 4803.28,
        "end": 4814.64,
        "text": "Silence becomes a habit. Remember, mistakes are learning. Silence is nothing.",
        "textdich": ""
    },
    {
        "start": 4811.6,
        "end": 4824.96,
        "text": "Speaking slowly is very helpful. Many learners feel nervous and try to speak fast. Fast speaking increases mistakes.",
        "textdich": ""
    },
    {
        "start": 4821.44,
        "end": 4838.8,
        "text": "Fast speaking increases fear. Speak slowly. Speak clearly. Give your brain time to think. Give your mouth time to form words. Slow speaking builds",
        "textdich": ""
    },
    {
        "start": 4835.76,
        "end": 4850.08,
        "text": "confidence. Slow speaking helps your sentences come out naturally. Later when you are comfortable, your speed will increase automatically.",
        "textdich": ""
    },
    {
        "start": 4847.36,
        "end": 4858.64,
        "text": "Let us repeat something important again and again. Don't stop. Don't hide.",
        "textdich": ""
    },
    {
        "start": 4854.88,
        "end": 4873.199,
        "text": "Speak. Say it in your mind. Say it aloud. Every time fear comes, say, \"Don't stop. Don't hide.\" Speak. This line is very powerful. It reminds your",
        "textdich": ""
    },
    {
        "start": 4870.56,
        "end": 4886.48,
        "text": "brain that action is more important than fear. You will feel nervous. That is normal. But take a deep breath. Open your mouth. Say something. Even one",
        "textdich": ""
    },
    {
        "start": 4884.239,
        "end": 4889.84,
        "text": "sentence is enough.",
        "textdich": ""
    },
    {
        "start": 4886.48,
        "end": 4898.0,
        "text": "Many beginners feel emotional fear. They feel nervous when someone asks them a simple question. They feel shy when they",
        "textdich": ""
    },
    {
        "start": 4895.199,
        "end": 4907.92,
        "text": "speak with friends or teachers. This is very natural. I want you to understand this. Fear is not a sign that you are",
        "textdich": ""
    },
    {
        "start": 4904.32,
        "end": 4919.52,
        "text": "bad at English. Fear is a sign that you care. Fear shows that you are trying something new. Embrace it. Do not run",
        "textdich": ""
    },
    {
        "start": 4915.199,
        "end": 4932.08,
        "text": "away. Do not hide. Speak even if your voice is small at first. Another powerful idea is that mistakes help your brain learn faster. When you make a",
        "textdich": ""
    },
    {
        "start": 4928.239,
        "end": 4942.719,
        "text": "mistake, your brain notices. Your brain says something is wrong here. I need to remember this. This is how learning",
        "textdich": ""
    },
    {
        "start": 4939.199,
        "end": 4947.76,
        "text": "works. Mistakes create stronger memory connections.",
        "textdich": ""
    },
    {
        "start": 4944.239,
        "end": 4955.679,
        "text": "Silence does not create memory. Only speaking, only trying creates learning.",
        "textdich": ""
    },
    {
        "start": 4951.92,
        "end": 4965.679,
        "text": "Every mistake is a step forward. You can practice confidence slowly. Speak to yourself in the mirror. Speak to your",
        "textdich": ""
    },
    {
        "start": 4961.679,
        "end": 4972.48,
        "text": "pets. Speak in empty rooms. Speak while walking. Speak while doing simple tasks.",
        "textdich": ""
    },
    {
        "start": 4969.84,
        "end": 4983.679,
        "text": "Your confidence grows when you see that nothing bad happens when you speak. No one laughs. No one judges. Mistakes",
        "textdich": ""
    },
    {
        "start": 4979.52,
        "end": 4996.719,
        "text": "happen. But the world does not stop. The more you practice, the braver you become. Remember, even small sentences are powerful.",
        "textdich": ""
    },
    {
        "start": 4992.08,
        "end": 5001.84,
        "text": "I am happy. I like tea. I am learning English.",
        "textdich": ""
    },
    {
        "start": 4998.32,
        "end": 5015.199,
        "text": "Speak them, repeat them, make mistakes, correct slowly. Your mouth and brain will learn together. Mistakes will feel normal. Fear will disappear.",
        "textdich": ""
    },
    {
        "start": 5011.92,
        "end": 5017.6,
        "text": "You will start to enjoy speaking.",
        "textdich": ""
    },
    {
        "start": 5015.199,
        "end": 5026.0,
        "text": "Confidence is built through repeated action. Confidence is not given.",
        "textdich": ""
    },
    {
        "start": 5021.52,
        "end": 5028.88,
        "text": "Confidence is earned by doing.",
        "textdich": ""
    },
    {
        "start": 5026.0,
        "end": 5032.88,
        "text": "So let us repeat one last important thought.",
        "textdich": ""
    },
    {
        "start": 5030.48,
        "end": 5037.679,
        "text": "Your mistakes are proof that you are trying.",
        "textdich": ""
    },
    {
        "start": 5034.56,
        "end": 5045.199,
        "text": "Every time you speak, every time you make a small mistake, you are growing.",
        "textdich": ""
    },
    {
        "start": 5041.6,
        "end": 5054.48,
        "text": "Every small step matters. Mistakes are not the end. Mistakes are the beginning of improvement. Don't stop. Don't hide.",
        "textdich": ""
    },
    {
        "start": 5052.96,
        "end": 5057.04,
        "text": "Speak.",
        "textdich": ""
    },
    {
        "start": 5054.48,
        "end": 5060.96,
        "text": "Even one sentence a day is better than silence.",
        "textdich": ""
    },
    {
        "start": 5058.56,
        "end": 5073.12,
        "text": "In the next chapter, we will put everything together. We will learn how to practice daily, improve step by step, and see real results.",
        "textdich": ""
    },
    {
        "start": 5070.159,
        "end": 5081.76,
        "text": "You will feel stronger. You will feel ready to speak English in real life.",
        "textdich": ""
    },
    {
        "start": 5077.28,
        "end": 5083.84,
        "text": "Stay with me. You are doing amazing.",
        "textdich": ""
    },
    {
        "start": 5081.76,
        "end": 5091.92,
        "text": "Your journey to confident English speaking is real and you are moving forward every day.",
        "textdich": ""
    },
    {
        "start": 5089.679,
        "end": 5095.04,
        "text": "Chapter six.",
        "textdich": ""
    },
    {
        "start": 5091.92,
        "end": 5100.96,
        "text": "Using English in real life and staying motivated forever.",
        "textdich": ""
    },
    {
        "start": 5097.52,
        "end": 5103.52,
        "text": "Now we have reached the final chapter.",
        "textdich": ""
    },
    {
        "start": 5100.96,
        "end": 5116.08,
        "text": "By this point you have learned many important things. You have learned how to overcome fear, practice speaking, listen and imitate, think in English,",
        "textdich": ""
    },
    {
        "start": 5113.04,
        "end": 5125.36,
        "text": "and handle mistakes with confidence. But learning does not stop here. The most important part of English is using it in",
        "textdich": ""
    },
    {
        "start": 5121.679,
        "end": 5137.76,
        "text": "real life. Real life practice is what turns knowledge into skill. Real life practice is what makes English natural. and real life practice keeps you",
        "textdich": ""
    },
    {
        "start": 5134.0,
        "end": 5143.52,
        "text": "motivated forever. First let us talk about using English in your daily life.",
        "textdich": ""
    },
    {
        "start": 5141.12,
        "end": 5154.159,
        "text": "English is not only for classrooms, videos or books. English is everywhere if you allow it. Start small. Speak to",
        "textdich": ""
    },
    {
        "start": 5150.88,
        "end": 5157.199,
        "text": "yourself in English about simple things.",
        "textdich": ""
    },
    {
        "start": 5154.159,
        "end": 5170.719,
        "text": "I am brushing my teeth. I am drinking water. I am cooking dinner. Speak out loud. Speak clearly. Use English while doing your daily activities.",
        "textdich": ""
    },
    {
        "start": 5167.76,
        "end": 5176.32,
        "text": "Slowly your mind will start thinking in English naturally.",
        "textdich": ""
    },
    {
        "start": 5173.04,
        "end": 5182.719,
        "text": "Small daily actions like this make a huge difference over time.",
        "textdich": ""
    },
    {
        "start": 5179.92,
        "end": 5191.52,
        "text": "Writing notes in English is another very helpful habit. You can write your shopping list in English. You can write",
        "textdich": ""
    },
    {
        "start": 5188.159,
        "end": 5200.88,
        "text": "reminders or tasks in English. You can write a diary in English. It does not need to be long or perfect.",
        "textdich": ""
    },
    {
        "start": 5197.28,
        "end": 5205.76,
        "text": "Just a few sentences are enough. Writing strengthens your vocabulary.",
        "textdich": ""
    },
    {
        "start": 5203.44,
        "end": 5210.159,
        "text": "Writing trains your brain to think in English.",
        "textdich": ""
    },
    {
        "start": 5207.36,
        "end": 5219.36,
        "text": "When you combine writing and speaking, your English improves faster than you think. Speaking with friends or online",
        "textdich": ""
    },
    {
        "start": 5215.84,
        "end": 5229.679,
        "text": "partners is also very important. Find people who want to learn English or speak English often. This could be a friend, a classmate, or a language",
        "textdich": ""
    },
    {
        "start": 5227.52,
        "end": 5232.48,
        "text": "partner online.",
        "textdich": ""
    },
    {
        "start": 5229.679,
        "end": 5235.679,
        "text": "Practice short conversations.",
        "textdich": ""
    },
    {
        "start": 5232.48,
        "end": 5244.88,
        "text": "Practice greetings. Practice questions and answers. Do not worry about mistakes. Do not worry about grammar.",
        "textdich": ""
    },
    {
        "start": 5241.84,
        "end": 5247.04,
        "text": "The goal is to use English naturally.",
        "textdich": ""
    },
    {
        "start": 5244.88,
        "end": 5259.04,
        "text": "Every small conversation adds confidence. Every small conversation makes speaking easier. Recording your voice is another simple but powerful",
        "textdich": ""
    },
    {
        "start": 5255.44,
        "end": 5270.639,
        "text": "technique. Speak about your day. Speak about your thoughts. Record yourself for just a few minutes. Listen to your voice. Notice where you can improve.",
        "textdich": ""
    },
    {
        "start": 5267.84,
        "end": 5276.88,
        "text": "Listen to your pronunciation, your intonation, your rhythm.",
        "textdich": ""
    },
    {
        "start": 5274.0,
        "end": 5286.719,
        "text": "This may feel strange at first, but recording helps you hear yourself like a teacher. It helps you notice mistakes",
        "textdich": ""
    },
    {
        "start": 5283.12,
        "end": 5293.04,
        "text": "and correct them. Over time, you will see progress. You will hear improvement.",
        "textdich": ""
    },
    {
        "start": 5290.88,
        "end": 5296.56,
        "text": "This is motivating.",
        "textdich": ""
    },
    {
        "start": 5293.04,
        "end": 5299.76,
        "text": "Setting small goals is very important.",
        "textdich": ""
    },
    {
        "start": 5296.56,
        "end": 5310.639,
        "text": "Big goals are useful, but they can feel heavy. Small goals are achievable and keep you motivated. For example, set a",
        "textdich": ""
    },
    {
        "start": 5306.8,
        "end": 5320.8,
        "text": "goal to learn three new words today or speak English for 5 minutes every day or write one sentence in English every morning.",
        "textdich": ""
    },
    {
        "start": 5318.08,
        "end": 5329.12,
        "text": "When you achieve these small goals, you feel proud. Small goals build consistency.",
        "textdich": ""
    },
    {
        "start": 5325.6,
        "end": 5339.6,
        "text": "Consistency builds fluency. Consistency builds confidence. Rewarding yourself is another key step. Learning English",
        "textdich": ""
    },
    {
        "start": 5335.28,
        "end": 5349.04,
        "text": "should be fun. Celebrate small wins. If you spoke English for 5 minutes every day for a week, reward yourself. If you",
        "textdich": ""
    },
    {
        "start": 5345.92,
        "end": 5360.48,
        "text": "learned 10 new words this month, reward yourself. Rewards can be simple. a treat, a small gift, or even a personal celebration.",
        "textdich": ""
    },
    {
        "start": 5357.92,
        "end": 5373.04,
        "text": "Rewarding yourself creates positive feelings about learning. It keeps you motivated for the long term. Being patient and consistent is the final most",
        "textdich": ""
    },
    {
        "start": 5369.679,
        "end": 5384.48,
        "text": "important habit. Learning English is a journey. It is not a race. Some days you will feel slow. Some days you will feel",
        "textdich": ""
    },
    {
        "start": 5379.92,
        "end": 5386.8,
        "text": "stuck. This is normal. Do not give up.",
        "textdich": ""
    },
    {
        "start": 5384.48,
        "end": 5390.4,
        "text": "Do not feel disappointed.",
        "textdich": ""
    },
    {
        "start": 5386.8,
        "end": 5404.4,
        "text": "Every small step counts. Every day of practice counts. With patience, your efforts build up. With consistency, your English improves naturally.",
        "textdich": ""
    },
    {
        "start": 5401.92,
        "end": 5410.88,
        "text": "Remember, learning English is like planting a tree. You water it every day.",
        "textdich": ""
    },
    {
        "start": 5407.92,
        "end": 5415.199,
        "text": "You cannot see growth in one day.",
        "textdich": ""
    },
    {
        "start": 5410.88,
        "end": 5428.159,
        "text": "But slowly the roots grow. Slowly the tree becomes strong. Slowly your English grows. Now imagine yourself in the future.",
        "textdich": ""
    },
    {
        "start": 5424.719,
        "end": 5430.96,
        "text": "You are speaking English confidently.",
        "textdich": ""
    },
    {
        "start": 5428.159,
        "end": 5439.52,
        "text": "You are communicating with friends, traveling to new countries or using English at work.",
        "textdich": ""
    },
    {
        "start": 5436.4,
        "end": 5445.679,
        "text": "This future is possible. Every small action you take today brings you closer.",
        "textdich": ""
    },
    {
        "start": 5442.639,
        "end": 5459.44,
        "text": "You are not starting from zero. You are already on the path. With daily practice, listening, thinking, speaking and using English, your fluency will",
        "textdich": ""
    },
    {
        "start": 5456.0,
        "end": 5462.239,
        "text": "grow step by step.",
        "textdich": ""
    },
    {
        "start": 5459.44,
        "end": 5465.6,
        "text": "Let me repeat this important idea.",
        "textdich": ""
    },
    {
        "start": 5462.239,
        "end": 5469.84,
        "text": "English is not a race. It is a journey.",
        "textdich": ""
    },
    {
        "start": 5465.6,
        "end": 5481.52,
        "text": "Enjoy every step. Celebrate every small win. Speak without fear. Listen without pressure. Think in English every day.",
        "textdich": ""
    },
    {
        "start": 5478.08,
        "end": 5489.36,
        "text": "Use English in daily life. Record your progress. Reward yourself. Be patient.",
        "textdich": ""
    },
    {
        "start": 5485.92,
        "end": 5502.48,
        "text": "Be consistent. When you do this, learning becomes fun. Learning becomes natural. Learning becomes a part of your life. You have learned a lot in this",
        "textdich": ""
    },
    {
        "start": 5499.36,
        "end": 5508.48,
        "text": "series. But learning English is not finished. It is a continuous journey.",
        "textdich": ""
    },
    {
        "start": 5506.56,
        "end": 5512.239,
        "text": "Take what you have learned and start today.",
        "textdich": ""
    },
    {
        "start": 5510.0,
        "end": 5515.6,
        "text": "Speak a few sentences.",
        "textdich": ""
    },
    {
        "start": 5512.239,
        "end": 5529.84,
        "text": "Listen to a short story. Write one sentence. Repeat a phrase. Use a new word. Every small step builds your confidence. Every small step brings you",
        "textdich": ""
    },
    {
        "start": 5526.96,
        "end": 5545.679,
        "text": "closer to fluent English. You are capable. You are strong. You are improving every day. So start now. Take action. Use English in your life.",
        "textdich": ""
    },
    {
        "start": 5542.56,
        "end": 5548.8,
        "text": "Remember the lessons from every chapter.",
        "textdich": ""
    },
    {
        "start": 5545.679,
        "end": 5562.32,
        "text": "Your mistakes are proof that you are trying. Your daily practice is your power. Your listening, repeating and thinking in English make you stronger.",
        "textdich": ""
    },
    {
        "start": 5558.239,
        "end": 5566.08,
        "text": "And most importantly, enjoy the journey.",
        "textdich": ""
    },
    {
        "start": 5562.32,
        "end": 5572.88,
        "text": "Feel proud of every small step. Keep moving forward. English is your skill.",
        "textdich": ""
    },
    {
        "start": 5570.0,
        "end": 5580.0,
        "text": "English is your friend. English is your journey. And this journey can last forever.",
        "textdich": ""
    },
    {
        "start": 5577.44,
        "end": 5590.239,
        "text": "Finally, if you enjoyed this series and want more simple and helpful English lessons, please subscribe to our channel, like this video if it helped",
        "textdich": ""
    },
    {
        "start": 5587.679,
        "end": 5598.639,
        "text": "you, and leave a comment to share your progress. I would love to hear how you are practicing English every day.",
        "textdich": ""
    },
    {
        "start": 5596.48,
        "end": 5604.719,
        "text": "Together we can speak English confidently, step by step, one day at a",
        "textdich": ""
    }
]