[
    {
        "start": 0.4,
        "end": 5.44,
        "text": "Mark, why are you wearing one sock?",
        "textdich": ""
    },
    {
        "start": 2.96,
        "end": 10.0,
        "text": " It's not fashion. It's tragedy. I lost the other sock  in your closet.",
        "textdich": ""
    },
    {
        "start": 7.68,
        "end": 12.32,
        "text": " No, in the washing machine. I think it ate it.",
        "textdich": ""
    },
    {
        "start": 10.88,
        "end": 14.32,
        "text": " Okay, what's your plan?",
        "textdich": ""
    },
    {
        "start": 12.32,
        "end": 16.56,
        "text": " I'm doing a healthy morning. No stress, positive mindset.",
        "textdich": ""
    },
    {
        "start": 15.2,
        "end": 19.359,
        "text": " Great. Then why are you whisper shouting?",
        "textdich": ""
    },
    {
        "start": 17.52,
        "end": 22.24,
        "text": " Because I'm running late, but I'm trying to be calm about it.",
        "textdich": ""
    },
    {
        "start": 20.4,
        "end": 25.199,
        "text": " You can't be calm and late at the same time.",
        "textdich": ""
    },
    {
        "start": 24.48,
        "end": 27.199,
        "text": " I'm heading out.",
        "textdich": ""
    },
    {
        "start": 25.199,
        "end": 28.96,
        "text": " Expression of the day. I'm running late.",
        "textdich": ""
    },
    {
        "start": 27.199,
        "end": 32.359,
        "text": " And do I have everything? because I definitely don't.",
        "textdich": ""
    },
    {
        "start": 33.92,
        "end": 39.92,
        "text": " Hello and welcome back to Speaking English Daily Dose.",
        "textdich": ""
    },
    {
        "start": 37.92,
        "end": 41.76,
        "text": " Hi everyone. We're so happy you're here with us today.",
        "textdich": ""
    },
    {
        "start": 40.879,
        "end": 46.079,
        "text": " I'm Sarah  and I'm Mark.",
        "textdich": ""
    },
    {
        "start": 43.04,
        "end": 48.399,
        "text": " This is a podcast style English lesson.",
        "textdich": ""
    },
    {
        "start": 46.079,
        "end": 51.28,
        "text": "Simple, calm, and real.",
        "textdich": ""
    },
    {
        "start": 48.399,
        "end": 58.719,
        "text": " We speak slowly, we repeat key phrases, and we help you practice English the way people actually use it in daily life. No",
        "textdich": ""
    },
    {
        "start": 56.32,
        "end": 62.079,
        "text": "pressure, just easy listening and speaking practice.",
        "textdich": ""
    },
    {
        "start": 60.0,
        "end": 69.04,
        "text": " If you enjoy this lesson, please like the video and subscribe. It really supports our channel. Today's topic is",
        "textdich": ""
    },
    {
        "start": 66.88,
        "end": 72.32,
        "text": "how to talk about your morning routine in English.",
        "textdich": ""
    },
    {
        "start": 70.08,
        "end": 79.52,
        "text": " We'll go through useful phrases step by step. Then you'll hear a natural conversation between us, like a real morning chat.",
        "textdich": ""
    },
    {
        "start": 77.04,
        "end": 88.96,
        "text": " We'll also act out a few short mini scenes so you can hear the phrases in context and copy them easily. All right, grab your tea or coffee, get",
        "textdich": ""
    },
    {
        "start": 86.96,
        "end": 90.64,
        "text": "comfortable, and let's begin.",
        "textdich": ""
    },
    {
        "start": 88.96,
        "end": 93.04,
        "text": " Sarah, good morning.",
        "textdich": ""
    },
    {
        "start": 90.64,
        "end": 100.64,
        "text": " Good morning, Sarah. Wait, is it actually morning or is this one of those fake mornings where it's dark and everyone is sad?",
        "textdich": ""
    },
    {
        "start": 98.079,
        "end": 104.159,
        "text": " It's real morning. We're filming early today.",
        "textdich": ""
    },
    {
        "start": 101.439,
        "end": 111.36,
        "text": " Wow. Then I deserve a medal and maybe a parade. I'm awake, but my brain is still loading. It's buffering like slow Wi-Fi.",
        "textdich": ""
    },
    {
        "start": 109.84,
        "end": 113.92,
        "text": " Did you have breakfast?",
        "textdich": ""
    },
    {
        "start": 111.36,
        "end": 119.6,
        "text": " I tried. I opened the fridge and just stared at it like it was going to give me motivation. The fridge stared back.",
        "textdich": ""
    },
    {
        "start": 118.399,
        "end": 122.96,
        "text": "Very rude.",
        "textdich": ""
    },
    {
        "start": 119.6,
        "end": 125.119,
        "text": " That's not breakfast. That's confusion.",
        "textdich": ""
    },
    {
        "start": 122.96,
        "end": 128.8,
        "text": " I had water. Does that count?",
        "textdich": ""
    },
    {
        "start": 125.119,
        "end": 130.959,
        "text": " It counts as survival, not breakfast.",
        "textdich": ""
    },
    {
        "start": 128.8,
        "end": 140.0,
        "text": " Okay. Okay. But honestly, my morning routine decides my whole day. If I start messy, my day becomes a chaos documentary.",
        "textdich": ""
    },
    {
        "start": 137.2,
        "end": 149.36,
        "text": " Exactly. And that's why today's lesson is so useful. We'll help you talk about your morning routine step by step.",
        "textdich": ""
    },
    {
        "start": 145.52,
        "end": 152.72,
        "text": "First, next, then, after that, and finally.",
        "textdich": ""
    },
    {
        "start": 150.08,
        "end": 158.239,
        "text": " And we'll keep it simple. Real phrases, real English, the kind you can use tomorrow morning.",
        "textdich": ""
    },
    {
        "start": 156.0,
        "end": 162.48,
        "text": " Perfect. Let's start with the first moment of the day, waking up.",
        "textdich": ""
    },
    {
        "start": 160.48,
        "end": 165.2,
        "text": " The hardest moment of the day.",
        "textdich": ""
    },
    {
        "start": 162.48,
        "end": 170.319,
        "text": " Let's start right at the beginning.",
        "textdich": ""
    },
    {
        "start": 165.2,
        "end": 178.64,
        "text": "Waking up. My favorite part and also my enemy. I love sleep, but mornings act like I did something wrong.",
        "textdich": ""
    },
    {
        "start": 175.44,
        "end": 186.64,
        "text": " That is such a real feeling. And if you want to talk about your morning routine in English, this is the first place to",
        "textdich": ""
    },
    {
        "start": 183.519,
        "end": 193.68,
        "text": "start. You can say, \"My alarm goes off at 7,\" which means it starts ringing.",
        "textdich": ""
    },
    {
        "start": 189.92,
        "end": 199.76,
        "text": "You can also say, \"My alarm rings at 7.\" Both are common and both sound natural.",
        "textdich": ""
    },
    {
        "start": 196.8,
        "end": 206.0,
        "text": " Mine goes off at 72, but it feels personal, like my alarm is angry at me.",
        "textdich": ""
    },
    {
        "start": 203.04,
        "end": 215.84,
        "text": " And after the alarm, you can say, I wake up at 7. That means your eyes are open and your brain starts working.",
        "textdich": ""
    },
    {
        "start": 211.68,
        "end": 223.04,
        "text": " Then you can say, I get up at 710. This is very useful because wake up and get up are not the same.",
        "textdich": ""
    },
    {
        "start": 220.159,
        "end": 228.72,
        "text": " Okay? I always hear both and I always mix them up. What's the difference again?",
        "textdich": ""
    },
    {
        "start": 225.599,
        "end": 230.72,
        "text": " Easy. Wake up means your mind is awake.",
        "textdich": ""
    },
    {
        "start": 228.72,
        "end": 242.4,
        "text": "You're not sleeping anymore, but you might still be lying in bed. Get up means you actually leave the bed. You sit up, stand up, and start your day.",
        "textdich": ""
    },
    {
        "start": 238.879,
        "end": 247.92,
        "text": " So, I can honestly say, I wake up at 7, but I get up at 7:45. That's not a lie.",
        "textdich": ""
    },
    {
        "start": 246.08,
        "end": 250.72,
        "text": "That's just my lifestyle.",
        "textdich": ""
    },
    {
        "start": 247.92,
        "end": 259.28,
        "text": " Exactly. And sometimes people say, \"I get out of bed,\" which means the same as get up. It's a very common phrase.",
        "textdich": ""
    },
    {
        "start": 256.479,
        "end": 268.24,
        "text": "Another phrase you can use is I turn off my alarm. And if you want more sleep, you can say, \"I hit the snooze button.\"",
        "textdich": ""
    },
    {
        "start": 265.36,
        "end": 276.16,
        "text": "Snooze is my best friend. Sometimes I hit snooze so many times, my alarm should just give up and move out. That",
        "textdich": ""
    },
    {
        "start": 273.04,
        "end": 282.08,
        "text": "happens to so many people. Now after you wake up you can describe how you feel.",
        "textdich": ""
    },
    {
        "start": 278.8,
        "end": 291.44,
        "text": "You can say I feel tired which is simple and very normal. You can also say I feel groggy. Groggy means your brain feels",
        "textdich": ""
    },
    {
        "start": 288.32,
        "end": 296.0,
        "text": "slow and heavy like you're awake but not fully awake.",
        "textdich": ""
    },
    {
        "start": 293.04,
        "end": 303.44,
        "text": " Yes, that's me. I feel groggy until I see food or until I hear someone say there's coffee.",
        "textdich": ""
    },
    {
        "start": 300.4,
        "end": 310.72,
        "text": " And on a good day you can say I feel refreshed. Refreshed means you slept well and you feel like you have new",
        "textdich": ""
    },
    {
        "start": 308.32,
        "end": 315.28,
        "text": "energy. It's a great word to describe a good morning.",
        "textdich": ""
    },
    {
        "start": 311.919,
        "end": 323.039,
        "text": " I want to feel refreshed every day, but my pillow and I have a strong relationship. It's hard to leave.",
        "textdich": ""
    },
    {
        "start": 320.0,
        "end": 330.479,
        "text": " Totally fair. But the good news is now you have the English phrases to explain it clearly, like a real conversation.",
        "textdich": ""
    },
    {
        "start": 328.0,
        "end": 337.12,
        "text": "Okay, let's move to the next part of the morning. Topic two, the bathroom.",
        "textdich": ""
    },
    {
        "start": 334.08,
        "end": 345.12,
        "text": "Yes, the place where I suddenly remember everything I forgot to do. Like I'll be brushing my teeth and my brain goes, \"By",
        "textdich": ""
    },
    {
        "start": 342.4,
        "end": 354.24,
        "text": "the way, you have 10 responsibilities today.\" That is so real. And the bathroom part of your routine is also one of the easiest parts to describe in",
        "textdich": ""
    },
    {
        "start": 352.16,
        "end": 363.28,
        "text": "English because the phrases are simple and very common. You can start with, \"I go to the bathroom.\" That's the basic sentence and it works in every",
        "textdich": ""
    },
    {
        "start": 360.72,
        "end": 372.24,
        "text": "situation. For a lot of people, it's the first thing they do, like no talking, no thinking, just straight to the bathroom.",
        "textdich": ""
    },
    {
        "start": 369.039,
        "end": 379.44,
        "text": " Exactly. Then you can say, \"I wash my face.\" Some people add details like, \"I wash my face with cold water.\" Because",
        "textdich": ""
    },
    {
        "start": 377.039,
        "end": 387.6,
        "text": "cold water helps you wake up. After that, a very important one is, \"I brush my teeth.\" This phrase is super common",
        "textdich": ""
    },
    {
        "start": 385.039,
        "end": 395.52,
        "text": "and you'll use it all the time. I brush my teeth and I try to look confident, but I'm still half asleep.",
        "textdich": ""
    },
    {
        "start": 392.8,
        "end": 397.039,
        "text": " And then you can say, I rinse my mouth.",
        "textdich": ""
    },
    {
        "start": 395.52,
        "end": 404.4,
        "text": "That means you wash your mouth with water after brushing. It's a small phrase, but it makes your English sound more natural because it shows the full",
        "textdich": ""
    },
    {
        "start": 403.36,
        "end": 406.08,
        "text": "routine.",
        "textdich": ""
    },
    {
        "start": 404.4,
        "end": 413.28,
        "text": " Right. Because if I don't rinse my mouth, my toothpaste is still having a meeting in my mouth.",
        "textdich": ""
    },
    {
        "start": 409.919,
        "end": 416.319,
        "text": " Exactly. Then we have shower phrases.",
        "textdich": ""
    },
    {
        "start": 413.28,
        "end": 423.36,
        "text": "You can say I take a shower or I have a shower. Both are correct. Take a shower is more common in American English and",
        "textdich": ""
    },
    {
        "start": 421.28,
        "end": 428.16,
        "text": "have a shower is more common in British English, but both sound normal.",
        "textdich": ""
    },
    {
        "start": 425.599,
        "end": 432.72,
        "text": " I take a shower and that's when I become a real human being.",
        "textdich": ""
    },
    {
        "start": 430.24,
        "end": 441.36,
        "text": " And after the shower, you can say I dry off with a towel. Dry off means you remove the water from your body. Then",
        "textdich": ""
    },
    {
        "start": 438.08,
        "end": 446.96,
        "text": "comes hair. You can say, \"I comb my hair or I brush my hair.\" Both are fine for daily conversation.",
        "textdich": ""
    },
    {
        "start": 445.039,
        "end": 454.08,
        "text": " \"My hair in the morning looks like it had a stressful night of its own.\"  And if you want to put your hair up, you",
        "textdich": ""
    },
    {
        "start": 451.44,
        "end": 459.52,
        "text": "can say, \"I tie my hair up.\" That's a really useful phrase, especially when you're getting ready quickly.",
        "textdich": ""
    },
    {
        "start": 457.44,
        "end": 469.52,
        "text": " Sometimes I look in the mirror and say, \"We can do this.\"  And honestly, that is great English and great motivation. You can even add,",
        "textdich": ""
    },
    {
        "start": 466.0,
        "end": 471.12,
        "text": "\"Okay, let's go.\" or one step at a time.",
        "textdich": ""
    },
    {
        "start": 469.52,
        "end": 480.879,
        "text": "Simple phrases, but they make your morning feel a little easier. Now, let's move to topic three, getting dressed.",
        "textdich": ""
    },
    {
        "start": 477.68,
        "end": 487.84,
        "text": " The daily fashion drama. Every morning feels like a mini show called What Am I Doing With My Life?",
        "textdich": ""
    },
    {
        "start": 485.039,
        "end": 495.52,
        "text": " Honestly, it really does. And this part is great for English practice because the phrases are simple, but you can use",
        "textdich": ""
    },
    {
        "start": 492.4,
        "end": 504.879,
        "text": "them in so many ways. The most basic one is I get dressed. It means you put on your clothes and you're ready to leave your room or your house.",
        "textdich": ""
    },
    {
        "start": 501.919,
        "end": 511.36,
        "text": " I get dressed and then I change my mind and then I get dressed again. That's my routine.",
        "textdich": ""
    },
    {
        "start": 508.0,
        "end": 517.839,
        "text": " That's very normal. You can also say I choose my clothes, which is the decision part. It's when you look at your clothes",
        "textdich": ""
    },
    {
        "start": 515.76,
        "end": 528.88,
        "text": "and pick what you want to wear. Another common phrase is I pick out a shirt and pants. Pick out means choose, usually by looking and deciding.",
        "textdich": ""
    },
    {
        "start": 526.56,
        "end": 535.44,
        "text": " Sometimes I pick out a shirt and pants and I feel confident and then I see a photo of myself and I'm like, \"Nope.\"",
        "textdich": ""
    },
    {
        "start": 533.36,
        "end": 544.16,
        "text": "And after you choose, you can talk about the action. You can say, \"I put on my socks. I put on my shoes. And I put on a",
        "textdich": ""
    },
    {
        "start": 541.36,
        "end": 551.12,
        "text": "jacket.\" Put on is one of the most useful morning verbs because you can use it with almost any clothing item.",
        "textdich": ""
    },
    {
        "start": 548.8,
        "end": 557.36,
        "text": " Put on socks. Put on shoes. put on jacket and then forget where I put my brain.",
        "textdich": ""
    },
    {
        "start": 554.24,
        "end": 564.56,
        "text": " Exactly. And sometimes the hardest part isn't putting on the clothes, it's choosing them. If you feel unsure, you",
        "textdich": ""
    },
    {
        "start": 561.92,
        "end": 571.36,
        "text": "can say, \"I don't know what to wear.\" That sentence is perfect, simple, and very natural.",
        "textdich": ""
    },
    {
        "start": 568.88,
        "end": 580.32,
        "text": " Yes. And some mornings I stand there for 5 minutes just staring. Then I say, \"I have nothing to wear while standing in front of 50 shirts.\"",
        "textdich": ""
    },
    {
        "start": 577.68,
        "end": 582.72,
        "text": " That is the most common human problem.",
        "textdich": ""
    },
    {
        "start": 580.32,
        "end": 594.0,
        "text": "And you can also add small details to sound more natural like I can't decide or everything looks the same today or I want something comfortable.",
        "textdich": ""
    },
    {
        "start": 591.6,
        "end": 599.2,
        "text": " I always want something comfortable. My style is called I want to survive the day.",
        "textdich": ""
    },
    {
        "start": 597.279,
        "end": 606.48,
        "text": " And that's great English too because it's real life. The goal is to use these phrases in your own routine so you can",
        "textdich": ""
    },
    {
        "start": 604.48,
        "end": 616.88,
        "text": "describe your morning easily and confidently. Okay. Now topic four, breakfast,  my love language. If breakfast is good,",
        "textdich": ""
    },
    {
        "start": 614.72,
        "end": 622.48,
        "text": "my mood is good. If breakfast is missing, I become a little dramatic.",
        "textdich": ""
    },
    {
        "start": 620.0,
        "end": 629.6,
        "text": " Breakfast is a big part of many people's mornings, and it's also a perfect topic for everyday English. The first simple",
        "textdich": ""
    },
    {
        "start": 626.8,
        "end": 637.6,
        "text": "phrase is, \"I'm hungry.\" You can say it the moment you wake up or when you walk into the kitchen or even at work when you're thinking about food.",
        "textdich": ""
    },
    {
        "start": 635.36,
        "end": 644.48,
        "text": " I say it like it's an announcement. Good morning. I'm hungry like everyone needs to know.",
        "textdich": ""
    },
    {
        "start": 641.44,
        "end": 649.519,
        "text": " Then you can say I make breakfast. That means you prepare food in the morning.",
        "textdich": ""
    },
    {
        "start": 646.64,
        "end": 657.6,
        "text": "Some days breakfast is calm and slow and some days it's very fast. And if you don't eat breakfast, you can say I skip breakfast.",
        "textdich": ""
    },
    {
        "start": 655.6,
        "end": 666.32,
        "text": " Skipping breakfast sounds so healthy when you say it like that. But sometimes it's not a choice. Sometimes life just happens.",
        "textdich": ""
    },
    {
        "start": 663.44,
        "end": 675.04,
        "text": " Exactly. If you're busy, you can say, \"I don't have time for breakfast.\" Or you can say something like, \"I grab a banana.\" Grab means take quickly,",
        "textdich": ""
    },
    {
        "start": 672.8,
        "end": 677.839,
        "text": "usually because you're in a rush.",
        "textdich": ""
    },
    {
        "start": 675.04,
        "end": 683.279,
        "text": " Yes, I grab a banana, grab my bag, grab my phone, and I grab my dignity on the way out.",
        "textdich": ""
    },
    {
        "start": 681.12,
        "end": 692.64,
        "text": " And of course, drinks are very common in the morning. You can say, \"I make coffee.\" Or, \"I make tea.\" These are simple, but they sound very natural.",
        "textdich": ""
    },
    {
        "start": 690.32,
        "end": 698.16,
        "text": "Then for food, you can say, \"I make toast.\" I eat cereal or I cook eggs.",
        "textdich": ""
    },
    {
        "start": 696.56,
        "end": 701.76,
        "text": "These are great because they're common in many homes.",
        "textdich": ""
    },
    {
        "start": 699.839,
        "end": 708.079,
        "text": " I cook eggs when I want to feel like I have my life together. It's like, look at me. I'm an adult.",
        "textdich": ""
    },
    {
        "start": 705.68,
        "end": 716.16,
        "text": " And if you eat with family, you can say, I set the table. That means you put plates, cups, and utensils on the table before eating.",
        "textdich": ""
    },
    {
        "start": 714.079,
        "end": 720.24,
        "text": " I set the table and then I eat like I haven't eaten in 3 days.",
        "textdich": ""
    },
    {
        "start": 718.399,
        "end": 727.12,
        "text": " And after breakfast, you can talk about cleaning up. You can say, \"I wash my cup.\" Or, \"I load the dishwasher.\" Load",
        "textdich": ""
    },
    {
        "start": 725.279,
        "end": 731.92,
        "text": "the dishwasher means you put the dirty dishes inside the machine.",
        "textdich": ""
    },
    {
        "start": 729.279,
        "end": 735.76,
        "text": " I don't skip breakfast. Breakfast skips me sometimes.",
        "textdich": ""
    },
    {
        "start": 733.519,
        "end": 744.32,
        "text": " And that means I don't have time for breakfast. Very real, very common. And now you have the English for it. All",
        "textdich": ""
    },
    {
        "start": 740.72,
        "end": 748.88,
        "text": "right. Now, topic five, the final steps before leaving the house.",
        "textdich": ""
    },
    {
        "start": 746.399,
        "end": 753.92,
        "text": " The panic zone. This is where my morning routine turns into an action movie.",
        "textdich": ""
    },
    {
        "start": 751.44,
        "end": 761.12,
        "text": "Everything is fast, loud, and slightly stressful. And this part is so important because these are the phrases you use",
        "textdich": ""
    },
    {
        "start": 759.12,
        "end": 770.72,
        "text": "when you're in a rush. Let's start simple. You can say, \"I pack my bag.\" That means you put the things you need inside your bag before you leave. It",
        "textdich": ""
    },
    {
        "start": 768.399,
        "end": 776.8,
        "text": "could be your laptop, your lunch, your notebook, or anything you need for your day.",
        "textdich": ""
    },
    {
        "start": 774.32,
        "end": 784.48,
        "text": " Yes. and I pack my bag like I'm going on a journey. Then I open it again because I forgot something. And right after",
        "textdich": ""
    },
    {
        "start": 781.519,
        "end": 794.88,
        "text": "that, a very common sentence is, \"I check my wallet, keys, and phone.\" This is such a real life phrase because people say it all the time. You can also",
        "textdich": ""
    },
    {
        "start": 792.0,
        "end": 800.079,
        "text": "say, \"I check my bag.\" Or, \"I check my pockets,\" depending on where you keep your things.",
        "textdich": ""
    },
    {
        "start": 798.16,
        "end": 807.279,
        "text": " Every morning I do the phone, wallet, keys dance. I top my pockets like I'm doing a small performance.",
        "textdich": ""
    },
    {
        "start": 804.639,
        "end": 816.8,
        "text": "Exactly. And sometimes you suddenly panic and you say, \"I can't find my keys.\" This is one of the most useful sentences because it happens to",
        "textdich": ""
    },
    {
        "start": 814.16,
        "end": 827.6,
        "text": "everyone. You can also say, \"Where are my keys?\" or \"Has anyone seen my keys?\"  And the worst part is sometimes the keys are literally in my hand.",
        "textdich": ""
    },
    {
        "start": 825.279,
        "end": 834.56,
        "text": " That's the most common thing. Now, another important step before leaving is checking the weather. You can say, \"I",
        "textdich": ""
    },
    {
        "start": 832.32,
        "end": 842.0,
        "text": "check the weather.\" Then you can add, it's raining, or it looks cold today, or it's really sunny.",
        "textdich": ""
    },
    {
        "start": 840.079,
        "end": 848.32,
        "text": " I check the weather and still make the wrong choice. I go out wearing a hoodie and the sun attacks me.",
        "textdich": ""
    },
    {
        "start": 845.92,
        "end": 853.68,
        "text": " And if it's raining, you can say, I need an umbrella. Simple and very practical.",
        "textdich": ""
    },
    {
        "start": 851.68,
        "end": 862.639,
        "text": "Then, right before you step out, you can say, \"I lock the door.\" That's an important phrase because it's part of your routine, and it's also something",
        "textdich": ""
    },
    {
        "start": 860.0,
        "end": 864.399,
        "text": "you really don't want to forget.",
        "textdich": ""
    },
    {
        "start": 862.639,
        "end": 869.76,
        "text": "Yes, because if I forget to lock the door, I'll think about it all day.",
        "textdich": ""
    },
    {
        "start": 867.04,
        "end": 878.72,
        "text": " And finally, you can say, I leave for work or I leave for school. If you want to sound extra natural, you can also say, I'm heading out.",
        "textdich": ""
    },
    {
        "start": 877.04,
        "end": 883.76,
        "text": " I like I'm heading out. It sounds responsible even if I'm running late.",
        "textdich": ""
    },
    {
        "start": 881.199,
        "end": 890.24,
        "text": " Exactly. And the perfect question to ask yourself in this moment is, do I have everything?",
        "textdich": ""
    },
    {
        "start": 887.76,
        "end": 899.44,
        "text": " That phrase saves lives or at least it saves mornings. Now we'll practice through scenes in different situations.",
        "textdich": ""
    },
    {
        "start": 895.6,
        "end": 902.24,
        "text": "Scene one, the tech problem morning.",
        "textdich": ""
    },
    {
        "start": 899.44,
        "end": 907.6,
        "text": "Mark, why do you look so stressed? You look like you just ran a marathon.",
        "textdich": ""
    },
    {
        "start": 904.399,
        "end": 913.36,
        "text": " Worse, my alarm didn't ring. My phone updated overnight and it decided my morning needed a surprise.",
        "textdich": ""
    },
    {
        "start": 911.36,
        "end": 924.0,
        "text": " Oh no. So you  I overslept. I opened my eyes and my brain went, \"This is not the time you planned. I sat up so fast I scared myself.",
        "textdich": ""
    },
    {
        "start": 921.44,
        "end": 926.959,
        "text": " Okay, perfect phrase here. I'm running late.",
        "textdich": ""
    },
    {
        "start": 924.8,
        "end": 934.88,
        "text": " I'm running late. I'm running late. I need to hurry up. I swear I moved like a cartoon character. I was brushing my teeth while walking.",
        "textdich": ""
    },
    {
        "start": 933.199,
        "end": 937.04,
        "text": " What did you do next?",
        "textdich": ""
    },
    {
        "start": 934.88,
        "end": 945.199,
        "text": " I rushed to the bathroom, washed my face, brushed my teeth in like 20 seconds, and then I forgot to rinse. So, I walked out tasting toothpaste and",
        "textdich": ""
    },
    {
        "start": 944.079,
        "end": 948.24,
        "text": "regret.",
        "textdich": ""
    },
    {
        "start": 945.199,
        "end": 950.56,
        "text": " That is scary. That's not fresh breath.",
        "textdich": ""
    },
    {
        "start": 948.24,
        "end": 953.04,
        "text": "That's a chemical situation.",
        "textdich": ""
    },
    {
        "start": 950.56,
        "end": 961.6,
        "text": " Exactly. Then I got dressed and I thought, \"Wow, I'm doing great.\" Then I looked in the mirror. My shirt was inside out.",
        "textdich": ""
    },
    {
        "start": 958.48,
        "end": 963.6,
        "text": " Classic. Did you eat breakfast at least?",
        "textdich": ""
    },
    {
        "start": 961.6,
        "end": 971.6,
        "text": " I grabbed a biscuit and called it a meal. I didn't make coffee. I just looked at the coffee jar for emotional support.",
        "textdich": ""
    },
    {
        "start": 968.72,
        "end": 979.199,
        "text": " And the final step before leaving? I locked the door, took two steps, came back because I forgot my keys, and then",
        "textdich": ""
    },
    {
        "start": 977.12,
        "end": 984.48,
        "text": "realized the keys were literally in my hand the whole time.",
        "textdich": ""
    },
    {
        "start": 981.12,
        "end": 988.399,
        "text": " So, the lesson is technology is helpful until it isn't.",
        "textdich": ""
    },
    {
        "start": 986.0,
        "end": 993.6,
        "text": " Exactly. And my morning routine depends on my phone behaving.",
        "textdich": ""
    },
    {
        "start": 990.399,
        "end": 1001.279,
        "text": " Scene two, the healthy morning experiment. Mark, you look calm today.",
        "textdich": ""
    },
    {
        "start": 997.519,
        "end": 1003.92,
        "text": "Like suspiciously calm. Are you okay?",
        "textdich": ""
    },
    {
        "start": 1001.279,
        "end": 1008.72,
        "text": " I know. I look different. I tried a healthy morning.",
        "textdich": ""
    },
    {
        "start": 1005.279,
        "end": 1012.56,
        "text": " A healthy morning? Who are you? And what did you do with Mark?",
        "textdich": ""
    },
    {
        "start": 1010.56,
        "end": 1023.68,
        "text": " Don't worry, it's still me. I just decided to test something. I woke up and instead of hitting snooze five times, I actually got up right away.",
        "textdich": ""
    },
    {
        "start": 1020.399,
        "end": 1026.799,
        "text": " Wow, that's already a miracle.",
        "textdich": ""
    },
    {
        "start": 1023.68,
        "end": 1037.6,
        "text": " I know. I opened the window, took a deep breath, and I told myself, \"Okay, today will be a smooth day.\" It felt very dramatic, but it worked.",
        "textdich": ""
    },
    {
        "start": 1034.64,
        "end": 1039.76,
        "text": " Honestly, I love that. Then what?",
        "textdich": ""
    },
    {
        "start": 1037.6,
        "end": 1046.24,
        "text": " Then I went to the bathroom, washed my face, brushed my teeth like a normal person, and took a quick shower. Not a",
        "textdich": ""
    },
    {
        "start": 1044.48,
        "end": 1051.12,
        "text": "long shower where I think about my entire life. A quick one.",
        "textdich": ""
    },
    {
        "start": 1048.319,
        "end": 1062.24,
        "text": " That is progress. And you didn't look stressed once. Exactly. After that, I made tea instead of coffee. I wanted to feel calm, not powerful.",
        "textdich": ""
    },
    {
        "start": 1059.52,
        "end": 1065.919,
        "text": " Okay, wellness king. What about breakfast?",
        "textdich": ""
    },
    {
        "start": 1063.36,
        "end": 1069.039,
        "text": " I actually made toast and ate fruit.",
        "textdich": ""
    },
    {
        "start": 1065.919,
        "end": 1074.08,
        "text": "Real breakfast, not water and hope. I even sat down while eating like I had time.",
        "textdich": ""
    },
    {
        "start": 1071.76,
        "end": 1076.72,
        "text": " I'm genuinely impressed.",
        "textdich": ""
    },
    {
        "start": 1074.08,
        "end": 1086.559,
        "text": " And the biggest surprise, I checked the weather before leaving. I saw it was cold, so I put on a jacket. No suffering, no regret.",
        "textdich": ""
    },
    {
        "start": 1083.039,
        "end": 1090.08,
        "text": " So this means a smooth morning.",
        "textdich": ""
    },
    {
        "start": 1086.559,
        "end": 1094.16,
        "text": " Yes, smooth, peaceful, responsible. But don't worry, I still lost one sock.",
        "textdich": ""
    },
    {
        "start": 1092.64,
        "end": 1097.2,
        "text": "Balance is important.",
        "textdich": ""
    },
    {
        "start": 1094.16,
        "end": 1100.48,
        "text": " Good. I was scared you became perfect.",
        "textdich": ""
    },
    {
        "start": 1097.2,
        "end": 1104.88,
        "text": " Never. I'm just improving slowly.",
        "textdich": ""
    },
    {
        "start": 1100.48,
        "end": 1114.72,
        "text": " Scene three, the family morning. Helping each other. Mark, can you help me for a second? I'm getting ready and my hands are full.",
        "textdich": ""
    },
    {
        "start": 1112.08,
        "end": 1117.2,
        "text": " Sure, of course. What do you need?",
        "textdich": ""
    },
    {
        "start": 1114.72,
        "end": 1124.4,
        "text": " Can you start the coffee? If I don't have coffee soon, I'm going to start speaking in slow motion.",
        "textdich": ""
    },
    {
        "start": 1122.0,
        "end": 1131.919,
        "text": " Say no more. I'll make it now. How do you want it today? Strong or I want to feel calm.",
        "textdich": ""
    },
    {
        "start": 1128.72,
        "end": 1135.6,
        "text": " Strong. I need the I can handle life aversion.",
        "textdich": ""
    },
    {
        "start": 1133.28,
        "end": 1140.4,
        "text": " Perfect. Coffee is officially in progress.",
        "textdich": ""
    },
    {
        "start": 1137.039,
        "end": 1151.2,
        "text": " Thank you. Okay, one more thing. Have you seen my phone charger? I swear it disappears every morning like it has its own secret life.",
        "textdich": ""
    },
    {
        "start": 1148.4,
        "end": 1156.559,
        "text": " H check the living room. I think I saw it near the couch.",
        "textdich": ""
    },
    {
        "start": 1152.799,
        "end": 1160.799,
        "text": " Wait, yes, found it. Oh my gosh, you saved my morning.",
        "textdich": ""
    },
    {
        "start": 1158.32,
        "end": 1162.88,
        "text": " See, this is what teamwork looks like.",
        "textdich": ""
    },
    {
        "start": 1160.799,
        "end": 1170.0,
        "text": "One person finds the charger, the other person makes the coffee, and suddenly the morning feels 10 times easier.",
        "textdich": ""
    },
    {
        "start": 1167.679,
        "end": 1178.72,
        "text": " Exactly. Because when you're doing everything alone, the morning feels stressful. But when someone helps you, it feels smooth.",
        "textdich": ""
    },
    {
        "start": 1176.88,
        "end": 1185.919,
        "text": " It's like a morning routine, but with support. And honestly, support should be part of the routine, too.",
        "textdich": ""
    },
    {
        "start": 1183.12,
        "end": 1190.32,
        "text": " Agreed. Now I'm ready and I'm caffeinated. That's a good start.",
        "textdich": ""
    },
    {
        "start": 1188.48,
        "end": 1195.6,
        "text": " Great. Let's head out before something else disappears.",
        "textdich": ""
    },
    {
        "start": 1192.16,
        "end": 1204.24,
        "text": " Scene four, the planning night before morning. Mark, quick reminder, tomorrow we need to leave by 8.",
        "textdich": ""
    },
    {
        "start": 1201.76,
        "end": 1210.24,
        "text": " 8. Okay, then we should definitely get up earlier. No last minute chaos.",
        "textdich": ""
    },
    {
        "start": 1207.28,
        "end": 1217.919,
        "text": " Exactly. I don't want the where are my keys morning. Let's prepare tonight so tomorrow feels smooth.",
        "textdich": ""
    },
    {
        "start": 1215.36,
        "end": 1220.0,
        "text": " Good idea. I'll set my alarm right now.",
        "textdich": ""
    },
    {
        "start": 1217.919,
        "end": 1226.48,
        "text": "And I'm setting a second alarm, too, just in case my phone decides to update again.",
        "textdich": ""
    },
    {
        "start": 1223.6,
        "end": 1234.88,
        "text": " Smart. I'll choose my outfit tonight so I'm not standing in front of my closet at 7:40 like nothing looks right.",
        "textdich": ""
    },
    {
        "start": 1232.32,
        "end": 1238.0,
        "text": " Yes, please. That moment is dangerous.",
        "textdich": ""
    },
    {
        "start": 1234.88,
        "end": 1240.159,
        "text": "It steals time and confidence.",
        "textdich": ""
    },
    {
        "start": 1238.0,
        "end": 1247.039,
        "text": " Exactly. And you can pack your bag tonight, too. Make sure you have everything you need.",
        "textdich": ""
    },
    {
        "start": 1243.919,
        "end": 1255.919,
        "text": " I'll pack my bag now. laptop, charger, wallet, and keys. And I'm putting my keys in the same place so I don't lose them in the morning.",
        "textdich": ""
    },
    {
        "start": 1253.039,
        "end": 1263.919,
        "text": " Perfect. Also, maybe we can prepare breakfast a little. Even something small like fruit or a snack we can grab.",
        "textdich": ""
    },
    {
        "start": 1261.44,
        "end": 1270.559,
        "text": " Great plan. Then tomorrow morning, we can just wake up, get ready, and leave without rushing.",
        "textdich": ""
    },
    {
        "start": 1267.6,
        "end": 1275.36,
        "text": " Exactly. Planning the night before makes the morning feel easier.",
        "textdich": ""
    },
    {
        "start": 1272.88,
        "end": 1279.36,
        "text": " Agreed. Future S is going to be so grateful.",
        "textdich": ""
    },
    {
        "start": 1276.64,
        "end": 1282.48,
        "text": " Tomorrow will be smoother. No panic zone.",
        "textdich": ""
    },
    {
        "start": 1280.4,
        "end": 1287.679,
        "text": " Hopefully, but I'm still keeping that second alarm.",
        "textdich": ""
    },
    {
        "start": 1283.76,
        "end": 1291.84,
        "text": " Now, scene five, the not feeling well morning.",
        "textdich": ""
    },
    {
        "start": 1288.799,
        "end": 1294.24,
        "text": " Sarah, I don't feel well today.",
        "textdich": ""
    },
    {
        "start": 1291.84,
        "end": 1298.64,
        "text": " Oh no. Are you okay? You sound different.",
        "textdich": ""
    },
    {
        "start": 1295.36,
        "end": 1307.84,
        "text": " Yeah, I feel really tired and my throat hurts. I woke up and I just knew something was wrong. Even getting out of bed feels hard.",
        "textdich": ""
    },
    {
        "start": 1305.6,
        "end": 1311.76,
        "text": " Oh, that's not good. Do you have a fever?",
        "textdich": ""
    },
    {
        "start": 1308.88,
        "end": 1318.32,
        "text": " I'm not sure, but I feel weak and a little cold. I don't think today is going to be a normal morning.",
        "textdich": ""
    },
    {
        "start": 1316.0,
        "end": 1325.679,
        "text": " Then don't force it. You should stay in bed and get some rest. Your body is telling you it needs a break.",
        "textdich": ""
    },
    {
        "start": 1322.4,
        "end": 1333.12,
        "text": " I know, but I have things to do. I have messages to answer, and I'm supposed to be productive today. Listen, your health",
        "textdich": ""
    },
    {
        "start": 1330.72,
        "end": 1335.039,
        "text": "is more important than your to-do list.",
        "textdich": ""
    },
    {
        "start": 1333.12,
        "end": 1341.44,
        "text": "Those things can wait. If you push yourself, you might feel worse tomorrow.",
        "textdich": ""
    },
    {
        "start": 1338.0,
        "end": 1344.159,
        "text": " True. I just feel guilty when I rest.",
        "textdich": ""
    },
    {
        "start": 1341.44,
        "end": 1348.96,
        "text": " That's normal, but resting is not being lazy. Rest is part of getting better.",
        "textdich": ""
    },
    {
        "start": 1347.2,
        "end": 1351.76,
        "text": "Just take it easy today.",
        "textdich": ""
    },
    {
        "start": 1348.96,
        "end": 1355.76,
        "text": " Okay, I'll stay in bed. I'll try to sleep a little more.",
        "textdich": ""
    },
    {
        "start": 1353.039,
        "end": 1361.28,
        "text": " Good. I'll make you some tea. Warm tea is great for a sore throat. Do you want honey, too?",
        "textdich": ""
    },
    {
        "start": 1359.039,
        "end": 1363.52,
        "text": " Yes, please. That would be perfect.",
        "textdich": ""
    },
    {
        "start": 1361.28,
        "end": 1369.52,
        "text": " All right. And if you need anything, just tell me. I'll take care of the small things today.",
        "textdich": ""
    },
    {
        "start": 1366.64,
        "end": 1375.12,
        "text": " Thank you. That's really kind. Honestly, that already makes me feel a little better.",
        "textdich": ""
    },
    {
        "start": 1372.0,
        "end": 1381.84,
        "text": " Good. Now, relax. Today's routine is simple. Rest, tea, and no stress.",
        "textdich": ""
    },
    {
        "start": 1378.4,
        "end": 1392.0,
        "text": " Best routine ever. Okay, now let's do our essential morning routine phrases, but in a smooth podcast style so you can listen and repeat naturally.",
        "textdich": ""
    },
    {
        "start": 1390.0,
        "end": 1401.44,
        "text": " Yes. And we're going to walk through the morning like a real day from the first sound you hear to the moment you walk out the door.",
        "textdich": ""
    },
    {
        "start": 1397.6,
        "end": 1404.32,
        "text": " Perfect. So imagine you're still in bed.",
        "textdich": ""
    },
    {
        "start": 1401.44,
        "end": 1413.76,
        "text": "You can say, \"My alarm goes off.\" Or, \"My alarm rings.\" You might say, \"I hear my alarm.\" and then I turn off my alarm.",
        "textdich": ""
    },
    {
        "start": 1411.36,
        "end": 1423.84,
        "text": "If you want more sleep, you can say I hit the snooze button. After that, you can say I wake up and then I get up or I",
        "textdich": ""
    },
    {
        "start": 1420.559,
        "end": 1432.4,
        "text": "get out of bed. A lot of people also say I check the time. And if something goes wrong, you can say I overslept.",
        "textdich": ""
    },
    {
        "start": 1429.679,
        "end": 1445.76,
        "text": "Then you can describe how you feel. I feel tired. I feel groggy. I feel refreshed. Four, I feel wide awake. And on a weekend, you can say I sleep in.",
        "textdich": ""
    },
    {
        "start": 1442.48,
        "end": 1456.48,
        "text": " Okay, now you're up and you move to the bathroom. You can say I go to the bathroom. I wash my face. I brush my",
        "textdich": ""
    },
    {
        "start": 1452.32,
        "end": 1463.279,
        "text": "teeth and I rinse my mouth. Then you can say, I take a shower or I have a shower.",
        "textdich": ""
    },
    {
        "start": 1460.4,
        "end": 1465.76,
        "text": "If you're busy, I take a quick shower.",
        "textdich": ""
    },
    {
        "start": 1463.279,
        "end": 1480.0,
        "text": "And if you're relaxed, I take a long shower. After that, I dry off with a towel. For your hair, you can say, \"I comb my hair, I brush my hair, or I tie",
        "textdich": ""
    },
    {
        "start": 1476.64,
        "end": 1491.84,
        "text": "my hair up.\" And a nice simple phrase is, \"I freshen up.\" Then it's time to get dressed. You can say, \"I get dressed, I choose my clothes, or I pick",
        "textdich": ""
    },
    {
        "start": 1488.559,
        "end": 1501.279,
        "text": "out my outfit.\" Then you can say, \"I put on my shirt. I put on my pants. I put on my socks. I put on my shoes. And I put",
        "textdich": ""
    },
    {
        "start": 1498.159,
        "end": 1510.48,
        "text": "on my jacket.\" And then breakfast. You can say, \"I'm hungry.\" You can say, \"I make breakfast.\" Or if you don't eat, I",
        "textdich": ""
    },
    {
        "start": 1507.679,
        "end": 1520.96,
        "text": "skip breakfast. If you're in a rush, you can say, \"I grab a quick bite.\" For drinks, I make coffee. I make tea. I",
        "textdich": ""
    },
    {
        "start": 1517.039,
        "end": 1524.08,
        "text": "boil water. and I pour a cup of coffee.",
        "textdich": ""
    },
    {
        "start": 1520.96,
        "end": 1535.6,
        "text": "For food, you can say, \"I make toast, I cook eggs, or I eat cereal.\" And finally, the last part of the morning, leaving the house, you can say, \"I pack",
        "textdich": ""
    },
    {
        "start": 1532.24,
        "end": 1544.32,
        "text": "my bag and I check my keys, wallet, and phone.\" Then you can say, \"I'm heading out.\" Or, \"I head out.\" Before you go,",
        "textdich": ""
    },
    {
        "start": 1541.679,
        "end": 1554.559,
        "text": "you can say, \"I check the weather.\" And when you leave, I lock the door. If you're late, you can say, \"I'm running late and I need to hurry up.\" And a",
        "textdich": ""
    },
    {
        "start": 1552.64,
        "end": 1563.12,
        "text": "simple kind phrase you can say to someone at home is, \"Have a good day.\"  That's it. That's your full morning routine in real English from start to",
        "textdich": ""
    },
    {
        "start": 1562.24,
        "end": 1564.72,
        "text": "finish.",
        "textdich": ""
    },
    {
        "start": 1563.12,
        "end": 1571.52,
        "text": " Mark, quick review,  please. My brain likes small reviews, short and clear.",
        "textdich": ""
    },
    {
        "start": 1568.4,
        "end": 1581.76,
        "text": " Okay, first one. Oversleep means you sleep too long by accident. You plan to wake up at 7, but you wake up at 7:40 and you panic.",
        "textdich": ""
    },
    {
        "start": 1578.799,
        "end": 1587.919,
        "text": " Yes, oversleep is when your alarm fails you or when you fail your alarm.",
        "textdich": ""
    },
    {
        "start": 1584.559,
        "end": 1595.36,
        "text": " Next, rush means you do everything fast because you don't have enough time. You rush to the bathroom. You rush to get",
        "textdich": ""
    },
    {
        "start": 1592.4,
        "end": 1598.64,
        "text": "dressed. And everything feels urgent.",
        "textdich": ""
    },
    {
        "start": 1595.36,
        "end": 1606.88,
        "text": " That's my weekday personality. Stressed means you feel worried and pressured, like you have too much to do and not enough time.",
        "textdich": ""
    },
    {
        "start": 1604.159,
        "end": 1613.76,
        "text": " And the opposite is relaxed, which means calm, no stress, nothing is chasing you.",
        "textdich": ""
    },
    {
        "start": 1610.24,
        "end": 1618.4,
        "text": " Exactly. Now, groggy is that slow, sleepy feeling right after you wake up.",
        "textdich": ""
    },
    {
        "start": 1616.159,
        "end": 1622.4,
        "text": "Your eyes are open, but your brain is still half asleep.",
        "textdich": ""
    },
    {
        "start": 1619.84,
        "end": 1625.2,
        "text": " That's me until breakfast happens.",
        "textdich": ""
    },
    {
        "start": 1622.4,
        "end": 1632.159,
        "text": " And refreshed is the opposite. It means you feel full of new energy, like you slept well, and you're ready to start the day.",
        "textdich": ""
    },
    {
        "start": 1629.84,
        "end": 1635.279,
        "text": " I want that feeling more often.",
        "textdich": ""
    },
    {
        "start": 1632.159,
        "end": 1642.88,
        "text": " Hectic means very busy and chaotic with a lot happening at once, like when you're late, your phone is ringing, and you can't find your keys.",
        "textdich": ""
    },
    {
        "start": 1641.6,
        "end": 1648.48,
        "text": " So, Monday  and smooth means easy with no problems.",
        "textdich": ""
    },
    {
        "start": 1646.559,
        "end": 1652.159,
        "text": "Everything goes well, and you leave on time.",
        "textdich": ""
    },
    {
        "start": 1649.2,
        "end": 1660.0,
        "text": " That's the dream. Freshen up means you do small things to feel clean and awake, like washing your face and brushing your",
        "textdich": ""
    },
    {
        "start": 1656.88,
        "end": 1668.72,
        "text": "teeth. Head out means leave the house, like I'm heading out now. And commute is your daily travel to work or school.",
        "textdich": ""
    },
    {
        "start": 1665.52,
        "end": 1671.679,
        "text": " Perfect. Small review, big help.",
        "textdich": ""
    },
    {
        "start": 1668.72,
        "end": 1674.88,
        "text": " Okay, Mark, we covered a lot today.",
        "textdich": ""
    },
    {
        "start": 1671.679,
        "end": 1679.2,
        "text": " From my alarm goes off to I'm heading out.",
        "textdich": ""
    },
    {
        "start": 1676.08,
        "end": 1684.08,
        "text": " Exactly. But here's a tip. Don't learn everything in one day.",
        "textdich": ""
    },
    {
        "start": 1681.2,
        "end": 1687.52,
        "text": " Tomorrow, use just one phrase.",
        "textdich": ""
    },
    {
        "start": 1684.08,
        "end": 1694.08,
        "text": " Even something small like time to get up  or I'm running late. I use that one a lot.",
        "textdich": ""
    },
    {
        "start": 1691.2,
        "end": 1698.559,
        "text": " Question of the day. What is one thing you always do in your morning routine?",
        "textdich": ""
    },
    {
        "start": 1696.88,
        "end": 1700.88,
        "text": "Tell us in the comments.",
        "textdich": ""
    },
    {
        "start": 1698.559,
        "end": 1705.2,
        "text": " Do you check your phone first, drink coffee, take a shower?",
        "textdich": ""
    },
    {
        "start": 1703.12,
        "end": 1712.559,
        "text": " We read your comments and they help us make better lessons. Thanks for learning with Speaking English Daily Dose. Bye for now.",
        "textdich": ""
    }
]