[
  {
    "start": 0.06,
    "end": 6.18,
    "text": "Hey guys! It's Ariannita la Gringa and welcome back to my YouTube channel. Can you guys guess",
    "textdich": ""
  },
  {
    "start": 6.18,
    "end": 12.24,
    "text": "where I'm at today? Today I'm at Starbucks and as you can see behind me you can see",
    "textdich": ""
  },
  {
    "start": 12.24,
    "end": 18.48,
    "text": "the beautiful Starbucks logo that they have. And this logo is famous worldwide. You all",
    "textdich": ""
  },
  {
    "start": 18.48,
    "end": 24.9,
    "text": "might be wondering... Ariannita why are you at Starbucks? Well today I'm at Starbucks because I",
    "textdich": ""
  },
  {
    "start": 24.9,
    "end": 30.66,
    "text": "want to teach you guys some coffee vocabulary. And you guys might be wondering... Wait it's",
    "textdich": ""
  },
  {
    "start": 30.66,
    "end": 35.16,
    "text": "really easy to order coffee... Actually, it can be pretty difficult especially at",
    "textdich": ""
  },
  {
    "start": 35.16,
    "end": 40.8,
    "text": "Starbucks because they have different sizes, different coffee, and different drinks all",
    "textdich": ""
  },
  {
    "start": 40.8,
    "end": 46.08,
    "text": "together. So come along with me and let's go learn some English vocab inside Starbucks.",
    "textdich": ""
  },
  {
    "start": 48.78,
    "end": 55.08,
    "text": "Before walking inside this Starbucks store I want to teach you guys some facts about Starbucks.",
    "textdich": ""
  },
  {
    "start": 55.08,
    "end": 65.94,
    "text": "The first original Starbucks opened in 1971 in Seattle, Washington. And there are over 33,833",
    "textdich": ""
  },
  {
    "start": 65.94,
    "end": 72.72,
    "text": "stores worldwide. 15,000 of those stores are located right in the United States of America.",
    "textdich": ""
  },
  {
    "start": 72.72,
    "end": 79.02,
    "text": "I have a question for you all... Do you guys have a Starbucks in your city or country? Let",
    "textdich": ""
  },
  {
    "start": 79.02,
    "end": 84.54,
    "text": "me know down below. Before walking inside the Starbucks store and ordering a cup of coffee,",
    "textdich": ""
  },
  {
    "start": 84.54,
    "end": 91.14,
    "text": "I need to teach you guys one thing. The first thing is a coffee bean. What is a coffee bean?",
    "textdich": ""
  },
  {
    "start": 91.14,
    "end": 98.1,
    "text": "A coffee bean is a seed from a coffee plant. And where do you find coffee plants? Coffee plants are",
    "textdich": ""
  },
  {
    "start": 98.1,
    "end": 104.64,
    "text": "most common in Venezuela, Colombia, Guatemala. Countries in South America and Central America.",
    "textdich": ""
  },
  {
    "start": 104.64,
    "end": 110.34,
    "text": "They are also found in Africa. Countries like Ethiopia are rich with coffee plants.",
    "textdich": ""
  },
  {
    "start": 110.34,
    "end": 115.98,
    "text": "Let's go ahead and walk inside and order a cup of coffee and learn some English vocab in Starbucks.",
    "textdich": ""
  },
  {
    "start": 125.94,
    "end": 132.42,
    "text": "The next important thing about coffee is the roast. So what is a roast? A roast",
    "textdich": ""
  },
  {
    "start": 132.42,
    "end": 138.78,
    "text": "is the process of drying coffee beans for their taste and appearance. They have three different",
    "textdich": ""
  },
  {
    "start": 138.78,
    "end": 145.26,
    "text": "types of roasts. They have a light roast, a medium roast, and a dark roast. And the",
    "textdich": ""
  },
  {
    "start": 145.26,
    "end": 151.44,
    "text": "nice thing about these roasts is on the back of this package you can actually scan this barcode",
    "textdich": ""
  },
  {
    "start": 151.44,
    "end": 158.46,
    "text": "and you can check out where your coffee beans are from. Right now I will scan this bag and",
    "textdich": ""
  },
  {
    "start": 158.46,
    "end": 164.82,
    "text": "I will trace where my coffee is from. I am scanning the code on the back of the package",
    "textdich": ""
  },
  {
    "start": 166.8,
    "end": 173.22,
    "text": "and this says that this batch of Starbucks blonde espresso roast is from Honduras, Kenya,",
    "textdich": ""
  },
  {
    "start": 173.22,
    "end": 178.5,
    "text": "and Guatemala. Now that you guys know what a coffee bean is, what a roast is,",
    "textdich": ""
  },
  {
    "start": 178.5,
    "end": 184.14,
    "text": "let's jump to the most exciting part... The different types of coffee! There are",
    "textdich": ""
  },
  {
    "start": 184.14,
    "end": 190.08,
    "text": "two types of coffee. There is hot coffee and cold coffee. Let's learn some of the different types",
    "textdich": ""
  },
  {
    "start": 190.08,
    "end": 196.32,
    "text": "of hot and cold coffees with your native English teacher Ariannita la Gringa. Here are some hot",
    "textdich": ""
  },
  {
    "start": 196.32,
    "end": 205.08,
    "text": "coffees. Americano. An Americano is two shots of espresso with hot water. Macchiato. A macchiato is",
    "textdich": ""
  },
  {
    "start": 205.08,
    "end": 212.4,
    "text": "a shot of espresso with a little bit of foam milk. Latte. A latte is espresso, steamed milk (which is",
    "textdich": ""
  },
  {
    "start": 212.4,
    "end": 219.0,
    "text": "basically hot milk), and a little bit of foam milk on top. Cappuccino. A cappuccino is similar to a",
    "textdich": ""
  },
  {
    "start": 219.0,
    "end": 226.08,
    "text": "latte. It has espresso and steamed milk but it has a lot more foam milk compared to a latte. Mocha. A",
    "textdich": ""
  },
  {
    "start": 226.08,
    "end": 232.2,
    "text": "mocha is a combination of espresso, chocolate, and steamed milk. It's a sweet and chocolatey coffee",
    "textdich": ""
  },
  {
    "start": 232.2,
    "end": 239.34,
    "text": "drink. Cold coffee drinks can be served over ice. An iced Americano, iced mocha, and iced latte are",
    "textdich": ""
  },
  {
    "start": 239.34,
    "end": 245.4,
    "text": "cold variations of the hot coffees. Frappuccino. A frappuccino is a coffee drink made with ice,",
    "textdich": ""
  },
  {
    "start": 245.4,
    "end": 252.78,
    "text": "milk, coffee, and various flavors like chocolate, caramel, or fruit. It's mixed in a blender. After",
    "textdich": ""
  },
  {
    "start": 252.78,
    "end": 259.44,
    "text": "learning about the different types of coffee, I am going to choose and order a hot cup of",
    "textdich": ""
  },
  {
    "start": 259.44,
    "end": 265.32,
    "text": "coffee at the counter. Before ordering, there are two types of coffee you can choose from you",
    "textdich": ""
  },
  {
    "start": 265.32,
    "end": 272.34,
    "text": "can choose caffeinated coffee with caffeine or you can choose decaffeinated coffee (it's also called",
    "textdich": ""
  },
  {
    "start": 272.34,
    "end": 279.72,
    "text": "decaf coffee) because this has no caffeine inside of it. You can also choose a half-caf which just",
    "textdich": ""
  },
  {
    "start": 279.72,
    "end": 285.96,
    "text": "means there is half caffeine and half decaf. Half of it is with caffeinated coffee beans",
    "textdich": ""
  },
  {
    "start": 285.96,
    "end": 292.86,
    "text": "and the other half is with decaffeinated coffee beans. Before ordering my cup of hot coffee I am",
    "textdich": ""
  },
  {
    "start": 292.86,
    "end": 298.92,
    "text": "going to browse along all of the sweet treats that they have inside this store. My favorite type of",
    "textdich": ""
  },
  {
    "start": 298.92,
    "end": 307.08,
    "text": "sweet treat that they have here is the banana loaf bread. It costs $3.95. And they also have",
    "textdich": ""
  },
  {
    "start": 307.08,
    "end": 313.56,
    "text": "some pumpkin loaf breads, pumpkin cream cheese muffin, and they have a chocolate chip cookie.",
    "textdich": ""
  },
  {
    "start": 313.56,
    "end": 321.36,
    "text": "This chocolate chip cookie costs $2.95. Now I'm going to order a hot cup of coffee at the counter.",
    "textdich": ""
  },
  {
    "start": 321.36,
    "end": 327.54,
    "text": "Hi I'd like a tall white chocolate mocha. Okay, Do you want it hot or iced? Hot please. Alright.",
    "textdich": ""
  },
  {
    "start": 327.54,
    "end": 332.4,
    "text": "And then may I have the banana nut bread. Yeah absolutely, did you want it warmed up? Yes,",
    "textdich": ""
  },
  {
    "start": 332.4,
    "end": 337.44,
    "text": "warmed up please. What's a good name for your order? Arianna. Alright it's gonna $9.43. Thank",
    "textdich": ""
  },
  {
    "start": 337.44,
    "end": 341.88,
    "text": "you. No problem. You doing Apple pay? Yes. K. It should be ready for you on the screen.",
    "textdich": ""
  },
  {
    "start": 343.74,
    "end": 350.94,
    "text": "Awesome. Do you need a receipt? Yes please. Alrighty. Here you go. Thank you. Yeah we'll",
    "textdich": ""
  },
  {
    "start": 350.94,
    "end": 357.24,
    "text": "have it right out. Thanks. I just ordered a tall white chocolate mocha and it's hot coffee and the",
    "textdich": ""
  },
  {
    "start": 357.24,
    "end": 363.6,
    "text": "girl that took my order is called a barista. And now, she is going to prepare that hot cup",
    "textdich": ""
  },
  {
    "start": 363.6,
    "end": 369.24,
    "text": "of coffee for me and I am just going to stand by this counter and wait for my name to be called.",
    "textdich": ""
  },
  {
    "start": 369.24,
    "end": 376.8,
    "text": "My hot cup of coffee is ready as well as my banana nut bread. I'm gonna take this over here because",
    "textdich": ""
  },
  {
    "start": 376.8,
    "end": 384.3,
    "text": "they have straws that you can drink out of and they also have coffee stoppers. This is a coffee",
    "textdich": ""
  },
  {
    "start": 384.3,
    "end": 390.48,
    "text": "stopper that you can put inside your drink to keep it nice and warm and to prevent it from spilling",
    "textdich": ""
  },
  {
    "start": 390.48,
    "end": 396.84,
    "text": "if you're on the road. I'm ready to go take a seat and enjoy my coffee. Now I'm going to take",
    "textdich": ""
  },
  {
    "start": 396.84,
    "end": 403.08,
    "text": "a seat outside in this beautiful patio that they have at this Starbucks and enjoy the beautiful",
    "textdich": ""
  },
  {
    "start": 403.08,
    "end": 409.26,
    "text": "weather. I'm now sitting down and enjoying my coffee, but before drinking it I have to take out",
    "textdich": ""
  },
  {
    "start": 409.26,
    "end": 414.06,
    "text": "this green stopper and I'll set this on the table and I'm going to take my first sip.",
    "textdich": ""
  },
  {
    "start": 415.5,
    "end": 423.66,
    "text": "Wow! That's good. I ordered a tall white chocolate mocha. This tall drink has a sleeve. This is a",
    "textdich": ""
  },
  {
    "start": 423.66,
    "end": 430.8,
    "text": "sleeve that'll go around the drink because this is a hot drink so it may get really hot. This sleeve",
    "textdich": ""
  },
  {
    "start": 430.8,
    "end": 436.86,
    "text": "will just protect my fingers. Also, I ordered this drink just a tall white chocolate mocha",
    "textdich": ""
  },
  {
    "start": 436.86,
    "end": 442.98,
    "text": "and I didn't want to ask for a sugar packet. I did not want a sugar packet because this drink already",
    "textdich": ""
  },
  {
    "start": 442.98,
    "end": 449.7,
    "text": "has way too much sugar. As I said before I didn't take any sugar packets, but if I were to choose",
    "textdich": ""
  },
  {
    "start": 449.7,
    "end": 457.68,
    "text": "some sugar packets there are three choices. I can take brown sugar, white sugar, or the substitute",
    "textdich": ""
  },
  {
    "start": 457.68,
    "end": 464.46,
    "text": "for sugar stevia. Also, I'm going to let you guys know how much I paid for my cup of hot coffee and",
    "textdich": ""
  },
  {
    "start": 464.46,
    "end": 472.98,
    "text": "for my sweet treat my banana nut bread. For this tall white chocolate mocha I paid $4.95 and for",
    "textdich": ""
  },
  {
    "start": 472.98,
    "end": 482.22,
    "text": "this banana nut loaf I paid $3.95 cents with a total with taxes of $10.43. Do you guys think",
    "textdich": ""
  },
  {
    "start": 482.22,
    "end": 488.94,
    "text": "that is expensive just for a banana nut bread and a small cup of coffee? Let me know down below. I'm",
    "textdich": ""
  },
  {
    "start": 488.94,
    "end": 493.68,
    "text": "about to finish drinking my hot cup of coffee in 90 degree weather (32 degrees celsius) and",
    "textdich": ""
  },
  {
    "start": 493.68,
    "end": 501.54,
    "text": "I forgot to tell you guys that you can use this stopper as a stirrer. So you can take off this",
    "textdich": ""
  },
  {
    "start": 501.54,
    "end": 508.56,
    "text": "lid of the coffee cup and then if you want to stir your coffee you use this stirrer and",
    "textdich": ""
  },
  {
    "start": 508.56,
    "end": 514.98,
    "text": "mix it together. You use stirrers when you put a sugar packet in your coffee. Lastly,",
    "textdich": ""
  },
  {
    "start": 514.98,
    "end": 521.58,
    "text": "you guys might be wondering that Starbucks has the same sizes like other coffee shops (small,",
    "textdich": ""
  },
  {
    "start": 521.58,
    "end": 528.48,
    "text": "medium, and large). Well here at Starbucks, that's not the case. Starbucks has different sizes. This",
    "textdich": ""
  },
  {
    "start": 528.48,
    "end": 535.38,
    "text": "small cup is a tall coffee cup. A medium is a grande. But grande means large in Spanish?!",
    "textdich": ""
  },
  {
    "start": 535.38,
    "end": 543.12,
    "text": "I know that's very confusing. The large size is called a venti. So it's tall, grande, venti.",
    "textdich": ""
  },
  {
    "start": 543.12,
    "end": 549.54,
    "text": "Okay guys I'm finally finished with this amazing video at Starbucks. Go ahead and give me a like,",
    "textdich": ""
  },
  {
    "start": 549.54,
    "end": 555.3,
    "text": "subscribe, and if you want to support my YouTube channel, go ahead and give me a super thanks",
    "textdich": ""
  },
  {
    "start": 555.3,
    "end": 561.24,
    "text": "because that allows me to buy this small cup of coffee. Let me know down below what type of coffee",
    "textdich": ""
  },
  {
    "start": 561.24,
    "end": 567.72,
    "text": "you guys order if you go to Starbucks or a regular coffee shop. I'll see you guys next week! Bye!",
    "textdich": ""
  }
]