[
    {
        "start": 0.24,
        "end": 14.88,
        "text": "Welcome everyone. Today's video is not just a list of tips. This is a full transformation plan for your fluency in 2026.",
        "textdich": ""
    },
    {
        "start": 11.679,
        "end": 19.84,
        "text": "It doesn't matter if you feel shy. It doesn't matter if you've failed before.",
        "textdich": ""
    },
    {
        "start": 18.0,
        "end": 24.64,
        "text": "It doesn't matter if you don't have someone to speak English with.",
        "textdich": ""
    },
    {
        "start": 22.64,
        "end": 37.92,
        "text": "If you follow these steps the way I'm about to explain slowly, consistently with heart, you will speak English fluently in 2026.",
        "textdich": ""
    },
    {
        "start": 34.559,
        "end": 47.12,
        "text": "This is not a shortcut. This is the full system for your brain, your mouth, your confidence, and your daily routine.",
        "textdich": ""
    },
    {
        "start": 45.28,
        "end": 56.16,
        "text": "Because learning English is not just about speaking. It's about building a new version of yourself. someone who can",
        "textdich": ""
    },
    {
        "start": 53.039,
        "end": 68.4,
        "text": "communicate with the world. So whether you're a beginner who understands English but can't speak, a student who freezes when it's time to",
        "textdich": ""
    },
    {
        "start": 64.64,
        "end": 77.52,
        "text": "talk, or a dreamer who wants to work, live, or study in an English-speaking country, this video will give you everything you",
        "textdich": ""
    },
    {
        "start": 75.119,
        "end": 82.96,
        "text": "need to finally speak fluent English in 2026.",
        "textdich": ""
    },
    {
        "start": 79.6,
        "end": 93.6,
        "text": "And one more thing, this video will not only change your English, it will change your mindset, your habits, your daily life, and most importantly, your",
        "textdich": ""
    },
    {
        "start": 92.079,
        "end": 95.2,
        "text": "self-belief.",
        "textdich": ""
    },
    {
        "start": 93.6,
        "end": 101.84,
        "text": "Because when you learn to speak a new language, you also learn to become a new person.",
        "textdich": ""
    },
    {
        "start": 99.68,
        "end": 105.68,
        "text": "Before we begin, subscribe to the channel.",
        "textdich": ""
    },
    {
        "start": 103.52,
        "end": 113.04,
        "text": "Every video here is designed to improve your English clearly and confidently.",
        "textdich": ""
    },
    {
        "start": 108.96,
        "end": 117.28,
        "text": "Now, let's begin. Step one, fix the root problem.",
        "textdich": ""
    },
    {
        "start": 114.64,
        "end": 126.159,
        "text": "It's not your English. It's your environment. Most people fail to speak English not because their brain is weak,",
        "textdich": ""
    },
    {
        "start": 123.2,
        "end": 128.64,
        "text": "but because their environment is wrong.",
        "textdich": ""
    },
    {
        "start": 126.159,
        "end": 138.879,
        "text": "That's the root problem. And that's where we must begin. Imagine this. You want to grow a plant, but the soil is",
        "textdich": ""
    },
    {
        "start": 135.84,
        "end": 149.68,
        "text": "dry. There's no sunlight, no water. Can the plant grow? No. The same is true for your English. You want to grow your fluency.",
        "textdich": ""
    },
    {
        "start": 146.56,
        "end": 158.48,
        "text": "But your daily environment is full of your native language, surrounded by people who never speak English and built",
        "textdich": ""
    },
    {
        "start": 155.2,
        "end": 168.72,
        "text": "with habits that avoid speaking. So, let me ask you, are you reading in your native language all day? Are you thinking in your native language while",
        "textdich": ""
    },
    {
        "start": 166.239,
        "end": 170.959,
        "text": "trying to speak English?",
        "textdich": ""
    },
    {
        "start": 168.72,
        "end": 177.28,
        "text": "Are you waiting for English class but not creating your own practice space?",
        "textdich": ""
    },
    {
        "start": 174.239,
        "end": 181.44,
        "text": "If yes, that's the reason your fluency is stuck.",
        "textdich": ""
    },
    {
        "start": 179.12,
        "end": 188.8,
        "text": "You are trying to grow in the wrong soil. The solution, change your English environment.",
        "textdich": ""
    },
    {
        "start": 186.239,
        "end": 199.92,
        "text": "Starting today, fluency doesn't begin with grammar. Fluency begins with changing your surroundings. Set your phone to English. Every time you unlock",
        "textdich": ""
    },
    {
        "start": 196.0,
        "end": 211.76,
        "text": "your phone, see English, read English, think in English. This trains your brain without effort. Use English while brushing, walking, cooking. You don't",
        "textdich": ""
    },
    {
        "start": 208.8,
        "end": 221.04,
        "text": "need extra time. Just use normal time in an English way. Say your thoughts out loud in English. I'm brushing my teeth.",
        "textdich": ""
    },
    {
        "start": 217.68,
        "end": 227.92,
        "text": "I'm feeling sleepy today. I need to call my friend. This builds thinking speed.",
        "textdich": ""
    },
    {
        "start": 224.879,
        "end": 230.72,
        "text": "Write one page in English every morning.",
        "textdich": ""
    },
    {
        "start": 227.92,
        "end": 238.48,
        "text": "Don't worry about grammar. Just write, even simple. Today I want to speak better English.",
        "textdich": ""
    },
    {
        "start": 235.76,
        "end": 241.12,
        "text": "I feel nervous sometimes.",
        "textdich": ""
    },
    {
        "start": 238.48,
        "end": 246.56,
        "text": "But I'm improving. Writing helps you think clearly.",
        "textdich": ""
    },
    {
        "start": 243.12,
        "end": 249.68,
        "text": "Clear thoughts equals clear speaking.",
        "textdich": ""
    },
    {
        "start": 246.56,
        "end": 258.72,
        "text": "Start your day with English input for the first 10 minutes after waking up. No Instagram, no native language scrolling,",
        "textdich": ""
    },
    {
        "start": 256.16,
        "end": 270.24,
        "text": "just one English video, podcast, or voice note. Let English be the first thing your brain hears every day. Put English words on your mirror and wall. I",
        "textdich": ""
    },
    {
        "start": 268.4,
        "end": 273.6,
        "text": "speak clearly.",
        "textdich": ""
    },
    {
        "start": 270.24,
        "end": 276.0,
        "text": "I am improving every day.",
        "textdich": ""
    },
    {
        "start": 273.6,
        "end": 287.12,
        "text": "English is easy. I just need to speak it. Repeat these affirmations aloud every time you see them. Your environment will remind your brain.",
        "textdich": ""
    },
    {
        "start": 284.24,
        "end": 293.12,
        "text": "We're serious now because the brain learns from repetition and exposure.",
        "textdich": ""
    },
    {
        "start": 290.16,
        "end": 301.6,
        "text": "The more you hear English, see English, and feel English, the more your brain accepts it as normal.",
        "textdich": ""
    },
    {
        "start": 299.04,
        "end": 311.919,
        "text": "Right now, English feels like a second language to you. Your goal in 2026 is to make it feel like your first language in your environment.",
        "textdich": ""
    },
    {
        "start": 310.08,
        "end": 320.72,
        "text": "Even if no one around you speaks English, you can build a world where English lives.",
        "textdich": ""
    },
    {
        "start": 316.8,
        "end": 322.88,
        "text": "Wake up. Play a 5-minute English audio.",
        "textdich": ""
    },
    {
        "start": 320.72,
        "end": 333.6,
        "text": "While brushing teeth, speak two sentences about your day. Breakfast time. Watch five minutes of an English story or interview. Writing journal, one",
        "textdich": ""
    },
    {
        "start": 331.759,
        "end": 337.28,
        "text": "page in English.",
        "textdich": ""
    },
    {
        "start": 333.6,
        "end": 346.96,
        "text": "What I want to improve. Before sleeping, record a two-minute voice note. What I did today in English. Total time less",
        "textdich": ""
    },
    {
        "start": 344.08,
        "end": 356.32,
        "text": "than 30 minutes. But your mind will feel like you're living in an English-speaking country. You don't have to move to America. You have to bring",
        "textdich": ""
    },
    {
        "start": 353.6,
        "end": 365.039,
        "text": "English into your home, your habits, and your thoughts. Fluency is not about how smart you are. It's about how consistent",
        "textdich": ""
    },
    {
        "start": 362.24,
        "end": 378.479,
        "text": "your environment is. So before we move to grammar, speaking, vocabulary, fix this first. Where is English in your daily life? If the answer is nowhere,",
        "textdich": ""
    },
    {
        "start": 375.68,
        "end": 388.319,
        "text": "then start today. You can't grow fluent English in a dry land. Change your environment and you change everything.",
        "textdich": ""
    },
    {
        "start": 384.24,
        "end": 396.56,
        "text": "Step two, don't just learn words. Train your mouth to speak. You can know 10,000 English words in your brain but still",
        "textdich": ""
    },
    {
        "start": 394.479,
        "end": 401.84,
        "text": "not be able to speak one full sentence fluently.",
        "textdich": ""
    },
    {
        "start": 398.319,
        "end": 405.28,
        "text": "Why? Because your mouth is not trained.",
        "textdich": ""
    },
    {
        "start": 401.84,
        "end": 412.4,
        "text": "Your brain might be full of English, but your mouth is still in your native language.",
        "textdich": ""
    },
    {
        "start": 409.36,
        "end": 423.759,
        "text": "This is the biggest difference between learners who understand English but can't speak and learners who speak fluently even with simple vocabulary.",
        "textdich": ""
    },
    {
        "start": 420.96,
        "end": 434.88,
        "text": "Most people spend their time watching videos, reading books, listening to podcasts, memorizing vocabulary, learning grammar rules.",
        "textdich": ""
    },
    {
        "start": 432.8,
        "end": 442.88,
        "text": "All of this helps your brain understand English, but it doesn't help your mouth produce English.",
        "textdich": ""
    },
    {
        "start": 439.44,
        "end": 448.24,
        "text": "Speaking is a physical skill just like dancing, swimming, or playing guitar.",
        "textdich": ""
    },
    {
        "start": 446.4,
        "end": 457.68,
        "text": "You don't become a good dancer by reading dance books. You don't become a swimmer by watching swimming videos.",
        "textdich": ""
    },
    {
        "start": 454.24,
        "end": 466.08,
        "text": "You become good by moving your body. The same is true for English speaking. You don't speak fluently by knowing English.",
        "textdich": ""
    },
    {
        "start": 463.36,
        "end": 478.4,
        "text": "You speak fluently by moving your mouth again and again and again. Your lips, tongue, throat, and breathing patterns are all trained for your native",
        "textdich": ""
    },
    {
        "start": 475.44,
        "end": 491.599,
        "text": "language. For years, your mouth has practiced your first language. So, it feels comfortable, fast, easy. But when you try to speak English, your mouth",
        "textdich": ""
    },
    {
        "start": 487.12,
        "end": 498.24,
        "text": "freezes, hesitates, feels uncomfortable, can't find the rhythm or pronunciation.",
        "textdich": ""
    },
    {
        "start": 495.28,
        "end": 506.08,
        "text": "That's not your fault. It's not because you're bad at English. It's because your mouth has no muscle memory in English",
        "textdich": ""
    },
    {
        "start": 503.12,
        "end": 511.52,
        "text": "yet. Your muscles don't know how to move in the English way.",
        "textdich": ""
    },
    {
        "start": 508.4,
        "end": 524.0,
        "text": "That's why your thoughts feel stuck because the bridge between your brain and your mouth is weak. The solution, just like going to the gym, you must",
        "textdich": ""
    },
    {
        "start": 520.719,
        "end": 527.76,
        "text": "start doing mouth workouts every day.",
        "textdich": ""
    },
    {
        "start": 524.0,
        "end": 536.56,
        "text": "Not with grammar, not with writing, but with real speaking drills, the shadowing method. Speak with the video. This is",
        "textdich": ""
    },
    {
        "start": 534.64,
        "end": 545.6,
        "text": "one of the most powerful exercises in the world for spoken English. Choose any video with a native English speaker.",
        "textdich": ""
    },
    {
        "start": 542.24,
        "end": 554.64,
        "text": "Start with easy ones. Stories, TED talks, short interviews, play one sentence, pause.",
        "textdich": ""
    },
    {
        "start": 551.92,
        "end": 565.92,
        "text": "Speak the sentence out loud. Then play it again. And this time, speak with the speaker matching their speed, pronunciation, emotion, and rhythm. Do",
        "textdich": ""
    },
    {
        "start": 563.519,
        "end": 577.04,
        "text": "this with one minute clips, then 2 minute clips, then longer. At first, your mouth will struggle. You'll feel slow. You'll mispronounce. You'll get",
        "textdich": ""
    },
    {
        "start": 573.839,
        "end": 584.959,
        "text": "tired. That's okay. That means your mouth is learning a new skill, like lifting a new weight.",
        "textdich": ""
    },
    {
        "start": 582.24,
        "end": 596.0,
        "text": "The more you shadow, the more your mouth becomes fluent, fast, and natural in English. Repeat each sentence five to 10 times if needed.",
        "textdich": ""
    },
    {
        "start": 592.959,
        "end": 601.44,
        "text": "This is not a race. This is transformation.",
        "textdich": ""
    },
    {
        "start": 597.76,
        "end": 610.399,
        "text": "The 321 speaking drill. Speed, pressure, clarity. This is a fluency exercise to help you speak under time pressure. Just",
        "textdich": ""
    },
    {
        "start": 606.959,
        "end": 612.08,
        "text": "like in real life. Pick a simple topic.",
        "textdich": ""
    },
    {
        "start": 610.399,
        "end": 624.88,
        "text": "For example, my morning routine, my favorite movie, why I want to learn English. Speak about that topic for 3 minutes. No stopping,",
        "textdich": ""
    },
    {
        "start": 621.6,
        "end": 636.8,
        "text": "no translation. Just keep going. Then speak about the same topic again, but this time for two minutes. Then again for one minute. Each time you are",
        "textdich": ""
    },
    {
        "start": 633.6,
        "end": 648.959,
        "text": "training, faster thinking, clearer speaking, better structure. At first it will feel difficult. You might run out of words. You might repeat yourself.",
        "textdich": ""
    },
    {
        "start": 645.68,
        "end": 660.32,
        "text": "That's okay. Do this drill daily. And after two weeks, you will notice fewer pauses, faster sentences, stronger confidence. This is the real gym of",
        "textdich": ""
    },
    {
        "start": 658.64,
        "end": 663.76,
        "text": "fluency.",
        "textdich": ""
    },
    {
        "start": 660.32,
        "end": 673.44,
        "text": "And no one can do it for you. Mirror talk. Daily self-speaking habit. Every night, just for 5 minutes, go to the",
        "textdich": ""
    },
    {
        "start": 670.64,
        "end": 676.8,
        "text": "mirror and speak to yourself in English.",
        "textdich": ""
    },
    {
        "start": 673.44,
        "end": 687.76,
        "text": "You can talk about what you did today, what you're thinking about, what you're planning tomorrow, how you feel. It doesn't matter if your English is",
        "textdich": ""
    },
    {
        "start": 685.04,
        "end": 696.88,
        "text": "broken. It doesn't matter if you repeat the same words. You are training your mouth and your brain to work together.",
        "textdich": ""
    },
    {
        "start": 693.839,
        "end": 699.68,
        "text": "This is where fluency begins.",
        "textdich": ""
    },
    {
        "start": 696.88,
        "end": 705.44,
        "text": "Look into your own eyes. Speak your truth in English.",
        "textdich": ""
    },
    {
        "start": 701.6,
        "end": 707.2,
        "text": "Speak slowly, honestly, confidently.",
        "textdich": ""
    },
    {
        "start": 705.44,
        "end": 717.92,
        "text": "This also builds your emotional confidence because when you can speak to yourself, you are no longer afraid of speaking to others. Record yourself once",
        "textdich": ""
    },
    {
        "start": 715.6,
        "end": 727.04,
        "text": "a week. Most learners are afraid to hear their voice. But this fear is blocking your growth. Choose a topic. Speak for",
        "textdich": ""
    },
    {
        "start": 724.64,
        "end": 736.8,
        "text": "two to three minutes in English. Record it. Then listen to it the next day. Ask yourself, where did I pause? Where did I",
        "textdich": ""
    },
    {
        "start": 734.56,
        "end": 743.12,
        "text": "make grammar mistakes? Did I sound confident? Did I speak clearly?",
        "textdich": ""
    },
    {
        "start": 740.16,
        "end": 745.36,
        "text": "This is how you become your own coach.",
        "textdich": ""
    },
    {
        "start": 743.12,
        "end": 751.12,
        "text": "No one else has to correct you. You will hear your mistakes. You will fix them.",
        "textdich": ""
    },
    {
        "start": 748.399,
        "end": 760.639,
        "text": "And week by week, your voice will become stronger. Your speaking will become more natural. Fluent speaking is not about",
        "textdich": ""
    },
    {
        "start": 756.72,
        "end": 772.32,
        "text": "knowing more. It's about saying more. out loud every day. You can know everything about English, but if your mouth is silent, you will never feel",
        "textdich": ""
    },
    {
        "start": 769.44,
        "end": 782.88,
        "text": "fluent. But if you train your mouth like this, even with basic vocabulary, you will feel confidence, clarity, and control.",
        "textdich": ""
    },
    {
        "start": 780.48,
        "end": 786.16,
        "text": "That is fluency.",
        "textdich": ""
    },
    {
        "start": 782.88,
        "end": 789.839,
        "text": "5 minutes shadowing with a short video.",
        "textdich": ""
    },
    {
        "start": 786.16,
        "end": 794.079,
        "text": "3 minutes mirror talk about your day.",
        "textdich": ""
    },
    {
        "start": 789.839,
        "end": 796.72,
        "text": "3 to 2:1 drill on a simple topic.",
        "textdich": ""
    },
    {
        "start": 794.079,
        "end": 805.68,
        "text": "Weekly recording every Sunday. That's it. You don't need long hours. You just need daily movement of your mouth with",
        "textdich": ""
    },
    {
        "start": 802.32,
        "end": 810.48,
        "text": "English. This will give you the fluency that grammar books can't.",
        "textdich": ""
    },
    {
        "start": 808.48,
        "end": 819.2,
        "text": "This will give you the voice you're dreaming of. Step three, build brain fluency.",
        "textdich": ""
    },
    {
        "start": 816.399,
        "end": 827.2,
        "text": "Train your mind to think in English. If your brain is still thinking in your native language, then speaking English will always feel slow, broken, and",
        "textdich": ""
    },
    {
        "start": 825.6,
        "end": 830.399,
        "text": "unnatural.",
        "textdich": ""
    },
    {
        "start": 827.2,
        "end": 842.16,
        "text": "You will always translate in your head, forget words, pause between sentences, feel nervous when speaking. This is why many learners say, \"I understand",
        "textdich": ""
    },
    {
        "start": 838.48,
        "end": 851.76,
        "text": "English, but I can't speak. I freeze when I have to talk. I know the sentence, but it doesn't come out.",
        "textdich": ""
    },
    {
        "start": 848.88,
        "end": 861.36,
        "text": "These are not speaking problems. These are thinking problems. Because the real battle is not in your tongue. It's in",
        "textdich": ""
    },
    {
        "start": 857.519,
        "end": 870.32,
        "text": "your thoughts. Brain fluency means your thoughts flow in English automatically, clearly, and emotionally.",
        "textdich": ""
    },
    {
        "start": 867.44,
        "end": 878.079,
        "text": "You're not stopping to translate. You're not switching between languages. You're not struggling to find words.",
        "textdich": ""
    },
    {
        "start": 875.76,
        "end": 887.6,
        "text": "English becomes the default voice inside your mind. That's what true fluency feels like. And in this step, I will",
        "textdich": ""
    },
    {
        "start": 884.639,
        "end": 896.72,
        "text": "show you exactly how to train it, even if you're a complete beginner. Most people never build brain fluency because",
        "textdich": ""
    },
    {
        "start": 893.68,
        "end": 908.8,
        "text": "they were never taught how. Schools and YouTube videos only teach vocabulary, grammar, phrases, listening, and reading. But no one teaches you how to",
        "textdich": ""
    },
    {
        "start": 906.16,
        "end": 916.0,
        "text": "think in English. No one shows you how to rewire your mind from your native language to English.",
        "textdich": ""
    },
    {
        "start": 913.279,
        "end": 922.48,
        "text": "So learners do everything except the one thing that matters most.",
        "textdich": ""
    },
    {
        "start": 919.36,
        "end": 931.36,
        "text": "Practicing thoughts in English. That's why they feel stuck. That's why they feel like English is always foreign. But",
        "textdich": ""
    },
    {
        "start": 928.0,
        "end": 942.8,
        "text": "we're about to change that. Your goal is simple. to build an English operating system inside your brain just like your phone runs on Android or iOS.",
        "textdich": ""
    },
    {
        "start": 941.04,
        "end": 951.68,
        "text": "Your thoughts run on your language system. Right now, your brain runs on your native language.",
        "textdich": ""
    },
    {
        "start": 948.079,
        "end": 960.24,
        "text": "We will now install a parallel system where your brain can think in English without effort. This is possible.",
        "textdich": ""
    },
    {
        "start": 957.6,
        "end": 967.92,
        "text": "Millions have done it. And if you follow this process, so will you. Let's now go deep into the three tools that will",
        "textdich": ""
    },
    {
        "start": 965.04,
        "end": 974.32,
        "text": "rewire your brain to think in English fast, clear, and emotionally.",
        "textdich": ""
    },
    {
        "start": 971.36,
        "end": 976.959,
        "text": "Tool one, the English thought loop.",
        "textdich": ""
    },
    {
        "start": 974.32,
        "end": 984.399,
        "text": "Train the flow of thoughts. They speak in broken parts.",
        "textdich": ""
    },
    {
        "start": 979.12,
        "end": 986.959,
        "text": "I want to eat something good.",
        "textdich": ""
    },
    {
        "start": 984.399,
        "end": 989.12,
        "text": "They don't speak in a flow.",
        "textdich": ""
    },
    {
        "start": 986.959,
        "end": 994.72,
        "text": "Why? Because they never trained their brain to complete thoughts in English.",
        "textdich": ""
    },
    {
        "start": 991.759,
        "end": 1001.199,
        "text": "So, we fix it with thought loops. Pick a simple sentence and then extend it using your thoughts.",
        "textdich": ""
    },
    {
        "start": 999.36,
        "end": 1015.12,
        "text": "Example, I'm feeling tired because I didn't sleep well and I was watching a video and then I scrolled Instagram and now I have to finish my work. See",
        "textdich": ""
    },
    {
        "start": 1012.959,
        "end": 1027.6,
        "text": "the flow? That's how you speak in your native language. Full thoughts, not isolated words. Now train that same habit in English. Start with I like I",
        "textdich": ""
    },
    {
        "start": 1025.679,
        "end": 1042.799,
        "text": "like coffee alanat especially in the morning with milk and I usually drink two cups before 9:00 a.m. or I don't know. I don't know what to wear today.",
        "textdich": ""
    },
    {
        "start": 1038.959,
        "end": 1047.36,
        "text": "Maybe jeans or something more formal. I think it might rain.",
        "textdich": ""
    },
    {
        "start": 1044.959,
        "end": 1056.64,
        "text": "Practice these flows for 5 minutes every day. Don't stop, don't edit, don't translate, just think and speak.",
        "textdich": ""
    },
    {
        "start": 1054.72,
        "end": 1069.039,
        "text": "This builds the natural rhythm of English inside your brain. Tool two, the no translation zones. Force your brain to think in English.",
        "textdich": ""
    },
    {
        "start": 1066.559,
        "end": 1079.36,
        "text": "If you want to think in English, you must create situations where translation is not allowed. These are your no translation zones. Small moments where",
        "textdich": ""
    },
    {
        "start": 1077.44,
        "end": 1092.72,
        "text": "you train your brain to use only English. Choose one to two simple daily activities and promise yourself. In this moment, I will think only in English.",
        "textdich": ""
    },
    {
        "start": 1088.96,
        "end": 1095.52,
        "text": "Even if it's broken, even if it's slow.",
        "textdich": ""
    },
    {
        "start": 1092.72,
        "end": 1101.6,
        "text": "Start small. Brushing teeth. Taking a shower. Making tea. Getting dressed.",
        "textdich": ""
    },
    {
        "start": 1098.0,
        "end": 1112.16,
        "text": "Like I'm brushing. This side. Now the front. Okay. Done. I look sleepy. This shirt is blue. Should I wear this or",
        "textdich": ""
    },
    {
        "start": 1108.16,
        "end": 1122.559,
        "text": "something else? Hm. The grammar doesn't matter. What matters is this. You are building the habit of English thoughts.",
        "textdich": ""
    },
    {
        "start": 1119.2,
        "end": 1134.4,
        "text": "After one week, add more zones. grocery shopping, cooking, going for a walk, waiting for a bus. Eventually, your whole day becomes English friendly and",
        "textdich": ""
    },
    {
        "start": 1131.679,
        "end": 1138.96,
        "text": "your brain stops using translation as a crutch.",
        "textdich": ""
    },
    {
        "start": 1136.0,
        "end": 1145.12,
        "text": "Tool three, the emotion connection method. Attach English to your feelings.",
        "textdich": ""
    },
    {
        "start": 1143.039,
        "end": 1156.88,
        "text": "Your brain remembers language faster when it's connected to emotion. Think about your native language. You didn't learn it by memorizing grammar. You",
        "textdich": ""
    },
    {
        "start": 1152.08,
        "end": 1166.72,
        "text": "learned it through hunger. I want food, pain, it hurts, joy, I'm happy, anger, leave me alone.",
        "textdich": ""
    },
    {
        "start": 1164.0,
        "end": 1168.48,
        "text": "These were real life emotions.",
        "textdich": ""
    },
    {
        "start": 1166.72,
        "end": 1178.72,
        "text": "And they gave real power to your language. You must do the same with English. How? Start giving voice to your feelings in English.",
        "textdich": ""
    },
    {
        "start": 1175.76,
        "end": 1189.44,
        "text": "When you feel excited, say, \"This is amazing.\" Frustrated, say, \"I'm really tired of this.\" Nervous? Say, \"Why do I",
        "textdich": ""
    },
    {
        "start": 1185.2,
        "end": 1192.24,
        "text": "feel so scared?\" Proud? Say, \"I did it.",
        "textdich": ""
    },
    {
        "start": 1189.44,
        "end": 1200.88,
        "text": "I'm proud of myself.\" Even if you say it alone, even if you whisper, even if you say it in your mind, this trains your",
        "textdich": ""
    },
    {
        "start": 1198.08,
        "end": 1204.0,
        "text": "brain to use English in real emotion.",
        "textdich": ""
    },
    {
        "start": 1200.88,
        "end": 1216.0,
        "text": "And that's when fluency becomes natural because fluency is not just about grammar. It's about connecting your thoughts and feelings to English in real",
        "textdich": ""
    },
    {
        "start": 1210.88,
        "end": 1220.32,
        "text": "time. Pick a topic, dream, food, friend, weekend.",
        "textdich": ""
    },
    {
        "start": 1217.52,
        "end": 1230.559,
        "text": "Think about it for 2 minutes only in English. Speak it out loud in full thoughts. Not perfect sentences, just flowing ideas.",
        "textdich": ""
    },
    {
        "start": 1227.76,
        "end": 1243.44,
        "text": "Write five feelings you had today. and describe why in English. Create two no translation zones for your day, like brushing teeth or making tea. Before",
        "textdich": ""
    },
    {
        "start": 1240.159,
        "end": 1246.799,
        "text": "bed, speak three positive affirmations.",
        "textdich": ""
    },
    {
        "start": 1243.44,
        "end": 1254.24,
        "text": "I'm becoming fluent. English is part of me. My brain is learning fast.",
        "textdich": ""
    },
    {
        "start": 1251.12,
        "end": 1264.24,
        "text": "This is mental gym for fluency. Do it daily and your mind will stop thinking in your native language and start living in English.",
        "textdich": ""
    },
    {
        "start": 1262.32,
        "end": 1273.36,
        "text": "You don't have to speak perfect English to be fluent. You just need to think clearly and confidently in English.",
        "textdich": ""
    },
    {
        "start": 1270.799,
        "end": 1285.6,
        "text": "When your brain thinks in English, speaking becomes automatic. When your brain flows in English, words come faster, sentences come smoother,",
        "textdich": ""
    },
    {
        "start": 1282.799,
        "end": 1294.88,
        "text": "confidence becomes real. So don't just train your mouth, don't just read books, train your thoughts, train your inner",
        "textdich": ""
    },
    {
        "start": 1291.679,
        "end": 1307.44,
        "text": "voice. Make English the language of your mind and fluency will follow you everywhere. Step four, master the power of repetition.",
        "textdich": ""
    },
    {
        "start": 1303.76,
        "end": 1317.6,
        "text": "Speak less new, speak more deep. Most learners are addicted to new. But fluency comes from repeating the same things until they become part of you. In",
        "textdich": ""
    },
    {
        "start": 1315.039,
        "end": 1328.32,
        "text": "today's world, we have unlimited access to new English videos, new vocabulary apps, new grammar hacks, new YouTube channels, new reals, podcasts, and",
        "textdich": ""
    },
    {
        "start": 1326.88,
        "end": 1330.96,
        "text": "teachers.",
        "textdich": ""
    },
    {
        "start": 1328.32,
        "end": 1341.76,
        "text": "Every day you're chasing the next tip, the next trick, the next method. But your brain is not hungry for new information. It's hungry for repetition.",
        "textdich": ""
    },
    {
        "start": 1339.679,
        "end": 1353.52,
        "text": "Because repetition is how your brain says, \"This is important.\" When you hear something once, your brain says, \"Interesting.\"",
        "textdich": ""
    },
    {
        "start": 1350.559,
        "end": 1364.159,
        "text": "When you hear it again, it says, \"I've heard this before.\" when you hear it 20 times and say it out loud. Okay, this is",
        "textdich": ""
    },
    {
        "start": 1360.32,
        "end": 1366.799,
        "text": "important. I will remember this forever.",
        "textdich": ""
    },
    {
        "start": 1364.159,
        "end": 1378.0,
        "text": "That's how memory works. That's how fluency works. You didn't learn your native language by learning 100 new words every day. You learned by hearing",
        "textdich": ""
    },
    {
        "start": 1375.36,
        "end": 1388.559,
        "text": "the same few words and phrases 10,000 times. You learned by repeating what others said. You learned by living inside repetition.",
        "textdich": ""
    },
    {
        "start": 1385.52,
        "end": 1400.64,
        "text": "The golden rule of repetition. Repeat one lesson 10 times, not 10 lessons one time. That one rule can change everything. Because most people touch",
        "textdich": ""
    },
    {
        "start": 1396.799,
        "end": 1409.76,
        "text": "everything but master nothing. They watch a video once, write a word once, practice a sentence once, shadow once,",
        "textdich": ""
    },
    {
        "start": 1406.4,
        "end": 1418.32,
        "text": "and move on. Then they say, \"Why can't I speak clearly?\" Because the sentence didn't become part of you yet. You just",
        "textdich": ""
    },
    {
        "start": 1414.799,
        "end": 1428.96,
        "text": "touched it. You didn't own it. Repeat sentences, not words. Vocabulary is important, but words alone don't give fluency. You can know the word",
        "textdich": ""
    },
    {
        "start": 1427.2,
        "end": 1430.72,
        "text": "opportunity.",
        "textdich": ""
    },
    {
        "start": 1428.96,
        "end": 1441.12,
        "text": "But if you don't know how to use it in a sentence, it's useless. That's why in 2026, focus on sentence repetition. Instead of",
        "textdich": ""
    },
    {
        "start": 1438.24,
        "end": 1446.48,
        "text": "memorizing the word opportunity, memorize and repeat.",
        "textdich": ""
    },
    {
        "start": 1443.6,
        "end": 1449.44,
        "text": "This is a great opportunity.",
        "textdich": ""
    },
    {
        "start": 1446.48,
        "end": 1452.559,
        "text": "I don't want to miss this opportunity.",
        "textdich": ""
    },
    {
        "start": 1449.44,
        "end": 1461.84,
        "text": "She gave me an opportunity to learn. Now use these in speaking, writing, mirror practice. Say each of them 10 to 20",
        "textdich": ""
    },
    {
        "start": 1458.08,
        "end": 1470.64,
        "text": "times. Make them automatic. Because when your brain remembers full sentences, you don't have to think when speaking. You",
        "textdich": ""
    },
    {
        "start": 1467.279,
        "end": 1480.64,
        "text": "just speak. Build a personal sentence bank. Create your own sentence bank, not just a vocabulary list. Every time you",
        "textdich": ""
    },
    {
        "start": 1477.6,
        "end": 1491.36,
        "text": "hear a powerful sentence or phrase, write it down. Review it every day. Pick one to two sentences and repeat them out",
        "textdich": ""
    },
    {
        "start": 1486.88,
        "end": 1494.4,
        "text": "loud 20 times. Use them in your journal.",
        "textdich": ""
    },
    {
        "start": 1491.36,
        "end": 1498.64,
        "text": "Use them in mirror talk. Use them in your voice recordings.",
        "textdich": ""
    },
    {
        "start": 1496.559,
        "end": 1505.679,
        "text": "This is how those sentences enter your mouth, your memory, and your fluency system.",
        "textdich": ""
    },
    {
        "start": 1503.2,
        "end": 1518.96,
        "text": "If you collect two sentences a day, you'll have 60 new usable sentences a month. But more importantly, you'll have deeply repeated confidence",
        "textdich": ""
    },
    {
        "start": 1513.84,
        "end": 1524.96,
        "text": "patterns. Use the 5x speaking method, internal repetition system.",
        "textdich": ""
    },
    {
        "start": 1522.08,
        "end": 1528.4,
        "text": "Take one sentence.",
        "textdich": ""
    },
    {
        "start": 1524.96,
        "end": 1531.2,
        "text": "I'm not comfortable with this.",
        "textdich": ""
    },
    {
        "start": 1528.4,
        "end": 1539.039,
        "text": "Repeat it out loud five times in your normal voice. Repeat it five times slowly and emotionally.",
        "textdich": ""
    },
    {
        "start": 1536.72,
        "end": 1551.919,
        "text": "Feel the tone. Say it like you're talking to a friend. Repeat it five times in different moods. Angry, happy, tired, professional, casual. Use it in",
        "textdich": ""
    },
    {
        "start": 1548.96,
        "end": 1554.64,
        "text": "three different imaginary conversations.",
        "textdich": ""
    },
    {
        "start": 1551.919,
        "end": 1562.32,
        "text": "Write a small paragraph using it. This is repetition that works. This is repetition that transforms.",
        "textdich": ""
    },
    {
        "start": 1559.36,
        "end": 1571.279,
        "text": "This is how your brain says, \"Okay, I know this. I can use it any time.\" Watch one video 10 times. The deep learning",
        "textdich": ""
    },
    {
        "start": 1568.0,
        "end": 1584.0,
        "text": "rule. Choose one English learning video, not 10. Watch it 10 times. First time, just listen. Second time, read subtitles. Third time, repeat phrases.",
        "textdich": ""
    },
    {
        "start": 1581.039,
        "end": 1586.48,
        "text": "Fourth time, shadow every sentence.",
        "textdich": ""
    },
    {
        "start": 1584.0,
        "end": 1593.36,
        "text": "Fifth time, pause and explain in your own words. Sixth time, write a summary.",
        "textdich": ""
    },
    {
        "start": 1590.4,
        "end": 1604.559,
        "text": "Seventh time, teach it to someone or a mirror. Eighth time, copy the speaking style. Ninth time, speak about your",
        "textdich": ""
    },
    {
        "start": 1600.799,
        "end": 1612.32,
        "text": "opinion. 10th time, use sentences from the video in your own life. Most people would skip to a new video after the",
        "textdich": ""
    },
    {
        "start": 1608.96,
        "end": 1622.0,
        "text": "second watch, but you, you are not most people. You are training like a fluent speaker and fluent people don't rush.",
        "textdich": ""
    },
    {
        "start": 1617.76,
        "end": 1633.2,
        "text": "They repeat deeply. Return to the basics again and again. You know the sentence, how are you? But how many different ways",
        "textdich": ""
    },
    {
        "start": 1628.72,
        "end": 1641.76,
        "text": "can you answer? I'm fine. I'm okay. I've been better. Not too bad. Actually, I'm a bit stressed. These are simple, but",
        "textdich": ""
    },
    {
        "start": 1639.36,
        "end": 1650.4,
        "text": "they're powerful. Don't be ashamed of repeating basic things. Repetition of basics is how great speakers are born.",
        "textdich": ""
    },
    {
        "start": 1647.279,
        "end": 1653.84,
        "text": "Even native speakers say, \"I don't know.",
        "textdich": ""
    },
    {
        "start": 1650.4,
        "end": 1665.44,
        "text": "It's okay. Let me think.\" That's a good point. These are used 100 times more than complex words. So, repeat them, master them, own them. If you follow",
        "textdich": ""
    },
    {
        "start": 1663.44,
        "end": 1675.12,
        "text": "everything in this step for just one month, you'll notice your sentences come out faster. Your confidence increases.",
        "textdich": ""
    },
    {
        "start": 1672.48,
        "end": 1685.279,
        "text": "You hesitate less. You sound more natural. You stop translating. You stop searching for new videos because the old ones still teach you. And most",
        "textdich": ""
    },
    {
        "start": 1683.76,
        "end": 1693.76,
        "text": "importantly, you begin to feel this is not a foreign language anymore.",
        "textdich": ""
    },
    {
        "start": 1690.559,
        "end": 1698.24,
        "text": "This is part of who I am. That's the magic of deep repetition.",
        "textdich": ""
    },
    {
        "start": 1696.24,
        "end": 1708.0,
        "text": "Pick two sentences from your sentence bank. Repeat each 10 to 20 times. Use each in speaking, writing, and mirror",
        "textdich": ""
    },
    {
        "start": 1705.12,
        "end": 1717.12,
        "text": "talk. Shadow one minute of a video five times. Review yesterday's sentence and repeat it again. Repeat this every",
        "textdich": ""
    },
    {
        "start": 1713.84,
        "end": 1727.52,
        "text": "single day. Fluency is not about doing more. It's about going deeper. And repetition is the deepest learning you'll ever do. Fluency is not about",
        "textdich": ""
    },
    {
        "start": 1725.039,
        "end": 1739.44,
        "text": "speed. It's not about memorizing thousands of things. Fluency is about repeating a few powerful things until they become part of you. So stop",
        "textdich": ""
    },
    {
        "start": 1736.08,
        "end": 1749.52,
        "text": "chasing. Start mastering. Repeat with intensity. Repeat with love. Repeat like your future depends on it because it",
        "textdich": ""
    },
    {
        "start": 1745.679,
        "end": 1762.399,
        "text": "does. And when 2026 ends, you'll look back and realize I didn't become fluent because I knew more. I became fluent because I repeated",
        "textdich": ""
    },
    {
        "start": 1757.6,
        "end": 1765.279,
        "text": "better. Step five, practice speaking.",
        "textdich": ""
    },
    {
        "start": 1762.399,
        "end": 1774.32,
        "text": "Even if you're completely alone, you don't need a speaking partner. You don't need to move to an English-speaking country. You don't even",
        "textdich": ""
    },
    {
        "start": 1771.44,
        "end": 1783.84,
        "text": "need a classroom or a tutor. To become fluent in English, what you truly need is a system that makes you speak every",
        "textdich": ""
    },
    {
        "start": 1780.64,
        "end": 1792.159,
        "text": "day. A mindset that doesn't wait for permission. and a strategy that turns silence into progress.",
        "textdich": ""
    },
    {
        "start": 1789.52,
        "end": 1803.76,
        "text": "This step is for those who feel alone, who feel forgotten, who feel like the world isn't giving them a chance. And I'm going to prove to you, you don't",
        "textdich": ""
    },
    {
        "start": 1799.6,
        "end": 1806.48,
        "text": "need the world. You just need yourself.",
        "textdich": ""
    },
    {
        "start": 1803.76,
        "end": 1816.08,
        "text": "Most learners never speak fluently, even after years of studying, because they wait for someone else. They wait for a",
        "textdich": ""
    },
    {
        "start": 1813.279,
        "end": 1825.44,
        "text": "native speaker to talk to, a perfect tutor, an English-speaking environment, a job interview, a class or partner or",
        "textdich": ""
    },
    {
        "start": 1822.399,
        "end": 1833.52,
        "text": "moment that may never come. And every day they wait, their confidence dies a little more. Their voice becomes weaker.",
        "textdich": ""
    },
    {
        "start": 1830.88,
        "end": 1844.0,
        "text": "Their dreams move farther. Their heart gets quieter because they believe I'm alone. so I can't practice.",
        "textdich": ""
    },
    {
        "start": 1841.2,
        "end": 1850.799,
        "text": "But that belief is a lie. And once you understand that, your fluency journey becomes unstoppable.",
        "textdich": ""
    },
    {
        "start": 1848.72,
        "end": 1863.12,
        "text": "Most fluent English speakers you see today, even those on YouTube or stage, spend hundreds of hours practicing alone, in front of mirrors, whispering",
        "textdich": ""
    },
    {
        "start": 1859.52,
        "end": 1870.64,
        "text": "in bed, talking to walls, repeating sentences on walks, speaking out loud to themselves in empty rooms.",
        "textdich": ""
    },
    {
        "start": 1868.64,
        "end": 1879.279,
        "text": "They weren't lucky. They were determined. They didn't wait for a partner. They became their own partner.",
        "textdich": ""
    },
    {
        "start": 1876.72,
        "end": 1892.08,
        "text": "This is what we call solo speaking mastery. And it is one of the most powerful secrets of fluency. Your goal is to speak English out loud every",
        "textdich": ""
    },
    {
        "start": 1888.559,
        "end": 1901.519,
        "text": "single day with no partner, no fear, and no excuses. We will build your private speaking world. A world where you think",
        "textdich": ""
    },
    {
        "start": 1898.32,
        "end": 1911.2,
        "text": "in English, speak in English, express your emotions, practice real life conversations, build deep fluency alone. These are the",
        "textdich": ""
    },
    {
        "start": 1908.96,
        "end": 1920.72,
        "text": "five systems that will turn your silence into fluency. Pillar one, mirror talk therapy. The most powerful speaking",
        "textdich": ""
    },
    {
        "start": 1917.6,
        "end": 1931.2,
        "text": "habit. Your mirror is the most honest speaking partner in the world. It doesn't laugh. It doesn't interrupt. It doesn't correct you, but it reflects",
        "textdich": ""
    },
    {
        "start": 1928.08,
        "end": 1937.12,
        "text": "your energy, your voice, your fear, and your growth. Stand in front of a mirror.",
        "textdich": ""
    },
    {
        "start": 1934.559,
        "end": 1946.0,
        "text": "Look yourself in the eye. Pick one topic. Your day, your goals, your feelings.",
        "textdich": ""
    },
    {
        "start": 1942.559,
        "end": 1956.799,
        "text": "Speak for 5 minutes without stopping out loud. Don't worry about grammar or vocabulary. Just express why it works.",
        "textdich": ""
    },
    {
        "start": 1954.159,
        "end": 1967.039,
        "text": "You face your fear of speaking. You build confidence through visual feedback. You stop being scared of your own voice. You start owning the language",
        "textdich": ""
    },
    {
        "start": 1964.72,
        "end": 1970.799,
        "text": "with your full body.",
        "textdich": ""
    },
    {
        "start": 1967.039,
        "end": 1978.48,
        "text": "This is not silly. This is how actors, speakers, and leaders train their confidence. And if you do it daily, you",
        "textdich": ""
    },
    {
        "start": 1975.6,
        "end": 1988.88,
        "text": "will start to believe I have a voice in English and I trust it. Pillar two, imaginary conversations. The roleplay",
        "textdich": ""
    },
    {
        "start": 1986.32,
        "end": 1997.84,
        "text": "power. If you don't have someone to talk to, create them. Seriously, your brain doesn't need another human to simulate",
        "textdich": ""
    },
    {
        "start": 1995.039,
        "end": 2002.72,
        "text": "speaking. It just needs intention and imagination.",
        "textdich": ""
    },
    {
        "start": 1999.679,
        "end": 2017.12,
        "text": "Imagine a situation. Job interview, ordering food, meeting a friend, airport check-in. Create both sides of the conversation. Speak it out loud. React,",
        "textdich": ""
    },
    {
        "start": 2011.919,
        "end": 2026.96,
        "text": "pause, smile, ask, answer. Example: Hi, I'd like to order a large coffee, please. Sure. Would you like milk or sugar with that? Milk, no sugar, and",
        "textdich": ""
    },
    {
        "start": 2024.399,
        "end": 2032.0,
        "text": "also one blueberry muffin. All right, your total is $5.",
        "textdich": ""
    },
    {
        "start": 2029.36,
        "end": 2041.84,
        "text": "You're practicing flow, rhythm, sentence structure, pronunciation, listening, and confidence all by yourself.",
        "textdich": ""
    },
    {
        "start": 2038.399,
        "end": 2051.119,
        "text": "Why it works? You prepare for real life situations. You train your reflexes and emotional tone. You become comfortable",
        "textdich": ""
    },
    {
        "start": 2048.079,
        "end": 2060.32,
        "text": "with common dialogues. Do this every day with one new situation. Within 30 days, you will feel ready for any conversation",
        "textdich": ""
    },
    {
        "start": 2056.399,
        "end": 2070.48,
        "text": "in the real world. Pillar three, topic talks. Master your voice on real subjects. Pick a topic. Set a timer.",
        "textdich": ""
    },
    {
        "start": 2067.359,
        "end": 2073.52,
        "text": "Speak. This is called topic talk practice.",
        "textdich": ""
    },
    {
        "start": 2072.0,
        "end": 2085.679,
        "text": "You don't need anyone to ask you questions. You don't need anyone to listen. You are speaking to improve your organization, your ideas, your fluency.",
        "textdich": ""
    },
    {
        "start": 2081.599,
        "end": 2094.639,
        "text": "Choose one topic each day. My dream job, the best day of my life, my biggest fear, why I want to learn English, what",
        "textdich": ""
    },
    {
        "start": 2092.32,
        "end": 2107.119,
        "text": "I would change about the world. Set a timer for 3 minutes. Speak without stopping. Even if you get stuck, say, um, let me think. What I'm trying to say",
        "textdich": ""
    },
    {
        "start": 2103.44,
        "end": 2113.52,
        "text": "is that's still English. That's still fluency. That's how real people speak.",
        "textdich": ""
    },
    {
        "start": 2110.64,
        "end": 2121.2,
        "text": "Over time, you'll stop pausing. You'll stop struggling. You'll start speaking like a storyteller.",
        "textdich": ""
    },
    {
        "start": 2117.839,
        "end": 2130.8,
        "text": "Pillar four, voice journaling. Your daily speaking diary. Writing journals is great, but speaking journals are next",
        "textdich": ""
    },
    {
        "start": 2127.04,
        "end": 2142.64,
        "text": "level. Every night before bed, instead of writing, record yourself speaking about your day. Open a voice recorder app. Speak freely for 2 to 5 minutes.",
        "textdich": ""
    },
    {
        "start": 2139.119,
        "end": 2152.32,
        "text": "what you did, how you felt, what you learned, what you want to improve. Save the recording. Repeat this every night.",
        "textdich": ""
    },
    {
        "start": 2150.0,
        "end": 2156.8,
        "text": "Then once a week, listen to one to two of your old recordings.",
        "textdich": ""
    },
    {
        "start": 2154.72,
        "end": 2162.32,
        "text": "You will cry with pride when you realize, \"I sound better than last week.",
        "textdich": ""
    },
    {
        "start": 2160.56,
        "end": 2171.2,
        "text": "I sound like someone who speaks English.\" This is not just fluency training. This is emotional healing.",
        "textdich": ""
    },
    {
        "start": 2169.28,
        "end": 2181.76,
        "text": "You're recording the voice of a person who refused to give up. Pillar five, shadow conversations. Copy, speak, own.",
        "textdich": ""
    },
    {
        "start": 2179.76,
        "end": 2193.28,
        "text": "You've seen this before, but let's use it only for solo fluency. Now, use any video with English speakers, movies, interviews, audiobooks. Listen to a",
        "textdich": ""
    },
    {
        "start": 2189.44,
        "end": 2203.92,
        "text": "sentence. Pause. Repeat it exactly. Same tone, rhythm, speed, emotion. Repeat again and again until your mouth owns",
        "textdich": ""
    },
    {
        "start": 2200.96,
        "end": 2213.359,
        "text": "it. Do this with one minute of video per day. By the end of the week, your voice will start to sound more natural, confident, and nativeike.",
        "textdich": ""
    },
    {
        "start": 2211.04,
        "end": 2220.32,
        "text": "This is how you train intonation, confidence, emotional tone, and rhythm all alone.",
        "textdich": ""
    },
    {
        "start": 2218.4,
        "end": 2223.119,
        "text": "Let's talk about the emotional side.",
        "textdich": ""
    },
    {
        "start": 2220.32,
        "end": 2232.079,
        "text": "Now, this is the part most fluency coaches never talk about. Here's what you may feel. I feel silly talking to a mirror.",
        "textdich": ""
    },
    {
        "start": 2230.32,
        "end": 2236.24,
        "text": "I feel weird pretending to have a conversation.",
        "textdich": ""
    },
    {
        "start": 2233.599,
        "end": 2242.48,
        "text": "What if someone hears me? This doesn't feel real. Talking alone is not crazy.",
        "textdich": ""
    },
    {
        "start": 2240.48,
        "end": 2245.52,
        "text": "It's courageous.",
        "textdich": ""
    },
    {
        "start": 2242.48,
        "end": 2247.359,
        "text": "Every master talks to themselves.",
        "textdich": ""
    },
    {
        "start": 2245.52,
        "end": 2255.92,
        "text": "You just don't see them when they're doing it. Singers rehearse lyrics alone.",
        "textdich": ""
    },
    {
        "start": 2252.24,
        "end": 2258.24,
        "text": "Actors repeat scenes in their bedroom.",
        "textdich": ""
    },
    {
        "start": 2255.92,
        "end": 2270.0,
        "text": "Speakers practice their speech to an empty wall. You're not crazy. You're a warrior. You're rewiring your brain, your voice, your identity with no",
        "textdich": ""
    },
    {
        "start": 2266.64,
        "end": 2273.44,
        "text": "audience, no applause, no support.",
        "textdich": ""
    },
    {
        "start": 2270.0,
        "end": 2280.88,
        "text": "That's not weird. That's heroic. Your alone practice is not fake. It's real preparation.",
        "textdich": ""
    },
    {
        "start": 2278.24,
        "end": 2292.64,
        "text": "Every time you speak alone, you're building mouth memory. You're building courage. You're training your brain to react faster in real life. So when a",
        "textdich": ""
    },
    {
        "start": 2289.44,
        "end": 2302.32,
        "text": "real conversation happens, your mouth doesn't freeze. Your voice doesn't shake. Your thoughts don't disappear.",
        "textdich": ""
    },
    {
        "start": 2299.2,
        "end": 2308.96,
        "text": "You've already trained for it. Speaking alone is how you build unbreakable confidence.",
        "textdich": ""
    },
    {
        "start": 2306.4,
        "end": 2319.76,
        "text": "The truth is, if you can speak to yourself confidently in English, you can speak to anyone in the world. Because you've already faced the fear of being",
        "textdich": ""
    },
    {
        "start": 2316.96,
        "end": 2330.96,
        "text": "judged. You've already practiced without praise. You've already chosen to believe in yourself when no one else was watching. That kind of fluency,",
        "textdich": ""
    },
    {
        "start": 2328.32,
        "end": 2341.28,
        "text": "no teacher can give it to you. No classroom can replace it. It's born in silence, built in your room, and carried in your",
        "textdich": ""
    },
    {
        "start": 2338.0,
        "end": 2349.839,
        "text": "heart. Stop saying, \"I can't practice because I'm alone.\" Start saying, \"I speak fluently because I practice alone.\"",
        "textdich": ""
    },
    {
        "start": 2348.0,
        "end": 2359.2,
        "text": "You are not weak because you have no partner. You are strong because you keep going without one. So talk to your",
        "textdich": ""
    },
    {
        "start": 2355.52,
        "end": 2365.119,
        "text": "mirror. Speak to your phone. Create your own conversations.",
        "textdich": ""
    },
    {
        "start": 2361.119,
        "end": 2374.8,
        "text": "Voice your emotions. Repeat your truths because the voice you build in private will one day speak on stages, in",
        "textdich": ""
    },
    {
        "start": 2370.56,
        "end": 2378.56,
        "text": "interviews, in relationships, in dreams.",
        "textdich": ""
    },
    {
        "start": 2374.8,
        "end": 2387.359,
        "text": "Step six, speak like a human, not like a textbook. Why do some English learners speak perfectly but sound boring,",
        "textdich": ""
    },
    {
        "start": 2384.0,
        "end": 2389.599,
        "text": "robotic, and awkward? You've heard them.",
        "textdich": ""
    },
    {
        "start": 2387.359,
        "end": 2399.04,
        "text": "Their grammar is perfect. Their vocabulary is advanced. Their pronunciation is technically correct.",
        "textdich": ""
    },
    {
        "start": 2394.88,
        "end": 2407.52,
        "text": "And yet something feels wrong. Their English feels cold, empty, uncomfortable because they're not speaking like a",
        "textdich": ""
    },
    {
        "start": 2405.119,
        "end": 2420.079,
        "text": "person. They're speaking like a grammar machine. Now think about this. You've also seen people who make grammar mistakes, who don't use big words, but",
        "textdich": ""
    },
    {
        "start": 2416.88,
        "end": 2430.079,
        "text": "when they speak, you feel something. You listen, you smile, you connect. That's the difference. That's the goal of this",
        "textdich": ""
    },
    {
        "start": 2426.96,
        "end": 2437.839,
        "text": "step. To help you sound real, natural, and emotionally fluent, even if your English is simple. Let's be honest.",
        "textdich": ""
    },
    {
        "start": 2435.44,
        "end": 2447.28,
        "text": "Memorize grammar rules. Translate perfectly. Speak like a textbook. Use correct English. They never teach you.",
        "textdich": ""
    },
    {
        "start": 2444.8,
        "end": 2458.64,
        "text": "How to express emotion. How to sound like yourself. How to be real in English. How to sound like someone people trust. This is why learners say",
        "textdich": ""
    },
    {
        "start": 2455.119,
        "end": 2461.68,
        "text": "things like, \"I feel fake when I speak.",
        "textdich": ""
    },
    {
        "start": 2458.64,
        "end": 2463.92,
        "text": "I sound nervous, not natural.",
        "textdich": ""
    },
    {
        "start": 2461.68,
        "end": 2469.28,
        "text": "People understand me, but they don't connect with me.",
        "textdich": ""
    },
    {
        "start": 2465.68,
        "end": 2475.92,
        "text": "This is a deep pain and a silent one because on paper everything looks fine.",
        "textdich": ""
    },
    {
        "start": 2472.4,
        "end": 2477.92,
        "text": "But in real life, you don't feel fluent.",
        "textdich": ""
    },
    {
        "start": 2475.92,
        "end": 2490.0,
        "text": "You feel uncomfortable. That's not fluency. That's performance. Now, let's fix that forever. When you speak your native language, you use pauses. You",
        "textdich": ""
    },
    {
        "start": 2487.52,
        "end": 2502.079,
        "text": "express emotions. You change your voice with your mood. You don't always speak full sentences. You sometimes say uh h",
        "textdich": ""
    },
    {
        "start": 2497.92,
        "end": 2505.44,
        "text": "yeah that's what makes you feel human.",
        "textdich": ""
    },
    {
        "start": 2502.079,
        "end": 2518.16,
        "text": "It's not about speaking correctly. It's about speaking with soul and in English you must build the same freedom. Your goal is to feel like yourself in",
        "textdich": ""
    },
    {
        "start": 2514.72,
        "end": 2531.04,
        "text": "English. To speak in a way that sounds confident, calm, casual, clear, emotionally alive, to make people feel something when you speak, not just",
        "textdich": ""
    },
    {
        "start": 2528.16,
        "end": 2538.16,
        "text": "understand your words. We'll now learn five transformational techniques to help you get there. And each one will change",
        "textdich": ""
    },
    {
        "start": 2536.24,
        "end": 2548.64,
        "text": "the way you feel when you open your mouth in English. Technique one, speak in chunks, not single words.",
        "textdich": ""
    },
    {
        "start": 2545.839,
        "end": 2553.76,
        "text": "You've been told to memorize vocabulary, but human beings don't speak in words.",
        "textdich": ""
    },
    {
        "start": 2551.839,
        "end": 2563.68,
        "text": "We speak in groups of words that go together naturally. These are called chunks. Let me show you the difference.",
        "textdich": ""
    },
    {
        "start": 2559.68,
        "end": 2575.04,
        "text": "Robotic speech, word by word. I will and go to the store after I finish work. human speech chunked. I'll go to the",
        "textdich": ""
    },
    {
        "start": 2571.76,
        "end": 2580.4,
        "text": "store after work. See the flow. Chunks are how natives speak naturally.",
        "textdich": ""
    },
    {
        "start": 2577.68,
        "end": 2584.8,
        "text": "You know what I mean? It depends on the situation.",
        "textdich": ""
    },
    {
        "start": 2582.0,
        "end": 2593.2,
        "text": "I'm not really sure. Let me get back to you. To be honest, these are the real muscles of spoken English. When you",
        "textdich": ""
    },
    {
        "start": 2590.96,
        "end": 2603.44,
        "text": "learn English in chunks, you don't need to build sentences word by word. You just plug in a chunk and flow continues.",
        "textdich": ""
    },
    {
        "start": 2600.88,
        "end": 2616.24,
        "text": "Watch native speakers, interviews, movies, podcasts. Don't focus on vocabulary. Focus on what phrases they repeat. Write those phrases down. Repeat",
        "textdich": ""
    },
    {
        "start": 2612.56,
        "end": 2621.28,
        "text": "them out loud 10 to 20 times. Use them in your mirror talk and voice journal.",
        "textdich": ""
    },
    {
        "start": 2619.04,
        "end": 2630.4,
        "text": "The more chunks you own, the more natural and automatic you sound. This is how you stop sounding robotic. You start",
        "textdich": ""
    },
    {
        "start": 2626.56,
        "end": 2643.359,
        "text": "sounding real. Technique two, speak with emotion, not just logic. Robotic speakers, focus only on grammar. Say everything flat. Use no tone or feeling.",
        "textdich": ""
    },
    {
        "start": 2640.24,
        "end": 2653.359,
        "text": "Human speakers smile when happy. Lower their voice when serious. Pause when they feel something. Use emotion to guide the message. Same sentence,",
        "textdich": ""
    },
    {
        "start": 2650.64,
        "end": 2656.88,
        "text": "different delivery. I can't believe it.",
        "textdich": ""
    },
    {
        "start": 2653.359,
        "end": 2660.56,
        "text": "Robotic version. I can't believe it.",
        "textdich": ""
    },
    {
        "start": 2656.88,
        "end": 2671.839,
        "text": "Flat. Boring. Human version. I can't believe it. Surprised. I can't believe it. Sad. Gh. I can't believe it. Angry.",
        "textdich": ""
    },
    {
        "start": 2669.44,
        "end": 2679.839,
        "text": "Same words, different emotional energy, completely different feeling. That is how humans communicate. So ask yourself,",
        "textdich": ""
    },
    {
        "start": 2676.88,
        "end": 2688.88,
        "text": "am I just saying words or am I saying feelings? Choose one sentence from a video or show. Say it in five different",
        "textdich": ""
    },
    {
        "start": 2685.28,
        "end": 2692.64,
        "text": "emotions. Record yourself. Listen back.",
        "textdich": ""
    },
    {
        "start": 2688.88,
        "end": 2695.839,
        "text": "Adjust tone, speed, volume, pauses.",
        "textdich": ""
    },
    {
        "start": 2692.64,
        "end": 2704.48,
        "text": "Repeat until it feels real. This is how you train emotional delivery. When you speak like this, people will say your",
        "textdich": ""
    },
    {
        "start": 2700.88,
        "end": 2707.119,
        "text": "English is not only clear, it's alive.",
        "textdich": ""
    },
    {
        "start": 2704.48,
        "end": 2719.2,
        "text": "That's fluency of the soul. Technique three. Stop chasing perfection. Chase connection. This might be the most important lesson of your life. Perfect",
        "textdich": ""
    },
    {
        "start": 2716.4,
        "end": 2722.8,
        "text": "English doesn't make people listen.",
        "textdich": ""
    },
    {
        "start": 2719.2,
        "end": 2730.56,
        "text": "Honest, simple human English does. Let go of fear of mistakes, fear of judgment, fear of grammar errors.",
        "textdich": ""
    },
    {
        "start": 2728.72,
        "end": 2741.119,
        "text": "Because native speakers make mistakes, too. They say, um, they change sentences halfway. They start and restart. They",
        "textdich": ""
    },
    {
        "start": 2737.76,
        "end": 2747.119,
        "text": "forget words but they keep speaking because their focus is not perfection.",
        "textdich": ""
    },
    {
        "start": 2743.76,
        "end": 2756.56,
        "text": "Their focus is connection. Speak slowly, clearly, and honestly. Make eye contact even with yourself in the mirror. Use",
        "textdich": ""
    },
    {
        "start": 2753.359,
        "end": 2765.52,
        "text": "your hands to explain. Use pauses to let the words breathe. Say, \"I don't know the word, but let me explain.\" And keep",
        "textdich": ""
    },
    {
        "start": 2762.24,
        "end": 2774.88,
        "text": "going. This is confidence, not grammar, not vocabulary, but courage to keep speaking like a human. Technique four,",
        "textdich": ""
    },
    {
        "start": 2771.92,
        "end": 2779.119,
        "text": "use everyday expressions, not academic English.",
        "textdich": ""
    },
    {
        "start": 2776.4,
        "end": 2785.92,
        "text": "Don't say, I find this experience to be quite pleasurable and beneficial.",
        "textdich": ""
    },
    {
        "start": 2782.24,
        "end": 2794.72,
        "text": "Say, I really liked it. It was fun and helpful. Use normal words. Use how you speak in your language, in your real",
        "textdich": ""
    },
    {
        "start": 2791.599,
        "end": 2796.88,
        "text": "life. and match that energy in English.",
        "textdich": ""
    },
    {
        "start": 2794.72,
        "end": 2802.079,
        "text": "Native speakers use basic language every day. You got to be kidding me. Come on.",
        "textdich": ""
    },
    {
        "start": 2800.56,
        "end": 2805.119,
        "text": "Seriously?",
        "textdich": ""
    },
    {
        "start": 2802.079,
        "end": 2814.079,
        "text": "No way. That's awesome. These are expressions full of emotion, attitude, and voice. Learn one per day. Repeat it.",
        "textdich": ""
    },
    {
        "start": 2810.96,
        "end": 2820.079,
        "text": "Use it. Live it. This is what makes your English sound alive, not academic.",
        "textdich": ""
    },
    {
        "start": 2816.8,
        "end": 2832.72,
        "text": "Technique five. Match your body language with your voice. Spoken language is not just your mouth. It's your eyes, face,",
        "textdich": ""
    },
    {
        "start": 2828.4,
        "end": 2841.28,
        "text": "shoulders, hands, posture, breath. If your body is closed, tense, stiff, your English will feel blocked. But when you",
        "textdich": ""
    },
    {
        "start": 2838.72,
        "end": 2852.48,
        "text": "move, when you open your chest, when you breathe deeply, your voice becomes powerful, confident, fluid. That's why public speakers,",
        "textdich": ""
    },
    {
        "start": 2850.0,
        "end": 2864.48,
        "text": "actors, and leaders train their body, not just their words. So stand tall, speak with your hands, smile when appropriate. Breathe while you speak.",
        "textdich": ""
    },
    {
        "start": 2862.48,
        "end": 2872.72,
        "text": "This is how you bring your full presence into English. People don't remember the grammar you use. They remember how you",
        "textdich": ""
    },
    {
        "start": 2870.56,
        "end": 2884.079,
        "text": "made them feel, how confident you looked, how clearly you spoke, how real you sounded. So stop hiding behind textbooks. Stop trying to be perfect.",
        "textdich": ""
    },
    {
        "start": 2880.319,
        "end": 2894.64,
        "text": "Start being yourself in English. Speak with real emotions, real tone, real rhythm, real soul, and watch how the world responds.",
        "textdich": ""
    },
    {
        "start": 2891.92,
        "end": 2904.64,
        "text": "Because when you speak like a human, people listen like humans too. Fluency is not a skill you learn. It is a person",
        "textdich": ""
    },
    {
        "start": 2901.359,
        "end": 2913.28,
        "text": "you become. A person who is patient with themselves, is brave enough to speak imperfectly, is consistent even without",
        "textdich": ""
    },
    {
        "start": 2910.559,
        "end": 2921.839,
        "text": "motivation, is emotionally connected to the language, is no longer waiting for permission.",
        "textdich": ""
    },
    {
        "start": 2917.68,
        "end": 2925.04,
        "text": "So in 2026, make this promise.",
        "textdich": ""
    },
    {
        "start": 2921.839,
        "end": 2928.0,
        "text": "I will not quit English because of fear.",
        "textdich": ""
    },
    {
        "start": 2925.04,
        "end": 2931.04,
        "text": "I will not quit because of mistakes.",
        "textdich": ""
    },
    {
        "start": 2928.0,
        "end": 2934.16,
        "text": "I will not quit because of slow days.",
        "textdich": ""
    },
    {
        "start": 2931.04,
        "end": 2938.24,
        "text": "I will not quit because of comparison.",
        "textdich": ""
    },
    {
        "start": 2934.16,
        "end": 2941.359,
        "text": "I will stay and I will become fluent.",
        "textdich": ""
    },
    {
        "start": 2938.24,
        "end": 2947.839,
        "text": "And if you do that one day, without realizing it, you'll speak English naturally.",
        "textdich": ""
    },
    {
        "start": 2944.88,
        "end": 2952.48,
        "text": "Not because you forced it, but because it became you.",
        "textdich": ""
    },
    {
        "start": 2950.4,
        "end": 2959.839,
        "text": "Because I can't even explain how powerful and life-changing it is to learn how to love yourself.",
        "textdich": ""
    },
    {
        "start": 2957.44,
        "end": 2972.24,
        "text": "We spend our whole lives trying to be loved by others, but we forget the most important relationship we'll ever have, the relationship with ourselves.",
        "textdich": ""
    },
    {
        "start": 2969.28,
        "end": 2983.599,
        "text": "We want others to accept us, but we don't accept ourselves. We want others to treat us with kindness, but we attack ourselves with judgment.",
        "textdich": ""
    },
    {
        "start": 2980.4,
        "end": 2993.839,
        "text": "We want others to stay, but we keep abandoning our own hearts. And that's why this video is important because if you don't love yourself,",
        "textdich": ""
    },
    {
        "start": 2991.359,
        "end": 3006.4,
        "text": "nothing will ever feel enough. Not success, not money, not relationships, not compliments, not even your dreams coming true. And this video will also",
        "textdich": ""
    },
    {
        "start": 3003.599,
        "end": 3015.359,
        "text": "improve your English fluency, emotional vocabulary, and confidence. So listen carefully, repeat the lines, and feel",
        "textdich": ""
    },
    {
        "start": 3012.559,
        "end": 3024.079,
        "text": "every word in your heart. So stay with me till the end and don't forget to subscribe because we grow here together.",
        "textdich": ""
    },
    {
        "start": 3022.0,
        "end": 3026.8,
        "text": "What is self-love?",
        "textdich": ""
    },
    {
        "start": 3024.079,
        "end": 3028.319,
        "text": "Self-love is not about being selfish.",
        "textdich": ""
    },
    {
        "start": 3026.8,
        "end": 3037.76,
        "text": "It's not about thinking you're better than others. It's not about ignoring your flaws or never improving. Self-love",
        "textdich": ""
    },
    {
        "start": 3033.92,
        "end": 3047.68,
        "text": "is a promise, a deep silent promise that says, \"No matter what happens, I will not abandon myself. I will not destroy",
        "textdich": ""
    },
    {
        "start": 3044.64,
        "end": 3058.4,
        "text": "myself for others. I will not speak to myself like I am worthless. I will treat myself with the same love I give to the people I care about.",
        "textdich": ""
    },
    {
        "start": 3055.76,
        "end": 3062.48,
        "text": "Selflove means accepting yourself when you fail.",
        "textdich": ""
    },
    {
        "start": 3060.16,
        "end": 3067.28,
        "text": "It means forgiving yourself when you make mistakes.",
        "textdich": ""
    },
    {
        "start": 3064.72,
        "end": 3072.24,
        "text": "It means trusting yourself even when others doubt you.",
        "textdich": ""
    },
    {
        "start": 3069.68,
        "end": 3076.559,
        "text": "It means being your own safe place when the world feels cold.",
        "textdich": ""
    },
    {
        "start": 3074.88,
        "end": 3088.24,
        "text": "It's how you talk to yourself when you're alone. It's how you look at yourself in the mirror. It's how you take care of your body, your mind, your",
        "textdich": ""
    },
    {
        "start": 3084.96,
        "end": 3098.24,
        "text": "dreams, and your heart. Without self-love, success feels empty. With self-love, even silence feels peaceful.",
        "textdich": ""
    },
    {
        "start": 3095.68,
        "end": 3112.88,
        "text": "And the best part, you don't need to become perfect to love yourself. You just need to start seeing yourself as human, worthy, growing enough. Lesson",
        "textdich": ""
    },
    {
        "start": 3108.559,
        "end": 3116.559,
        "text": "one, learn to accept mistakes.",
        "textdich": ""
    },
    {
        "start": 3112.88,
        "end": 3126.72,
        "text": "You're human, not a robot. You will make mistakes. You'll fail. You'll say the wrong things. You'll trust the wrong people. You'll miss opportunities.",
        "textdich": ""
    },
    {
        "start": 3125.04,
        "end": 3135.68,
        "text": "You'll wish you could go back in time and fix everything. But here's the truth. Most people never hear.",
        "textdich": ""
    },
    {
        "start": 3132.88,
        "end": 3138.96,
        "text": "Mistakes don't make you a bad person.",
        "textdich": ""
    },
    {
        "start": 3135.68,
        "end": 3150.16,
        "text": "Mistakes make you a person. You are not a robot. You are not a machine programmed to be perfect every day. You are a human being with emotions, trauma,",
        "textdich": ""
    },
    {
        "start": 3148.079,
        "end": 3159.76,
        "text": "confusion, pressure, and memories that the world doesn't see. Yet most people live their entire life in self-punishment.",
        "textdich": ""
    },
    {
        "start": 3156.88,
        "end": 3164.64,
        "text": "I shouldn't have done that. I'm so stupid.",
        "textdich": ""
    },
    {
        "start": 3161.44,
        "end": 3168.72,
        "text": "Why did I mess everything up? I always ruin everything.",
        "textdich": ""
    },
    {
        "start": 3166.8,
        "end": 3180.96,
        "text": "They think this guilt will make them better. But guilt doesn't make you better. It makes you stuck. You don't grow by hating yourself. You grow by",
        "textdich": ""
    },
    {
        "start": 3178.0,
        "end": 3193.52,
        "text": "understanding yourself. Imagine a 12-year-old child spills milk on the floor. You don't scream at them and say, \"You're a failure. You don't deserve",
        "textdich": ""
    },
    {
        "start": 3189.68,
        "end": 3203.839,
        "text": "love.\" You say, \"It's okay. Let's clean it up. Be careful next time.\" Why can't you treat yourself like that? You're not 12 anymore.",
        "textdich": ""
    },
    {
        "start": 3201.44,
        "end": 3212.96,
        "text": "But you still make mistakes, just on a bigger scale. And you still deserve kindness, especially from yourself. Because the",
        "textdich": ""
    },
    {
        "start": 3211.2,
        "end": 3222.48,
        "text": "moment you accept your mistakes without shame, that's the moment you begin to change. Say this to yourself every",
        "textdich": ""
    },
    {
        "start": 3218.72,
        "end": 3226.319,
        "text": "morning. I am allowed to make mistakes.",
        "textdich": ""
    },
    {
        "start": 3222.48,
        "end": 3233.68,
        "text": "I learn, I grow, I evolve, but I never abandon myself. Self-love doesn't mean ignoring your mistakes. It means not",
        "textdich": ""
    },
    {
        "start": 3231.839,
        "end": 3237.92,
        "text": "using your mistakes as a weapon against yourself.",
        "textdich": ""
    },
    {
        "start": 3235.2,
        "end": 3241.76,
        "text": "The world will criticize you anyway.",
        "textdich": ""
    },
    {
        "start": 3237.92,
        "end": 3253.52,
        "text": "Don't join them. Lesson two, improve your mental diet. You become what you feed your mind. You know what a food diet is, right? If you eat only junk",
        "textdich": ""
    },
    {
        "start": 3250.559,
        "end": 3259.52,
        "text": "food, your body becomes tired, slow, and weak. But what about your mental diet?",
        "textdich": ""
    },
    {
        "start": 3256.88,
        "end": 3271.04,
        "text": "The thoughts you consume, the people you listen to, the words you say to yourself, the media you watch, the beliefs you repeat, what you feed your",
        "textdich": ""
    },
    {
        "start": 3267.76,
        "end": 3282.48,
        "text": "brain is what you feel in your heart. If your mental diet is full of toxic social media, negative news, people who always doubt you, friends who",
        "textdich": ""
    },
    {
        "start": 3280.24,
        "end": 3293.44,
        "text": "gossip and complain, self-hating thoughts like, \"I'm not good enough.\" Then don't be surprised when you feel anxious, angry, tired, and unworthy.",
        "textdich": ""
    },
    {
        "start": 3291.359,
        "end": 3304.64,
        "text": "Most people try to fix their life by changing the outside. New job, new relationship, new clothes, but their mental world is still dirty.",
        "textdich": ""
    },
    {
        "start": 3302.48,
        "end": 3312.64,
        "text": "And just like a dirty kitchen attracts insects, a dirty mind attracts pain.",
        "textdich": ""
    },
    {
        "start": 3308.64,
        "end": 3315.2,
        "text": "Imagine two people wake up at 6:00 a.m.",
        "textdich": ""
    },
    {
        "start": 3312.64,
        "end": 3324.319,
        "text": "Person A opens Instagram, sees a model, and says, \"I'll never look like her. I hate my face.\" Then they watch 10 videos",
        "textdich": ""
    },
    {
        "start": 3321.44,
        "end": 3332.48,
        "text": "of people living rich lives and say, \"My life is a failure.\" Then they scroll through hate comments, gossip, and",
        "textdich": ""
    },
    {
        "start": 3328.88,
        "end": 3335.839,
        "text": "negative quotes. That's their breakfast.",
        "textdich": ""
    },
    {
        "start": 3332.48,
        "end": 3338.24,
        "text": "Not food, but thoughts.",
        "textdich": ""
    },
    {
        "start": 3335.839,
        "end": 3348.72,
        "text": "Person B wakes up, looks in the mirror, and says, \"I'm not perfect, but I'm proud. I'm still trying.\" They listen to a motivational podcast.",
        "textdich": ""
    },
    {
        "start": 3346.8,
        "end": 3356.96,
        "text": "They write one thing they're grateful for. They spend 10 minutes in silence with their own mind. Who do you think",
        "textdich": ""
    },
    {
        "start": 3354.96,
        "end": 3361.92,
        "text": "will feel more self-love by the end of the day?",
        "textdich": ""
    },
    {
        "start": 3358.64,
        "end": 3365.68,
        "text": "Build a clean mental diet.",
        "textdich": ""
    },
    {
        "start": 3361.92,
        "end": 3367.839,
        "text": "Unfollow people who make you feel less.",
        "textdich": ""
    },
    {
        "start": 3365.68,
        "end": 3370.64,
        "text": "Mute negativity.",
        "textdich": ""
    },
    {
        "start": 3367.839,
        "end": 3381.2,
        "text": "Replace every self-hating thought with a healing one. Spend 10 minutes every morning feeding your brain something loving, positive, and wise. Because",
        "textdich": ""
    },
    {
        "start": 3378.24,
        "end": 3391.599,
        "text": "here's the truth. The brain doesn't care if something is true or false. If you repeat it, it believes it. So if you",
        "textdich": ""
    },
    {
        "start": 3388.079,
        "end": 3400.24,
        "text": "keep telling yourself, I'm worthless, your brain will find proof. But if you start saying, I'm learning, I'm worthy,",
        "textdich": ""
    },
    {
        "start": 3397.52,
        "end": 3405.2,
        "text": "I'm becoming, your brain will find proof for that, too.",
        "textdich": ""
    },
    {
        "start": 3401.76,
        "end": 3416.24,
        "text": "Lesson three, perfection is the enemy of self-love. If you want to destroy self-love, here's the fastest way. Try to be perfect because perfection is a",
        "textdich": ""
    },
    {
        "start": 3413.52,
        "end": 3426.559,
        "text": "prison with no door. You're chasing a target that keeps moving. And every time you reach a goal, your brain says that's",
        "textdich": ""
    },
    {
        "start": 3421.2,
        "end": 3429.599,
        "text": "not enough. Be more, do more, fix more.",
        "textdich": ""
    },
    {
        "start": 3426.559,
        "end": 3441.76,
        "text": "You want perfect skin, perfect body, perfect English, perfect career, perfect behavior, perfect reactions, perfect confidence. Perfection is not love.",
        "textdich": ""
    },
    {
        "start": 3438.16,
        "end": 3451.599,
        "text": "Perfection is fear. Wearing a mask. It's the fear of not being accepted. The fear of being laughed at. The fear of being",
        "textdich": ""
    },
    {
        "start": 3447.28,
        "end": 3461.04,
        "text": "too much or not enough. They say, \"I'll love myself when I lose weight. I'll love myself when I speak fluent English.",
        "textdich": ""
    },
    {
        "start": 3458.0,
        "end": 3464.72,
        "text": "I'll love myself when I earn $10,000 a month.",
        "textdich": ""
    },
    {
        "start": 3462.559,
        "end": 3469.28,
        "text": "I'll love myself when my past doesn't haunt me anymore.",
        "textdich": ""
    },
    {
        "start": 3466.96,
        "end": 3481.119,
        "text": "But they never reach that place because every time they get close, they move the goalpost again. And now they've spent 5 years chasing perfection",
        "textdich": ""
    },
    {
        "start": 3478.799,
        "end": 3494.319,
        "text": "and not even five minutes practicing love. Imagine you have a friend who stutters sometimes. Do you say, \"I'll only love you when you speak fluently?\"",
        "textdich": ""
    },
    {
        "start": 3491.28,
        "end": 3504.0,
        "text": "No. You love them anyway. You have a friend who gained some weight. Do you say, \"I'll only support you if you look",
        "textdich": ""
    },
    {
        "start": 3500.16,
        "end": 3512.16,
        "text": "like a model.\" No. Then why do you treat yourself like that? If you can love others while they're imperfect, you can",
        "textdich": ""
    },
    {
        "start": 3509.04,
        "end": 3517.599,
        "text": "love yourself, too. The most attractive people in the world are not perfect.",
        "textdich": ""
    },
    {
        "start": 3514.799,
        "end": 3524.64,
        "text": "They're real. The girl with stretch marks who laughs loudly and walks with confidence.",
        "textdich": ""
    },
    {
        "start": 3521.76,
        "end": 3534.72,
        "text": "The boy who failed three times but still shows up every morning. The woman with acne who speaks with kindness and power.",
        "textdich": ""
    },
    {
        "start": 3531.76,
        "end": 3542.799,
        "text": "The man who doesn't have abs but hugs his children with joy. That is beauty.",
        "textdich": ""
    },
    {
        "start": 3538.64,
        "end": 3552.319,
        "text": "That is power. That is love. You don't need to wait for some imaginary version of yourself to arrive. That version doesn't exist. The real self- loveve",
        "textdich": ""
    },
    {
        "start": 3548.96,
        "end": 3564.16,
        "text": "begins when you say, \"I am not perfect and I love myself anyway.\" Always remember this. Married people want freedom. Singles want love. The",
        "textdich": ""
    },
    {
        "start": 3561.44,
        "end": 3574.88,
        "text": "young want to grow up. The old wish to be young again. Broken people long for happiness. Educated people want employment. The poor want money. The",
        "textdich": ""
    },
    {
        "start": 3572.0,
        "end": 3587.119,
        "text": "truth is no one has everything. So be grateful, be proud, be happy with what you have. I am not a project. I am a person. I am not perfect, but I am",
        "textdich": ""
    },
    {
        "start": 3583.599,
        "end": 3596.16,
        "text": "powerful, lovable, and enough. Lesson four, set boundaries and never feel ashamed for protecting your peace. Most",
        "textdich": ""
    },
    {
        "start": 3594.48,
        "end": 3606.4,
        "text": "people don't know how to set boundaries because deep down they're afraid to lose people. They say yes when they mean no.",
        "textdich": ""
    },
    {
        "start": 3602.96,
        "end": 3608.559,
        "text": "They agree just to avoid conflict.",
        "textdich": ""
    },
    {
        "start": 3606.4,
        "end": 3612.88,
        "text": "They stay quiet when they want to scream.",
        "textdich": ""
    },
    {
        "start": 3610.319,
        "end": 3621.52,
        "text": "They allow people to walk all over their time, energy, and emotions and call it kindness.",
        "textdich": ""
    },
    {
        "start": 3618.72,
        "end": 3635.68,
        "text": "If you don't protect your peace, no one else will. Loving yourself means creating a shield around your soul where only respect, truth, and care are",
        "textdich": ""
    },
    {
        "start": 3631.119,
        "end": 3643.92,
        "text": "allowed in. Everything else must go. You were taught that being liked is more important than being honest. That it's",
        "textdich": ""
    },
    {
        "start": 3640.799,
        "end": 3652.48,
        "text": "better to be polite than powerful. That you should always put others first, even if it destroys you inside. But here's",
        "textdich": ""
    },
    {
        "start": 3649.839,
        "end": 3661.359,
        "text": "the dark side of that. You become a prisoner to other people's approval and over time that turns into resentment.",
        "textdich": ""
    },
    {
        "start": 3658.48,
        "end": 3666.559,
        "text": "You start feeling why doesn't anyone respect me?",
        "textdich": ""
    },
    {
        "start": 3663.52,
        "end": 3670.079,
        "text": "Why am I always the one giving?",
        "textdich": ""
    },
    {
        "start": 3666.559,
        "end": 3672.0,
        "text": "Why do I feel so drained and invisible?",
        "textdich": ""
    },
    {
        "start": 3670.079,
        "end": 3680.24,
        "text": "It's because you taught them to expect your silence instead of your limits. For example, you have a friend who always",
        "textdich": ""
    },
    {
        "start": 3677.599,
        "end": 3689.28,
        "text": "calls you only when they need help. never checks on you, never listens to you, only dumps their problems on you.",
        "textdich": ""
    },
    {
        "start": 3685.04,
        "end": 3699.76,
        "text": "But you say nothing. You nod, you help, you smile, and inside you're burning because they don't see your pain.",
        "textdich": ""
    },
    {
        "start": 3696.799,
        "end": 3702.319,
        "text": "And you never showed them your boundary.",
        "textdich": ""
    },
    {
        "start": 3699.76,
        "end": 3711.119,
        "text": "Now imagine you say, \"Hey, I care about you, but I'm not available to solve this every time. I need space, too.\" They may",
        "textdich": ""
    },
    {
        "start": 3707.76,
        "end": 3722.96,
        "text": "be shocked. They may back off, but they'll learn one thing. You love yourself enough to not be used. Saying no is not rude. It's responsible. Saying",
        "textdich": ""
    },
    {
        "start": 3720.319,
        "end": 3734.559,
        "text": "I need space is not selfish. It's survival. Saying this is not okay is not dramatic. It's healthy. Say, \"I am allowed to protect my energy. I do not",
        "textdich": ""
    },
    {
        "start": 3732.16,
        "end": 3746.559,
        "text": "need to be available to everyone. I am not here to please. I am here to live in peace. Lesson five. Love your body, your",
        "textdich": ""
    },
    {
        "start": 3742.319,
        "end": 3755.44,
        "text": "flaws, your voice. They're yours. Let me ask you something deeply personal. When was the last time you looked in the mirror and smiled",
        "textdich": ""
    },
    {
        "start": 3753.119,
        "end": 3758.16,
        "text": "without criticism?",
        "textdich": ""
    },
    {
        "start": 3755.44,
        "end": 3767.76,
        "text": "Not to fix your hair, not to check your skin, not to suck in your stomach, not to hide a wrinkle or a scar. just looked",
        "textdich": ""
    },
    {
        "start": 3764.48,
        "end": 3777.839,
        "text": "at your body and said, \"Thank you for carrying me.\" Most people don't love their body. They judge it. They compare",
        "textdich": ""
    },
    {
        "start": 3773.68,
        "end": 3786.319,
        "text": "it. They hide it. They punish it. But here's the truth. Your body is not the enemy. It's the home you live in. You",
        "textdich": ""
    },
    {
        "start": 3784.0,
        "end": 3795.119,
        "text": "criticize your legs, but they've walked you through hard times. You hate your arms, but they've hugged people you",
        "textdich": ""
    },
    {
        "start": 3791.52,
        "end": 3802.72,
        "text": "love. You hide your face, but it shows your smile, your strength, your soul.",
        "textdich": ""
    },
    {
        "start": 3798.88,
        "end": 3805.039,
        "text": "Every ad, every model, every influencer.",
        "textdich": ""
    },
    {
        "start": 3802.72,
        "end": 3816.319,
        "text": "They're photoshopped, filtered, perfectly lit. And even they don't look like that in real life. Yet you, sitting alone in your room, you compare your",
        "textdich": ""
    },
    {
        "start": 3813.92,
        "end": 3827.119,
        "text": "living, breathing, imperfect, beautiful body to their fantasy. And then you call yourself ugly, unworthy, fat, dark,",
        "textdich": ""
    },
    {
        "start": 3823.839,
        "end": 3835.119,
        "text": "short, awkward. Do you realize how cruel that is? If your friend called themselves disgusting just because of a",
        "textdich": ""
    },
    {
        "start": 3831.28,
        "end": 3845.599,
        "text": "scar, would you agree? No. So why do you do that to yourself? And let's not forget your voice. How many people say, \"I hate my voice.",
        "textdich": ""
    },
    {
        "start": 3843.52,
        "end": 3848.799,
        "text": "I sound weird.",
        "textdich": ""
    },
    {
        "start": 3845.599,
        "end": 3858.96,
        "text": "My English is not clear.\" People will laugh at me, but the truth is your voice is your soul's fingerprint.",
        "textdich": ""
    },
    {
        "start": 3855.44,
        "end": 3867.68,
        "text": "It's how you say I love you. It's how you say I'm scared. It's how you say I'm still here trying. Don't silence your",
        "textdich": ""
    },
    {
        "start": 3865.039,
        "end": 3870.799,
        "text": "voice just because it's not perfect.",
        "textdich": ""
    },
    {
        "start": 3867.68,
        "end": 3873.28,
        "text": "Speak anyway. That's self-love.",
        "textdich": ""
    },
    {
        "start": 3870.799,
        "end": 3881.039,
        "text": "Eating because you want to nourish, not punish. Resting because your body is sacred, not lazy.",
        "textdich": ""
    },
    {
        "start": 3878.88,
        "end": 3891.28,
        "text": "Wearing clothes that make you feel good, not others. Saying, \"This is my face, my shape, my skin, my sound. It may not",
        "textdich": ""
    },
    {
        "start": 3887.839,
        "end": 3900.4,
        "text": "match the magazine, but it's mine.\" Affirm this every day. My body is not ugly. My body is honest. My voice is not",
        "textdich": ""
    },
    {
        "start": 3897.119,
        "end": 3906.88,
        "text": "weak. My voice is mine. I don't need to match others to matter. Lesson six.",
        "textdich": ""
    },
    {
        "start": 3904.0,
        "end": 3914.48,
        "text": "Forgive yourself. You can't love what you hate. Let's talk about guilt. The silent poison that kills self-love.",
        "textdich": ""
    },
    {
        "start": 3912.799,
        "end": 3923.28,
        "text": "Because here's what many people secretly feel. I've hurt people. I wasted years.",
        "textdich": ""
    },
    {
        "start": 3920.16,
        "end": 3934.16,
        "text": "I broke someone's heart. I lied. I cheated. I gave up. I messed up. And they carry this guilt everywhere like a heavy bag chained to their soul. They",
        "textdich": ""
    },
    {
        "start": 3931.28,
        "end": 3943.92,
        "text": "smile in front of people, but inside they hear, \"You don't deserve love. Look what you did.\" And when you carry that",
        "textdich": ""
    },
    {
        "start": 3940.64,
        "end": 3948.48,
        "text": "long enough, you stop feeling human. You start feeling like a mistake.",
        "textdich": ""
    },
    {
        "start": 3946.4,
        "end": 3951.44,
        "text": "But listen carefully.",
        "textdich": ""
    },
    {
        "start": 3948.48,
        "end": 3961.119,
        "text": "You are not your past. You are not your worst moment. You are not the same person you were when you made that choice.",
        "textdich": ""
    },
    {
        "start": 3958.0,
        "end": 3963.76,
        "text": "Forgiveness doesn't mean forgetting.",
        "textdich": ""
    },
    {
        "start": 3961.119,
        "end": 3971.2,
        "text": "It means facing what happened, learning from it, and deciding not to punish yourself forever.",
        "textdich": ""
    },
    {
        "start": 3968.24,
        "end": 3972.88,
        "text": "You've already suffered enough.",
        "textdich": ""
    },
    {
        "start": 3971.2,
        "end": 3985.92,
        "text": "What's the point of dragging that pain into every day of your future? If you truly feel sorry, then take responsibility and then release yourself.",
        "textdich": ""
    },
    {
        "start": 3982.96,
        "end": 3988.0,
        "text": "You can't become who you're meant to be.",
        "textdich": ""
    },
    {
        "start": 3985.92,
        "end": 3997.599,
        "text": "If you're still punishing who you used to be, imagine someone accidentally breaks your phone. They say, \"I'm so",
        "textdich": ""
    },
    {
        "start": 3994.0,
        "end": 4007.52,
        "text": "sorry. I didn't mean to. I'll try to fix it or replace it.\" And then every day they text you, call you, cry, say sorry,",
        "textdich": ""
    },
    {
        "start": 4003.92,
        "end": 4009.599,
        "text": "and never stop apologizing for 5 years.",
        "textdich": ""
    },
    {
        "start": 4007.52,
        "end": 4019.28,
        "text": "Wouldn't you say, \"It's okay. I forgave you. Move on now. You don't need to keep suffering.\" That's what your soul is",
        "textdich": ""
    },
    {
        "start": 4014.0,
        "end": 4021.839,
        "text": "saying to you. Let it go. Learn. Grow.",
        "textdich": ""
    },
    {
        "start": 4019.28,
        "end": 4025.92,
        "text": "But stop replaying the punishment.",
        "textdich": ""
    },
    {
        "start": 4021.839,
        "end": 4030.88,
        "text": "Affirm this daily. I forgive myself. I made mistakes.",
        "textdich": ""
    },
    {
        "start": 4027.839,
        "end": 4037.359,
        "text": "But I'm not a mistake. I've hurt. I've healed. And I'm still becoming someone better.",
        "textdich": ""
    },
    {
        "start": 4034.559,
        "end": 4039.599,
        "text": "Forgiveness is not weakness.",
        "textdich": ""
    },
    {
        "start": 4037.359,
        "end": 4050.64,
        "text": "It's the most powerful gift you can give your heart because you can't love what you still hate. And if you want to love yourself,",
        "textdich": ""
    },
    {
        "start": 4047.52,
        "end": 4060.319,
        "text": "you must start with forgiveness. Lesson seven, leave the past behind. You're not that version of you anymore.",
        "textdich": ""
    },
    {
        "start": 4057.359,
        "end": 4068.64,
        "text": "Most people live in two places. The past they can't change and the future they keep fearing. And because of this, they",
        "textdich": ""
    },
    {
        "start": 4066.559,
        "end": 4077.68,
        "text": "forget to live in the only place where love can grow, the present. But when it comes to loving yourself, the past is",
        "textdich": ""
    },
    {
        "start": 4074.64,
        "end": 4088.16,
        "text": "often your biggest enemy. Why? Because you keep telling yourself, \"I was a failure. I was weak. I trusted the wrong",
        "textdich": ""
    },
    {
        "start": 4084.319,
        "end": 4101.04,
        "text": "person. I should have done more. I used to be happy. Now I'm broken.\" And you carry those versions of you like ghosts on your back. You drag their",
        "textdich": ""
    },
    {
        "start": 4096.64,
        "end": 4111.199,
        "text": "guilt, their trauma, their pain. And now even when life gives you something good, you sabotage it because deep down you",
        "textdich": ""
    },
    {
        "start": 4106.88,
        "end": 4121.52,
        "text": "still believe I don't deserve this. Look at my past. The past is a chapter. It is not your identity. And no matter how bad",
        "textdich": ""
    },
    {
        "start": 4118.96,
        "end": 4131.6,
        "text": "your past was, it cannot stop you from building a beautiful future unless you keep holding it. You are not the teenager who was confused. You are not",
        "textdich": ""
    },
    {
        "start": 4128.88,
        "end": 4143.04,
        "text": "the person who got cheated on. You are not the version who failed, who screamed, who gave up, who didn't know better. You are not that version anymore.",
        "textdich": ""
    },
    {
        "start": 4140.96,
        "end": 4153.44,
        "text": "And just because you once lived in chaos, doesn't mean you don't deserve peace now. If a snake sheds its skin, does it",
        "textdich": ""
    },
    {
        "start": 4149.92,
        "end": 4155.44,
        "text": "go back and pick it up again? No.",
        "textdich": ""
    },
    {
        "start": 4153.44,
        "end": 4159.199,
        "text": "Because it's done with it. It's grown out of it.",
        "textdich": ""
    },
    {
        "start": 4157.12,
        "end": 4167.359,
        "text": "Then why do you keep revisiting old pain like it's your home? You're not being loyal to your truth. You're being loyal",
        "textdich": ""
    },
    {
        "start": 4164.48,
        "end": 4180.64,
        "text": "to your trauma. And that loyalty is costing you your joy. What self-love looks like here. Telling yourself that was me, but that's not me anymore.",
        "textdich": ""
    },
    {
        "start": 4178.719,
        "end": 4192.0,
        "text": "Letting go of people who only remember the old you. Saying no to the same patterns that once broke you. celebrating your growth, not hiding it.",
        "textdich": ""
    },
    {
        "start": 4189.12,
        "end": 4201.679,
        "text": "You can't love who you are if you keep being ashamed of who you were. Say this with me. I am not my past. I am my",
        "textdich": ""
    },
    {
        "start": 4198.56,
        "end": 4212.32,
        "text": "progress. I have made mistakes, but I've also made it through. I release what doesn't belong in my future. Lesson eight, practice self-acceptance, not",
        "textdich": ""
    },
    {
        "start": 4210.32,
        "end": 4214.88,
        "text": "constant self-fixing.",
        "textdich": ""
    },
    {
        "start": 4212.32,
        "end": 4224.159,
        "text": "Self-improvement is amazing. Self-growth is beautiful, but when it becomes an obsession, when you keep trying to fix everything",
        "textdich": ""
    },
    {
        "start": 4220.96,
        "end": 4232.96,
        "text": "about yourself all the time, you start sending your brain this dangerous message.",
        "textdich": ""
    },
    {
        "start": 4227.76,
        "end": 4242.239,
        "text": "You are not lovable yet. Fix more. Then maybe you'll deserve love. This creates a loop. Once I heal my childhood, then",
        "textdich": ""
    },
    {
        "start": 4239.199,
        "end": 4252.48,
        "text": "I'll be worthy. Once I meditate every day, then I'll feel enough. Once I speak perfect English, then I'll respect myself.",
        "textdich": ""
    },
    {
        "start": 4249.679,
        "end": 4257.04,
        "text": "Once I stop overthinking, then I'll be proud.",
        "textdich": ""
    },
    {
        "start": 4254.0,
        "end": 4258.88,
        "text": "But self-love doesn't work like that.",
        "textdich": ""
    },
    {
        "start": 4257.04,
        "end": 4266.239,
        "text": "You don't wait to love a flower until it's fully bloomed. You water it while it's still growing.",
        "textdich": ""
    },
    {
        "start": 4263.6,
        "end": 4269.6,
        "text": "That's what real self-acceptance is.",
        "textdich": ""
    },
    {
        "start": 4266.239,
        "end": 4279.92,
        "text": "It's not giving up. It's not saying I'll stay the same forever. It's saying even while I'm growing, I'm still enough today.",
        "textdich": ""
    },
    {
        "start": 4278.0,
        "end": 4287.04,
        "text": "Imagine you're helping a child learn how to walk. They fall down again and again.",
        "textdich": ""
    },
    {
        "start": 4284.32,
        "end": 4294.08,
        "text": "Would you say you're not worthy until you run? You're a failure until you stop falling.",
        "textdich": ""
    },
    {
        "start": 4291.6,
        "end": 4299.44,
        "text": "You don't deserve love until you walk perfectly.",
        "textdich": ""
    },
    {
        "start": 4296.0,
        "end": 4309.92,
        "text": "Of course not. You'd clap, encourage, pick them up, try again. Then why don't you do that for yourself? You're learning how to live. You're learning",
        "textdich": ""
    },
    {
        "start": 4307.44,
        "end": 4317.36,
        "text": "how to set boundaries. You're learning how to heal. You're learning how to be enough. Stop hating yourself for not",
        "textdich": ""
    },
    {
        "start": 4315.44,
        "end": 4322.96,
        "text": "being a master at something you're just beginning to understand.",
        "textdich": ""
    },
    {
        "start": 4319.52,
        "end": 4326.32,
        "text": "They mix self-love with self-criticism.",
        "textdich": ""
    },
    {
        "start": 4322.96,
        "end": 4330.4,
        "text": "They say, \"I need to lose weight to accept myself.",
        "textdich": ""
    },
    {
        "start": 4328.48,
        "end": 4334.159,
        "text": "I need to stop overthinking to respect myself.",
        "textdich": ""
    },
    {
        "start": 4332.0,
        "end": 4344.159,
        "text": "I need to fix every part of me before I can be happy.\" But that mindset makes self- loveve a moving target. You'll never catch it.",
        "textdich": ""
    },
    {
        "start": 4341.12,
        "end": 4354.8,
        "text": "You'll just keep running, exhausted, broken, and empty. You can want to improve your English and still accept your voice today.",
        "textdich": ""
    },
    {
        "start": 4352.0,
        "end": 4359.84,
        "text": "You can want to be fit and still love your current body.",
        "textdich": ""
    },
    {
        "start": 4356.96,
        "end": 4369.28,
        "text": "You can want to heal and still honor your scars. You can be both a work in progress and a masterpiece at the same",
        "textdich": ""
    },
    {
        "start": 4365.199,
        "end": 4381.76,
        "text": "time. Affirm this every single day. I am still learning. I still struggle. I still fall. But I still matter. I am enough. Not because I am perfect, but",
        "textdich": ""
    },
    {
        "start": 4377.92,
        "end": 4387.92,
        "text": "because I exist. Lesson nine. Talk to yourself every day. Like a best friend.",
        "textdich": ""
    },
    {
        "start": 4386.08,
        "end": 4398.64,
        "text": "You talk to yourself more than anyone else in the world. But are you listening? Most people speak to themselves in a voice that is harsh,",
        "textdich": ""
    },
    {
        "start": 4394.48,
        "end": 4404.08,
        "text": "rude, critical, angry, and sometimes emotionally abusive. Now, imagine this.",
        "textdich": ""
    },
    {
        "start": 4402.239,
        "end": 4411.92,
        "text": "If someone followed you around all day and whispered, \"You're so stupid. You're not doing enough.",
        "textdich": ""
    },
    {
        "start": 4409.28,
        "end": 4414.08,
        "text": "You're such a failure.",
        "textdich": ""
    },
    {
        "start": 4411.92,
        "end": 4417.199,
        "text": "You're not good-looking.",
        "textdich": ""
    },
    {
        "start": 4414.08,
        "end": 4425.679,
        "text": "Everyone is better than you. Would you allow them in your life? No. You'd block them. You'd call it verbal abuse. You'd",
        "textdich": ""
    },
    {
        "start": 4422.96,
        "end": 4435.12,
        "text": "protect your peace. But the real truth is, you say these things to yourself, and you've been listening for years.",
        "textdich": ""
    },
    {
        "start": 4431.84,
        "end": 4436.88,
        "text": "Your brain believes what it hears most.",
        "textdich": ""
    },
    {
        "start": 4435.12,
        "end": 4449.679,
        "text": "You don't need to be hypnotized by someone else. You're hypnotizing yourself every single day. And this is why most people feel stuck because their",
        "textdich": ""
    },
    {
        "start": 4445.76,
        "end": 4459.04,
        "text": "own voice is against them. For example, a girl fails her exam. She goes home and hears this in her head.",
        "textdich": ""
    },
    {
        "start": 4456.4,
        "end": 4466.719,
        "text": "I am such a disappointment. I always mess things up. My parents are going to be ashamed.",
        "textdich": ""
    },
    {
        "start": 4463.6,
        "end": 4476.159,
        "text": "I'm so stupid. Now she starts to believe it. Now she starts to act like it. Now even in the next exam, her brain is so",
        "textdich": ""
    },
    {
        "start": 4472.8,
        "end": 4478.8,
        "text": "full of fear that she fails again.",
        "textdich": ""
    },
    {
        "start": 4476.159,
        "end": 4487.44,
        "text": "Not because she's not smart, but because she's not supported by her own mind. The battlefield is not outside.",
        "textdich": ""
    },
    {
        "start": 4485.12,
        "end": 4489.12,
        "text": "It's inside.",
        "textdich": ""
    },
    {
        "start": 4487.44,
        "end": 4496.32,
        "text": "And you've been losing because you never realized who your real enemy was. Your own inner voice.",
        "textdich": ""
    },
    {
        "start": 4494.159,
        "end": 4505.28,
        "text": "Every single morning, talk to yourself like a best friend. Even if it feels weird, even if you don't believe it yet,",
        "textdich": ""
    },
    {
        "start": 4502.56,
        "end": 4512.4,
        "text": "even if your heart is still hurting, look in the mirror and say, \"I'm trying.",
        "textdich": ""
    },
    {
        "start": 4509.199,
        "end": 4523.44,
        "text": "I'm proud of that. I've been through a lot and I'm still here. I'm not perfect, but I deserve respect. I forgive myself.",
        "textdich": ""
    },
    {
        "start": 4520.4,
        "end": 4533.28,
        "text": "Let's take it one day at a time. Talk to yourself out loud. Whisper if you need to, but speak because silence becomes",
        "textdich": ""
    },
    {
        "start": 4530.32,
        "end": 4538.96,
        "text": "shame. And your voice has the power to heal what years of pain destroyed.",
        "textdich": ""
    },
    {
        "start": 4536.159,
        "end": 4553.36,
        "text": "Repeat this truth. I don't wait for others to love me. I talk to myself with love every day. I am not alone. I have me. Lesson 10. Stop criticizing",
        "textdich": ""
    },
    {
        "start": 4549.92,
        "end": 4561.6,
        "text": "yourself. You are listening. Your brain is always listening. Even when you're joking, every time you say, \"I'm such a",
        "textdich": ""
    },
    {
        "start": 4557.6,
        "end": 4568.48,
        "text": "loser. I look horrible today. Why do I always mess up? Nobody really likes me.",
        "textdich": ""
    },
    {
        "start": 4565.52,
        "end": 4574.08,
        "text": "I'm not enough.\" Your brain doesn't know you're just saying it. It believes it.",
        "textdich": ""
    },
    {
        "start": 4571.28,
        "end": 4585.44,
        "text": "It accepts it. And it starts building a reality around it. You become what you repeat. Even if you're joking, even if you think no one is watching.",
        "textdich": ""
    },
    {
        "start": 4583.52,
        "end": 4598.96,
        "text": "Imagine a child is trying to learn how to walk. Every time they fall, you shout, \"You're useless. You'll never get it. You're wasting everyone's time.\"",
        "textdich": ""
    },
    {
        "start": 4595.6,
        "end": 4606.88,
        "text": "What will happen? That child will stop trying. Not because they can't walk, but because they now believe something is",
        "textdich": ""
    },
    {
        "start": 4604.64,
        "end": 4615.28,
        "text": "wrong with them. This is what you've been doing to yourself. You've been criticizing yourself for years. And now",
        "textdich": ""
    },
    {
        "start": 4612.64,
        "end": 4621.12,
        "text": "you think you're the problem, but you're not. You're not broken. You're bruised.",
        "textdich": ""
    },
    {
        "start": 4618.56,
        "end": 4629.36,
        "text": "And bruises don't need judgment. They need care. Self-criticism is not honesty. It's self-sabotage.",
        "textdich": ""
    },
    {
        "start": 4626.8,
        "end": 4638.8,
        "text": "Being honest is saying, \"I need to improve.\" But criticizing yourself sounds like, \"I'll never be good enough.",
        "textdich": ""
    },
    {
        "start": 4635.84,
        "end": 4647.76,
        "text": "There's a big difference. And self-love starts when you finally say, \"No more. I am done destroying myself. I will not",
        "textdich": ""
    },
    {
        "start": 4646.08,
        "end": 4657.92,
        "text": "speak to myself in a way I wouldn't allow from others.\" If a voice inside you makes you feel small, afraid, or ashamed,",
        "textdich": ""
    },
    {
        "start": 4654.719,
        "end": 4666.159,
        "text": "it's not love. If a voice encourages you, forgives you, and helps you grow, that's selflove.",
        "textdich": ""
    },
    {
        "start": 4662.88,
        "end": 4675.04,
        "text": "You have a choice. Every day you can either beat yourself down with judgment or build yourself up with compassion.",
        "textdich": ""
    },
    {
        "start": 4672.08,
        "end": 4686.239,
        "text": "Daily affirmation. I am done being my own enemy. I choose to speak to myself with kindness because I am listening and I deserve peace.",
        "textdich": ""
    },
    {
        "start": 4682.8,
        "end": 4698.64,
        "text": "This is self-love. Not a luxury, not a quote, but a quiet powerful decision every single day to stop hurting yourself and start holding yourself.",
        "textdich": ""
    },
    {
        "start": 4694.4,
        "end": 4701.92,
        "text": "Lesson 11. Start valuing yourself.",
        "textdich": ""
    },
    {
        "start": 4698.64,
        "end": 4713.12,
        "text": "You are not replaceable. Let's get one thing very, very clear. You are not here to just survive, obey, serve, and disappear. You are here to live, to",
        "textdich": ""
    },
    {
        "start": 4710.0,
        "end": 4723.36,
        "text": "grow, and to value who you are. They live like their own worth depends on someone's opinion, someone's attention, [clears throat] a job title, a",
        "textdich": ""
    },
    {
        "start": 4720.96,
        "end": 4733.52,
        "text": "relationship, their achievements, their looks, their social status. And when they don't get enough praise, love, likes, or approval.",
        "textdich": ""
    },
    {
        "start": 4730.88,
        "end": 4747.199,
        "text": "They begin to feel empty. They start saying, \"I'm not important. I don't matter. I'm just average. I'm nobody.\" And slowly they start to disappear",
        "textdich": ""
    },
    {
        "start": 4743.92,
        "end": 4757.679,
        "text": "inside their own life. Alive but not really living. You don't have to prove your worth. You already have it. Not because of what you do but because of",
        "textdich": ""
    },
    {
        "start": 4754.8,
        "end": 4768.159,
        "text": "who you are. There is only one of you in this entire world. No one has your exact story, heart, soul, voice or energy. No",
        "textdich": ""
    },
    {
        "start": 4765.12,
        "end": 4777.44,
        "text": "one has your exact pain. No one has your exact perspective. That means you are not replaceable. You are rare. You are",
        "textdich": ""
    },
    {
        "start": 4774.239,
        "end": 4789.199,
        "text": "real. You are valuable. Imagine you hold a $100 bill. Now you crumple it. You step on it. You throw it. Is it still worth $100?",
        "textdich": ""
    },
    {
        "start": 4786.0,
        "end": 4797.76,
        "text": "Yes. Now imagine your heart. It's been stepped on, crumpled, thrown, but it's still valuable because its value doesn't",
        "textdich": ""
    },
    {
        "start": 4794.88,
        "end": 4802.0,
        "text": "come from how it looks. It comes from what it is.",
        "textdich": ""
    },
    {
        "start": 4799.44,
        "end": 4806.8,
        "text": "That's you. Don't wait for someone else to see your worth. See it yourself.",
        "textdich": ""
    },
    {
        "start": 4805.36,
        "end": 4811.84,
        "text": "Don't stay in places where you are tolerated. Go where you are celebrated.",
        "textdich": ""
    },
    {
        "start": 4810.4,
        "end": 4818.64,
        "text": "Don't lower your light just because others feel small. Shine anyway.",
        "textdich": ""
    },
    {
        "start": 4815.679,
        "end": 4830.48,
        "text": "Self-love begins when you say, \"I matter. My life matters. My voice matters. My presence makes a difference.\" Affirm this every morning.",
        "textdich": ""
    },
    {
        "start": 4827.44,
        "end": 4841.679,
        "text": "I'm not perfect, but I'm valuable. I don't have everything, but I am still enough. I am not for everyone, and that's okay. I value myself because I'm",
        "textdich": ""
    },
    {
        "start": 4839.36,
        "end": 4844.719,
        "text": "the only one who can live my life.",
        "textdich": ""
    },
    {
        "start": 4841.679,
        "end": 4855.12,
        "text": "Lesson 12. Keep a journal of your feelings because your emotions need a home. Where do your emotions go when you have no one",
        "textdich": ""
    },
    {
        "start": 4851.679,
        "end": 4866.88,
        "text": "to talk to? When you're hurt, when you're angry, when you're confused, when you're proud but no one claps, when you're scared but smiling in",
        "textdich": ""
    },
    {
        "start": 4863.28,
        "end": 4872.8,
        "text": "public. For most people, the answer is I keep it inside.",
        "textdich": ""
    },
    {
        "start": 4868.8,
        "end": 4883.6,
        "text": "I try to forget. I distract myself. I stay busy. I cry silently at night. But this is why so many people feel lost because they carry years of unspoken",
        "textdich": ""
    },
    {
        "start": 4881.12,
        "end": 4892.56,
        "text": "pain inside their chest. and they never let it out. Feelings don't disappear, they store.",
        "textdich": ""
    },
    {
        "start": 4890.719,
        "end": 4901.36,
        "text": "And if you don't give your emotions a safe place, they will attack you from within. This is where journaling changes",
        "textdich": ""
    },
    {
        "start": 4898.719,
        "end": 4910.0,
        "text": "everything. Because when you write what you feel, you stop pretending. You stop running.",
        "textdich": ""
    },
    {
        "start": 4906.64,
        "end": 4914.719,
        "text": "You stop lying to yourself. And suddenly you feel lighter.",
        "textdich": ""
    },
    {
        "start": 4912.239,
        "end": 4922.48,
        "text": "Journaling is not just writing. It's emotional freedom. You don't need to be a writer. You don't need grammar. You",
        "textdich": ""
    },
    {
        "start": 4920.48,
        "end": 4929.6,
        "text": "don't need perfect sentences. You just need honesty.",
        "textdich": ""
    },
    {
        "start": 4924.239,
        "end": 4934.719,
        "text": "Start with today. I feel I'm scared of I wish someone understood.",
        "textdich": ""
    },
    {
        "start": 4931.76,
        "end": 4947.76,
        "text": "I'm proud that I right now I need to hear and let it flow because your emotions deserve a voice even if no one hears it. Because you deserve to express",
        "textdich": ""
    },
    {
        "start": 4945.04,
        "end": 4958.96,
        "text": "not suppress because your journal becomes your best friend when no one understands. Because the page doesn't judge you. It listens. Start saying this",
        "textdich": ""
    },
    {
        "start": 4955.679,
        "end": 4968.4,
        "text": "to yourself. My feelings are valid. My pain deserves space. My words matter even when they're only written. I will",
        "textdich": ""
    },
    {
        "start": 4964.96,
        "end": 4972.88,
        "text": "no longer silence myself. I will write.",
        "textdich": ""
    },
    {
        "start": 4968.4,
        "end": 4975.04,
        "text": "I will heal. I will grow. Lesson 13.",
        "textdich": ""
    },
    {
        "start": 4972.88,
        "end": 4978.239,
        "text": "Practice self-care.",
        "textdich": ""
    },
    {
        "start": 4975.04,
        "end": 4981.28,
        "text": "It's not luxury. It's survival.",
        "textdich": ""
    },
    {
        "start": 4978.239,
        "end": 4992.719,
        "text": "Self-care is not selfish. Self-care is not a luxury. Self-care is how you keep yourself alive inside. Most people believe self-care means going to the",
        "textdich": ""
    },
    {
        "start": 4990.0,
        "end": 4999.92,
        "text": "spa, taking a vacation, buying something expensive, watching Netflix all night.",
        "textdich": ""
    },
    {
        "start": 4996.88,
        "end": 5005.84,
        "text": "But real self-care is deeper. It's emotional. It's mental. It's spiritual.",
        "textdich": ""
    },
    {
        "start": 5003.679,
        "end": 5014.48,
        "text": "It's about creating a life you don't have to escape from. You don't burn out because you're weak. You burn out because you forget to take care of",
        "textdich": ""
    },
    {
        "start": 5012.719,
        "end": 5026.719,
        "text": "yourself while taking care of everything else. You take care of work, of family, of friends, of deadlines, of your to-do",
        "textdich": ""
    },
    {
        "start": 5022.96,
        "end": 5033.52,
        "text": "list. But what about you? When was the last time you asked yourself, \"Am I okay?",
        "textdich": ""
    },
    {
        "start": 5030.48,
        "end": 5043.12,
        "text": "What do I need right now? What would make me feel safe, rested, or loved today?\" That is self-care. Let me show you a",
        "textdich": ""
    },
    {
        "start": 5040.56,
        "end": 5047.52,
        "text": "real example. Imagine your phone battery is at 1%.",
        "textdich": ""
    },
    {
        "start": 5045.04,
        "end": 5056.639,
        "text": "You wouldn't open 10 apps, turn on Bluetooth, Wi-Fi, GPS, brightness, and start watching videos. You'd charge it.",
        "textdich": ""
    },
    {
        "start": 5054.4,
        "end": 5065.44,
        "text": "So why don't you recharge yourself? Why do you wait until you break down, until your body aches, until your mind",
        "textdich": ""
    },
    {
        "start": 5061.6,
        "end": 5075.199,
        "text": "collapses to finally rest? You are not a machine. You are a soul, a human. You need rest. You need breath. You need",
        "textdich": ""
    },
    {
        "start": 5072.239,
        "end": 5081.04,
        "text": "care. Start practicing real self-care like this. Go to sleep without guilt.",
        "textdich": ""
    },
    {
        "start": 5078.32,
        "end": 5089.36,
        "text": "Say no without explaining. Drink water like you deserve to be alive. Journal when your heart feels heavy. Take 10",
        "textdich": ""
    },
    {
        "start": 5086.56,
        "end": 5098.719,
        "text": "minutes a day for silence. Take a walk without your phone. Speak kindly to yourself like a best friend. Self-care",
        "textdich": ""
    },
    {
        "start": 5095.76,
        "end": 5108.08,
        "text": "doesn't have to be big. But it must be daily. Because if you don't protect your peace, no one else will. Repeat this",
        "textdich": ""
    },
    {
        "start": 5104.719,
        "end": 5121.84,
        "text": "every night. Today, I mattered. I did what I could. I gave myself love. I cared for my mind, my body, my peace, and that is enough. Lesson 14. Act on",
        "textdich": ""
    },
    {
        "start": 5118.239,
        "end": 5124.56,
        "text": "what you need. Stop ignoring yourself.",
        "textdich": ""
    },
    {
        "start": 5121.84,
        "end": 5130.719,
        "text": "Self-love is not just a feeling. It's a decision and real love takes action.",
        "textdich": ""
    },
    {
        "start": 5128.4,
        "end": 5142.8,
        "text": "Most people know what they need, but they keep ignoring it. They know they need rest. They need boundaries. They need to leave that toxic place. They",
        "textdich": ""
    },
    {
        "start": 5139.76,
        "end": 5145.44,
        "text": "need to stop pretending. They need help.",
        "textdich": ""
    },
    {
        "start": 5142.8,
        "end": 5152.719,
        "text": "They need change. They need to slow down. But they keep saying, \"Not now.",
        "textdich": ""
    },
    {
        "start": 5149.92,
        "end": 5157.36,
        "text": "Maybe later.\" I don't want to upset anyone.",
        "textdich": ""
    },
    {
        "start": 5154.239,
        "end": 5165.12,
        "text": "It's not that bad. I'll just push through. And the more they ignore their needs, the louder the pain becomes.",
        "textdich": ""
    },
    {
        "start": 5163.199,
        "end": 5172.4,
        "text": "When you keep betraying yourself to please others, you slowly kill your spirit.",
        "textdich": ""
    },
    {
        "start": 5169.199,
        "end": 5178.0,
        "text": "You start to feel tired, confused, angry, anxious.",
        "textdich": ""
    },
    {
        "start": 5174.96,
        "end": 5183.679,
        "text": "Not because life is unfair, but because you stopped showing up for yourself.",
        "textdich": ""
    },
    {
        "start": 5180.639,
        "end": 5186.88,
        "text": "Imagine you're in a toxic friendship.",
        "textdich": ""
    },
    {
        "start": 5183.679,
        "end": 5198.0,
        "text": "You always give. They always take. You feel drained, disrespected, unseen. You know you should speak up or step away.",
        "textdich": ""
    },
    {
        "start": 5194.08,
        "end": 5206.32,
        "text": "But instead, you stay. Why? Because you don't want to hurt them. But what about you? Why is your pain less important?",
        "textdich": ""
    },
    {
        "start": 5204.08,
        "end": 5216.88,
        "text": "Every time you ignore what you need, you teach your brain, \"I don't matter.\" and slowly you start to believe it. Self-love means",
        "textdich": ""
    },
    {
        "start": 5214.159,
        "end": 5227.84,
        "text": "this. When your heart needs rest, you rest. When your soul needs quiet, you unplug. When your body needs healing, you slow down. When your spirit needs",
        "textdich": ""
    },
    {
        "start": 5225.12,
        "end": 5237.199,
        "text": "courage, you act. Needs are not weakness. Needs are signals from your soul. Don't ignore them. Listen and act.",
        "textdich": ""
    },
    {
        "start": 5234.4,
        "end": 5247.36,
        "text": "Say this out loud right now. I trust myself. I listen to my needs. I no longer wait for permission to care for me. I will act on what I need because I",
        "textdich": ""
    },
    {
        "start": 5245.84,
        "end": 5251.44,
        "text": "matter.",
        "textdich": ""
    },
    {
        "start": 5247.36,
        "end": 5254.239,
        "text": "Lesson 15. Don't waste your potential.",
        "textdich": ""
    },
    {
        "start": 5251.44,
        "end": 5263.84,
        "text": "You were made for more. Let's stop pretending. You know it. Deep down under all the pain, overthinking, fear, and",
        "textdich": ""
    },
    {
        "start": 5260.08,
        "end": 5271.44,
        "text": "pressure. You know it. You were made for more. More than just surviving. More than just scrolling, more than just",
        "textdich": ""
    },
    {
        "start": 5269.12,
        "end": 5278.4,
        "text": "working like a machine, more than just pleasing others, more than just hiding behind fear.",
        "textdich": ""
    },
    {
        "start": 5275.679,
        "end": 5291.199,
        "text": "You were born with a voice, with a vision, [clears throat] with a heart, with a gift, with a mind full of ideas no one else has, with a soul that can",
        "textdich": ""
    },
    {
        "start": 5287.28,
        "end": 5302.48,
        "text": "rise even from the darkest places. But somewhere along the way, you started shrinking. Here's what happens to most people. They compare themselves too",
        "textdich": ""
    },
    {
        "start": 5299.199,
        "end": 5314.96,
        "text": "much. They listen to judgment. They doubt their worth. They wait for motivation. They bury their dreams. They silence their ideas. They choose comfort",
        "textdich": ""
    },
    {
        "start": 5310.719,
        "end": 5324.0,
        "text": "over growth. And slowly their potential fades not because they weren't good enough, but because they stopped trying.",
        "textdich": ""
    },
    {
        "start": 5321.28,
        "end": 5328.0,
        "text": "Example, there's a boy who loves writing.",
        "textdich": ""
    },
    {
        "start": 5325.199,
        "end": 5339.28,
        "text": "He's not the best, but he has something real inside him. But one day, someone says, \"You're not that good.\" So he stops. 10 years later, he sees books",
        "textdich": ""
    },
    {
        "start": 5337.76,
        "end": 5341.04,
        "text": "everywhere.",
        "textdich": ""
    },
    {
        "start": 5339.28,
        "end": 5351.199,
        "text": "And wonders what could have happened if he just kept going. The world didn't kill his potential. His own doubt did.",
        "textdich": ""
    },
    {
        "start": 5347.84,
        "end": 5360.88,
        "text": "Now ask yourself this. What dream have you put on hold? What gift have you buried? What fear has stopped your progress?",
        "textdich": ""
    },
    {
        "start": 5358.719,
        "end": 5364.719,
        "text": "What lie have you told yourself about your worth?",
        "textdich": ""
    },
    {
        "start": 5362.8,
        "end": 5375.36,
        "text": "Because self-love doesn't just mean being kind to yourself. It means believing that you are capable and then acting on it. You don't have to",
        "textdich": ""
    },
    {
        "start": 5373.44,
        "end": 5378.4,
        "text": "be the best.",
        "textdich": ""
    },
    {
        "start": 5375.36,
        "end": 5383.679,
        "text": "You just have to stop hiding. Don't die with your light still locked inside you.",
        "textdich": ""
    },
    {
        "start": 5380.88,
        "end": 5392.48,
        "text": "The world doesn't need perfection. It needs people who are brave enough to show up. Say this now. I am not small. I",
        "textdich": ""
    },
    {
        "start": 5389.6,
        "end": 5403.04,
        "text": "am not useless. I am not here to just exist. I have potential and I won't waste it anymore. Lesson 16.",
        "textdich": ""
    },
    {
        "start": 5400.0,
        "end": 5413.199,
        "text": "Be mindful. Love yourself in every moment. You can't love yourself in the future if you don't love yourself right now in this moment.",
        "textdich": ""
    },
    {
        "start": 5411.44,
        "end": 5423.6,
        "text": "Self- loveve is not something you do once a year. It's not just journaling once a week. It's not just saying I'm enough after watching a motivational",
        "textdich": ""
    },
    {
        "start": 5420.88,
        "end": 5434.4,
        "text": "video. Self-love lives in your small daily moments. And you need to be present to feel it. Mindfulness means being here fully. Not stuck in",
        "textdich": ""
    },
    {
        "start": 5432.239,
        "end": 5442.88,
        "text": "yesterday's guilt. Not lost in tomorrow's fear. Just here right now.",
        "textdich": ""
    },
    {
        "start": 5440.0,
        "end": 5453.44,
        "text": "Because this moment, the one you're in, is the only one where change, peace, healing, and self-love can actually begin. Let's take an example. You're",
        "textdich": ""
    },
    {
        "start": 5450.56,
        "end": 5461.44,
        "text": "eating dinner, but your mind is on your regrets. You're walking outside, but your mind is on your failures. You're",
        "textdich": ""
    },
    {
        "start": 5459.04,
        "end": 5466.32,
        "text": "brushing your teeth, but you're thinking about your insecurities.",
        "textdich": ""
    },
    {
        "start": 5463.76,
        "end": 5474.639,
        "text": "You live in your body, but your mind is never home. That's not living. That's mental self-abandonment.",
        "textdich": ""
    },
    {
        "start": 5472.88,
        "end": 5485.04,
        "text": "Mindfulness is the practice of coming back to yourself, back to your breath, back to your body, back to your present.",
        "textdich": ""
    },
    {
        "start": 5482.159,
        "end": 5494.0,
        "text": "And in that present, you finally hear your soul again. You hear the child in you saying, \"Please stop running. Just",
        "textdich": ""
    },
    {
        "start": 5490.719,
        "end": 5503.44,
        "text": "be here with me.\" When you eat, taste it. Nourish your body. When you walk, feel your feet. Be proud of your body.",
        "textdich": ""
    },
    {
        "start": 5500.48,
        "end": 5513.36,
        "text": "When you speak, mean it. Listen with love. When you think, observe. Don't attack. When you breathe, don't rush.",
        "textdich": ""
    },
    {
        "start": 5510.719,
        "end": 5522.159,
        "text": "Honor the moment. Your life is not in the past. Your peace is not in the future. Your love is here now if you pay",
        "textdich": ""
    },
    {
        "start": 5519.12,
        "end": 5533.12,
        "text": "attention. Repeat this every day. Right now, I am enough. In this breath, I am safe. In this moment, I choose peace. I",
        "textdich": ""
    },
    {
        "start": 5528.4,
        "end": 5542.48,
        "text": "choose presence. I choose love. Please love yourself. You've been through so much. And you've survived every single",
        "textdich": ""
    },
    {
        "start": 5538.4,
        "end": 5550.719,
        "text": "day. You've cried. You've failed. You've been judged. You've lost people. You've been ignored. You've questioned your",
        "textdich": ""
    },
    {
        "start": 5547.44,
        "end": 5563.6,
        "text": "worth. But you never gave up. Look at you. Still standing, still breathing, still trying, still showing up, even with a broken heart. That's not",
        "textdich": ""
    },
    {
        "start": 5560.88,
        "end": 5571.84,
        "text": "weakness. That's strength. That's the kind of power most people never see, but it's inside you.",
        "textdich": ""
    },
    {
        "start": 5568.32,
        "end": 5582.48,
        "text": "So, please be proud of yourself. Even if no one clapped, even if no one noticed, even if the world didn't say, \"Well",
        "textdich": ""
    },
    {
        "start": 5577.6,
        "end": 5593.12,
        "text": "done,\" say it to yourself right now. I'm proud of me. I've done a lot. I've come so far, and I will go even further.",
        "textdich": ""
    },
    {
        "start": 5590.48,
        "end": 5603.679,
        "text": "But to do more, to rise higher, to become everything you dream of becoming, you need one thing first. You need to love yourself. Because when you love",
        "textdich": ""
    },
    {
        "start": 5601.52,
        "end": 5615.84,
        "text": "yourself, you don't chase people who hurt you. You don't fear failure. You don't shrink to fit in. You don't give up on your dreams.",
        "textdich": ""
    },
    {
        "start": 5612.639,
        "end": 5625.92,
        "text": "You stop living like a prisoner. And you start living like you were born to. And if no one ever told you this before,",
        "textdich": ""
    },
    {
        "start": 5621.679,
        "end": 5634.0,
        "text": "I want to say it now. I love you. I really, really do. Not because you're perfect, but because you're real.",
        "textdich": ""
    },
    {
        "start": 5632.0,
        "end": 5644.239,
        "text": "Because you're trying. Because you're human. And that's more than enough. So please, from this moment on, be kind to",
        "textdich": ""
    },
    {
        "start": 5640.8,
        "end": 5648.08,
        "text": "yourself. Speak gently to yourself.",
        "textdich": ""
    },
    {
        "start": 5644.239,
        "end": 5650.08,
        "text": "Protect your peace. Trust your journey.",
        "textdich": ""
    },
    {
        "start": 5648.08,
        "end": 5662.08,
        "text": "And never forget you are the best thing you will ever have. This world doesn't need another perfect person. It needs more people who",
        "textdich": ""
    },
    {
        "start": 5658.08,
        "end": 5671.679,
        "text": "are healed. And healing begins with you loving you. Subscribe to our channel if this touched your heart and share this with someone who also needs",
        "textdich": ""
    },
    {
        "start": 5670.08,
        "end": 5674.56,
        "text": "to hear it.",
        "textdich": ""
    },
    {
        "start": 5671.679,
        "end": 5681.8,
        "text": "Take care. You are powerful. You are worthy. You are loved. And I'm proud of you always.",
        "textdich": ""
    }
]