[
    {
        "start": 4.319,
        "end": 14.559,
        "text": "On this vote, the eyes's are 218, the nazs are 211 with one answering present.",
        "textdich": ""
    },
    {
        "start": 12.0,
        "end": 17.119,
        "text": "The resolution is adopted.",
        "textdich": ""
    },
    {
        "start": 14.559,
        "end": 24.72,
        "text": " Is anyone surprised that I am somehow deemed unworthy to speak about American foreign policy or that they see me as a",
        "textdich": ""
    },
    {
        "start": 23.119,
        "end": 31.119,
        "text": "powerful voice that needs to be silenced? Frankly, it is expected because when you",
        "textdich": ""
    },
    {
        "start": 36.96,
        "end": 49.44,
        "text": "A formal announcement of the House vote tally establishing the procedural legitimacy of the action taken. The precise numerical breakdown, 218 in",
        "textdich": ""
    },
    {
        "start": 46.079,
        "end": 57.28,
        "text": "favor, 211 opposed and one present, underscores the narrow but decisive nature of the resolution's passage. This moment reflects the constitutional",
        "textdich": ""
    },
    {
        "start": 55.36,
        "end": 65.28,
        "text": "mechanics of congressional authority where outcomes are determined not by rhetoric but by recorded votes. The declaration that the resolution is",
        "textdich": ""
    },
    {
        "start": 62.96,
        "end": 71.52,
        "text": "adopted marks a definitive institutional act signaling that the matter has moved beyond debate into enforcement. This",
        "textdich": ""
    },
    {
        "start": 69.76,
        "end": 78.32,
        "text": "segment frames the gravity of what follows by grounding the controversy in official legislative action rather than speculation.",
        "textdich": ""
    },
    {
        "start": 76.799,
        "end": 85.6,
        "text": " Thank you, Mr. Speaker. We've heard uh from my colleagues the reasons why uh the representative Omar should be re",
        "textdich": ""
    },
    {
        "start": 83.28,
        "end": 91.04,
        "text": "removed from this committee. Uh and but I feel like all the reasons have not just yet been stated which is why I rise",
        "textdich": ""
    },
    {
        "start": 88.88,
        "end": 99.84,
        "text": "to add for the record. Um we've heard about the comments that were made regarding anti-semitism and anti-Israeli views. But I rise to add to the record",
        "textdich": ""
    },
    {
        "start": 98.24,
        "end": 110.479,
        "text": "that uh as a member of the foreign affairs committee, I've sat there and heard the representative actually spew anti-American rhetoric as well. I've",
        "textdich": ""
    },
    {
        "start": 108.479,
        "end": 119.6,
        "text": "been in that committee room where the representative equates Israel and the United States to Hamas and the Taliban. Absolutely",
        "textdich": ""
    },
    {
        "start": 117.6,
        "end": 128.959,
        "text": "unacceptable for a member of that committee. I've also heard the representative quote that it is the United States's fault that there is",
        "textdich": ""
    },
    {
        "start": 126.64,
        "end": 136.239,
        "text": "turmoil in Venezuela. That is not because of the oppressive socialist and communism that has spread throughout Central and South America in Venezuela",
        "textdich": ""
    },
    {
        "start": 133.92,
        "end": 141.599,
        "text": "at the hands of the Maduro and Hugo Chavez regimes. That is unacceptable.",
        "textdich": ""
    },
    {
        "start": 139.44,
        "end": 147.599,
        "text": " Representative Omar's remarks present a personal and philosophical response to her removal, framing the action as an",
        "textdich": ""
    },
    {
        "start": 145.599,
        "end": 156.0,
        "text": "attempt to silence dissenting voices on American foreign policy. She characterizes herself simultaneously as marginalized and influential, suggesting",
        "textdich": ""
    },
    {
        "start": 154.16,
        "end": 161.92,
        "text": "that her critics view her as dangerous precisely because of her impact. The metaphor of the wolf and the silent",
        "textdich": ""
    },
    {
        "start": 159.76,
        "end": 166.319,
        "text": "shepherd introduces a moral narrative in which an action equates to betrayal.",
        "textdich": ""
    },
    {
        "start": 164.239,
        "end": 173.599,
        "text": "This segment reveals Omar's effort to recast institutional discipline as a broader struggle over conscience, voice, and moral responsibility within",
        "textdich": ""
    },
    {
        "start": 172.56,
        "end": 176.0,
        "text": "government.",
        "textdich": ""
    },
    {
        "start": 173.599,
        "end": 186.879,
        "text": " And as a New York representative, to hear the representative belittle to try to diminish the worst of terrorist attack on United States soil in",
        "textdich": ""
    },
    {
        "start": 184.0,
        "end": 191.2,
        "text": "September 11, 2001 as some people did something that is unacceptable as well.",
        "textdich": ""
    },
    {
        "start": 188.959,
        "end": 196.959,
        "text": "And I hold the same standard for this side of the aisle that I do the other because when another colleague on my side said something about 911, I also",
        "textdich": ""
    },
    {
        "start": 195.68,
        "end": 204.64,
        "text": "voted to have her removed from the education committee because I thought that was inappropriate. So, I'm being consistent here and I hope my colleagues",
        "textdich": ""
    },
    {
        "start": 202.4,
        "end": 210.64,
        "text": "will do the same to show that this is about consistency and accountability because we should not have an individual",
        "textdich": ""
    },
    {
        "start": 208.4,
        "end": 218.319,
        "text": "with those views on the committee that is tasked with representing our country and our Congress to foreign nations. I yield back.",
        "textdich": ""
    },
    {
        "start": 216.0,
        "end": 224.64,
        "text": " Representative Nicole Maliotaki's speech constitutes a formal justification for Omar's removal grounded in committee",
        "textdich": ""
    },
    {
        "start": 222.239,
        "end": 231.599,
        "text": "responsibility. She asserts firsthand experience on the foreign affairs committee, emphasizing that Omar's rhetoric extended beyond controversial",
        "textdich": ""
    },
    {
        "start": 229.84,
        "end": 240.56,
        "text": "opinions into what she describes as anti-American equivalence by citing specific comparisons Israel and the United States to Hamas and the Taliban.",
        "textdich": ""
    },
    {
        "start": 238.72,
        "end": 248.0,
        "text": "Maliotakis frames the issue as incompatible with national representation. The speech positions committee membership not as a right but",
        "textdich": ""
    },
    {
        "start": 246.239,
        "end": 257.919,
        "text": "as a trust requiring alignment with foundational national principles. centuring representative Ilhan Omar of Somali I mean Minnesota whereas elected",
        "textdich": ""
    },
    {
        "start": 255.68,
        "end": 266.479,
        "text": "members of Congress take an oath to bear true faith and allegiance to the United States without any mental reservation or purpose of evasion whereas",
        "textdich": ""
    },
    {
        "start": 264.8,
        "end": 276.0,
        "text": "representative Ilhan Omar took an oath of allegiance to the United States upon becoming a citizen declaring I absolutely and entirely renounce and",
        "textdich": ""
    },
    {
        "start": 273.28,
        "end": 285.84,
        "text": "objure all allegiance and fidelity to any foreign prince potentate state or sovereign of whom or which I have hereto for been",
        "textdich": ""
    },
    {
        "start": 282.96,
        "end": 293.6,
        "text": "a subject or citizen. Whereas on January 27th, 2024, Representative Omar gave remarks at an event in Minneapolis in",
        "textdich": ""
    },
    {
        "start": 291.44,
        "end": 295.68,
        "text": "which she made treasonous statements.",
        "textdich": ""
    },
    {
        "start": 293.6,
        "end": 303.04,
        "text": " Focuses on Maliotaki's critique of Omar's comments regarding Venezuela. She rejects the attribution of Venezuela's",
        "textdich": ""
    },
    {
        "start": 300.639,
        "end": 310.72,
        "text": "instability to US actions, instead placing responsibility on socialist governance under Hugo Chavez and Nicholas Maduro. The argument is",
        "textdich": ""
    },
    {
        "start": 308.88,
        "end": 317.6,
        "text": "structured to contrast ideological interpretations of global instability, framing Omar's perspective as dismissive",
        "textdich": ""
    },
    {
        "start": 315.199,
        "end": 324.8,
        "text": "of authoritarian accountability. Within the context of foreign affairs oversight, this disagreement is presented as disqualifying rather than",
        "textdich": ""
    },
    {
        "start": 322.56,
        "end": 333.12,
        "text": "merely ideological, reinforcing the claim that Omar's worldview undermines US diplomatic credibility. Whereas Representative Omar said she has spoken",
        "textdich": ""
    },
    {
        "start": 331.039,
        "end": 340.88,
        "text": "to many Somalians who asked her to intercede for the Somali government by pressuring the United States government into certain actions. Whereas",
        "textdich": ""
    },
    {
        "start": 339.36,
        "end": 350.479,
        "text": "Representative Omar assured the Somalians she spoke to, \"The US government will only do what Somalians in the US tell them to do. They will do",
        "textdich": ""
    },
    {
        "start": 347.6,
        "end": 357.52,
        "text": "what we want and nothing else. They must follow our orders and that is how we will safeguard the interest of Somalia.\"",
        "textdich": ""
    },
    {
        "start": 355.12,
        "end": 365.84,
        "text": "Whereas Representative Omar continued, \"For as long as I am in US Congress, Somalia will never be in danger. Its",
        "textdich": ""
    },
    {
        "start": 363.199,
        "end": 376.72,
        "text": "waters will not be stolen by Ethiopia or others. Sleep in comfort knowing I am here to protect the interest of Somalia from inside the US system.\"",
        "textdich": ""
    },
    {
        "start": 374.639,
        "end": 382.639,
        "text": " The speech then addresses Omar's remarks on the September 11th attacks, specifically criticizing the phrasing",
        "textdich": ""
    },
    {
        "start": 380.4,
        "end": 385.12,
        "text": "that minimized the nature of the event.",
        "textdich": ""
    },
    {
        "start": 382.639,
        "end": 392.08,
        "text": "Maliotakis emphasizes that clarity in describing terrorism is a moral obligation, not a semantic choice.",
        "textdich": ""
    },
    {
        "start": 389.52,
        "end": 397.919,
        "text": "Importantly, she asserts consistency by referencing her own vote to discipline a member of her own party for similar",
        "textdich": ""
    },
    {
        "start": 395.68,
        "end": 406.24,
        "text": "conduct. This segment is designed to preempt accusations of partisan hypocrisy by grounding the action in uniform standards of decorum and respect",
        "textdich": ""
    },
    {
        "start": 403.84,
        "end": 417.44,
        "text": "for national tragedy. Whereas George Washington warned in his farewell address of 1796 to guard against the impostures of pretended patriotism and",
        "textdich": ""
    },
    {
        "start": 414.88,
        "end": 427.52,
        "text": "further declared citizens by birth or choice of a common country. That country has a right to concentrate your affections. The name of American which",
        "textdich": ""
    },
    {
        "start": 424.4,
        "end": 436.16,
        "text": "belongs to you in your national capacity must always exalt the just pride of patriotism more than any appellation derived from local discriminations.",
        "textdich": ""
    },
    {
        "start": 434.88,
        "end": 444.8,
        "text": "Whereas these statements by Representative Omar clearly violate the oath she took as an elected member of Congress to defend and protect the",
        "textdich": ""
    },
    {
        "start": 441.919,
        "end": 454.0,
        "text": "United States Constitution. Whereas Representative Omar has exhibited the treasonous tendencies George Washington warned about and her actions must be",
        "textdich": ""
    },
    {
        "start": 451.919,
        "end": 464.24,
        "text": "condemned by all members of Congress who adhere to the oath they took upon assuming office. And whereas by openly admitting her efforts to advance",
        "textdich": ""
    },
    {
        "start": 460.72,
        "end": 470.639,
        "text": "Somalia's interest using her position as a United States representative, Representative Omar has revealed herself",
        "textdich": ""
    },
    {
        "start": 468.4,
        "end": 479.68,
        "text": "to be a foreign agent acting on behalf of a foreign government. Now therefore be it resolved that Representative Ilhan Omar of Minnesota be censured.",
        "textdich": ""
    },
    {
        "start": 477.36,
        "end": 486.16,
        "text": "Representative Ilhan Omar forth with present herself in the well of the House of Representatives for the pronouncement",
        "textdich": ""
    },
    {
        "start": 483.44,
        "end": 493.44,
        "text": "of censure. The first censure resolution introduces formal allegations related to Omar's remarks about Somalia. Structured",
        "textdich": ""
    },
    {
        "start": 491.28,
        "end": 501.36,
        "text": "through traditional whereas clauses, it invokes the oath of allegiance taken by naturalized citizens and elected officials. The resolution alleges that",
        "textdich": ""
    },
    {
        "start": 499.44,
        "end": 509.84,
        "text": "Omar positioned herself as an advocate for Somali national interests within the US government, framing this as a violation of constitutional duty by",
        "textdich": ""
    },
    {
        "start": 507.84,
        "end": 518.08,
        "text": "invoking George Washington's farewell address. The resolution situates the accusations within a historical narrative warning against divided loyalty.",
        "textdich": ""
    },
    {
        "start": 516.32,
        "end": 527.519,
        "text": " Representative Ilhan Omar be centered with the public reading of this resolution by the speaker and representative Ilh Ilhan Omar B and is",
        "textdich": ""
    },
    {
        "start": 525.6,
        "end": 533.44,
        "text": "hereby removed from the committee of the budget and the committee on education and the workforce.",
        "textdich": ""
    },
    {
        "start": 531.2,
        "end": 538.24,
        "text": " Mr. Speaker, pursuant to clause 2A1 of rule 9, I rise to give notice of my intent to raise a question of the",
        "textdich": ""
    },
    {
        "start": 536.32,
        "end": 546.48,
        "text": "privileges of the house. The form of the resolution is as follows. House Resolution 713 censoring Representative Elanomar of Minnesota and removing her",
        "textdich": ""
    },
    {
        "start": 544.959,
        "end": 553.2,
        "text": "from the Committee on Education and Workforce and the Committee on the Budget. Whereas Charlie Kirk was a lifelong advocate for freedom of speech,",
        "textdich": ""
    },
    {
        "start": 551.68,
        "end": 560.88,
        "text": "civil political discourse, and the political engagement of youth. Whereas Charlie Kirk was a man of deep faith, a husband, and a father to two young",
        "textdich": ""
    },
    {
        "start": 558.56,
        "end": 570.8,
        "text": "children. Whereas on September 10th, 2025, Charlie Kirk was assassinated on the campus of Utah Valley University while exercising his First Amendment",
        "textdich": ""
    },
    {
        "start": 567.12,
        "end": 578.88,
        "text": "right to freedom of speech. Whereas on September 11th, 2025, one day after the assassination of Charlie Kirk, Representative Alan Omar gave an",
        "textdich": ""
    },
    {
        "start": 576.959,
        "end": 586.959,
        "text": "interview on Zateo's town hall with Medi Hassan in which she smeared Charlie Kirk and implied he was to blame for his own murder.",
        "textdich": ""
    },
    {
        "start": 584.72,
        "end": 594.399,
        "text": " Moral and rhetorical condemnation to procedural enforcement. The resolution specifies consequences, public censure,",
        "textdich": ""
    },
    {
        "start": 592.48,
        "end": 600.8,
        "text": "presentation before the House, and removal from committee assignments. The formal tone underscores that the House",
        "textdich": ""
    },
    {
        "start": 598.48,
        "end": 608.72,
        "text": "is exercising institutional discipline rather than symbolic rebuke. The language reflects Congress's internal mechanisms for maintaining order,",
        "textdich": ""
    },
    {
        "start": 606.8,
        "end": 616.32,
        "text": "credibility, and accountability among its members, reinforcing the seriousness of the allegations being advanced.",
        "textdich": ""
    },
    {
        "start": 613.76,
        "end": 623.04,
        "text": "Whereas on September 12th, 2025, two days after the assassination of Charlie Kirk, Representative Alanomar reposted a",
        "textdich": ""
    },
    {
        "start": 620.8,
        "end": 630.64,
        "text": "video on X, formerly known as Twitter, which disparaged the character of Charlie Kirk and those mourning his death. Whereas the video representative",
        "textdich": ""
    },
    {
        "start": 628.72,
        "end": 637.839,
        "text": "Alanomar reposted on X, states, \"Charlie Kirk is dead, and before the body got cold, the far right propped his corpse",
        "textdich": ""
    },
    {
        "start": 634.64,
        "end": 645.44,
        "text": "up as a cudgel for their holy war.\" Whereas the video representative Alan Omar reposted on X further states, \"Don't be fooled. These people don't",
        "textdich": ""
    },
    {
        "start": 643.2,
        "end": 647.279,
        "text": "give a single about Charlie Kirk.",
        "textdich": ""
    },
    {
        "start": 645.44,
        "end": 656.16,
        "text": "They are just using his death to further their cristofascist agenda. Whereas the video representative Alan Omar reposted on X further states",
        "textdich": ""
    },
    {
        "start": 653.519,
        "end": 661.92,
        "text": "Charlie Kirk was a reprehensible human being. He enacted his political agenda by praying on weak-minded people. He",
        "textdich": ""
    },
    {
        "start": 660.079,
        "end": 668.8,
        "text": "took complex socio-economic issues and simplified them by pointing fingers at out groups, demonizing those groups and",
        "textdich": ""
    },
    {
        "start": 666.48,
        "end": 677.68,
        "text": "sicking his massive following on them. introduces a second resolution tied to Omar's alleged conduct following the death of Charlie Kirk. Regardless of",
        "textdich": ""
    },
    {
        "start": 675.2,
        "end": 684.079,
        "text": "external factual context, the resolution itself centers on House rules requiring members to behave in ways that uphold",
        "textdich": ""
    },
    {
        "start": 681.68,
        "end": 692.0,
        "text": "institutional dignity. It argues that public commentary attributed to Omar damaged the credibility of Congress and violated standards of decorum. This",
        "textdich": ""
    },
    {
        "start": 690.24,
        "end": 699.279,
        "text": "segment reinforces the broader theme running through all original clips that speech by elected officials is subject to institutional limits when it is",
        "textdich": ""
    },
    {
        "start": 697.68,
        "end": 702.72,
        "text": "deemed to undermine the integrity of the house.",
        "textdich": ""
    },
    {
        "start": 700.32,
        "end": 712.48,
        "text": " Whereas the video representative repos further states Charlie Kirk was a stochastic terrorist, an adamant trans phobe. He denied the",
        "textdich": ""
    },
    {
        "start": 710.399,
        "end": 720.399,
        "text": "genocide happening in Palestine. He believed the subjugation of women and in his last dying words he was spewing racist dog whistles. Whereas the video",
        "textdich": ""
    },
    {
        "start": 718.48,
        "end": 725.36,
        "text": "representative Alan Omar reposted on X further states Charlie Kirk was Dr.",
        "textdich": ""
    },
    {
        "start": 722.64,
        "end": 732.639,
        "text": "Frankenstein and his monster shot him through the neck. Whereas the video representative Alan Omar reposted on X",
        "textdich": ""
    },
    {
        "start": 729.279,
        "end": 742.639,
        "text": "further blames Charlie Kirk for his own murder. Whereas clause one of rule 13 of the rules of the house of representatives provides a member",
        "textdich": ""
    },
    {
        "start": 740.399,
        "end": 748.88,
        "text": "delegate resident commissioner officer or employ employee of the house shall behave at all times in a manner that",
        "textdich": ""
    },
    {
        "start": 746.079,
        "end": 750.56,
        "text": "shall reflect credibility on the house.",
        "textdich": ""
    },
    {
        "start": 748.88,
        "end": 759.2,
        "text": "Whereas representative Alanomar's actions in the wake of the assassination of Charlie Kirk are reprehensible and affect the dignity and integrity of",
        "textdich": ""
    },
    {
        "start": 757.44,
        "end": 762.48,
        "text": "the proceedings of the house and do not reflect the credibility on the house.",
        "textdich": ""
    },
    {
        "start": 760.88,
        "end": 770.959,
        "text": "Now therefore be it resolved that Representative Elan Omar of Minnesota be censured. Representative Alan Omar forthwith present herself in the well of",
        "textdich": ""
    },
    {
        "start": 769.6,
        "end": 778.079,
        "text": "the house of representatives for the pronouncement of censure. Representative Alanomar be censured with a public reading of this resolution by the",
        "textdich": ""
    },
    {
        "start": 776.48,
        "end": 785.36,
        "text": "speaker and representative Alan Omar be and is hereby removed from the committee on education and workforce and removed from",
        "textdich": ""
    },
    {
        "start": 783.76,
        "end": 792.32,
        "text": "the committee on the budget of the house. As the gavl fell and the vote was tallied, the House officially censured",
        "textdich": ""
    },
    {
        "start": 790.24,
        "end": 798.32,
        "text": "Ilan Omar, removing her from the Foreign Affairs Committee, the Budget Committee, and the Committee on Education and",
        "textdich": ""
    },
    {
        "start": 795.839,
        "end": 805.279,
        "text": "Workforce. And for many Americans, this moment was both cathartic and long overdue. Over the years, Omar's record has been marked not just by",
        "textdich": ""
    },
    {
        "start": 803.76,
        "end": 813.519,
        "text": "controversial statements, but by repeated instances of anti-American, anti-Israel, and unpatriotic rhetoric that went far beyond partisan",
        "textdich": ""
    },
    {
        "start": 811.2,
        "end": 818.88,
        "text": "disagreements. And today, the country witnessed what real accountability looks like when evidence meets principle.",
        "textdich": ""
    },
    {
        "start": 817.12,
        "end": 822.88,
        "text": "Congresswoman Nicole Malitaki's meticulously recounted Omar's actions.",
        "textdich": ""
    },
    {
        "start": 821.279,
        "end": 831.12,
        "text": "From equating the United States and Israel with terrorist organizations like Hamas and the Taliban to blaming America for the humanitarian disasters in",
        "textdich": ""
    },
    {
        "start": 828.72,
        "end": 838.399,
        "text": "Venezuela under brutal socialist regimes to diminishing the horror of the September 11th attacks with vague and dismissive language. comments that were",
        "textdich": ""
    },
    {
        "start": 836.24,
        "end": 846.24,
        "text": "not only offensive but incompatible with the responsibility of representing the United States to foreign nations. The removal is more than a procedural",
        "textdich": ""
    },
    {
        "start": 844.16,
        "end": 852.079,
        "text": "victory. It's a signal that rhetoric has consequences. That the oath to defend the Constitution is taken seriously and",
        "textdich": ""
    },
    {
        "start": 850.399,
        "end": 859.519,
        "text": "that both parties must be held to the same standards of consistency and integrity as evidenced by Malitaki's citing her vote to remove a Republican",
        "textdich": ""
    },
    {
        "start": 857.76,
        "end": 867.519,
        "text": "colleague for similarly inappropriate remarks. But the story does not exist in a vacuum. This moment connects to a broader context of accountability in",
        "textdich": ""
    },
    {
        "start": 865.519,
        "end": 875.519,
        "text": "government. From Senator Josh Holly exposing FBI cover-ups in Biden bribery allegations to Americans demanding transparency from institutions long",
        "textdich": ""
    },
    {
        "start": 873.76,
        "end": 884.0,
        "text": "shielded by bureaucracy and media silence. For years, voters have watched radicalism and corruption infiltrate our institutions, whether through",
        "textdich": ""
    },
    {
        "start": 882.0,
        "end": 892.24,
        "text": "ideological extremism, foreign entanglements, or outright obfiscation of the truth. And today's vote was a concrete push back against that erosion.",
        "textdich": ""
    },
    {
        "start": 890.32,
        "end": 899.92,
        "text": "The censure is not about silencing a voice or attacking diversity. It is about national security, the integrity of Congress, and the fundamental",
        "textdich": ""
    },
    {
        "start": 898.0,
        "end": 905.76,
        "text": "expectation that elected officials honor their oath and prioritize the interests of the United States above all else. It",
        "textdich": ""
    },
    {
        "start": 904.0,
        "end": 911.6,
        "text": "is a reminder that public office is a position of immense responsibility, that words have weight, and that the American",
        "textdich": ""
    },
    {
        "start": 909.76,
        "end": 918.0,
        "text": "people are watching, recording, and judging every action taken on the floor of the House. The removal of Omar is",
        "textdich": ""
    },
    {
        "start": 915.6,
        "end": 922.959,
        "text": "both symbolic and substantive. symbolic because it demonstrates that even the most prominent figures are accountable",
        "textdich": ""
    },
    {
        "start": 921.12,
        "end": 928.399,
        "text": "and substantive because it prevents an individual who has repeatedly undermined American values from shaping policy on",
        "textdich": ""
    },
    {
        "start": 926.959,
        "end": 933.04,
        "text": "committees charged with a nation's budget, education, and foreign affairs.",
        "textdich": ""
    },
    {
        "start": 931.199,
        "end": 939.12,
        "text": "It is a lesson in transparency and the permanence of recorded evidence showing that tweets, speeches, and public",
        "textdich": ""
    },
    {
        "start": 937.12,
        "end": 945.6,
        "text": "statements cannot simply be retracted or ignored when they reveal intentions that conflict with constitutional obligations. And perhaps most",
        "textdich": ""
    },
    {
        "start": 944.16,
        "end": 952.959,
        "text": "importantly, it is a moment of empowerment for citizens who demand that patriotism, truth, and accountability remain at the center of American",
        "textdich": ""
    },
    {
        "start": 951.12,
        "end": 960.56,
        "text": "governance. A reminder that radical ideologies, no matter how loudly proclaimed, will not go unchecked when they threaten the core principles of the",
        "textdich": ""
    },
    {
        "start": 958.639,
        "end": 968.88,
        "text": "nation. This vote is a call to vigilance, a demonstration that institutions still function, and a clear message that integrity matters more than",
        "textdich": ""
    },
    {
        "start": 966.399,
        "end": 974.72,
        "text": "partisan loyalty. As Americans absorb the implications from Omar censure to broader revelations of corruption and",
        "textdich": ""
    },
    {
        "start": 972.8,
        "end": 980.079,
        "text": "cover-ups, it is evident that the people are no longer passive observers. They are active participants in shaping the",
        "textdich": ""
    },
    {
        "start": 978.56,
        "end": 986.88,
        "text": "moral and political compass of the country. Today's decision reinforces that accountability is back on the table, that public servants are",
        "textdich": ""
    },
    {
        "start": 985.519,
        "end": 993.6,
        "text": "answerable to the citizens they represent, and that history will remember both the missteps and the courage to correct them. This is not",
        "textdich": ""
    },
    {
        "start": 991.839,
        "end": 1001.12,
        "text": "just a committee reshuffle. It is a turning point, a testament to the enduring power of truth and a reminder that when the institutions of governance",
        "textdich": ""
    },
    {
        "start": 999.04,
        "end": 1008.0,
        "text": "are confronted with evidence, principle must triumph over politics, and the oath to the United States is absolute for",
        "textdich": ""
    },
    {
        "start": 1005.759,
        "end": 1014.32,
        "text": "patriots, for voters, and for anyone who values the integrity of the nation. This is a decisive moment, one that demands",
        "textdich": ""
    },
    {
        "start": 1012.079,
        "end": 1021.92,
        "text": "attention, action, and reflection on what it truly means to serve responsibly, honorably, and faithfully in public office. and it sets the stage",
        "textdich": ""
    },
    {
        "start": 1020.16,
        "end": 1029.36,
        "text": "for a larger reckoning across Washington that the American people have been waiting for. Beyond the immediate vote, what this moment highlights is the",
        "textdich": ""
    },
    {
        "start": 1027.439,
        "end": 1038.0,
        "text": "broader importance of accountability in American governance. Too often, partisan loyalty or ideological convenience allows elected officials to avoid",
        "textdich": ""
    },
    {
        "start": 1036.079,
        "end": 1045.199,
        "text": "scrutiny for statements and actions that directly contradict their responsibilities and the oaths they have taken. Ilan Omar's removal from multiple",
        "textdich": ""
    },
    {
        "start": 1043.52,
        "end": 1052.16,
        "text": "committees serves as a stark reminder that words matter, that public statements carry consequences, and that positions of power come with an",
        "textdich": ""
    },
    {
        "start": 1050.32,
        "end": 1060.4,
        "text": "obligation to uphold the Constitution and represent the nation faithfully. The evidence laid bare, her speeches, interviews, and social media posts",
        "textdich": ""
    },
    {
        "start": 1058.72,
        "end": 1066.0,
        "text": "demonstrates a pattern of behavior that compromised national credibility. Yet, it also underscores the power of",
        "textdich": ""
    },
    {
        "start": 1064.0,
        "end": 1072.08,
        "text": "documented truth to confront and correct misconduct. The American people now have a clear record of what was said, the",
        "textdich": ""
    },
    {
        "start": 1070.24,
        "end": 1080.24,
        "text": "context in which it was said, and the responses it provoked, ensuring that attempts to rewrite history or evade responsibility are no longer possible.",
        "textdich": ""
    },
    {
        "start": 1078.24,
        "end": 1085.84,
        "text": "This is more than a single vote. It is a reinforcement of the principle that public service is not a platform for",
        "textdich": ""
    },
    {
        "start": 1083.44,
        "end": 1092.32,
        "text": "personal ideology, but a sacred duty to the citizens of the United States and to the principles of liberty, justice, and",
        "textdich": ""
    },
    {
        "start": 1090.0,
        "end": 1098.24,
        "text": "national security. Moreover, this censure sends a message beyond just one member of Congress. It sets a precedent",
        "textdich": ""
    },
    {
        "start": 1096.32,
        "end": 1105.28,
        "text": "for integrity and vigilance across the halls of government. When public servants are reminded that their actions, rhetoric, and alliances are",
        "textdich": ""
    },
    {
        "start": 1103.44,
        "end": 1111.28,
        "text": "scrutinized by both their colleagues and the citizens they serve, it strengthens the foundation of accountability in a",
        "textdich": ""
    },
    {
        "start": 1109.039,
        "end": 1119.28,
        "text": "democracy. It also emphasizes that patriotism and principle are not partisan tools. They are non-negotiable responsibilities of anyone entrusted",
        "textdich": ""
    },
    {
        "start": 1117.28,
        "end": 1127.36,
        "text": "with public office. From the floor of the House to town halls and social media, Americans are watching how their leaders conduct themselves. And the",
        "textdich": ""
    },
    {
        "start": 1124.799,
        "end": 1135.44,
        "text": "expectation is clear. Defend the nation, uphold the law, and act in alignment with the Constitution. The removal of Ilan Omar, therefore, is not just a",
        "textdich": ""
    },
    {
        "start": 1133.36,
        "end": 1140.799,
        "text": "moment of political consequence. It is a broader cultural moment that reinforces the idea that elected officials are not",
        "textdich": ""
    },
    {
        "start": 1138.88,
        "end": 1148.559,
        "text": "above reproach, that radical or unpatriotic behavior will face consequences and that the American people armed with evidence and engaged",
        "textdich": ""
    },
    {
        "start": 1146.4,
        "end": 1156.4,
        "text": "civic participation remain the ultimate arbiters of accountability. For those who have been frustrated by inaction or media silence, today's vote is a",
        "textdich": ""
    },
    {
        "start": 1154.48,
        "end": 1163.36,
        "text": "reminder that truth, courage, and principle can prevail even in the most polarized environments. And that when elected officials fail to honor their",
        "textdich": ""
    },
    {
        "start": 1161.52,
        "end": 1166.32,
        "text": "oath, corrective measures are both possible and necessary.",
        "textdich": ""
    }
]