[
    {
        "start": 0.4,
        "end": 14.4,
        "text": "Hello, my name is Ariel and today I want to talk to you about how to practice English at home in a way that is simple,",
        "textdich": ""
    },
    {
        "start": 10.639,
        "end": 26.32,
        "text": "calm, and possible for everyone. Even if you are busy or tired, even if you feel shy, and even if you think your English is not good enough yet,",
        "textdich": ""
    },
    {
        "start": 23.119,
        "end": 32.16,
        "text": "I want you to imagine this. You are sitting in your favorite place at home.",
        "textdich": ""
    },
    {
        "start": 29.039,
        "end": 46.32,
        "text": "Maybe on your bed, maybe on a chair, maybe near the window. You have a small notebook, a pen, maybe a book or your phone, and you are ready to learn",
        "textdich": ""
    },
    {
        "start": 42.239,
        "end": 51.76,
        "text": "English step by step, without stress, and without fear.",
        "textdich": ""
    },
    {
        "start": 48.64,
        "end": 62.32,
        "text": "Your home can be your best classroom even if it is small, even if it is noisy and even if you do not have special tools.",
        "textdich": ""
    },
    {
        "start": 59.44,
        "end": 74.799,
        "text": "The first thing you need is not a book, not an app, not a course. The first thing you need is a small simple plan that your brain can accept.",
        "textdich": ""
    },
    {
        "start": 71.84,
        "end": 90.24,
        "text": "For example, you can decide to practice every day for 15 minutes, just 15 minutes, not 2 hours, not 3 hours, just a little time that you can really do.",
        "textdich": ""
    },
    {
        "start": 87.04,
        "end": 99.119,
        "text": "Choose a time that feels natural. Maybe after breakfast, before sleep, or when you drink tea.",
        "textdich": ""
    },
    {
        "start": 95.439,
        "end": 105.04,
        "text": "Repeat this time again and again because your brain loves routine.",
        "textdich": ""
    },
    {
        "start": 102.24,
        "end": 119.6,
        "text": "When I first made my plan, I felt scared. I thought what if I cannot follow it? What if I fail again? But I told myself this time the plan will be",
        "textdich": ""
    },
    {
        "start": 116.079,
        "end": 130.959,
        "text": "very small. So small that I cannot say no. And that helped me a lot. The next thing is to choose one main place for practice.",
        "textdich": ""
    },
    {
        "start": 128.08,
        "end": 133.44,
        "text": "It does not have to be perfect.",
        "textdich": ""
    },
    {
        "start": 130.959,
        "end": 140.56,
        "text": "Maybe it is a corner of your bed, a small table in the kitchen, or the floor near the window.",
        "textdich": ""
    },
    {
        "start": 138.08,
        "end": 149.12,
        "text": "Just choose one place and tell your brain, \"This is my English place.",
        "textdich": ""
    },
    {
        "start": 145.28,
        "end": 157.04,
        "text": "When I sit here, I learn. When I sit here, I read and speak.",
        "textdich": ""
    },
    {
        "start": 153.36,
        "end": 168.08,
        "text": "I had a small table near my window. It was not beautiful. It was old, but it was my English place. I put one notebook",
        "textdich": ""
    },
    {
        "start": 164.16,
        "end": 178.16,
        "text": "there, one pen, and sometimes one simple book. When I saw that table, my brain remembered practice time, and it became",
        "textdich": ""
    },
    {
        "start": 174.64,
        "end": 185.12,
        "text": "easier to start. One of the easiest ways to practice at home is reading out loud.",
        "textdich": ""
    },
    {
        "start": 181.68,
        "end": 196.879,
        "text": "Take a short text, maybe a story, a short article, or a page from a book, and read the words with your voice, not only in your head.",
        "textdich": ""
    },
    {
        "start": 193.92,
        "end": 200.08,
        "text": "It will feel strange at first.",
        "textdich": ""
    },
    {
        "start": 196.879,
        "end": 211.84,
        "text": "Maybe you will feel shy. Maybe you think your pronunciation is bad. But nobody is watching you at home. Nobody is judging",
        "textdich": ""
    },
    {
        "start": 206.959,
        "end": 214.48,
        "text": "you. It is just you and the words.",
        "textdich": ""
    },
    {
        "start": 211.84,
        "end": 221.36,
        "text": "When I started reading out loud, my tongue felt heavy, my mouth felt slow.",
        "textdich": ""
    },
    {
        "start": 218.08,
        "end": 232.0,
        "text": "But after some days, my mouth started to move more easily. The sounds became familiar, and my voice did not shake so",
        "textdich": ""
    },
    {
        "start": 228.4,
        "end": 237.599,
        "text": "much. Another simple way to practice at home is your home talking time.",
        "textdich": ""
    },
    {
        "start": 235.2,
        "end": 246.4,
        "text": "This is a small time when you talk to yourself in English about normal things in your day. You do not need a partner.",
        "textdich": ""
    },
    {
        "start": 244.239,
        "end": 252.72,
        "text": "For example, when you are cooking, you can say, \"I am cutting the tomatoes now.",
        "textdich": ""
    },
    {
        "start": 249.76,
        "end": 262.32,
        "text": "I am washing the rice. I am putting salt in the pan.\" When you are cleaning, you can say, \"I am sweeping the floor. I am",
        "textdich": ""
    },
    {
        "start": 259.759,
        "end": 276.56,
        "text": "washing the dishes. I am folding the clothes.\" These sentences are very simple, but they are powerful because they connect English with your real life.",
        "textdich": ""
    },
    {
        "start": 274.16,
        "end": 288.88,
        "text": "I had this home talking time when I brushed my teeth. I would look in the mirror and say simple things. Hello Ariel, how are you today? You look",
        "textdich": ""
    },
    {
        "start": 285.84,
        "end": 291.919,
        "text": "tired, but you are doing your best.",
        "textdich": ""
    },
    {
        "start": 288.88,
        "end": 297.28,
        "text": "Today you will practice for 15 minutes and that is enough.",
        "textdich": ""
    },
    {
        "start": 294.08,
        "end": 303.36,
        "text": "It felt funny. I laughed at myself. But it also gave me courage.",
        "textdich": ""
    },
    {
        "start": 300.24,
        "end": 312.88,
        "text": "Another tool is listening. You do not need many things for this. You can use your phone, computer, or even a small",
        "textdich": ""
    },
    {
        "start": 309.36,
        "end": 323.199,
        "text": "old device. Choose short audio that you like. Maybe a story in simple English, a short podcast, or a video from bookish",
        "textdich": ""
    },
    {
        "start": 319.84,
        "end": 335.039,
        "text": "English. Listen to the same audio many times. The first time just relax and feel the sound. The second time try to",
        "textdich": ""
    },
    {
        "start": 331.12,
        "end": 346.24,
        "text": "catch some words. The third time repeat some sentences after the speaker. Pause, speak, then play again.",
        "textdich": ""
    },
    {
        "start": 342.32,
        "end": 355.6,
        "text": "This is something I did a lot. I had one favorite story. I listened to it so many times that I almost knew every word.",
        "textdich": ""
    },
    {
        "start": 353.039,
        "end": 368.16,
        "text": "This was good because my brain was comfortable and my tongue learned the rhythm. At home, this type of deep listening is very powerful. You do not",
        "textdich": ""
    },
    {
        "start": 365.039,
        "end": 374.96,
        "text": "need many audios, just a few that you really like and that you repeat many times.",
        "textdich": ""
    },
    {
        "start": 371.919,
        "end": 386.56,
        "text": "Some people feel bored quickly, but if you choose topics you love like cooking, travel, games or stories, it will feel much easier.",
        "textdich": ""
    },
    {
        "start": 384.24,
        "end": 392.8,
        "text": "The last thing I want to share in this first part is about feelings.",
        "textdich": ""
    },
    {
        "start": 389.919,
        "end": 403.84,
        "text": "At home, you are not only fighting with grammar, you are also fighting with your own thoughts. Maybe you think I am too",
        "textdich": ""
    },
    {
        "start": 399.52,
        "end": 413.52,
        "text": "slow. I am too old. I am too busy. My house is too noisy. My family will laugh at my English.",
        "textdich": ""
    },
    {
        "start": 410.08,
        "end": 418.72,
        "text": "I understand these thoughts very well. I had them too.",
        "textdich": ""
    },
    {
        "start": 415.6,
        "end": 427.039,
        "text": "But try something gentle. When these thoughts come, do not shout at yourself.",
        "textdich": ""
    },
    {
        "start": 422.96,
        "end": 442.0,
        "text": "Just say softly, \"I hear you.\" But I will still practice for 10 minutes. I do not need to be perfect today. I just need to show up. I just need to try.",
        "textdich": ""
    },
    {
        "start": 439.039,
        "end": 445.28,
        "text": "This gentle voice inside you is very important.",
        "textdich": ""
    },
    {
        "start": 443.52,
        "end": 453.52,
        "text": "It will help you come back again tomorrow even if today was difficult.",
        "textdich": ""
    },
    {
        "start": 449.36,
        "end": 457.12,
        "text": "Remember your home is not a test room.",
        "textdich": ""
    },
    {
        "start": 453.52,
        "end": 464.319,
        "text": "Your home is your practice garden. In a garden, plants grow slowly day by day.",
        "textdich": ""
    },
    {
        "start": 462.0,
        "end": 472.0,
        "text": "You water them a little, give them light, and one day you see a flower.",
        "textdich": ""
    },
    {
        "start": 469.039,
        "end": 479.68,
        "text": "Your English is like that. And your small daily practice at home is the water and the light.",
        "textdich": ""
    },
    {
        "start": 477.039,
        "end": 491.28,
        "text": "When you continue practicing at home, the next step is to include small speaking exercises that feel natural and fun. You do not need a teacher or a",
        "textdich": ""
    },
    {
        "start": 488.319,
        "end": 501.599,
        "text": "partner for this. You can use your phone or a recorder to help you. Record your voice and listen again. For example, you",
        "textdich": ""
    },
    {
        "start": 498.319,
        "end": 508.4,
        "text": "can take a short text, read it out loud, then record yourself reading it slowly.",
        "textdich": ""
    },
    {
        "start": 505.12,
        "end": 515.76,
        "text": "After that, listen carefully and notice the words that sound different or difficult.",
        "textdich": ""
    },
    {
        "start": 512.64,
        "end": 520.0,
        "text": "Try again and again until it feels comfortable.",
        "textdich": ""
    },
    {
        "start": 517.44,
        "end": 533.279,
        "text": "I did this when I was learning and at first I laughed at my own mistakes, but slowly my voice became more confident and my pronunciation improved.",
        "textdich": ""
    },
    {
        "start": 530.64,
        "end": 537.6,
        "text": "Another great way to practice is shadowing.",
        "textdich": ""
    },
    {
        "start": 535.6,
        "end": 550.0,
        "text": "Shadowing is when you listen to a speaker and try to speak at the same time, copying the rhythm, the pronunciation, and the pauses.",
        "textdich": ""
    },
    {
        "start": 546.48,
        "end": 558.399,
        "text": "At home, I would choose a short story or a video, play it, and speak along.",
        "textdich": ""
    },
    {
        "start": 554.88,
        "end": 567.92,
        "text": "It was not easy at first. My mouth felt slow, and my tongue did not move quickly. But I did not give up.",
        "textdich": ""
    },
    {
        "start": 565.04,
        "end": 574.08,
        "text": "After a few days, I noticed that I could speak faster and more naturally.",
        "textdich": ""
    },
    {
        "start": 571.68,
        "end": 583.839,
        "text": "Shadowing also helps your listening skills because you focus on the sounds and the way words connect in sentences.",
        "textdich": ""
    },
    {
        "start": 580.72,
        "end": 590.48,
        "text": "If you are shy, shadowing alone at home is perfect because no one is watching you.",
        "textdich": ""
    },
    {
        "start": 588.08,
        "end": 599.76,
        "text": "Another method I loved was writing simple sentences about my day. You do not need a perfect notebook. Just write",
        "textdich": ""
    },
    {
        "start": 596.88,
        "end": 610.399,
        "text": "short sentences about what you did, what you saw, or how you felt. For example, you can write, \"I am drinking tea. I am",
        "textdich": ""
    },
    {
        "start": 607.04,
        "end": 621.279,
        "text": "reading a book. I am happy today. When I started, I made many mistakes, but I did not worry. Every word I wrote helped my",
        "textdich": ""
    },
    {
        "start": 617.68,
        "end": 624.72,
        "text": "brain connect English with my thoughts.",
        "textdich": ""
    },
    {
        "start": 621.279,
        "end": 631.6,
        "text": "Over time, writing became easier and I could write longer sentences and even short stories.",
        "textdich": ""
    },
    {
        "start": 629.279,
        "end": 640.399,
        "text": "You can also make a small diary in English. Write one page a day even if it is very simple.",
        "textdich": ""
    },
    {
        "start": 638.16,
        "end": 648.48,
        "text": "Your diary will become a treasure for your learning because you can look back and see your progress.",
        "textdich": ""
    },
    {
        "start": 645.92,
        "end": 658.72,
        "text": "Listening is another very important part of home practice. You do not need to understand everything. Just listen every",
        "textdich": ""
    },
    {
        "start": 655.36,
        "end": 668.88,
        "text": "day, even for 10 minutes. You can choose a short podcast, a song or a video that you like. Listen carefully. Notice new",
        "textdich": ""
    },
    {
        "start": 665.839,
        "end": 673.839,
        "text": "words, repeat them and try to use them in sentences.",
        "textdich": ""
    },
    {
        "start": 670.8,
        "end": 686.0,
        "text": "When I started, I could not understand many words, but my brain slowly recognized the sounds and my ears became familiar with English.",
        "textdich": ""
    },
    {
        "start": 683.44,
        "end": 692.079,
        "text": "Listening everyday helps your brain think in English without translation.",
        "textdich": ""
    },
    {
        "start": 689.519,
        "end": 698.079,
        "text": "Another fun way to practice at home is to watch movies or series in English.",
        "textdich": ""
    },
    {
        "start": 695.76,
        "end": 707.36,
        "text": "Start with subtitles in English if you need them. Choose a movie you like and watch it carefully. Repeat the sentences",
        "textdich": ""
    },
    {
        "start": 704.48,
        "end": 721.76,
        "text": "that you hear. Try to imitate the actor's voices. When I did this, I chose simple movies at first and I repeated the same scenes many times.",
        "textdich": ""
    },
    {
        "start": 717.839,
        "end": 728.88,
        "text": "Slowly, I could understand more words and I could speak some sentences by myself.",
        "textdich": ""
    },
    {
        "start": 726.0,
        "end": 733.92,
        "text": "You can also pause the movie and say the sentences yourself.",
        "textdich": ""
    },
    {
        "start": 731.04,
        "end": 739.36,
        "text": "This is a small practice, but it makes a big difference over time.",
        "textdich": ""
    },
    {
        "start": 736.8,
        "end": 751.279,
        "text": "Playing games in English is another way to practice at home. There are many language learning games online. They make learning fun and interesting. For",
        "textdich": ""
    },
    {
        "start": 748.079,
        "end": 759.519,
        "text": "example, you can play word games, memory games, or quizzes. I used to play simple word games when I was learning. It",
        "textdich": ""
    },
    {
        "start": 757.12,
        "end": 771.68,
        "text": "helped me remember new words in a fun way. You can also label things in your home with English words. Write the English word on a small paper and stick",
        "textdich": ""
    },
    {
        "start": 768.16,
        "end": 782.8,
        "text": "it on the object. For example, write door on the door, table on the table, mirror on the mirror. When you see these",
        "textdich": ""
    },
    {
        "start": 779.519,
        "end": 788.72,
        "text": "words every day, your brain learns them naturally.",
        "textdich": ""
    },
    {
        "start": 784.56,
        "end": 791.36,
        "text": "I did this and it helped me a lot.",
        "textdich": ""
    },
    {
        "start": 788.72,
        "end": 798.32,
        "text": "Another tip is to think in English during small moments at home.",
        "textdich": ""
    },
    {
        "start": 794.56,
        "end": 809.2,
        "text": "For example, if you see a tree, say to yourself, \"Tree instead of using your native language.\" When you go to the kitchen, think of",
        "textdich": ""
    },
    {
        "start": 805.76,
        "end": 816.8,
        "text": "words for the things you see. I did this when I cleaned my room or cooked food.",
        "textdich": ""
    },
    {
        "start": 813.04,
        "end": 828.079,
        "text": "It was hard at first, but over time it became easier and my brain started to automatically connect English words with real objects.",
        "textdich": ""
    },
    {
        "start": 825.68,
        "end": 834.16,
        "text": "You can also talk about your plans in English at home.",
        "textdich": ""
    },
    {
        "start": 830.32,
        "end": 841.68,
        "text": "For example, today I will read a book. I will listen to a story. I will write one page.",
        "textdich": ""
    },
    {
        "start": 839.199,
        "end": 853.04,
        "text": "Speaking about your plan in English helps you think in English. I did this every morning before starting my practice. It made my day more organized",
        "textdich": ""
    },
    {
        "start": 850.399,
        "end": 858.0,
        "text": "and it also helped my English improve faster.",
        "textdich": ""
    },
    {
        "start": 855.279,
        "end": 868.24,
        "text": "Another helpful method is to set small goals for yourself. For example, learn five new words a day, read one short",
        "textdich": ""
    },
    {
        "start": 865.199,
        "end": 878.88,
        "text": "story a day, or write three sentences every morning. I started with very small goals. Every time I completed a goal, I",
        "textdich": ""
    },
    {
        "start": 875.44,
        "end": 889.04,
        "text": "felt proud. Small victories give you motivation to continue. You can also use apps to practice at home. Many apps are",
        "textdich": ""
    },
    {
        "start": 886.399,
        "end": 899.76,
        "text": "available for free and they give you exercises for listening, speaking, reading, and writing. I used an app to learn new words and practice",
        "textdich": ""
    },
    {
        "start": 898.0,
        "end": 903.92,
        "text": "pronunciation.",
        "textdich": ""
    },
    {
        "start": 899.76,
        "end": 911.04,
        "text": "I could practice anytime, anywhere, even if I had only 10 minutes.",
        "textdich": ""
    },
    {
        "start": 906.88,
        "end": 913.44,
        "text": "Remember, every small practice counts.",
        "textdich": ""
    },
    {
        "start": 911.04,
        "end": 922.56,
        "text": "Another way to practice is to pretend you are in different situations. For example, pretend you are in a restaurant",
        "textdich": ""
    },
    {
        "start": 919.12,
        "end": 931.44,
        "text": "and order food in English or pretend you are buying something at the store. Speak to yourself as if you were talking to a",
        "textdich": ""
    },
    {
        "start": 928.16,
        "end": 940.959,
        "text": "real person. I practiced this when I was alone at home and it helped me feel more confident to speak English with others",
        "textdich": ""
    },
    {
        "start": 936.639,
        "end": 948.8,
        "text": "in real life. Also, do not be afraid to make mistakes. Mistakes are part of learning.",
        "textdich": ""
    },
    {
        "start": 945.68,
        "end": 960.88,
        "text": "I made many mistakes when I started, but each mistake was a lesson. I learned new words, better pronunciation, and more confidence.",
        "textdich": ""
    },
    {
        "start": 957.759,
        "end": 967.279,
        "text": "At home, you can practice safely and make mistakes without worry.",
        "textdich": ""
    },
    {
        "start": 963.839,
        "end": 970.399,
        "text": "Another method is to use flashcards.",
        "textdich": ""
    },
    {
        "start": 967.279,
        "end": 980.959,
        "text": "Write a word on one side and its meaning on the other. Test yourself every day. I used flashc cards for new words and",
        "textdich": ""
    },
    {
        "start": 978.0,
        "end": 990.079,
        "text": "reviewed them often. This helped me remember words for a long time. You can also combine methods.",
        "textdich": ""
    },
    {
        "start": 986.8,
        "end": 1002.48,
        "text": "For example, read a story out loud, listen to it again, write a short summary in your notebook, and then talk about it to yourself. Combining reading,",
        "textdich": ""
    },
    {
        "start": 999.279,
        "end": 1008.16,
        "text": "listening, writing, and speaking strengthens your English faster.",
        "textdich": ""
    },
    {
        "start": 1005.839,
        "end": 1019.04,
        "text": "Another important point is to take breaks. Learning at home is good, but your brain also needs rest.",
        "textdich": ""
    },
    {
        "start": 1015.279,
        "end": 1030.079,
        "text": "Do not push yourself too much. I took short breaks every 30 minutes. Sometimes I drank tea. Sometimes I walked in the",
        "textdich": ""
    },
    {
        "start": 1026.48,
        "end": 1035.6,
        "text": "room. These small breaks helped me stay focused and motivated.",
        "textdich": ""
    },
    {
        "start": 1033.039,
        "end": 1048.72,
        "text": "You can also practice by using English in your hobbies. For example, if you like cooking, follow a recipe in English. If you like music, listen to",
        "textdich": ""
    },
    {
        "start": 1045.039,
        "end": 1058.559,
        "text": "English songs and sing along. When I did this, I enjoyed learning without feeling forced. Your home can be full of small",
        "textdich": ""
    },
    {
        "start": 1055.679,
        "end": 1068.88,
        "text": "practice moments, and all these small moments add up. Remember, consistency is more important than quantity. 10 minutes",
        "textdich": ""
    },
    {
        "start": 1066.24,
        "end": 1072.799,
        "text": "every day is better than 2 hours once a week.",
        "textdich": ""
    },
    {
        "start": 1070.08,
        "end": 1084.08,
        "text": "When I practiced every day, my progress was slow at first, but it was steady and after some months, I could see big improvements.",
        "textdich": ""
    },
    {
        "start": 1080.88,
        "end": 1088.48,
        "text": "Another tip is to review your old notes and writing.",
        "textdich": ""
    },
    {
        "start": 1086.0,
        "end": 1095.52,
        "text": "Go back and read what you wrote one week ago, one month ago, or longer.",
        "textdich": ""
    },
    {
        "start": 1092.72,
        "end": 1098.96,
        "text": "You will see your progress.",
        "textdich": ""
    },
    {
        "start": 1095.52,
        "end": 1104.24,
        "text": "I did this and it gave me confidence to continue.",
        "textdich": ""
    },
    {
        "start": 1100.96,
        "end": 1107.039,
        "text": "Stay positive during your home practice.",
        "textdich": ""
    },
    {
        "start": 1104.24,
        "end": 1118.48,
        "text": "Your brain sometimes feels tired and your motivation may decrease, but remember all your small efforts are building your English. I celebrated",
        "textdich": ""
    },
    {
        "start": 1115.6,
        "end": 1130.0,
        "text": "small victories like reading one page out loud without mistakes or speaking three sentences clearly. Every small success is important.",
        "textdich": ""
    },
    {
        "start": 1127.6,
        "end": 1140.16,
        "text": "You can also practice by thinking about your day in English before sleep. Review what you did, what you learned, and what",
        "textdich": ""
    },
    {
        "start": 1137.039,
        "end": 1147.919,
        "text": "you want to do tomorrow. I did this every night and it helped me think in English naturally.",
        "textdich": ""
    },
    {
        "start": 1145.12,
        "end": 1154.4,
        "text": "Another way to practice at home is to use English in daily activities.",
        "textdich": ""
    },
    {
        "start": 1151.52,
        "end": 1164.559,
        "text": "For example, when brushing your teeth, say the steps in English. I am brushing my teeth. I am rinsing my mouth. Or when",
        "textdich": ""
    },
    {
        "start": 1161.039,
        "end": 1168.08,
        "text": "washing dishes, I am washing the dishes.",
        "textdich": ""
    },
    {
        "start": 1164.559,
        "end": 1179.919,
        "text": "I am drying them. I did this every day and my English became part of my routine. You can also use online groups or communities to practice. Even if you",
        "textdich": ""
    },
    {
        "start": 1177.28,
        "end": 1190.32,
        "text": "are at home, you can chat with other learners, share small sentences, ask questions, and receive encouragement.",
        "textdich": ""
    },
    {
        "start": 1186.88,
        "end": 1194.799,
        "text": "I joined an online group and it gave me extra motivation.",
        "textdich": ""
    },
    {
        "start": 1192.32,
        "end": 1199.76,
        "text": "Another tip is to read aloud with emotion.",
        "textdich": ""
    },
    {
        "start": 1196.32,
        "end": 1208.88,
        "text": "Do not just read the words. Try to feel the story, the feelings of the characters and say it with your voice.",
        "textdich": ""
    },
    {
        "start": 1205.84,
        "end": 1217.12,
        "text": "When I did this, my reading became more fluent and I could remember words better.",
        "textdich": ""
    },
    {
        "start": 1213.84,
        "end": 1225.679,
        "text": "Remember, your home is your practice space, your safe place, and your English garden.",
        "textdich": ""
    },
    {
        "start": 1222.72,
        "end": 1238.159,
        "text": "Every small action, every little practice, every short sentence, and every small story adds water and light to your English growth. When you",
        "textdich": ""
    },
    {
        "start": 1235.52,
        "end": 1244.799,
        "text": "continue practicing at home, it is important to use your imagination.",
        "textdich": ""
    },
    {
        "start": 1241.44,
        "end": 1250.559,
        "text": "You can create small stories in English, even if they are very simple.",
        "textdich": ""
    },
    {
        "start": 1247.84,
        "end": 1258.4,
        "text": "For example, you can imagine a day in your life or a short adventure with your favorite character.",
        "textdich": ""
    },
    {
        "start": 1255.6,
        "end": 1266.4,
        "text": "Write it in your notebook or just speak it aloud. I used to do this every evening.",
        "textdich": ""
    },
    {
        "start": 1263.28,
        "end": 1274.64,
        "text": "At first, my sentences were very short, like I go to the market, I buy apples.",
        "textdich": ""
    },
    {
        "start": 1270.88,
        "end": 1278.24,
        "text": "But slowly, I added more details.",
        "textdich": ""
    },
    {
        "start": 1274.64,
        "end": 1281.84,
        "text": "I go to the market, I buy red apples.",
        "textdich": ""
    },
    {
        "start": 1278.24,
        "end": 1290.96,
        "text": "The apples are sweet and fresh. Creating small stories helps your brain think in English and makes learning more fun.",
        "textdich": ""
    },
    {
        "start": 1288.64,
        "end": 1297.2,
        "text": "Another very useful practice is repeating words and sentences.",
        "textdich": ""
    },
    {
        "start": 1294.32,
        "end": 1307.52,
        "text": "Every day, choose five or 10 words that you learned before and say them aloud many times. Then make small sentences",
        "textdich": ""
    },
    {
        "start": 1303.6,
        "end": 1320.08,
        "text": "with those words. For example, if the word is happy, you can say, I am happy today. My cat is happy. I feel happy when I read.",
        "textdich": ""
    },
    {
        "start": 1317.039,
        "end": 1332.0,
        "text": "Repetition helps your brain remember and your mouth becomes used to making the sounds of English. You can also practice by singing songs in English.",
        "textdich": ""
    },
    {
        "start": 1329.6,
        "end": 1346.0,
        "text": "Music is a very strong tool for learning. Choose a simple song and sing along. Do not worry about mistakes. When I started, I could not understand all",
        "textdich": ""
    },
    {
        "start": 1342.159,
        "end": 1356.159,
        "text": "the words, but I tried to sing. After a few weeks, I noticed that I could remember the words and my pronunciation improved.",
        "textdich": ""
    },
    {
        "start": 1353.679,
        "end": 1363.6,
        "text": "Another way to practice is to watch short videos and pause often.",
        "textdich": ""
    },
    {
        "start": 1359.919,
        "end": 1365.679,
        "text": "After one sentence, repeat it aloud.",
        "textdich": ""
    },
    {
        "start": 1363.6,
        "end": 1373.039,
        "text": "This way, you learn the rhythm, pronunciation, and natural expressions.",
        "textdich": ""
    },
    {
        "start": 1369.679,
        "end": 1376.88,
        "text": "I did this with my favorite videos.",
        "textdich": ""
    },
    {
        "start": 1373.039,
        "end": 1380.24,
        "text": "Sometimes I paused every three words.",
        "textdich": ""
    },
    {
        "start": 1376.88,
        "end": 1384.559,
        "text": "Sometimes I repeated whole sentences.",
        "textdich": ""
    },
    {
        "start": 1380.24,
        "end": 1390.32,
        "text": "It felt slow, but it helped a lot. Small steps make big improvements over time.",
        "textdich": ""
    },
    {
        "start": 1388.159,
        "end": 1402.559,
        "text": "You can also practice by teaching someone at home. Even if they do not know English, explain a word or a sentence to them. Teaching helps you",
        "textdich": ""
    },
    {
        "start": 1398.96,
        "end": 1408.0,
        "text": "remember. I used to explain simple words to my little brother.",
        "textdich": ""
    },
    {
        "start": 1405.12,
        "end": 1414.159,
        "text": "He laughed, but it helped me speak English with confidence.",
        "textdich": ""
    },
    {
        "start": 1410.64,
        "end": 1416.64,
        "text": "Another tip is to use sticky notes.",
        "textdich": ""
    },
    {
        "start": 1414.159,
        "end": 1429.76,
        "text": "Write new words and stick them on objects in your home. For example, mirror on the mirror, cup on the cup, window on the window.",
        "textdich": ""
    },
    {
        "start": 1427.039,
        "end": 1440.0,
        "text": "Every time you see the word, say it aloud. Your brain learns quickly this way. You can also practice thinking in",
        "textdich": ""
    },
    {
        "start": 1436.4,
        "end": 1450.559,
        "text": "English. When you do small actions like making tea or walking, say the steps in English. For example, I open the water",
        "textdich": ""
    },
    {
        "start": 1446.88,
        "end": 1463.84,
        "text": "bottle. I pour water in the cup. I add tea. When I started this, it felt strange. But after a few days it became natural. Another very important method",
        "textdich": ""
    },
    {
        "start": 1461.52,
        "end": 1475.36,
        "text": "is speaking to yourself about your feelings. For example, I feel happy today.",
        "textdich": ""
    },
    {
        "start": 1469.679,
        "end": 1478.08,
        "text": "I feel tired. I am excited to learn.",
        "textdich": ""
    },
    {
        "start": 1475.36,
        "end": 1486.799,
        "text": "When I did this every morning, it helped me connect English with my emotions and my speaking became easier.",
        "textdich": ""
    },
    {
        "start": 1483.919,
        "end": 1498.799,
        "text": "You can also practice by reading news or short articles in English. Even if you understand only a few words, your brain starts to recognize patterns.",
        "textdich": ""
    },
    {
        "start": 1496.159,
        "end": 1510.799,
        "text": "I started with very short articles and underlined words I did not know. Then I looked up their meaning and tried to use them in my own sentences.",
        "textdich": ""
    },
    {
        "start": 1508.0,
        "end": 1522.72,
        "text": "Another practice is using a vocabulary notebook. write new words, their meaning, and one sentence with each word. I did this every day, and after",
        "textdich": ""
    },
    {
        "start": 1520.159,
        "end": 1527.76,
        "text": "one month, I had a notebook full of words I could use.",
        "textdich": ""
    },
    {
        "start": 1525.039,
        "end": 1543.52,
        "text": "You can also practice by writing emails to yourself. Write small notes, messages, or letters. For example, dear Ariel, today I learned five new words.",
        "textdich": ""
    },
    {
        "start": 1540.24,
        "end": 1552.88,
        "text": "I practiced speaking. I listened to a story. This is fun and helps you write and think in English. Another method is",
        "textdich": ""
    },
    {
        "start": 1549.84,
        "end": 1555.039,
        "text": "reading aloud and recording yourself.",
        "textdich": ""
    },
    {
        "start": 1552.88,
        "end": 1564.88,
        "text": "Then listen to your recording and compare it with the original audio. This helps with pronunciation and fluency.",
        "textdich": ""
    },
    {
        "start": 1561.679,
        "end": 1573.6,
        "text": "I used to do this every week. At first, my voice sounded strange, but after some time, I noticed improvements.",
        "textdich": ""
    },
    {
        "start": 1571.2,
        "end": 1578.559,
        "text": "You can also practice by imagining conversations.",
        "textdich": ""
    },
    {
        "start": 1575.679,
        "end": 1584.88,
        "text": "Pretend you are talking with a friend, a teacher, or even a famous person.",
        "textdich": ""
    },
    {
        "start": 1582.159,
        "end": 1588.88,
        "text": "Speak your sentences aloud.",
        "textdich": ""
    },
    {
        "start": 1584.88,
        "end": 1599.919,
        "text": "For example, hello, how are you? I am learning English at home. What do you do today? This helps you prepare for real conversations.",
        "textdich": ""
    },
    {
        "start": 1596.48,
        "end": 1602.799,
        "text": "Another tip is to set small challenges.",
        "textdich": ""
    },
    {
        "start": 1599.919,
        "end": 1612.08,
        "text": "For example, speak only in English for 10 minutes at home or write a short story using five new words.",
        "textdich": ""
    },
    {
        "start": 1609.279,
        "end": 1623.919,
        "text": "I did this every week and it pushed me to practice more. You can also practice by translating simple sentences from your language to English.",
        "textdich": ""
    },
    {
        "start": 1620.96,
        "end": 1631.12,
        "text": "Take one small sentence like I am drinking water and write it in English.",
        "textdich": ""
    },
    {
        "start": 1627.919,
        "end": 1635.2,
        "text": "Then say it aloud. This helps you think in English.",
        "textdich": ""
    },
    {
        "start": 1633.12,
        "end": 1645.6,
        "text": "Another method is to watch English cartoons or simple shows. They are easy to understand and the words are clear.",
        "textdich": ""
    },
    {
        "start": 1642.72,
        "end": 1655.52,
        "text": "Repeat the sentences and try to copy the voices. I used to watch cartoons every evening and it made learning fun.",
        "textdich": ""
    },
    {
        "start": 1652.4,
        "end": 1664.64,
        "text": "Another tip is to join online groups for English learners. Even if you are at home, you can chat, ask questions and",
        "textdich": ""
    },
    {
        "start": 1661.44,
        "end": 1670.159,
        "text": "practice writing. I joined a small group and it helped me stay motivated.",
        "textdich": ""
    },
    {
        "start": 1667.52,
        "end": 1677.52,
        "text": "You can also practice by describing your day in English before sleeping.",
        "textdich": ""
    },
    {
        "start": 1673.2,
        "end": 1686.559,
        "text": "For example, today I woke up at 7:00. I brushed my teeth. I had breakfast. I practiced English for 15 minutes. Doing",
        "textdich": ""
    },
    {
        "start": 1684.159,
        "end": 1700.48,
        "text": "this every night trains your brain to think in English naturally. Another method is to use apps for vocabulary, listening, and speaking. I used small",
        "textdich": ""
    },
    {
        "start": 1696.64,
        "end": 1706.159,
        "text": "apps for 5 to 10 minutes every day. It was easy and I could practice anywhere.",
        "textdich": ""
    },
    {
        "start": 1704.0,
        "end": 1718.799,
        "text": "You can also practice by reading children's books. They are simple, fun, and full of useful words. I started with very easy books and slowly move to",
        "textdich": ""
    },
    {
        "start": 1716.799,
        "end": 1721.6,
        "text": "longer stories.",
        "textdich": ""
    },
    {
        "start": 1718.799,
        "end": 1736.159,
        "text": "Another tip is to set a goal for the week. For example, learn 20 new words, write three pages, or speak 5 minutes every day. Small goals are very",
        "textdich": ""
    },
    {
        "start": 1732.64,
        "end": 1745.919,
        "text": "powerful. You can also practice by using English in your hobbies. For example, cooking, drawing, or playing games.",
        "textdich": ""
    },
    {
        "start": 1743.44,
        "end": 1756.24,
        "text": "Use English words and sentences while doing your hobby. I did this and it made learning more enjoyable. Another tip is",
        "textdich": ""
    },
    {
        "start": 1752.96,
        "end": 1768.32,
        "text": "to celebrate small achievements. If you read one page without mistakes or speak three sentences clearly, give yourself a small reward.",
        "textdich": ""
    },
    {
        "start": 1764.559,
        "end": 1778.48,
        "text": "I did this and it kept me motivated. You can also practice by listening to short audio clips and repeating them many times.",
        "textdich": ""
    },
    {
        "start": 1775.36,
        "end": 1787.84,
        "text": "Repetition helps your brain remember and your mouth learns the pronunciation naturally. Another method is to read",
        "textdich": ""
    },
    {
        "start": 1784.24,
        "end": 1794.159,
        "text": "your old writing and notice progress. I did this every month and it gave me confidence.",
        "textdich": ""
    },
    {
        "start": 1791.679,
        "end": 1807.36,
        "text": "You can also practice by pretending to be a teacher and explaining words to someone. Even if it is imaginary, it helps you speak and think in English.",
        "textdich": ""
    },
    {
        "start": 1803.279,
        "end": 1809.919,
        "text": "Another tip is to take breaks and rest.",
        "textdich": ""
    },
    {
        "start": 1807.36,
        "end": 1820.799,
        "text": "Learning is important, but your brain needs rest to grow. Short breaks help you stay focused. You can also practice by using English in small daily",
        "textdich": ""
    },
    {
        "start": 1819.279,
        "end": 1823.76,
        "text": "activities.",
        "textdich": ""
    },
    {
        "start": 1820.799,
        "end": 1829.6,
        "text": "For example, when brushing teeth, washing dishes, or cooking.",
        "textdich": ""
    },
    {
        "start": 1826.799,
        "end": 1833.679,
        "text": "Say the steps in English.",
        "textdich": ""
    },
    {
        "start": 1829.6,
        "end": 1843.44,
        "text": "I brush my teeth. I wash the dishes. I stir the soup. Another method is to combine all skills.",
        "textdich": ""
    },
    {
        "start": 1839.679,
        "end": 1850.32,
        "text": "Listen to a story. Read it aloud. Write a small summary and then speak about it.",
        "textdich": ""
    },
    {
        "start": 1847.36,
        "end": 1856.72,
        "text": "This strengthens listening, reading, writing, and speaking at the same time.",
        "textdich": ""
    },
    {
        "start": 1854.159,
        "end": 1867.039,
        "text": "You can also practice by labeling new words in your home. When you see the word every day, say it aloud. Your brain",
        "textdich": ""
    },
    {
        "start": 1863.6,
        "end": 1878.24,
        "text": "will learn it naturally. Another tip is to use English when thinking about your plans. Today I will practice English. I will read a story. I will write",
        "textdich": ""
    },
    {
        "start": 1876.399,
        "end": 1882.24,
        "text": "sentences.",
        "textdich": ""
    },
    {
        "start": 1878.24,
        "end": 1890.96,
        "text": "Small daily sentences are powerful. You can also practice by reading short articles or news in English. Underline",
        "textdich": ""
    },
    {
        "start": 1887.84,
        "end": 1900.32,
        "text": "new words, find their meaning, and use them in sentences. Another method is to make small dialogues and act them out.",
        "textdich": ""
    },
    {
        "start": 1897.76,
        "end": 1907.039,
        "text": "Pretend to be in a shop, a restaurant, or a school. Speak aloud.",
        "textdich": ""
    },
    {
        "start": 1904.24,
        "end": 1912.72,
        "text": "I did this at home, and it helped me feel ready for real conversations.",
        "textdich": ""
    },
    {
        "start": 1910.08,
        "end": 1919.6,
        "text": "Another tip is to be patient and gentle with yourself. Do not push too hard.",
        "textdich": ""
    },
    {
        "start": 1916.32,
        "end": 1929.279,
        "text": "Learning at home is a slow process and every small step counts. Celebrate small progress and stay motivated. When you",
        "textdich": ""
    },
    {
        "start": 1926.559,
        "end": 1939.12,
        "text": "continue practicing at home, it is important to make English a natural part of your life. Do not think of it as",
        "textdich": ""
    },
    {
        "start": 1935.12,
        "end": 1949.44,
        "text": "studying all the time. Instead, think of it as a game, a small challenge, or a habit you enjoy. For example, you can",
        "textdich": ""
    },
    {
        "start": 1946.559,
        "end": 1960.32,
        "text": "start your morning by saying, \"Good morning, Ariel. Today I will practice English.\" You can smile at yourself in the mirror and speak a few sentences",
        "textdich": ""
    },
    {
        "start": 1958.24,
        "end": 1962.88,
        "text": "about your day.",
        "textdich": ""
    },
    {
        "start": 1960.32,
        "end": 1969.679,
        "text": "When I started this, it felt funny, but it also motivated me to start my practice.",
        "textdich": ""
    },
    {
        "start": 1967.039,
        "end": 1976.399,
        "text": "Another way to make learning natural is to include English in small daily tasks.",
        "textdich": ""
    },
    {
        "start": 1974.08,
        "end": 1986.799,
        "text": "For example, when you cook, think about the words, I cut the onions, I boil water, I stir the soup. When I did this,",
        "textdich": ""
    },
    {
        "start": 1984.24,
        "end": 1993.919,
        "text": "I started connecting English words with my real life, and it became easier to remember.",
        "textdich": ""
    },
    {
        "start": 1991.44,
        "end": 2006.72,
        "text": "Listening every day is also very important. You do not need a long podcast or a difficult story. Even 5 minutes of listening is good. Choose a",
        "textdich": ""
    },
    {
        "start": 2003.12,
        "end": 2011.279,
        "text": "short story, a song or a video and listen carefully.",
        "textdich": ""
    },
    {
        "start": 2008.72,
        "end": 2022.96,
        "text": "Repeat the words aloud after you hear them. I did this every day and my brain started recognizing words naturally.",
        "textdich": ""
    },
    {
        "start": 2019.84,
        "end": 2032.24,
        "text": "Another method is reading aloud. Choose a simple story or article. Read slowly and clearly.",
        "textdich": ""
    },
    {
        "start": 2028.96,
        "end": 2038.48,
        "text": "At first, you may make mistakes, but it is okay.",
        "textdich": ""
    },
    {
        "start": 2034.159,
        "end": 2041.76,
        "text": "Slowly, your pronunciation will improve.",
        "textdich": ""
    },
    {
        "start": 2038.48,
        "end": 2049.119,
        "text": "When I read aloud every day, I noticed my mouth learned the movements of English sounds.",
        "textdich": ""
    },
    {
        "start": 2046.24,
        "end": 2063.2,
        "text": "Speaking to yourself is another powerful method. You can talk about your day, your feelings, your plans, or anything you like. For example,",
        "textdich": ""
    },
    {
        "start": 2058.8,
        "end": 2072.96,
        "text": "I am happy today. I will read a story. I will write in my notebook. Speaking aloud trains your brain and your mouth.",
        "textdich": ""
    },
    {
        "start": 2070.0,
        "end": 2082.079,
        "text": "I did this every morning and evening and slowly I became more confident. Another useful way is shadowing.",
        "textdich": ""
    },
    {
        "start": 2079.44,
        "end": 2088.24,
        "text": "This means listening to a speaker and repeating at the same time.",
        "textdich": ""
    },
    {
        "start": 2085.04,
        "end": 2093.2,
        "text": "You copy the rhythm, the pronunciation, and the pauses.",
        "textdich": ""
    },
    {
        "start": 2090.24,
        "end": 2097.839,
        "text": "I practiced this with short stories and videos.",
        "textdich": ""
    },
    {
        "start": 2094.8,
        "end": 2105.599,
        "text": "At first, it was very hard, but after a few days, I could speak faster and more naturally.",
        "textdich": ""
    },
    {
        "start": 2102.64,
        "end": 2112.56,
        "text": "Shadowing also improves your listening because you notice small details in the sounds.",
        "textdich": ""
    },
    {
        "start": 2110.0,
        "end": 2123.04,
        "text": "Writing simple sentences is another way to practice. You can write about your day, your thoughts, or your dreams.",
        "textdich": ""
    },
    {
        "start": 2119.2,
        "end": 2134.96,
        "text": "For example, I woke up at 7. I had breakfast. I practiced English. I started with very short sentences and slowly added more details.",
        "textdich": ""
    },
    {
        "start": 2132.48,
        "end": 2142.0,
        "text": "Writing every day helped me remember words and express ideas.",
        "textdich": ""
    },
    {
        "start": 2138.24,
        "end": 2145.119,
        "text": "You can also use a vocabulary notebook.",
        "textdich": ""
    },
    {
        "start": 2142.0,
        "end": 2158.8,
        "text": "Write new words. their meaning and a sentence. Review them often. I did this every day and after a month I had many words I could use easily.",
        "textdich": ""
    },
    {
        "start": 2155.52,
        "end": 2161.839,
        "text": "Another way is to use flashcards.",
        "textdich": ""
    },
    {
        "start": 2158.8,
        "end": 2169.44,
        "text": "Write a word on one side and the meaning on the other. Test yourself every day.",
        "textdich": ""
    },
    {
        "start": 2166.8,
        "end": 2174.48,
        "text": "I use flashcards for new words and sentences.",
        "textdich": ""
    },
    {
        "start": 2171.119,
        "end": 2177.68,
        "text": "This helped me remember them quickly.",
        "textdich": ""
    },
    {
        "start": 2174.48,
        "end": 2188.24,
        "text": "Another fun method is to watch movies, series or cartoons in English. Start with subtitles in English if needed.",
        "textdich": ""
    },
    {
        "start": 2184.8,
        "end": 2194.079,
        "text": "Repeat sentences, copy the voices and try to act like the speakers.",
        "textdich": ""
    },
    {
        "start": 2191.28,
        "end": 2207.68,
        "text": "I used to watch short videos and repeat small parts many times. Slowly I understood more words and could speak the sentences myself.",
        "textdich": ""
    },
    {
        "start": 2203.359,
        "end": 2210.4,
        "text": "Listening to songs is also very helpful.",
        "textdich": ""
    },
    {
        "start": 2207.68,
        "end": 2218.8,
        "text": "Choose a song you like. Listen carefully. Repeat the words and sing along.",
        "textdich": ""
    },
    {
        "start": 2215.52,
        "end": 2228.72,
        "text": "At first it may be difficult, but after a few weeks your pronunciation improves and you remember new words. Another tip",
        "textdich": ""
    },
    {
        "start": 2225.839,
        "end": 2240.4,
        "text": "is to think in English. When you do small tasks like cleaning or cooking, say the actions in English. For example,",
        "textdich": ""
    },
    {
        "start": 2235.92,
        "end": 2253.119,
        "text": "I sweep the floor. I wash the dishes. I make tea. I did this every day. And slowly thinking in English became natural. You can also make small stories",
        "textdich": ""
    },
    {
        "start": 2250.079,
        "end": 2261.2,
        "text": "in your imagination. Pretend a small adventure happened today. Write it or speak it aloud.",
        "textdich": ""
    },
    {
        "start": 2258.64,
        "end": 2268.72,
        "text": "At first, your sentences may be short, like I go to the market. I buy apples.",
        "textdich": ""
    },
    {
        "start": 2265.599,
        "end": 2271.599,
        "text": "Later, add more details.",
        "textdich": ""
    },
    {
        "start": 2268.72,
        "end": 2274.24,
        "text": "I go to the market. I buy red apples.",
        "textdich": ""
    },
    {
        "start": 2271.599,
        "end": 2276.64,
        "text": "They are sweet and fresh.",
        "textdich": ""
    },
    {
        "start": 2274.24,
        "end": 2283.119,
        "text": "This practice helps your brain think creatively in English.",
        "textdich": ""
    },
    {
        "start": 2279.119,
        "end": 2286.0,
        "text": "Another method is to review old writing.",
        "textdich": ""
    },
    {
        "start": 2283.119,
        "end": 2293.599,
        "text": "Read what you wrote one week ago, one month ago, or more. Notice your progress.",
        "textdich": ""
    },
    {
        "start": 2290.72,
        "end": 2306.64,
        "text": "I did this every month and felt proud of small achievements. You can also practice by pretending to talk to a friend, teacher, or famous person. Speak",
        "textdich": ""
    },
    {
        "start": 2302.8,
        "end": 2315.04,
        "text": "your sentences aloud. For example, hello, how are you? I am learning English at home. What do you do today?",
        "textdich": ""
    },
    {
        "start": 2313.2,
        "end": 2319.68,
        "text": "This prepares you for real conversations.",
        "textdich": ""
    },
    {
        "start": 2316.88,
        "end": 2330.8,
        "text": "Another important tip is to set small goals. For example, learn 10 new words a week, write one page every day, or speak",
        "textdich": ""
    },
    {
        "start": 2327.44,
        "end": 2343.359,
        "text": "five minutes every day. Small goals give you motivation and a sense of achievement. You can also use apps for listening, speaking, and vocabulary.",
        "textdich": ""
    },
    {
        "start": 2339.599,
        "end": 2346.0,
        "text": "Even 5 to 10 minutes a day helps.",
        "textdich": ""
    },
    {
        "start": 2343.359,
        "end": 2350.56,
        "text": "I practice this at home and could use it any time.",
        "textdich": ""
    },
    {
        "start": 2347.839,
        "end": 2360.56,
        "text": "Another fun way is to use English in your hobbies. For example, if you like cooking, follow a recipe in English. If",
        "textdich": ""
    },
    {
        "start": 2357.52,
        "end": 2370.64,
        "text": "you like music, listen to English songs and try to understand the words. I did this and it made learning enjoyable.",
        "textdich": ""
    },
    {
        "start": 2368.079,
        "end": 2375.28,
        "text": "Another method is to celebrate small victories.",
        "textdich": ""
    },
    {
        "start": 2372.4,
        "end": 2385.599,
        "text": "Every time you finish reading one page, speaking three sentences, or learning a new word, give yourself a small reward.",
        "textdich": ""
    },
    {
        "start": 2382.48,
        "end": 2398.4,
        "text": "This keeps you motivated. You can also practice by labeling things in your home. Write English words on sticky notes and stick them on objects. For",
        "textdich": ""
    },
    {
        "start": 2394.64,
        "end": 2408.4,
        "text": "example, mirror on the mirror, table on the table. Every time you see it, say the word aloud. Your brain learns",
        "textdich": ""
    },
    {
        "start": 2405.04,
        "end": 2415.119,
        "text": "naturally. Another tip is to pretend you are teaching English to someone.",
        "textdich": ""
    },
    {
        "start": 2411.76,
        "end": 2420.56,
        "text": "Explain a new word or sentence, even if it is imaginary.",
        "textdich": ""
    },
    {
        "start": 2417.359,
        "end": 2425.76,
        "text": "I did this and it helped me speak more confidently.",
        "textdich": ""
    },
    {
        "start": 2422.16,
        "end": 2429.2,
        "text": "Another method is to combine skills.",
        "textdich": ""
    },
    {
        "start": 2425.76,
        "end": 2439.52,
        "text": "Listen to a story, read it aloud, write a small summary, and then speak about it. This strengthens listening, reading,",
        "textdich": ""
    },
    {
        "start": 2436.079,
        "end": 2441.92,
        "text": "writing, and speaking at the same time.",
        "textdich": ""
    },
    {
        "start": 2439.52,
        "end": 2446.079,
        "text": "You can also take short breaks during practice.",
        "textdich": ""
    },
    {
        "start": 2443.44,
        "end": 2460.56,
        "text": "Every 30 minutes, stop for a few minutes, stretch, drink water, or breathe. It helps your brain stay focused. Another tip is to use English",
        "textdich": ""
    },
    {
        "start": 2456.48,
        "end": 2469.839,
        "text": "while planning your day. Say, \"Today, I will practice English. I will read a story. I will write three sentences.\"",
        "textdich": ""
    },
    {
        "start": 2467.359,
        "end": 2479.92,
        "text": "Small daily sentences help your brain think in English. Another useful method is to read simple news articles or short",
        "textdich": ""
    },
    {
        "start": 2476.0,
        "end": 2487.76,
        "text": "stories, underline new words, look up the meaning and make small sentences.",
        "textdich": ""
    },
    {
        "start": 2484.0,
        "end": 2498.16,
        "text": "I did this and slowly I could understand more words. You can also act out small dialogues. Pretend to be in a shop, a",
        "textdich": ""
    },
    {
        "start": 2494.88,
        "end": 2504.56,
        "text": "restaurant or a school. Speak aloud and imagine the conversation.",
        "textdich": ""
    },
    {
        "start": 2500.64,
        "end": 2507.119,
        "text": "This prepares you for real situations.",
        "textdich": ""
    },
    {
        "start": 2504.56,
        "end": 2511.92,
        "text": "Another tip is to be patient and gentle with yourself.",
        "textdich": ""
    },
    {
        "start": 2509.52,
        "end": 2518.96,
        "text": "Learning English at home is a slow process. Every small step counts.",
        "textdich": ""
    },
    {
        "start": 2516.0,
        "end": 2527.44,
        "text": "Celebrate every success, even the smallest one. You can also practice by speaking about your day before sleep.",
        "textdich": ""
    },
    {
        "start": 2525.76,
        "end": 2535.839,
        "text": "For example, today I woke up at 7. I had breakfast. I practiced English.",
        "textdich": ""
    },
    {
        "start": 2533.76,
        "end": 2540.079,
        "text": "This helps you think in English naturally.",
        "textdich": ""
    },
    {
        "start": 2537.44,
        "end": 2553.839,
        "text": "Another method is to use English in daily routines. Brushing teeth, washing dishes, cooking or cleaning. Say the steps aloud in English. I did this and",
        "textdich": ""
    },
    {
        "start": 2551.52,
        "end": 2558.88,
        "text": "it helped me connect English with real life.",
        "textdich": ""
    },
    {
        "start": 2555.44,
        "end": 2561.839,
        "text": "Another tip is to use repetition.",
        "textdich": ""
    },
    {
        "start": 2558.88,
        "end": 2574.16,
        "text": "Repeat words, sentences, and short stories many times. Repetition helps your brain remember and makes speaking easier. You can also combine listening,",
        "textdich": ""
    },
    {
        "start": 2571.359,
        "end": 2579.599,
        "text": "reading, writing, and speaking in one practice session.",
        "textdich": ""
    },
    {
        "start": 2576.24,
        "end": 2592.0,
        "text": "I listened to a story, read it aloud, wrote a small summary, and spoke about it. This method strengthened all skills together.",
        "textdich": ""
    },
    {
        "start": 2588.24,
        "end": 2602.079,
        "text": "Another tip is to stay motivated. Find something that inspires you to practice every day, like a favorite quote, a small reward, or remembering your",
        "textdich": ""
    },
    {
        "start": 2600.319,
        "end": 2604.96,
        "text": "progress.",
        "textdich": ""
    },
    {
        "start": 2602.079,
        "end": 2615.68,
        "text": "Your home is your safe space, your English garden, where every small action adds water and sunlight to your learning. When you continue your",
        "textdich": ""
    },
    {
        "start": 2612.56,
        "end": 2627.76,
        "text": "practice at home, it is very important to make English a habit. A habit means doing something every day without thinking too much. You can start with a",
        "textdich": ""
    },
    {
        "start": 2624.96,
        "end": 2637.359,
        "text": "small action like speaking one sentence in English every morning. For example, today I will read a story. I will write",
        "textdich": ""
    },
    {
        "start": 2634.64,
        "end": 2649.359,
        "text": "three sentences. I will listen to a short video. When I started it felt small, but over time these small actions",
        "textdich": ""
    },
    {
        "start": 2645.68,
        "end": 2660.48,
        "text": "added up. Another way to make English a habit is to choose a fixed time every day. It could be morning, afternoon, or evening.",
        "textdich": ""
    },
    {
        "start": 2658.079,
        "end": 2671.44,
        "text": "I chose evening because it was quiet at home. Every evening I spent 30 minutes practicing English. At first, I did not",
        "textdich": ""
    },
    {
        "start": 2667.68,
        "end": 2680.96,
        "text": "feel much change, but after a few weeks, I noticed that my brain was ready to learn every day at the same time.",
        "textdich": ""
    },
    {
        "start": 2678.079,
        "end": 2690.64,
        "text": "Another helpful tip is to mix different skills in your practice. For example, start with listening, then read a short",
        "textdich": ""
    },
    {
        "start": 2687.119,
        "end": 2699.839,
        "text": "story aloud, then write a few sentences, and finally speak about it. This method is very powerful because it trains your",
        "textdich": ""
    },
    {
        "start": 2696.24,
        "end": 2709.04,
        "text": "brain to use all skills together. I did this every day and slowly I could understand more and speak more naturally.",
        "textdich": ""
    },
    {
        "start": 2706.72,
        "end": 2719.52,
        "text": "You can also practice by making small dialogues. Pretend you are in a shop, a restaurant, or at school. Speak aloud to",
        "textdich": ""
    },
    {
        "start": 2715.68,
        "end": 2725.44,
        "text": "yourself. For example, hello, can I buy apples? How much is it? Thank you.",
        "textdich": ""
    },
    {
        "start": 2722.72,
        "end": 2731.04,
        "text": "Acting like this helps you prepare for real conversations.",
        "textdich": ""
    },
    {
        "start": 2727.599,
        "end": 2734.4,
        "text": "Another important method is repetition.",
        "textdich": ""
    },
    {
        "start": 2731.04,
        "end": 2743.76,
        "text": "Repeat words, sentences or short stories many times. Repetition helps your memory and your mouth becomes familiar with",
        "textdich": ""
    },
    {
        "start": 2740.64,
        "end": 2750.88,
        "text": "English sounds. I repeated simple sentences every day until I could say them without thinking.",
        "textdich": ""
    },
    {
        "start": 2748.4,
        "end": 2761.04,
        "text": "Another tip is to use your hobbies to practice. For example, if you like cooking, read the recipe in English and",
        "textdich": ""
    },
    {
        "start": 2757.359,
        "end": 2768.24,
        "text": "follow it. If you like music, listen to songs in English and sing along.",
        "textdich": ""
    },
    {
        "start": 2764.24,
        "end": 2770.319,
        "text": "I did this and it made learning fun.",
        "textdich": ""
    },
    {
        "start": 2768.24,
        "end": 2774.0,
        "text": "Another method is to write about your day.",
        "textdich": ""
    },
    {
        "start": 2771.839,
        "end": 2784.64,
        "text": "Even if it is only three or four sentences, write about what you did, what you saw, or how you felt.",
        "textdich": ""
    },
    {
        "start": 2780.64,
        "end": 2792.72,
        "text": "For example, I woke up at 7. I had breakfast. I listened to a story. I felt happy.",
        "textdich": ""
    },
    {
        "start": 2790.24,
        "end": 2797.44,
        "text": "Writing helps your brain think in English.",
        "textdich": ""
    },
    {
        "start": 2794.48,
        "end": 2811.52,
        "text": "Another tip is to use a vocabulary notebook. Every day, write new words. their meaning and a sentence. Review it often. I did this and after a month I",
        "textdich": ""
    },
    {
        "start": 2809.04,
        "end": 2824.64,
        "text": "had many words I could use in speaking and writing. Another way is to use flashc cards. Write a word on one side and its meaning on the other. Test",
        "textdich": ""
    },
    {
        "start": 2820.64,
        "end": 2833.04,
        "text": "yourself every day. I used flashcards and noticed that my memory for new words became stronger.",
        "textdich": ""
    },
    {
        "start": 2830.079,
        "end": 2842.64,
        "text": "Another fun method is to watch movies or series in English. Start with subtitles in English if needed. Repeat sentences",
        "textdich": ""
    },
    {
        "start": 2839.2,
        "end": 2856.56,
        "text": "aloud and try to copy the voices. I watched short movies many times and repeated sentences slowly. It helped me understand more words and speak better.",
        "textdich": ""
    },
    {
        "start": 2852.72,
        "end": 2858.96,
        "text": "Listening to songs is also very helpful.",
        "textdich": ""
    },
    {
        "start": 2856.56,
        "end": 2867.04,
        "text": "Choose a song you like. Listen carefully, repeat the words and sing along.",
        "textdich": ""
    },
    {
        "start": 2864.0,
        "end": 2873.68,
        "text": "I did this every week and slowly my pronunciation and vocabulary improved.",
        "textdich": ""
    },
    {
        "start": 2871.2,
        "end": 2880.319,
        "text": "Another tip is to think in English during small daily tasks.",
        "textdich": ""
    },
    {
        "start": 2876.64,
        "end": 2887.04,
        "text": "For example, I am brushing my teeth. I am washing the dishes. I am making tea.",
        "textdich": ""
    },
    {
        "start": 2884.48,
        "end": 2893.2,
        "text": "Doing this every day helps your brain connect English words with actions.",
        "textdich": ""
    },
    {
        "start": 2890.88,
        "end": 2906.4,
        "text": "Another method is to create small stories in your mind. Pretend you had a small adventure or a fun day. Speak it aloud or write it down. At first, your",
        "textdich": ""
    },
    {
        "start": 2903.52,
        "end": 2918.72,
        "text": "sentences may be short. I go to the park. I see a bird. I feel happy. Later, you can add more details. I go to the",
        "textdich": ""
    },
    {
        "start": 2914.24,
        "end": 2926.64,
        "text": "park. I see a small brown bird. It sings a beautiful song. I feel very happy.",
        "textdich": ""
    },
    {
        "start": 2923.839,
        "end": 2934.559,
        "text": "This practice improves creativity and speaking skills. Another tip is to review old writing.",
        "textdich": ""
    },
    {
        "start": 2932.16,
        "end": 2946.319,
        "text": "Read what you wrote last week or last month. You will notice your progress and it will motivate you. I did this every month and felt proud of small",
        "textdich": ""
    },
    {
        "start": 2943.599,
        "end": 2957.28,
        "text": "achievements. You can also pretend to talk to a friend, teacher, or famous person. Speak your sentences aloud. For example,",
        "textdich": ""
    },
    {
        "start": 2954.64,
        "end": 2968.72,
        "text": "hello, how are you? I am learning English at home. I practiced today. What did you do? This prepares you for real conversations.",
        "textdich": ""
    },
    {
        "start": 2966.079,
        "end": 2979.68,
        "text": "Another important tip is to set small weekly goals. For example, learn 10 new words, write five sentences a day, or",
        "textdich": ""
    },
    {
        "start": 2976.559,
        "end": 2989.76,
        "text": "speak for 5 minutes every day. Small goals give motivation and a sense of achievement. You can also use apps to practice listening, speaking, and",
        "textdich": ""
    },
    {
        "start": 2988.16,
        "end": 2993.04,
        "text": "vocabulary.",
        "textdich": ""
    },
    {
        "start": 2989.76,
        "end": 3001.52,
        "text": "I used small apps for 5 to 10 minutes every day. Even a short practice is very useful.",
        "textdich": ""
    },
    {
        "start": 2998.319,
        "end": 3014.079,
        "text": "Another fun way is to use English in your hobbies. For example, follow a cooking recipe in English or read instructions for a craft project. Using",
        "textdich": ""
    },
    {
        "start": 3011.76,
        "end": 3018.24,
        "text": "English in hobbies makes learning enjoyable.",
        "textdich": ""
    },
    {
        "start": 3015.68,
        "end": 3022.319,
        "text": "Another tip is to celebrate small victories.",
        "textdich": ""
    },
    {
        "start": 3019.92,
        "end": 3033.92,
        "text": "Every time you read one page without mistakes, speak three sentences clearly or remember new words. Give yourself a",
        "textdich": ""
    },
    {
        "start": 3029.359,
        "end": 3036.559,
        "text": "small reward. This keeps you motivated.",
        "textdich": ""
    },
    {
        "start": 3033.92,
        "end": 3047.68,
        "text": "You can also practice by labeling things in your home. Write English words on sticky notes and stick them on objects.",
        "textdich": ""
    },
    {
        "start": 3043.839,
        "end": 3061.359,
        "text": "For example, door on the door, chair on the chair. Every time you see it, say the word aloud. Another tip is to pretend you are teaching English to",
        "textdich": ""
    },
    {
        "start": 3056.96,
        "end": 3068.0,
        "text": "someone. Explain a new word or sentence even if it is imaginary.",
        "textdich": ""
    },
    {
        "start": 3064.8,
        "end": 3073.04,
        "text": "I did this and it helped me speak more confidently.",
        "textdich": ""
    },
    {
        "start": 3069.68,
        "end": 3076.8,
        "text": "Another method is to combine skills.",
        "textdich": ""
    },
    {
        "start": 3073.04,
        "end": 3083.68,
        "text": "Listen to a story, read it aloud, write a small summary, and speak about it.",
        "textdich": ""
    },
    {
        "start": 3080.559,
        "end": 3090.0,
        "text": "This strengthens listening, reading, writing, and speaking together.",
        "textdich": ""
    },
    {
        "start": 3087.04,
        "end": 3092.72,
        "text": "Another tip is to take short breaks.",
        "textdich": ""
    },
    {
        "start": 3090.0,
        "end": 3106.0,
        "text": "Every 30 minutes, stop for a few minutes. Stretch, drink water, or breathe. It helps your brain stay focused. You can also practice by",
        "textdich": ""
    },
    {
        "start": 3102.4,
        "end": 3118.319,
        "text": "planning your day in English. Say aloud, \"Today I will practice English. I will read a story. I will write sentences. I will listen to a video.\"",
        "textdich": ""
    },
    {
        "start": 3115.52,
        "end": 3127.76,
        "text": "This small habit helps your brain think in English. Another useful method is to read short news articles or simple",
        "textdich": ""
    },
    {
        "start": 3123.839,
        "end": 3137.76,
        "text": "stories, underline new words, find their meaning, and make small sentences. I did this every week, and slowly I could",
        "textdich": ""
    },
    {
        "start": 3134.319,
        "end": 3151.04,
        "text": "understand more words. You can also act out dialogues. Pretend to be in a shop, restaurant, or school. Speak aloud and imagine the conversation.",
        "textdich": ""
    },
    {
        "start": 3147.76,
        "end": 3155.68,
        "text": "Another tip is to be patient and kind to yourself.",
        "textdich": ""
    },
    {
        "start": 3152.88,
        "end": 3162.0,
        "text": "Learning English at home is a slow process. Every small step counts.",
        "textdich": ""
    },
    {
        "start": 3159.359,
        "end": 3164.24,
        "text": "Celebrate all progress.",
        "textdich": ""
    },
    {
        "start": 3162.0,
        "end": 3177.2,
        "text": "Another method is to speak about your day before sleeping. For example, today I woke up at 7. I had breakfast. I listened to a story. I wrote three",
        "textdich": ""
    },
    {
        "start": 3175.119,
        "end": 3179.76,
        "text": "sentences.",
        "textdich": ""
    },
    {
        "start": 3177.2,
        "end": 3184.319,
        "text": "This helps your brain think in English naturally.",
        "textdich": ""
    },
    {
        "start": 3181.68,
        "end": 3195.76,
        "text": "Another tip is to use English in daily routines. Brushing teeth, washing dishes, cooking or cleaning.",
        "textdich": ""
    },
    {
        "start": 3191.599,
        "end": 3199.839,
        "text": "Say the steps aloud in English.",
        "textdich": ""
    },
    {
        "start": 3195.76,
        "end": 3206.319,
        "text": "Another tip is repetition. Repeat words, sentences or short stories many times.",
        "textdich": ""
    },
    {
        "start": 3203.599,
        "end": 3218.8,
        "text": "Repetition helps your memory and makes speaking easier. You can also combine listening, reading, writing, and speaking in one session. I listened to a",
        "textdich": ""
    },
    {
        "start": 3215.839,
        "end": 3229.119,
        "text": "story, read it aloud, wrote a small summary, and spoke about it. This strengthened all skills together.",
        "textdich": ""
    },
    {
        "start": 3225.599,
        "end": 3241.76,
        "text": "Another tip is to stay motivated. Find something that inspires you every day, like a quote, a small reward, or remembering your progress. Your home is",
        "textdich": ""
    },
    {
        "start": 3238.4,
        "end": 3251.76,
        "text": "your safe place, your English garden, where every small action helps your English grow. Have you ever tried to speak English, but your mind keeps",
        "textdich": ""
    },
    {
        "start": 3249.359,
        "end": 3261.68,
        "text": "translating every word before you say it? You know what you want to say, but your thoughts feel slow and stuck. In",
        "textdich": ""
    },
    {
        "start": 3259.28,
        "end": 3271.359,
        "text": "this video, I'll show you how to stop translating and start thinking in English so the words come out naturally,",
        "textdich": ""
    },
    {
        "start": 3268.16,
        "end": 3282.0,
        "text": "clearly, and with confidence. Stay with me till the end because after watching this, you'll never be afraid to speak again.",
        "textdich": ""
    },
    {
        "start": 3278.16,
        "end": 3286.24,
        "text": "Chapter 1. Why you don't think in English yet?",
        "textdich": ""
    },
    {
        "start": 3284.48,
        "end": 3296.96,
        "text": "You know that moment when you try to speak English, but your brain suddenly becomes quiet. You know the words. You studied them. You've written them",
        "textdich": ""
    },
    {
        "start": 3294.16,
        "end": 3307.44,
        "text": "hundreds of times. But when it's time to speak, your mind starts translating, searching, freezing. You want to say something simple like, \"I had",
        "textdich": ""
    },
    {
        "start": 3304.96,
        "end": 3316.559,
        "text": "breakfast.\" But your brain first says it in your own language, then tries to turn it into English. By that time, the",
        "textdich": ""
    },
    {
        "start": 3312.88,
        "end": 3327.68,
        "text": "moment is gone. You feel slow. You feel shy. And maybe you think something is wrong with you. But let me tell you something powerful. Nothing is wrong",
        "textdich": ""
    },
    {
        "start": 3324.319,
        "end": 3329.76,
        "text": "with you. You are not bad at English.",
        "textdich": ""
    },
    {
        "start": 3327.68,
        "end": 3337.2,
        "text": "Your brain is just doing what it was trained to do. For years, you learned English with translation.",
        "textdich": ""
    },
    {
        "start": 3335.28,
        "end": 3347.599,
        "text": "Every new word had a meaning in your native language next to it. Your brain created a connection between two languages. So when you try to speak, it",
        "textdich": ""
    },
    {
        "start": 3344.96,
        "end": 3355.68,
        "text": "takes a long journey. First from your thoughts, then to your language, and finally to English. It's like driving a",
        "textdich": ""
    },
    {
        "start": 3353.359,
        "end": 3364.799,
        "text": "car with three red lights before you can move. You are not slow. The system you use is slow. And that's what we're going",
        "textdich": ""
    },
    {
        "start": 3361.2,
        "end": 3370.319,
        "text": "to fix together. Imagine this. When you were a baby, you didn't study grammar.",
        "textdich": ""
    },
    {
        "start": 3367.52,
        "end": 3373.2,
        "text": "You didn't memorize vocabulary lists.",
        "textdich": ""
    },
    {
        "start": 3370.319,
        "end": 3380.559,
        "text": "You didn't translate anything. You just listened. You connected words with feelings. When your mother said milk,",
        "textdich": ""
    },
    {
        "start": 3378.72,
        "end": 3386.96,
        "text": "you didn't ask what it meant in another language. You saw the milk. You felt it.",
        "textdich": ""
    },
    {
        "start": 3384.24,
        "end": 3398.24,
        "text": "You understood it. That's how humans learn language naturally. But when we grow up, we forget that secret. We try to study English like a subject. But",
        "textdich": ""
    },
    {
        "start": 3395.839,
        "end": 3403.52,
        "text": "English is not a subject. It's a language meant to live inside your mind.",
        "textdich": ""
    },
    {
        "start": 3401.52,
        "end": 3411.599,
        "text": "Thinking in English doesn't mean you will become perfect overnight. It means you start changing how your brain works.",
        "textdich": ""
    },
    {
        "start": 3409.68,
        "end": 3423.2,
        "text": "It means you begin to see the world through English words. When you look at the sky, you say sky. When you drink water, you say water. When you walk to",
        "textdich": ""
    },
    {
        "start": 3420.319,
        "end": 3429.2,
        "text": "school, you think I am walking. It's small, it's simple, but it's powerful.",
        "textdich": ""
    },
    {
        "start": 3427.04,
        "end": 3435.28,
        "text": "Every time you do this, you are teaching your brain to think directly in English.",
        "textdich": ""
    },
    {
        "start": 3432.16,
        "end": 3437.599,
        "text": "You're cutting the translation wire.",
        "textdich": ""
    },
    {
        "start": 3435.28,
        "end": 3446.0,
        "text": "Right now, maybe you think that sounds difficult, but it's not. You already have everything you need. You have words",
        "textdich": ""
    },
    {
        "start": 3442.96,
        "end": 3453.52,
        "text": "in your memory. You have emotions. You have the will to speak. You just need to connect them again the way you did as a",
        "textdich": ""
    },
    {
        "start": 3450.319,
        "end": 3461.2,
        "text": "child. The moment you stop thinking what is this word in my language and start asking what does this word feel like in",
        "textdich": ""
    },
    {
        "start": 3458.799,
        "end": 3467.359,
        "text": "English, you will feel something new inside you. Freedom.",
        "textdich": ""
    },
    {
        "start": 3464.319,
        "end": 3474.079,
        "text": "You see your brain is like a muscle. It does what you train it to do. If you train it to think in your language, it",
        "textdich": ""
    },
    {
        "start": 3471.839,
        "end": 3487.2,
        "text": "will. But if you train it to think in English, it will switch. It takes time, yes. It takes practice, yes, but it is 100% possible. The biggest mistake",
        "textdich": ""
    },
    {
        "start": 3484.96,
        "end": 3494.559,
        "text": "learners make is waiting for the right time. Waiting for more vocabulary, waiting for confidence.",
        "textdich": ""
    },
    {
        "start": 3492.559,
        "end": 3501.52,
        "text": "But thinking in English doesn't need waiting. It needs starting.",
        "textdich": ""
    },
    {
        "start": 3498.4,
        "end": 3514.559,
        "text": "You can start right now. Look around you. Name what you see in English. chair, window, book, light. Don't translate, just say it, feel it. Listen",
        "textdich": ""
    },
    {
        "start": 3511.599,
        "end": 3525.2,
        "text": "to your own voice. That's how thinking begins. Not from a grammar book, not from a classroom, from your mind and your mouth working together.",
        "textdich": ""
    },
    {
        "start": 3523.119,
        "end": 3538.799,
        "text": "When you learn to think in English, speaking becomes easy. You don't plan, you don't pause, you just flow. The words come out like water. You sound",
        "textdich": ""
    },
    {
        "start": 3534.799,
        "end": 3552.319,
        "text": "natural, confident, alive. That is what every learner dreams of. And the truth is it's not a dream. It's a skill. A skill you can build starting today.",
        "textdich": ""
    },
    {
        "start": 3548.88,
        "end": 3561.119,
        "text": "So stop blaming yourself. Stop saying, \"I can't think fast.\" You can. You just need to teach your brain to stay in",
        "textdich": ""
    },
    {
        "start": 3558.0,
        "end": 3571.359,
        "text": "English longer. Every second you spend thinking in English is a step toward fluency. And with every step, your fear gets smaller.",
        "textdich": ""
    },
    {
        "start": 3568.72,
        "end": 3580.24,
        "text": "From this chapter forward, I want you to remember this line. You don't learn to think in English by studying. You learn",
        "textdich": ""
    },
    {
        "start": 3577.04,
        "end": 3591.2,
        "text": "by living in English. So from today, live in it, listen in it, speak in it, think in it. Even if you make mistakes, you're growing.",
        "textdich": ""
    },
    {
        "start": 3588.88,
        "end": 3602.16,
        "text": "Because one day soon, someone will talk to you in English. And without even realizing it, you'll reply instantly, confidently, and fluently. That's the",
        "textdich": ""
    },
    {
        "start": 3599.52,
        "end": 3616.64,
        "text": "day you'll smile and say to yourself, \"I did it. I can finally think in English.\" Chapter 2. The child's secret. How babies learn without translation.",
        "textdich": ""
    },
    {
        "start": 3613.76,
        "end": 3629.76,
        "text": "Think about a baby for a moment. A baby cannot read. A baby cannot write. But somehow a baby learns to speak perfectly. No grammar books, no",
        "textdich": ""
    },
    {
        "start": 3625.76,
        "end": 3639.44,
        "text": "vocabulary lists, no translation, just listening, feeling, and repeating. That is the magic of the human brain. You had",
        "textdich": ""
    },
    {
        "start": 3636.559,
        "end": 3648.799,
        "text": "that same power, too. You were born with it. You still have it. you just forgot how to use it. But the good news is you",
        "textdich": ""
    },
    {
        "start": 3645.44,
        "end": 3657.76,
        "text": "can remember you can bring it back. When a baby hears the word water, they do not ask what it means. They see it. They",
        "textdich": ""
    },
    {
        "start": 3654.72,
        "end": 3664.0,
        "text": "touch it. They drink it. Their brain connects the sound with the experience.",
        "textdich": ""
    },
    {
        "start": 3660.88,
        "end": 3675.04,
        "text": "That is why babies learn so fast. They learn with life, not with lessons. You can do the same. You can train your brain to think like a baby again. To",
        "textdich": ""
    },
    {
        "start": 3672.24,
        "end": 3679.839,
        "text": "connect English words with real things, not with translations.",
        "textdich": ""
    },
    {
        "start": 3677.2,
        "end": 3686.64,
        "text": "When you do that, English stops being a subject. It becomes a part of your world.",
        "textdich": ""
    },
    {
        "start": 3683.92,
        "end": 3694.799,
        "text": "You see, when you translate, your brain takes a long journey. But when you think like a baby, your brain takes a",
        "textdich": ""
    },
    {
        "start": 3691.44,
        "end": 3698.319,
        "text": "shortcut. It feels the meaning directly.",
        "textdich": ""
    },
    {
        "start": 3694.799,
        "end": 3709.04,
        "text": "No middle language, no confusion, just feeling and speaking. That is how fluency starts. You don't have to know every rule. You just need to trust your",
        "textdich": ""
    },
    {
        "start": 3706.64,
        "end": 3713.28,
        "text": "brain's natural ability to learn through connection.",
        "textdich": ""
    },
    {
        "start": 3710.799,
        "end": 3727.52,
        "text": "So today, I want you to try something simple. Look at anything near you. A pen, a cup, a mirror. Say its name in English. Do not think in your native",
        "textdich": ""
    },
    {
        "start": 3723.359,
        "end": 3730.88,
        "text": "language. Just say it. Feel the word.",
        "textdich": ""
    },
    {
        "start": 3727.52,
        "end": 3740.64,
        "text": "Imagine it in your mind. Cup, mirror, light. That's it. You are doing what babies do. You are building your English",
        "textdich": ""
    },
    {
        "start": 3736.72,
        "end": 3748.72,
        "text": "world. Word by word. Every small word you say this way makes your brain faster, more natural, more confident.",
        "textdich": ""
    },
    {
        "start": 3746.4,
        "end": 3755.119,
        "text": "When babies learn, they do not care about mistakes. They say funny words.",
        "textdich": ""
    },
    {
        "start": 3752.0,
        "end": 3765.44,
        "text": "They repeat sounds. They fall and stand again. But they never stop. That is the real secret. They do not say I am shy.",
        "textdich": ""
    },
    {
        "start": 3762.4,
        "end": 3772.319,
        "text": "They do not say I am not ready. They just try. That is what you must do.",
        "textdich": ""
    },
    {
        "start": 3768.72,
        "end": 3779.28,
        "text": "Forget perfection. Forget fear. Speak like a baby. Make sounds. Laugh. Feel.",
        "textdich": ""
    },
    {
        "start": 3777.2,
        "end": 3783.44,
        "text": "The more you do it, the more you will grow.",
        "textdich": ""
    },
    {
        "start": 3780.96,
        "end": 3789.92,
        "text": "You are not starting from zero. You already have experience, memory, and understanding.",
        "textdich": ""
    },
    {
        "start": 3787.76,
        "end": 3798.799,
        "text": "You just need to return to the natural way of learning. Stop forcing English into your mind. Let it flow.",
        "textdich": ""
    },
    {
        "start": 3796.319,
        "end": 3807.44,
        "text": "When you listen to English, don't try to understand every single word. Feel the rhythm. Feel the music. Let the meaning",
        "textdich": ""
    },
    {
        "start": 3804.96,
        "end": 3812.799,
        "text": "come to you slowly. Your brain will catch it. It always does.",
        "textdich": ""
    },
    {
        "start": 3810.88,
        "end": 3824.079,
        "text": "Think of this chapter as a mirror of your own power. If a baby can learn without books, you can too. You have more focus, more emotion, and more",
        "textdich": ""
    },
    {
        "start": 3821.2,
        "end": 3832.4,
        "text": "purpose than a child. You just need to use it. When you start connecting English with your life, it becomes alive",
        "textdich": ""
    },
    {
        "start": 3829.039,
        "end": 3844.48,
        "text": "inside you. It moves with you. You see the sky and say, \"Beautiful sky.\" You smell coffee and say good morning. You feel tired and whisper I need rest.",
        "textdich": ""
    },
    {
        "start": 3842.319,
        "end": 3850.24,
        "text": "These small sentences are the bridge between your thoughts and English thinking.",
        "textdich": ""
    },
    {
        "start": 3848.16,
        "end": 3858.16,
        "text": "One day you will realize something special. You will wake up and find your first thought of the day is in English.",
        "textdich": ""
    },
    {
        "start": 3855.599,
        "end": 3866.319,
        "text": "It will surprise you but it will also make you proud. That will be the moment you know your brain has changed. You are",
        "textdich": ""
    },
    {
        "start": 3863.68,
        "end": 3871.119,
        "text": "no longer translating. You are living the language.",
        "textdich": ""
    },
    {
        "start": 3868.559,
        "end": 3883.76,
        "text": "So stop thinking like a student. Start thinking like a child again. Open your ears. Open your heart. Trust your natural learning. Feel every word. Let",
        "textdich": ""
    },
    {
        "start": 3880.48,
        "end": 3887.44,
        "text": "English become sound, emotion, and life again.",
        "textdich": ""
    },
    {
        "start": 3885.52,
        "end": 3895.2,
        "text": "Because once you start thinking like a baby, you stop learning English the hard way. You start living it the easy way",
        "textdich": ""
    },
    {
        "start": 3893.119,
        "end": 3900.319,
        "text": "and that is how you truly think in English.",
        "textdich": ""
    },
    {
        "start": 3896.799,
        "end": 3905.039,
        "text": "Chapter three. Build English pictures in your mind.",
        "textdich": ""
    },
    {
        "start": 3902.559,
        "end": 3914.96,
        "text": "Close your eyes for a moment and imagine this. You hear the word apple. What do you see? A red fruit. A green leaf.",
        "textdich": ""
    },
    {
        "start": 3912.319,
        "end": 3916.799,
        "text": "Maybe the sound of someone biting it.",
        "textdich": ""
    },
    {
        "start": 3914.96,
        "end": 3927.119,
        "text": "That is how your brain understands meaning. Not through words, through pictures. This is the real secret to thinking in English. When you stop",
        "textdich": ""
    },
    {
        "start": 3924.88,
        "end": 3937.28,
        "text": "seeing translations and start seeing images, your brain becomes free. You start to feel the language instead of chasing it. When most people hear an",
        "textdich": ""
    },
    {
        "start": 3934.88,
        "end": 3946.48,
        "text": "English word, their brain immediately looks for the translation. Apple becomes a word in their own language. But this",
        "textdich": ""
    },
    {
        "start": 3943.2,
        "end": 3955.44,
        "text": "slows everything down. You think twice and by the time you find the meaning the sentence has already moved on. You lose",
        "textdich": ""
    },
    {
        "start": 3952.079,
        "end": 3963.039,
        "text": "confidence. You feel behind. But there is another way the faster way. When you connect the word apple directly with the",
        "textdich": ""
    },
    {
        "start": 3960.64,
        "end": 3976.4,
        "text": "image of an apple your brain doesn't need to translate. It just knows. That is thinking in English. Imagine your mind as a movie screen. Every word",
        "textdich": ""
    },
    {
        "start": 3972.64,
        "end": 3986.079,
        "text": "creates a picture there. Sun, rain, smile, coffee. You don't need another language to understand. You can see it.",
        "textdich": ""
    },
    {
        "start": 3982.96,
        "end": 3994.48,
        "text": "You can feel it. You can live it. That is how fluent speakers think. They do not translate. They imagine. They build",
        "textdich": ""
    },
    {
        "start": 3992.079,
        "end": 3999.92,
        "text": "a world inside their minds where English feels natural.",
        "textdich": ""
    },
    {
        "start": 3996.64,
        "end": 4004.72,
        "text": "Start small. Pick five words today.",
        "textdich": ""
    },
    {
        "start": 3999.92,
        "end": 4014.4,
        "text": "Simple words: book, chair, tree, road, window. Look at each one. Say the word out loud. Picture it clearly in your",
        "textdich": ""
    },
    {
        "start": 4010.96,
        "end": 4016.799,
        "text": "mind. Keep it there for a few seconds.",
        "textdich": ""
    },
    {
        "start": 4014.4,
        "end": 4026.799,
        "text": "Then move to the next one. You will notice something. You feel the meaning more deeply. You remember the words faster. You start to feel like English",
        "textdich": ""
    },
    {
        "start": 4024.48,
        "end": 4030.96,
        "text": "is part of your thoughts, not just a subject you study.",
        "textdich": ""
    },
    {
        "start": 4029.039,
        "end": 4042.16,
        "text": "When I first learned this trick, everything changed for me. I stopped translating. I started feeling. I could describe my world in English because I",
        "textdich": ""
    },
    {
        "start": 4039.2,
        "end": 4051.52,
        "text": "was seeing it in English. When I saw the sun, I didn't think about my language's word. I just said sun. When I saw a",
        "textdich": ""
    },
    {
        "start": 4048.0,
        "end": 4054.72,
        "text": "child laughing, I thought happy child.",
        "textdich": ""
    },
    {
        "start": 4051.52,
        "end": 4060.72,
        "text": "It was simple. It was natural. That's when English became real for me.",
        "textdich": ""
    },
    {
        "start": 4058.24,
        "end": 4068.4,
        "text": "You can do it too. Your brain loves pictures. It understands stories and images better than grammar rules. That",
        "textdich": ""
    },
    {
        "start": 4066.079,
        "end": 4076.319,
        "text": "is why movies help you learn faster than books. That is why a single image can teach you more than 10 pages. When you",
        "textdich": ""
    },
    {
        "start": 4074.079,
        "end": 4085.599,
        "text": "use pictures, your learning becomes alive. English words turn into memories, not just sounds.",
        "textdich": ""
    },
    {
        "start": 4082.88,
        "end": 4092.559,
        "text": "Try this. Look around your room right now. Say everything you see in English.",
        "textdich": ""
    },
    {
        "start": 4089.119,
        "end": 4104.4,
        "text": "This is my table. This is my phone. This is my bed. Do not think of the translation. Just say it, see it, feel it. That is how your brain builds",
        "textdich": ""
    },
    {
        "start": 4101.44,
        "end": 4110.0,
        "text": "connections. Every time you do this, you make English stronger inside your mind.",
        "textdich": ""
    },
    {
        "start": 4108.159,
        "end": 4120.159,
        "text": "Thinking in English is not about speaking fast. It is about seeing the world through English eyes. When you do that, you no longer fear speaking. The",
        "textdich": ""
    },
    {
        "start": 4118.319,
        "end": 4128.08,
        "text": "words come naturally because the pictures are already in your head. You do not have to search. They just appear.",
        "textdich": ""
    },
    {
        "start": 4125.839,
        "end": 4132.0,
        "text": "And when they appear, your confidence rises.",
        "textdich": ""
    },
    {
        "start": 4130.0,
        "end": 4143.92,
        "text": "The next time someone speaks to you in English, do not panic. Just listen and imagine what they say. Turn their words into pictures. Your brain will",
        "textdich": ""
    },
    {
        "start": 4140.56,
        "end": 4153.199,
        "text": "understand faster. You will feel calmer. you will start to reply without even realizing it. That is the power of English pictures.",
        "textdich": ""
    },
    {
        "start": 4150.719,
        "end": 4161.199,
        "text": "So make this your habit. Live your life in pictures. Let every English word become an image in your mind. Let every",
        "textdich": ""
    },
    {
        "start": 4158.64,
        "end": 4163.199,
        "text": "image become a feeling in your heart.",
        "textdich": ""
    },
    {
        "start": 4161.199,
        "end": 4167.52,
        "text": "That is how you will stop translating forever.",
        "textdich": ""
    },
    {
        "start": 4165.199,
        "end": 4177.52,
        "text": "Remember your brain learns best through vision. You do not have to force English. You just have to see it. And when you can see it, you can think it.",
        "textdich": ""
    },
    {
        "start": 4175.359,
        "end": 4181.759,
        "text": "And when you can think it, you can speak it.",
        "textdich": ""
    },
    {
        "start": 4179.199,
        "end": 4190.96,
        "text": "That is how fluency begins. Not with grammar, not with rules, with imagination, with pictures, with life.",
        "textdich": ""
    },
    {
        "start": 4188.799,
        "end": 4195.12,
        "text": "Chapter 4.",
        "textdich": ""
    },
    {
        "start": 4190.96,
        "end": 4198.08,
        "text": "Talk to yourself. The secret practice.",
        "textdich": ""
    },
    {
        "start": 4195.12,
        "end": 4201.44,
        "text": "Nobody tells you.",
        "textdich": ""
    },
    {
        "start": 4198.08,
        "end": 4211.04,
        "text": "Let me tell you something powerful. You already have the best English teacher in the world. It's not in a classroom. It's",
        "textdich": ""
    },
    {
        "start": 4207.6,
        "end": 4223.44,
        "text": "not on YouTube. It's not in a book. It's you. You are your own teacher. The secret is simple. You must talk to yourself in English.",
        "textdich": ""
    },
    {
        "start": 4220.48,
        "end": 4229.84,
        "text": "I know it sounds funny, but this one habit can change your English forever.",
        "textdich": ""
    },
    {
        "start": 4227.04,
        "end": 4239.199,
        "text": "When you talk to yourself, you remove the fear of being judged. There is no one to laugh at your mistakes, no one to",
        "textdich": ""
    },
    {
        "start": 4236.239,
        "end": 4249.199,
        "text": "correct you in a harsh way. It's just you and your thoughts. That's where real fluency begins. Because English is not",
        "textdich": ""
    },
    {
        "start": 4245.6,
        "end": 4251.52,
        "text": "only about words, it's about confidence.",
        "textdich": ""
    },
    {
        "start": 4249.199,
        "end": 4261.199,
        "text": "And when you speak to yourself, your confidence grows quietly inside you. You start hearing your own English voice.",
        "textdich": ""
    },
    {
        "start": 4258.239,
        "end": 4273.28,
        "text": "You start trusting it. You can begin right now. Say what you're doing in English. I am watching a video. I am learning English. I am sitting in my",
        "textdich": ""
    },
    {
        "start": 4269.92,
        "end": 4279.28,
        "text": "room. Simple sentences. But every time you say them, your brain gets stronger.",
        "textdich": ""
    },
    {
        "start": 4276.64,
        "end": 4285.84,
        "text": "You are not just repeating words. You are training your mind to think and speak at the same time.",
        "textdich": ""
    },
    {
        "start": 4283.92,
        "end": 4291.28,
        "text": "You are building the habit of thinking in English naturally.",
        "textdich": ""
    },
    {
        "start": 4288.64,
        "end": 4303.12,
        "text": "When I first started learning, I felt shy to speak in front of others. My words came slowly. My sentences were broken. I was afraid people would laugh.",
        "textdich": ""
    },
    {
        "start": 4300.719,
        "end": 4308.719,
        "text": "But then I learned this secret. I started talking to myself every day.",
        "textdich": ""
    },
    {
        "start": 4306.08,
        "end": 4322.239,
        "text": "While walking, while eating, while cleaning, while reading, I described my world in English. At first, it felt strange. But soon, something amazing",
        "textdich": ""
    },
    {
        "start": 4319.199,
        "end": 4327.04,
        "text": "happened. My brain began to think in English automatically.",
        "textdich": ""
    },
    {
        "start": 4324.239,
        "end": 4333.92,
        "text": "Words came without effort. I didn't have to translate. I didn't have to prepare.",
        "textdich": ""
    },
    {
        "start": 4330.32,
        "end": 4335.92,
        "text": "It just happened. You can do the same.",
        "textdich": ""
    },
    {
        "start": 4333.92,
        "end": 4338.4,
        "text": "Start small.",
        "textdich": ""
    },
    {
        "start": 4335.92,
        "end": 4342.88,
        "text": "In the morning, say your plans in English.",
        "textdich": ""
    },
    {
        "start": 4340.08,
        "end": 4353.04,
        "text": "Today, I will go to work. I will call my friend. I will study English. At night, talk about your day. I cooked dinner. I",
        "textdich": ""
    },
    {
        "start": 4349.76,
        "end": 4356.239,
        "text": "watched a movie. I learned a new word.",
        "textdich": ""
    },
    {
        "start": 4353.04,
        "end": 4359.84,
        "text": "These little talks create big changes.",
        "textdich": ""
    },
    {
        "start": 4356.239,
        "end": 4362.8,
        "text": "They help your brain live in English.",
        "textdich": ""
    },
    {
        "start": 4359.84,
        "end": 4375.679,
        "text": "Don't worry about mistakes. Don't try to sound perfect. The goal is not perfection. The goal is flow. The more you talk, the more natural you become.",
        "textdich": ""
    },
    {
        "start": 4372.64,
        "end": 4384.4,
        "text": "Even native speakers make mistakes. But they keep talking. So should you. Every time you speak to yourself, your tongue",
        "textdich": ""
    },
    {
        "start": 4381.76,
        "end": 4393.76,
        "text": "gets more comfortable. Your mouth learns the rhythm of English. Your brain starts believing that you can speak fluently.",
        "textdich": ""
    },
    {
        "start": 4391.199,
        "end": 4397.6,
        "text": "This is not just practice. It's transformation.",
        "textdich": ""
    },
    {
        "start": 4395.44,
        "end": 4411.04,
        "text": "You will start to feel that English is becoming part of you. You will begin to express your emotions, not just sentences. When you're happy, say it, I",
        "textdich": ""
    },
    {
        "start": 4407.12,
        "end": 4419.44,
        "text": "feel great. When you're tired, say it, I need rest. When you're grateful, say it, I am thankful.",
        "textdich": ""
    },
    {
        "start": 4416.88,
        "end": 4430.0,
        "text": "These are not just words. They are feelings in English. And the more you express them, the deeper your connection becomes with the language.",
        "textdich": ""
    },
    {
        "start": 4427.6,
        "end": 4434.4,
        "text": "There will be days when you feel lazy or unmotivated.",
        "textdich": ""
    },
    {
        "start": 4431.679,
        "end": 4443.28,
        "text": "Talk to yourself even then. Tell yourself, I can do this. I am getting better. I am learning every day.",
        "textdich": ""
    },
    {
        "start": 4441.04,
        "end": 4452.88,
        "text": "This self-t talk keeps your motivation alive. It reminds you that you are not waiting for confidence. You are building",
        "textdich": ""
    },
    {
        "start": 4448.88,
        "end": 4458.8,
        "text": "it. So make it your daily habit. Talk to yourself in English every single day.",
        "textdich": ""
    },
    {
        "start": 4455.92,
        "end": 4470.32,
        "text": "Morning, afternoon, evening, while walking, cooking or thinking. Make English your inner voice. Because when your inner voice speaks English, your",
        "textdich": ""
    },
    {
        "start": 4467.36,
        "end": 4472.239,
        "text": "outer voice will follow.",
        "textdich": ""
    },
    {
        "start": 4470.32,
        "end": 4484.159,
        "text": "You don't need a perfect partner to practice. You just need courage. You just need you. Every sentence you speak to yourself brings you one step closer",
        "textdich": ""
    },
    {
        "start": 4481.6,
        "end": 4486.96,
        "text": "to fluency.",
        "textdich": ""
    },
    {
        "start": 4484.159,
        "end": 4496.8,
        "text": "Remember this. The person who talks to themselves in English today will speak to the world in English tomorrow. So",
        "textdich": ""
    },
    {
        "start": 4492.8,
        "end": 4499.84,
        "text": "start now. Look around. Open your mouth.",
        "textdich": ""
    },
    {
        "start": 4496.8,
        "end": 4502.159,
        "text": "Let your thoughts flow in English.",
        "textdich": ""
    },
    {
        "start": 4499.84,
        "end": 4509.04,
        "text": "That's how you truly begin to think and speak like a fluent English speaker.",
        "textdich": ""
    },
    {
        "start": 4506.96,
        "end": 4511.92,
        "text": "Chapter 5.",
        "textdich": ""
    },
    {
        "start": 4509.04,
        "end": 4514.4,
        "text": "Listen like you think.",
        "textdich": ""
    },
    {
        "start": 4511.92,
        "end": 4525.44,
        "text": "If you want to think in English, you must first learn to listen like you think. Listening is not just hearing sounds. It is about feeling the rhythm,",
        "textdich": ""
    },
    {
        "start": 4522.719,
        "end": 4534.239,
        "text": "the emotion, and the meaning behind the words. Every great speaker was once a great listener. The more you listen, the",
        "textdich": ""
    },
    {
        "start": 4532.159,
        "end": 4544.32,
        "text": "more your brain starts to understand English without effort. You stop translating. You start feeling. That is when English becomes part of your",
        "textdich": ""
    },
    {
        "start": 4542.4,
        "end": 4546.159,
        "text": "thinking.",
        "textdich": ""
    },
    {
        "start": 4544.32,
        "end": 4556.239,
        "text": "Think about how you learned your first language. You listened for months before speaking. You listened to voices, tone,",
        "textdich": ""
    },
    {
        "start": 4553.12,
        "end": 4568.32,
        "text": "laughter, and emotion. You didn't understand every word, but your brain was working silently. It was learning patterns. It was building understanding.",
        "textdich": ""
    },
    {
        "start": 4565.28,
        "end": 4575.92,
        "text": "English works the same way. The more you listen, the faster your brain learns to think in it.",
        "textdich": ""
    },
    {
        "start": 4573.04,
        "end": 4581.6,
        "text": "So many learners make this mistake. They try to speak without listening enough.",
        "textdich": ""
    },
    {
        "start": 4578.64,
        "end": 4590.08,
        "text": "They want to talk fast, but they forget that fluency begins with the ear, not the tongue. Your mouth can only say what",
        "textdich": ""
    },
    {
        "start": 4587.28,
        "end": 4600.64,
        "text": "your ears understand. That is why listening is the key. When you listen daily, your brain starts recognizing sounds automatically.",
        "textdich": ""
    },
    {
        "start": 4597.92,
        "end": 4612.64,
        "text": "Words that once felt hard suddenly become familiar. You start thinking in English naturally because your brain is full of English sounds and feelings.",
        "textdich": ""
    },
    {
        "start": 4610.08,
        "end": 4614.4,
        "text": "Start with simple English.",
        "textdich": ""
    },
    {
        "start": 4612.64,
        "end": 4624.159,
        "text": "Don't worry if you don't understand every word. Understanding comes with time. What matters is exposure.",
        "textdich": ""
    },
    {
        "start": 4620.8,
        "end": 4630.88,
        "text": "Listen every day. Listen while walking, cooking, traveling, or relaxing.",
        "textdich": ""
    },
    {
        "start": 4627.76,
        "end": 4641.679,
        "text": "Make English your background sound. Let your brain swim in it. Even if you are not focusing, your mind is still learning. Slowly, it begins to connect",
        "textdich": ""
    },
    {
        "start": 4639.12,
        "end": 4647.6,
        "text": "sounds with meanings, just like it did when you were a child.",
        "textdich": ""
    },
    {
        "start": 4644.239,
        "end": 4656.64,
        "text": "When you listen, don't translate. Just imagine the scene. If someone says, \"The sun is rising, see it in your mind. Feel",
        "textdich": ""
    },
    {
        "start": 4654.239,
        "end": 4666.56,
        "text": "the light.\" That is how your brain learns faster. Listening becomes thinking. Thinking becomes speaking.",
        "textdich": ""
    },
    {
        "start": 4663.6,
        "end": 4673.6,
        "text": "That is the natural process. You don't need to memorize. You need to feel.",
        "textdich": ""
    },
    {
        "start": 4670.88,
        "end": 4675.199,
        "text": "There will be moments when you get lost.",
        "textdich": ""
    },
    {
        "start": 4673.6,
        "end": 4680.88,
        "text": "You will hear something and not understand.",
        "textdich": ""
    },
    {
        "start": 4676.719,
        "end": 4683.6,
        "text": "Don't stop. Don't panic. Keep listening.",
        "textdich": ""
    },
    {
        "start": 4680.88,
        "end": 4699.28,
        "text": "Even if you catch one word out of 10, that's progress. One day you will catch two words, then five, then the whole sentence. That is how real growth",
        "textdich": ""
    },
    {
        "start": 4693.36,
        "end": 4702.64,
        "text": "happens. Quietly, slowly but surely.",
        "textdich": ""
    },
    {
        "start": 4699.28,
        "end": 4715.52,
        "text": "Find voices that inspire you. Listen to stories, motivational talks, or conversations in simple English. Repeat what you hear. Copy the tone. Copy the",
        "textdich": ""
    },
    {
        "start": 4712.32,
        "end": 4717.679,
        "text": "emotion. Shadow the speaker.",
        "textdich": ""
    },
    {
        "start": 4715.52,
        "end": 4726.88,
        "text": "This is how you train your ears and your mouth together. The more you repeat, the more fluent you become. You start to",
        "textdich": ""
    },
    {
        "start": 4723.6,
        "end": 4729.84,
        "text": "speak like the people you listen to.",
        "textdich": ""
    },
    {
        "start": 4726.88,
        "end": 4739.36,
        "text": "Listening is not a study activity. It is a life habit. The best learners don't force it. They enjoy it. They listen to",
        "textdich": ""
    },
    {
        "start": 4736.0,
        "end": 4748.8,
        "text": "English songs, watch short videos, or talk to themselves after hearing something new. They don't worry about being perfect. They focus on being",
        "textdich": ""
    },
    {
        "start": 4746.88,
        "end": 4751.199,
        "text": "connected.",
        "textdich": ""
    },
    {
        "start": 4748.8,
        "end": 4761.44,
        "text": "When you listen every day, something magical happens. One morning, you will hear a sentence and understand it instantly without thinking. That's when",
        "textdich": ""
    },
    {
        "start": 4758.96,
        "end": 4768.239,
        "text": "you'll smile and realize, \"I just thought in English.\" That moment will stay with you forever.",
        "textdich": ""
    },
    {
        "start": 4766.4,
        "end": 4774.64,
        "text": "It will prove that your brain has changed. You no longer need translation.",
        "textdich": ""
    },
    {
        "start": 4771.92,
        "end": 4778.08,
        "text": "You just understand.",
        "textdich": ""
    },
    {
        "start": 4774.64,
        "end": 4787.84,
        "text": "So make this your new rule. Listen with your heart, not with fear. Let English sounds become music to your ears. Feel",
        "textdich": ""
    },
    {
        "start": 4784.56,
        "end": 4795.84,
        "text": "them, repeat them, live them. Because when you listen like you think, you don't just hear English. You become part",
        "textdich": ""
    },
    {
        "start": 4792.88,
        "end": 4805.679,
        "text": "of it. And from that moment, thinking and speaking in English will never feel difficult again.",
        "textdich": ""
    },
    {
        "start": 4800.88,
        "end": 4808.4,
        "text": "Chapter 6. Speak before you're ready.",
        "textdich": ""
    },
    {
        "start": 4805.679,
        "end": 4819.44,
        "text": "Most learners wait. They wait for the perfect day, the perfect moment, the perfect confidence. They tell themselves, \"I'll speak when I'm ready.\"",
        "textdich": ""
    },
    {
        "start": 4816.719,
        "end": 4832.4,
        "text": "But that day never comes. Because fluency is not waiting for you. It is waiting inside you. You become ready the moment you start speaking, not before.",
        "textdich": ""
    },
    {
        "start": 4829.679,
        "end": 4835.12,
        "text": "Think about how children learn to speak.",
        "textdich": ""
    },
    {
        "start": 4832.4,
        "end": 4843.76,
        "text": "They don't wait to become perfect. They just start. They speak wrong words. They make funny sentences. They say things",
        "textdich": ""
    },
    {
        "start": 4841.04,
        "end": 4856.8,
        "text": "that make no sense. But they keep talking. And because they talk, they learn. They improve. They grow. That is the secret that most adults forget. You",
        "textdich": ""
    },
    {
        "start": 4853.679,
        "end": 4861.12,
        "text": "do not need to be perfect to begin. You just need to begin.",
        "textdich": ""
    },
    {
        "start": 4859.36,
        "end": 4866.96,
        "text": "When you open your mouth to speak English, something powerful happens.",
        "textdich": ""
    },
    {
        "start": 4864.4,
        "end": 4873.28,
        "text": "Your brain wakes up. It starts connecting ideas, sounds, and memories.",
        "textdich": ""
    },
    {
        "start": 4871.12,
        "end": 4880.159,
        "text": "You train your tongue to move in new ways. You train your confidence to rise.",
        "textdich": ""
    },
    {
        "start": 4877.44,
        "end": 4885.84,
        "text": "Every single word you speak, no matter how small, is a step toward fluency.",
        "textdich": ""
    },
    {
        "start": 4883.84,
        "end": 4895.199,
        "text": "Every mistake is proof that you are trying. And every try brings you closer to the speaker you want to become.",
        "textdich": ""
    },
    {
        "start": 4892.08,
        "end": 4897.92,
        "text": "The biggest enemy of fluency is fear.",
        "textdich": ""
    },
    {
        "start": 4895.199,
        "end": 4908.56,
        "text": "Fear of being wrong. Fear of being judged. Fear of sounding silly. But remember this truth. The people who laugh at your English can never teach",
        "textdich": ""
    },
    {
        "start": 4906.08,
        "end": 4917.92,
        "text": "you. And the people who respect your effort will never laugh at you. You are brave for trying. You are stronger than",
        "textdich": ""
    },
    {
        "start": 4914.56,
        "end": 4924.08,
        "text": "your fear. Every time you speak, you show courage. You show growth.",
        "textdich": ""
    },
    {
        "start": 4921.52,
        "end": 4933.52,
        "text": "When I started learning English, I was afraid too. I wanted my sentences to sound perfect. I used to stay silent,",
        "textdich": ""
    },
    {
        "start": 4930.639,
        "end": 4942.32,
        "text": "waiting for the right words to come. But they never came. Because English doesn't live in silence, it lives in speaking.",
        "textdich": ""
    },
    {
        "start": 4939.76,
        "end": 4953.84,
        "text": "The moment I started talking, even with mistakes, something changed. My fear began to fade. My fluency started to",
        "textdich": ""
    },
    {
        "start": 4948.639,
        "end": 4957.52,
        "text": "grow. It was not magic. It was practice.",
        "textdich": ""
    },
    {
        "start": 4953.84,
        "end": 4968.56,
        "text": "So speak today. Speak now. Even if your sentences are short, even if your grammar is not perfect, say what you can. Use the words you know. The more",
        "textdich": ""
    },
    {
        "start": 4966.0,
        "end": 4980.0,
        "text": "you speak, the more new words will come naturally. You don't learn to swim by reading about water. You learn by jumping in. Speaking is the same. You",
        "textdich": ""
    },
    {
        "start": 4977.44,
        "end": 4989.76,
        "text": "can study English for years, but until you speak, you are only standing at the edge of the pool. Jump in, make a splash.",
        "textdich": ""
    },
    {
        "start": 4987.28,
        "end": 4992.96,
        "text": "That's how you learn.",
        "textdich": ""
    },
    {
        "start": 4989.76,
        "end": 4996.639,
        "text": "Talk to your mirror. Talk to your phone.",
        "textdich": ""
    },
    {
        "start": 4992.96,
        "end": 5007.44,
        "text": "Talk to the world. Use your voice. Feel your confidence grow. When you hear yourself speak, you begin to believe that you can. And that belief is the",
        "textdich": ""
    },
    {
        "start": 5004.719,
        "end": 5009.12,
        "text": "first step to true fluency.",
        "textdich": ""
    },
    {
        "start": 5007.44,
        "end": 5017.76,
        "text": "Don't wait for someone to give you permission. Give it to yourself. You deserve to speak.",
        "textdich": ""
    },
    {
        "start": 5015.04,
        "end": 5027.36,
        "text": "There is no perfect time. There is only now. Right now, you can say one sentence in English. That one sentence can change",
        "textdich": ""
    },
    {
        "start": 5024.88,
        "end": 5038.32,
        "text": "everything. Because speaking is not about being ready. It is about being brave. You can make a thousand mistakes and still improve. But if you stay",
        "textdich": ""
    },
    {
        "start": 5035.12,
        "end": 5041.12,
        "text": "silent, nothing changes.",
        "textdich": ""
    },
    {
        "start": 5038.32,
        "end": 5046.719,
        "text": "So take this as your challenge. Speak something today. Speak to yourself.",
        "textdich": ""
    },
    {
        "start": 5044.4,
        "end": 5057.679,
        "text": "Speak to your friend. Speak to your camera. Just speak. Your English doesn't have to be beautiful. Your effort already is.",
        "textdich": ""
    },
    {
        "start": 5055.12,
        "end": 5064.239,
        "text": "Remember this always. The more you speak, the more your mind thinks in English.",
        "textdich": ""
    },
    {
        "start": 5061.679,
        "end": 5071.36,
        "text": "The more you think, the easier it becomes to speak again. It's a beautiful circle, a neverending improvement.",
        "textdich": ""
    },
    {
        "start": 5070.413,
        "end": 5084.32,
        "text": "[music] So don't wait another day. Your voice is ready now. Use it. Trust it. Let it grow. Because the day you stop waiting",
        "textdich": ""
    },
    {
        "start": 5081.199,
        "end": 5091.92,
        "text": "to be perfect is the day you finally start becoming fluent.",
        "textdich": ""
    },
    {
        "start": 5087.12,
        "end": 5094.719,
        "text": "Chapter 7. Make English your daily mind.",
        "textdich": ""
    },
    {
        "start": 5091.92,
        "end": 5096.719,
        "text": "This is the moment everything connects.",
        "textdich": ""
    },
    {
        "start": 5094.719,
        "end": 5105.04,
        "text": "You have learned how to listen, how to speak, and how to think. Now it is time to live in English because English is",
        "textdich": ""
    },
    {
        "start": 5102.4,
        "end": 5114.0,
        "text": "not something you study once a week. It is something you carry with you every single day. The secret to fluency is not",
        "textdich": ""
    },
    {
        "start": 5111.28,
        "end": 5118.0,
        "text": "studying more. It is living more in the language you love.",
        "textdich": ""
    },
    {
        "start": 5116.263,
        "end": 5128.56,
        "text": "[music] When you make English part of your daily mind, it stops feeling like a task. It becomes natural. It becomes who",
        "textdich": ""
    },
    {
        "start": 5124.719,
        "end": 5137.12,
        "text": "you are. Every small moment in your day becomes a chance to grow. When you wake up, say good morning to yourself. When",
        "textdich": ""
    },
    {
        "start": 5134.56,
        "end": 5147.36,
        "text": "you cook, describe what you're doing in English. When you walk outside, notice things and name them. The sky is clear.",
        "textdich": ""
    },
    {
        "start": 5144.4,
        "end": 5159.679,
        "text": "The air feels fresh. I see children playing. These small sentences build your inner world in English. You don't need hours. You just need moments. One",
        "textdich": ""
    },
    {
        "start": 5157.36,
        "end": 5168.48,
        "text": "minute of thinking in English is more powerful than 1 hour of reading without feeling. Let English live inside your",
        "textdich": ""
    },
    {
        "start": 5165.199,
        "end": 5170.96,
        "text": "thoughts. Let it become your friend.",
        "textdich": ""
    },
    {
        "start": 5168.48,
        "end": 5181.12,
        "text": "When you think of something funny, think it in English. When you feel something deep, describe it in English. The more you connect your feelings to the",
        "textdich": ""
    },
    {
        "start": 5178.48,
        "end": 5185.199,
        "text": "language, the faster your mind becomes fluent.",
        "textdich": ""
    },
    {
        "start": 5182.88,
        "end": 5190.4,
        "text": "Every day you have thousands of thoughts. Use some of them in English.",
        "textdich": ""
    },
    {
        "start": 5188.4,
        "end": 5201.199,
        "text": "It doesn't matter if they are short or simple. What matters is that they are real. Say I am hungry. Say I feel happy",
        "textdich": ""
    },
    {
        "start": 5197.52,
        "end": 5204.239,
        "text": "today. Say I can do better tomorrow.",
        "textdich": ""
    },
    {
        "start": 5201.199,
        "end": 5215.6,
        "text": "These sentences may look small but they carry power. They connect your brain and your emotions in English. That is how true fluency is born.",
        "textdich": ""
    },
    {
        "start": 5212.56,
        "end": 5218.239,
        "text": "Make your environment speak English too.",
        "textdich": ""
    },
    {
        "start": 5215.6,
        "end": 5224.8,
        "text": "Change your phone settings. Watch short English videos. Listen to English songs.",
        "textdich": ""
    },
    {
        "start": 5222.0,
        "end": 5236.32,
        "text": "Read small quotes or stories. The more you see and hear the language, the more your brain accepts it as normal. And when English feels normal, speaking",
        "textdich": ""
    },
    {
        "start": 5232.719,
        "end": 5239.405,
        "text": "becomes easy. Thinking becomes natural.",
        "textdich": ""
    },
    {
        "start": 5236.32,
        "end": 5241.12,
        "text": "It becomes part of your daily rhythm.",
        "textdich": ""
    },
    {
        "start": 5239.405,
        "end": 5247.28,
        "text": "[music] There will be days when you don't feel motivated. That is okay.",
        "textdich": ""
    },
    {
        "start": 5244.32,
        "end": 5257.44,
        "text": "Fluency is not built in one day. It grows slowly just like a tree. Some days you will feel strong. Some days you will",
        "textdich": ""
    },
    {
        "start": 5253.84,
        "end": 5266.32,
        "text": "feel tired. But even on those days think a little in English. One sentence is enough. That one sentence keeps your",
        "textdich": ""
    },
    {
        "start": 5263.04,
        "end": 5274.719,
        "text": "progress alive. [music] You are not just learning English. You are building a new identity. A person who thinks in another",
        "textdich": ""
    },
    {
        "start": 5271.76,
        "end": 5282.56,
        "text": "language who can express feelings, dreams and ideas in new words. That is something beautiful.",
        "textdich": ""
    },
    {
        "start": 5280.0,
        "end": 5291.151,
        "text": "That is something powerful. Never underestimate it. You are not just learning grammar or vocabulary. You are learning to see the world from a new",
        "textdich": ""
    },
    {
        "start": 5289.52,
        "end": 5293.44,
        "text": "window.",
        "textdich": ""
    },
    {
        "start": 5291.151,
        "end": 5301.6,
        "text": "[music] When you live in English daily, it starts to live in you. You will begin to dream in it. You will catch yourself",
        "textdich": ""
    },
    {
        "start": 5298.719,
        "end": 5309.92,
        "text": "thinking in it without trying. You will speak more smoothly, more confidently, more freely. That is the moment you will",
        "textdich": ""
    },
    {
        "start": 5307.52,
        "end": 5316.159,
        "text": "realize you are no longer just a learner. You are a speaker.",
        "textdich": ""
    },
    {
        "start": 5313.36,
        "end": 5327.76,
        "text": "So from today stop waiting for big changes. Make small ones. One English sentence in the morning, one in the evening, one in your thoughts before",
        "textdich": ""
    },
    {
        "start": 5324.239,
        "end": 5337.76,
        "text": "sleep. Step by step your English mind will grow stronger. [music] Remember fluency is not something you chase. It is something you become.",
        "textdich": ""
    },
    {
        "start": 5335.84,
        "end": 5348.48,
        "text": "The more you let English live in your day, the more it becomes your natural voice. [music] So go out there and live in English.",
        "textdich": ""
    },
    {
        "start": 5344.88,
        "end": 5350.48,
        "text": "Think in it, feel in it, speak in it.",
        "textdich": ""
    },
    {
        "start": 5348.48,
        "end": 5361.237,
        "text": "Because English is not just a language you learn. It is a part of who you are becoming. And when you make it your daily mind, fluency will no longer be",
        "textdich": ""
    },
    {
        "start": 5358.159,
        "end": 5362.0,
        "text": "your dream. It will be your reality.",
        "textdich": ""
    },
    {
        "start": 5361.237,
        "end": 5366.639,
        "text": "[music] Thank you for watching. Bye for now.",
        "textdich": ""
    }
]