[
    {
        "start": 0.0,
        "end": 8.559,
        "text": "Hey everyone, welcome to your REST API crash course. My name is Caleb. In this video, we're going to talk about everything you need to know to get",
        "textdich": ""
    },
    {
        "start": 6.4,
        "end": 13.92,
        "text": "started with REST APIs. We're going to first talk about the concepts, then we're going to talk about how to consume",
        "textdich": ""
    },
    {
        "start": 12.0,
        "end": 21.199,
        "text": "an API, and then we're going to build our very own API in Python. So, it's a lot of useless or it's a lot of useful",
        "textdich": ""
    },
    {
        "start": 19.199,
        "end": 27.279,
        "text": "information. So, if you need a reference of all this, I created a PDF that you guys can get for free with a link in the",
        "textdich": ""
    },
    {
        "start": 25.039,
        "end": 33.28,
        "text": "description. So go check that out if you just need to like, you know, look at the definitions and study or whatever. But",
        "textdich": ""
    },
    {
        "start": 31.439,
        "end": 40.16,
        "text": "anyways, we're going to jump in by first talking about what a REST API is, why you should care, and where this is used",
        "textdich": ""
    },
    {
        "start": 38.16,
        "end": 45.12,
        "text": "in software. And if you're watching this video and you're not really doing anything with software, not really sure",
        "textdich": ""
    },
    {
        "start": 43.36,
        "end": 56.239,
        "text": "why you're here, but you can probably move on to one of my other videos. So which all of my videos are about software. So anywh who, API stands for",
        "textdich": ""
    },
    {
        "start": 52.559,
        "end": 59.84,
        "text": "application programming interface.",
        "textdich": ""
    },
    {
        "start": 56.239,
        "end": 68.56,
        "text": "So, I tried talking and explaining this last time I recorded this and it just didn't go so well because I cannot talk",
        "textdich": ""
    },
    {
        "start": 65.84,
        "end": 71.119,
        "text": "and write very well at the same time.",
        "textdich": ""
    },
    {
        "start": 68.56,
        "end": 81.6,
        "text": "Application programming interface. It's basically a fancy way to say a way two pieces of software can communicate with one another. So, if we have this",
        "textdich": ""
    },
    {
        "start": 78.68,
        "end": 90.479,
        "text": "software over here, this is some really cool software system we built. And here is another one. And let's say these are built in different programming",
        "textdich": ""
    },
    {
        "start": 88.24,
        "end": 97.28,
        "text": "languages. That's where an API is going to come in and save the day. It allows different applications that aren't built",
        "textdich": ""
    },
    {
        "start": 94.64,
        "end": 107.04,
        "text": "exactly the same to communicate. So we'll say this one was built in Python and this one was built in JavaScript. Poor developer. I'm so",
        "textdich": ""
    },
    {
        "start": 104.24,
        "end": 116.04,
        "text": "sorry. Well, an API allows us to build functionality in this application to make a request to this other application",
        "textdich": ""
    },
    {
        "start": 113.6,
        "end": 125.52,
        "text": "and then this application can give a response back to this application. And that is where the API comes in. We're",
        "textdich": ""
    },
    {
        "start": 122.56,
        "end": 132.959,
        "text": "building this interface for these pieces of software to communicate with one another. Now, in general, it's a one-way",
        "textdich": ""
    },
    {
        "start": 129.599,
        "end": 144.0,
        "text": "thing. So this app is not going to request information from this app and get it back. Instead, it's always we have a a server and then a client. The",
        "textdich": ""
    },
    {
        "start": 141.36,
        "end": 150.319,
        "text": "client consumes information given from the server. So this is a very common setup you'll see in all of computing.",
        "textdich": ""
    },
    {
        "start": 148.16,
        "end": 159.68,
        "text": "The same way when you go to get a website, you know, you go to youtube.com, you're making a request and then that server gives back a response.",
        "textdich": ""
    },
    {
        "start": 158.0,
        "end": 171.36,
        "text": "It works exactly the same way with our REST API, although instead of getting HTML, you're going to get JSON.",
        "textdich": ""
    },
    {
        "start": 166.36,
        "end": 180.48,
        "text": "So, JSON is a language or a notation of describing information. It's just like text and it stands for JavaScript object",
        "textdich": ""
    },
    {
        "start": 177.599,
        "end": 186.879,
        "text": "notation. So, it's a way to notate what objects look like. But, it doesn't have to be done with JavaScript. It's",
        "textdich": ""
    },
    {
        "start": 185.12,
        "end": 199.76,
        "text": "actually supported in pretty much every language. And this is now the standard for APIs. You may run into APIs that use XML. However, this is kind of",
        "textdich": ""
    },
    {
        "start": 197.48,
        "end": 208.159,
        "text": "old-fashioned and probably not what you would want to use going forward. So, I would recommend even if you're more familiar with XML for some reason to",
        "textdich": ""
    },
    {
        "start": 205.12,
        "end": 210.48,
        "text": "learn JSON or JSON. You'll hear both.",
        "textdich": ""
    },
    {
        "start": 208.159,
        "end": 219.12,
        "text": "So, JSON's not complicated. Don't feel like you have to learn another programming language or something. It's just a series of key value pairs just",
        "textdich": ""
    },
    {
        "start": 216.159,
        "end": 226.799,
        "text": "like an object in JavaScript, hence the word JavaScript object notation or like a dictionary in Python where you have a",
        "textdich": ""
    },
    {
        "start": 224.239,
        "end": 237.12,
        "text": "key and then an associated value. So, it's pretty much just an associative array. We'll get into what JSON looks like and how to use it soon when we go",
        "textdich": ""
    },
    {
        "start": 234.0,
        "end": 246.879,
        "text": "build our own API, but don't worry too much about that. So JSON is basically the the language of communication and",
        "textdich": ""
    },
    {
        "start": 243.439,
        "end": 254.159,
        "text": "the API is you know what things we can communicate you know maybe you want to get a list of users or maybe you want to",
        "textdich": ""
    },
    {
        "start": 251.519,
        "end": 266.28,
        "text": "update some comments whatever you want to do that's all defined as API end points. So, you know, right here where we're making that request, that's an",
        "textdich": ""
    },
    {
        "start": 263.32,
        "end": 276.479,
        "text": "example of an end point. We're going to talk about the different types of endpoints that we can create. Now, what about this rest thing",
        "textdich": ""
    },
    {
        "start": 273.04,
        "end": 282.72,
        "text": "here? Well, that stands for um I think representational state transfer. I had to look that up a little bit ago because",
        "textdich": ""
    },
    {
        "start": 280.0,
        "end": 284.96,
        "text": "I was like represent what was it?",
        "textdich": ""
    },
    {
        "start": 282.72,
        "end": 294.16,
        "text": "Anyways, this is the means of communication. So, you know, I can talk to you in English, but how am I talking to you? Am I talking to you over the",
        "textdich": ""
    },
    {
        "start": 291.44,
        "end": 305.32,
        "text": "phone? Am I texting you? Am I talking to you face to face? Well, that is describing how we're communicating. And this REST aspect is communicating over",
        "textdich": ""
    },
    {
        "start": 303.04,
        "end": 315.759,
        "text": "the web or the internet. So, this is all going to be done by making requests similar to how you would request a website, but instead",
        "textdich": ""
    },
    {
        "start": 313.12,
        "end": 321.039,
        "text": "of HTML, you're requesting JSON. just as I mentioned earlier. So to make this a little bit more concrete, let's go over",
        "textdich": ""
    },
    {
        "start": 318.72,
        "end": 331.32,
        "text": "an example of an app I'm working on. So I have some software written in Python and this is the server software.",
        "textdich": ""
    },
    {
        "start": 327.68,
        "end": 338.4,
        "text": "You may also hear it as the backend software. And this is the software that's going to communicate with a database. That's where all of our",
        "textdich": ""
    },
    {
        "start": 336.88,
        "end": 348.16,
        "text": "information and data is going to be stored. So this talks to the database. Now, we want other pieces of software to be able to communicate to",
        "textdich": ""
    },
    {
        "start": 346.32,
        "end": 354.32,
        "text": "this back-end software, but we don't just want them to be able to access anything. We don't want to give direct",
        "textdich": ""
    },
    {
        "start": 351.759,
        "end": 365.039,
        "text": "access to this database. So, instead, we expose different API endpoints. So, an example of an API endpoint would be forward",
        "textdich": ""
    },
    {
        "start": 361.96,
        "end": 373.52,
        "text": "slash and this I haven't described what the actual app is for, but forward slashdrinks. Now, the actual app is to",
        "textdich": ""
    },
    {
        "start": 371.199,
        "end": 380.639,
        "text": "get a list of drinks and be able to rate these, you know, like zero to 10 or to put them in different categories of how good they are. And then you can",
        "textdich": ""
    },
    {
        "start": 379.12,
        "end": 389.919,
        "text": "basically keep track of all your favorite drinks. It's a little silly, but I thought it'd be a fun project. And um basically, I I like to drink I don't",
        "textdich": ""
    },
    {
        "start": 388.319,
        "end": 399.36,
        "text": "like to drink. I like to drink non-alcoholic beverages like LCroy or like stevia drinks and energy drinks or whatever, but there's so many of them I",
        "textdich": ""
    },
    {
        "start": 397.6,
        "end": 405.44,
        "text": "can't keep track of them all. So, I just wanted to build a little website to, you know, rank them, you know, and instead",
        "textdich": ""
    },
    {
        "start": 403.52,
        "end": 417.039,
        "text": "of just getting all of the drinks, you might want to get a specific drink. So, in this situation, we would pass in an ID. So, in this situation, we are",
        "textdich": ""
    },
    {
        "start": 414.56,
        "end": 424.599,
        "text": "getting data. And that's one of the different methods of APIs. We're going to talk about API methods here in a minute. But what this means is my",
        "textdich": ""
    },
    {
        "start": 422.24,
        "end": 435.08,
        "text": "software that I built over here. And in this situation, let's just say this is JavaScript. I can get all of the drinks",
        "textdich": ""
    },
    {
        "start": 432.16,
        "end": 444.0,
        "text": "or a specific drink from my backend software just by making a request to this web address. Now, you might be looking at this like, what? That doesn't",
        "textdich": ""
    },
    {
        "start": 442.16,
        "end": 451.68,
        "text": "look like a web address. Well, because this is a web server, this is going to have either an IP address or a domain",
        "textdich": ""
    },
    {
        "start": 449.039,
        "end": 461.199,
        "text": "name. So, let's say I put this up on a website, Caleb's favorite drinks.com, not a real website to the extent of my knowledge, and then forward",
        "textdich": ""
    },
    {
        "start": 461.4,
        "end": 472.56,
        "text": "slashdrinks forward slash and then you can pass in some ID such as five. Now, the actual structure for these URLs and what data you want to get that is",
        "textdich": ""
    },
    {
        "start": 470.96,
        "end": 480.24,
        "text": "totally up to you. However, there are some general standards and I will describe why I went with this coming up",
        "textdich": ""
    },
    {
        "start": 477.44,
        "end": 488.72,
        "text": "soon. But basically, we have the list of data we're trying to get from and then we pass in which specific element we",
        "textdich": ""
    },
    {
        "start": 485.199,
        "end": 496.8,
        "text": "want. And this will return JSON of all the information about that drink. Now, oftent times when you have a website, you're going to have web pages, you",
        "textdich": ""
    },
    {
        "start": 495.039,
        "end": 501.759,
        "text": "know, people can view on their web browser or you're going to have the API.",
        "textdich": ""
    },
    {
        "start": 499.44,
        "end": 508.0,
        "text": "And often these will be split out into two subset applications. So you might have calebs",
        "textdich": ""
    },
    {
        "start": 511.64,
        "end": 523.44,
        "text": "favoritedrinks.com/drinks5. Or another common thing is to have a different domain such as api.calebsfeddrinks.com. You don't have",
        "textdich": ""
    },
    {
        "start": 521.44,
        "end": 531.36,
        "text": "to. You can mix those together. However, just for organizational sake, often the API is in some separate section, either",
        "textdich": ""
    },
    {
        "start": 528.399,
        "end": 538.959,
        "text": "a subdirectory or a subdomain. Now, you might look at this setup, as I often do when I'm working on applications, and be",
        "textdich": ""
    },
    {
        "start": 536.16,
        "end": 547.519,
        "text": "like, why the complexity? Why do you need to have two applications and then the database? Why don't you just connect from this",
        "textdich": ""
    },
    {
        "start": 544.6,
        "end": 555.44,
        "text": "application all the way to the database, skipping all this junk? Well, obviously you can do that. You can do whatever you",
        "textdich": ""
    },
    {
        "start": 552.399,
        "end": 563.519,
        "text": "want but this is not always advisable for various reasons. The most biggest importantest reason of not going from",
        "textdich": ""
    },
    {
        "start": 560.8,
        "end": 572.32,
        "text": "the client application directly to the database is security specifically if you are using JavaScript. Now oftent times",
        "textdich": ""
    },
    {
        "start": 570.56,
        "end": 575.76,
        "text": "the client is going to be JavaScript because that's used for web pages.",
        "textdich": ""
    },
    {
        "start": 574.0,
        "end": 583.519,
        "text": "However, you could also make a console application or a mobile application. So, it's not always going to be JavaScript,",
        "textdich": ""
    },
    {
        "start": 580.959,
        "end": 592.56,
        "text": "but if you go to a website, you can go into the developer tools and you can see all of this JavaScript or you can rightclick and view source and it'll",
        "textdich": ""
    },
    {
        "start": 590.399,
        "end": 603.04,
        "text": "have the JavaScript files linked there and you can view all of that. So, you don't really want to put sensitive information on the client here because",
        "textdich": ""
    },
    {
        "start": 600.64,
        "end": 612.16,
        "text": "it's all viewable to the person using your software, which means they could then go to the database themselves directly, tinker around, you know, drop",
        "textdich": ""
    },
    {
        "start": 609.04,
        "end": 622.16,
        "text": "database, lol. We don't want them doing that. So instead, we just expose specific things that we want people to see, such as the list of drinks, but",
        "textdich": ""
    },
    {
        "start": 620.64,
        "end": 631.76,
        "text": "they can't go in there and see everybody's user information or people's address or any of that. Now, beyond security, the other big reason is",
        "textdich": ""
    },
    {
        "start": 629.2,
        "end": 640.88,
        "text": "versatility. So, right now, we have one front-end application in JavaScript, but with this setup, we could very easily build a mobile",
        "textdich": ""
    },
    {
        "start": 638.519,
        "end": 650.64,
        "text": "application, and yes, this is a cell phone. And we could also consume the same API. So what happens now is both of",
        "textdich": ""
    },
    {
        "start": 647.76,
        "end": 657.0,
        "text": "these front-end applications are sharing the same backend which means these are always going to have the same data.",
        "textdich": ""
    },
    {
        "start": 655.44,
        "end": 666.56,
        "text": "They're going to be synchronized. So that is how when you have applications on your phone, you can go in there and change data and then you",
        "textdich": ""
    },
    {
        "start": 664.399,
        "end": 673.04,
        "text": "can go log in on your computer and all of that stuff still exists. It's because they all share the same backend. So, you",
        "textdich": ""
    },
    {
        "start": 671.519,
        "end": 679.76,
        "text": "know, when you're messaging someone on social media, well, those messages are being sent to a back-end server that",
        "textdich": ""
    },
    {
        "start": 678.0,
        "end": 688.56,
        "text": "does all of the processing and all of the hard work of the application. And that website you're looking at is really",
        "textdich": ""
    },
    {
        "start": 684.24,
        "end": 697.839,
        "text": "just a pretty cover to this backend. So, you know, JavaScript, maybe your application here is in Swift, but ultimately we're hiding the back end of",
        "textdich": ""
    },
    {
        "start": 695.12,
        "end": 705.519,
        "text": "this application and separating those, which brings up the next good point, which is modularity. Because the front",
        "textdich": ""
    },
    {
        "start": 702.32,
        "end": 712.079,
        "text": "end and the back end are separated and we're just defining this consistent way to communicate, we can actually swap",
        "textdich": ""
    },
    {
        "start": 709.68,
        "end": 720.399,
        "text": "different things out and not necessarily break. I say necessarily because you know in practice it's it could be difficult but in theory you should be",
        "textdich": ""
    },
    {
        "start": 718.399,
        "end": 727.88,
        "text": "able to swap out different things without breaking other pieces of the application. So right now this is written in Python but I could be like eh",
        "textdich": ""
    },
    {
        "start": 726.32,
        "end": 740.68,
        "text": "I don't really feel like writing in Python you know and I decide to upgrade to something like Visual Basic and in this situation we can expose the same",
        "textdich": ""
    },
    {
        "start": 736.959,
        "end": 748.0,
        "text": "exact API endpoint. So, this website and this mobile phone app, they don't even need to know about those changes to the",
        "textdich": ""
    },
    {
        "start": 746.32,
        "end": 753.6,
        "text": "back end because they're still getting their list of drinks. That's all they care about. They just want their drinks.",
        "textdich": ""
    },
    {
        "start": 752.0,
        "end": 763.2,
        "text": "This is great because you can change the back end of software without requiring an update to the app or requiring a new",
        "textdich": ""
    },
    {
        "start": 760.24,
        "end": 770.0,
        "text": "deployment of the website as long as you're able to give a consistent interface to working with your backend.",
        "textdich": ""
    },
    {
        "start": 767.839,
        "end": 776.32,
        "text": "Last reason and then I promise I'll stop rambling. Okay, I got a little bit more rambling, but basically the last thing I",
        "textdich": ""
    },
    {
        "start": 774.639,
        "end": 785.04,
        "text": "wanted to share of why this setup is good is interoperability, which I think is a word. And basically what I'm saying here is that these front-end",
        "textdich": ""
    },
    {
        "start": 782.88,
        "end": 794.959,
        "text": "applications, they don't all have to be built by you or the front-end development team for your company. You can actually expose certain endpoints",
        "textdich": ""
    },
    {
        "start": 792.72,
        "end": 800.079,
        "text": "such as this one right here, and you could make this public.",
        "textdich": ""
    },
    {
        "start": 797.36,
        "end": 809.44,
        "text": "So if you make certain endpoints public, you don't have to worry about authentication or authorization. And in that situation, anybody could go ahead",
        "textdich": ""
    },
    {
        "start": 806.8,
        "end": 821.04,
        "text": "and create some new app, new and improved to consume your API. So you know, if I don't like the way Instagram looks, I can go create my very own",
        "textdich": ""
    },
    {
        "start": 818.32,
        "end": 827.44,
        "text": "Instagram viewer because they have an API that can be consumed. Now, sometimes you'll still need to get some kind of",
        "textdich": ""
    },
    {
        "start": 825.36,
        "end": 835.519,
        "text": "token or some way to authorize saying, \"Hey, I'm okay to use this API.\" But a lot of the times these APIs are going to",
        "textdich": ""
    },
    {
        "start": 832.8,
        "end": 842.959,
        "text": "be publicly available. So, the API we're going to consume soon is just a public API that anybody can use and it's really",
        "textdich": ""
    },
    {
        "start": 840.72,
        "end": 851.76,
        "text": "cool honestly. So, many websites you might not even realize have APIs. So, for example, if you wanted to do something like create a trading bot or",
        "textdich": ""
    },
    {
        "start": 849.36,
        "end": 859.519,
        "text": "like a cryptocurrency trading bot, well, oftent times different exchanges are going to have APIs so you can automate",
        "textdich": ""
    },
    {
        "start": 856.959,
        "end": 866.24,
        "text": "different things in code. So, it's not always just about making a pretty interface, but it might be about automation. How can we connect these",
        "textdich": ""
    },
    {
        "start": 864.959,
        "end": 875.76,
        "text": "apps and make things happen automatically? So, if the thing's not public, it might be private, but you can still access it. You just need a way to",
        "textdich": ""
    },
    {
        "start": 873.519,
        "end": 883.279,
        "text": "verify that it's you and not just anybody's going on there and trading cryptocurrencies or spending your money.",
        "textdich": ""
    },
    {
        "start": 880.72,
        "end": 889.519,
        "text": "So there the authorization aspect of this is like a whole another beast. But a common thing you often see is OOTH 2.",
        "textdich": ""
    },
    {
        "start": 887.839,
        "end": 896.399,
        "text": "That is an authentication technique that's fairly common. So if you want to look into how to protect your API and",
        "textdich": ""
    },
    {
        "start": 894.32,
        "end": 906.88,
        "text": "make you basically have to log in, you can look into OOTH. That's o a u t h2. Now I want to take a moment to talk about the different methods of",
        "textdich": ""
    },
    {
        "start": 904.48,
        "end": 916.279,
        "text": "requesting data from the server. So we've talked about get and this one's pretty simple. It's what's used to retrieve data from the server. And these",
        "textdich": ""
    },
    {
        "start": 913.36,
        "end": 926.0,
        "text": "are often written in all uppercase letters. So you're just like screaming like get me this information. All right.",
        "textdich": ""
    },
    {
        "start": 921.36,
        "end": 929.04,
        "text": "So get is used to retrieve data.",
        "textdich": ""
    },
    {
        "start": 926.0,
        "end": 940.0,
        "text": "I could just say get data but fancy here. All right, so there's a few other ones you should know about and that is post. Post is used to write data. So",
        "textdich": ""
    },
    {
        "start": 938.16,
        "end": 946.0,
        "text": "anytime you want to write information to the server, you're going to use post.",
        "textdich": ""
    },
    {
        "start": 942.959,
        "end": 955.6,
        "text": "And then there is delete. Almost didn't use capitals there, but I fixed it. And this is used to, you know, delete stuff. Now there is another one",
        "textdich": ""
    },
    {
        "start": 954.079,
        "end": 966.16,
        "text": "that's pretty common. Why do I always write like this way? I don't know. And that is put. And this is actually fairly confusing if you're new. And the",
        "textdich": ""
    },
    {
        "start": 964.0,
        "end": 974.48,
        "text": "difference between post and put is pretty gray. And people will even argue about which you should use where. Here's",
        "textdich": ""
    },
    {
        "start": 970.72,
        "end": 983.44,
        "text": "my opinion. Post should be used to write new data. Put should be used to write but in this situation, we're going to update data.",
        "textdich": ""
    },
    {
        "start": 982.16,
        "end": 992.16,
        "text": "So now I want to show you how these things correlate to the most popular things you have to do with the database which is CRUD. So the different things",
        "textdich": ""
    },
    {
        "start": 990.48,
        "end": 1004.8,
        "text": "you need to do, we need to be able to create data, post, read data, get, update data, put, and delete data, delete. Now, why exactly is there",
        "textdich": ""
    },
    {
        "start": 1002.399,
        "end": 1010.88,
        "text": "confusion between post and put? That's what I want to talk about now. Well, first let's talk about how post and put",
        "textdich": ""
    },
    {
        "start": 1008.16,
        "end": 1019.199,
        "text": "are generally used. Post is used to add a resource. Put is used to replace a resource. And that's why it's natural in",
        "textdich": ""
    },
    {
        "start": 1016.399,
        "end": 1025.919,
        "text": "my mind to say you can use put to update data and post to add new data. But replacing a resource requires some way",
        "textdich": ""
    },
    {
        "start": 1023.839,
        "end": 1037.6,
        "text": "to identify it. And often this is done with an ID. So my thoughts are if you're doing a post request, you want to add data. So you might have the",
        "textdich": ""
    },
    {
        "start": 1034.439,
        "end": 1044.48,
        "text": "address of drinks and you want to add a new drink. With put, you're probably going to need to identify what resource",
        "textdich": ""
    },
    {
        "start": 1042.24,
        "end": 1054.96,
        "text": "you want to replace. So it might look like drinks slash 6005 for an ID. Now, with the setup I tend to do, I usually",
        "textdich": ""
    },
    {
        "start": 1052.48,
        "end": 1062.4,
        "text": "don't have this ID value until that's that data is already inserted in the database with a post. So when you're adding new data, you don't know what",
        "textdich": ""
    },
    {
        "start": 1060.48,
        "end": 1071.6,
        "text": "that ID is going to be because that's auto incremented in the database. Then if you want to update that data, then you use the ID. But there's another",
        "textdich": ""
    },
    {
        "start": 1069.84,
        "end": 1078.4,
        "text": "difference and this is more defined in the spec of how an API is supposed to work and less about pure functionality",
        "textdich": ""
    },
    {
        "start": 1076.799,
        "end": 1085.12,
        "text": "because you're the one who defines the functionality. So if you want your API to work correctly then you need to make",
        "textdich": ""
    },
    {
        "start": 1082.88,
        "end": 1098.559,
        "text": "sure you implement it in this way and that is put is designed to give the same result every time if you make the same request. So for example if you're",
        "textdich": ""
    },
    {
        "start": 1095.12,
        "end": 1106.96,
        "text": "replacing this drink with a new drink you can replace this ID over and over again as long as that new one has the",
        "textdich": ""
    },
    {
        "start": 1104.0,
        "end": 1117.2,
        "text": "same exact ID. So, let's say you have a grape drink and you replace it with cola and then you replace cola again with",
        "textdich": ""
    },
    {
        "start": 1113.6,
        "end": 1124.48,
        "text": "cola and then cola again with cola. No matter how many times you do this, the same resource exists and it doesn't hurt",
        "textdich": ""
    },
    {
        "start": 1122.4,
        "end": 1130.72,
        "text": "if you accidentally put that request numerous times. Post is usually a little bit different because that feature or",
        "textdich": ""
    },
    {
        "start": 1128.559,
        "end": 1139.76,
        "text": "capability is not guaranteed. So, what that means is if you add a new drink, let's say you add cola and then you add cola again. Well, in",
        "textdich": ""
    },
    {
        "start": 1138.24,
        "end": 1148.559,
        "text": "this situation, you're not replacing anything. So each time you add cola, it's making a new record in that table.",
        "textdich": ""
    },
    {
        "start": 1144.72,
        "end": 1154.799,
        "text": "So put is guaranteed to be able to be executed numerous times without any kind of side effects. Post on the other hand",
        "textdich": ""
    },
    {
        "start": 1152.72,
        "end": 1162.24,
        "text": "is not guaranteed by the spec. And in that situation, you could actually have duplicate records in the database or you",
        "textdich": ""
    },
    {
        "start": 1159.2,
        "end": 1165.44,
        "text": "could get an error on that second one if the drink name is defined to be unique.",
        "textdich": ""
    },
    {
        "start": 1164.32,
        "end": 1175.4,
        "text": "Now, I'm probably going to mess this word up, but there's a word to describe this. Iden potent. It Yeah, I it potent. I don't",
        "textdich": ""
    },
    {
        "start": 1172.16,
        "end": 1180.16,
        "text": "know. So, put is said to be this. I'm not even going to try anymore.",
        "textdich": ""
    },
    {
        "start": 1177.84,
        "end": 1188.48,
        "text": "Just whatever that's called. Now, in general, I think there's a lot of confusion between post and put. And you can pretty much do the same behaviors",
        "textdich": ""
    },
    {
        "start": 1186.24,
        "end": 1195.039,
        "text": "with either one. So, I tend to just try to stick with post most of the time.",
        "textdich": ""
    },
    {
        "start": 1192.08,
        "end": 1200.799,
        "text": "Even if I'm updating a resource, it you can do it with post just the same. You can define it however you want. It's",
        "textdich": ""
    },
    {
        "start": 1198.88,
        "end": 1208.0,
        "text": "sort of how with modern HTML, you can make a section be a div or you can be a little bit more specific and say, \"Oh,",
        "textdich": ""
    },
    {
        "start": 1205.12,
        "end": 1213.52,
        "text": "this is a footer.\" Both kind of give the same results. And if you're not using footer, right, then you might just make",
        "textdich": ""
    },
    {
        "start": 1211.679,
        "end": 1220.559,
        "text": "things worse. So, a lot of people still end up just using divs. So if you're using HTML, that's just maybe that kind",
        "textdich": ""
    },
    {
        "start": 1218.48,
        "end": 1222.32,
        "text": "of puts it in perspective. I don't know.",
        "textdich": ""
    },
    {
        "start": 1220.559,
        "end": 1229.919,
        "text": "There's another method, patch, which is used to replace different pieces of a resource. So maybe you just want to update one field. However, in our",
        "textdich": ""
    },
    {
        "start": 1228.08,
        "end": 1237.6,
        "text": "situation, the data we're working with is so small that it's pretty much just easier to replace it with a new version.",
        "textdich": ""
    },
    {
        "start": 1236.0,
        "end": 1244.159,
        "text": "So that way you don't have to keep track of individual changes. However, if you're working with very large data, you",
        "textdich": ""
    },
    {
        "start": 1241.679,
        "end": 1253.919,
        "text": "can definitely look into patch. So my theory is you basically keep the state of an object in the client side application and then once you save you",
        "textdich": ""
    },
    {
        "start": 1252.0,
        "end": 1260.24,
        "text": "just send that new state and replace the old state in the database. Hopefully that makes sense. All right. So let's",
        "textdich": ""
    },
    {
        "start": 1258.159,
        "end": 1268.32,
        "text": "get some practice with APIs by consuming an existing API. We're going to take a look at Stack Overflow. So all of the",
        "textdich": ""
    },
    {
        "start": 1266.08,
        "end": 1276.08,
        "text": "questions on here, you can get access to this information through an API. So we can build an application to work with",
        "textdich": ""
    },
    {
        "start": 1273.2,
        "end": 1286.4,
        "text": "Stack Overflow. So to do this, you actually go to api.stackchange.com and in here you can see the documentation for all of this.",
        "textdich": ""
    },
    {
        "start": 1283.36,
        "end": 1289.0,
        "text": "So here's the different API endpoints.",
        "textdich": ""
    },
    {
        "start": 1286.4,
        "end": 1295.2,
        "text": "So we can get the answers, badges, comments, posts, which is just a uh combination of questions and answers.",
        "textdich": ""
    },
    {
        "start": 1294.0,
        "end": 1304.4,
        "text": "And I'm going to take a look at the questions here. So we're going to get all of the questions. And here is an example of how you would invoke this. So",
        "textdich": ""
    },
    {
        "start": 1301.28,
        "end": 1312.159,
        "text": "you can hit run and you can see in this web address there's this question mark and then some variables with assigned",
        "textdich": ""
    },
    {
        "start": 1308.64,
        "end": 1321.36,
        "text": "values and then an and sign amperand and sort. These are known as query parameters and they can be used in this situation to modify the results of the",
        "textdich": ""
    },
    {
        "start": 1319.679,
        "end": 1331.36,
        "text": "API. Now, if you want to know how to actually invoke this without it running it in this little test window, you basically just take this address here",
        "textdich": ""
    },
    {
        "start": 1328.159,
        "end": 1340.88,
        "text": "and you would paste it after api.stack exchange.com uh like so. So, that's what it's going to look like. Hitting enter, you get a",
        "textdich": ""
    },
    {
        "start": 1338.159,
        "end": 1351.2,
        "text": "bunch of data here. Not exactly as pretty as this, which by the way, this is JSON format. So, it's just key value pairs. And in the pairs you can have",
        "textdich": ""
    },
    {
        "start": 1349.2,
        "end": 1358.32,
        "text": "arrays or uh you could consider them lists if you're more familiar with Python. So we have items right here which is a list of questions. Each",
        "textdich": ""
    },
    {
        "start": 1356.08,
        "end": 1360.32,
        "text": "question is surrounded by curly braces.",
        "textdich": ""
    },
    {
        "start": 1358.32,
        "end": 1367.12,
        "text": "So there's the opening curly brace and it has tags owner bunch of other stuff and then it ends. And then we have",
        "textdich": ""
    },
    {
        "start": 1364.72,
        "end": 1373.919,
        "text": "another question which has tags owner a bunch of other stuff and it just repeats in a list. So what we're going to do is",
        "textdich": ""
    },
    {
        "start": 1371.6,
        "end": 1381.12,
        "text": "we're going to work with this API. So, a tool I would recommend you get is called Postman. And in here, you can work with",
        "textdich": ""
    },
    {
        "start": 1379.2,
        "end": 1387.76,
        "text": "your APIs and it's just a little bit easier because you can customize the body and the different headers of your",
        "textdich": ""
    },
    {
        "start": 1385.72,
        "end": 1397.76,
        "text": "requests. And what we're going to do is we're just going to take this web address here and paste it on here. So, we're",
        "textdich": ""
    },
    {
        "start": 1394.0,
        "end": 1408.799,
        "text": "going to have httpapi.stackchange.com stack exchange.com and then forward slashquests and then all that other stuff. So hit send and we'll get a",
        "textdich": ""
    },
    {
        "start": 1405.84,
        "end": 1417.36,
        "text": "response sort of like this. So basically this is JSON here we have this items and then a list of the different questions.",
        "textdich": ""
    },
    {
        "start": 1414.88,
        "end": 1423.2,
        "text": "So let's go ahead and we'll come back to Postman later but for now let's take this URL and try to work with this in a",
        "textdich": ""
    },
    {
        "start": 1421.12,
        "end": 1431.84,
        "text": "Python script. So, if you need help setting up a Python environment, then you can check out my beginner Python programming all-in-one. However, I'm",
        "textdich": ""
    },
    {
        "start": 1430.4,
        "end": 1440.2,
        "text": "just going to assume you can at least get a Python environment set up. And we're in a Python file. What we're going to do is we're going to need a few",
        "textdich": ""
    },
    {
        "start": 1437.919,
        "end": 1447.84,
        "text": "tools. So, we're going to say import requests and import JSON. So, if this is your first time working with requests,",
        "textdich": ""
    },
    {
        "start": 1445.6,
        "end": 1456.799,
        "text": "you might need to install it. So what we can do is we can open a terminal and say pip 3 install requests. All right. So",
        "textdich": ""
    },
    {
        "start": 1454.4,
        "end": 1467.039,
        "text": "now we have requests installed and we should be able to make a request to a web page by saying requests.get and pasting in a web",
        "textdich": ""
    },
    {
        "start": 1464.64,
        "end": 1474.159,
        "text": "address inside of a string here. So let's just uh make sure this is nice and formatted properly like so. And that's",
        "textdich": ""
    },
    {
        "start": 1472.0,
        "end": 1480.88,
        "text": "going to return a response. So we can assign that to a response variable. And then what we'll do is we'll just print",
        "textdich": ""
    },
    {
        "start": 1478.64,
        "end": 1489.2,
        "text": "this response and see what we get. And you can see we get a response 200 which means okay. Now we can actually see the",
        "textdich": ""
    },
    {
        "start": 1486.48,
        "end": 1496.799,
        "text": "data that's returned by running.json as a method here. And that's going to give us all of the data exactly as we would",
        "textdich": ""
    },
    {
        "start": 1494.24,
        "end": 1505.44,
        "text": "if we requested it in the web browser or with Postman. So we got the items and then a list of all of the different",
        "textdich": ""
    },
    {
        "start": 1502.36,
        "end": 1513.279,
        "text": "questions. So we can basically zoom in on this and instead of just having one key value pair where we have items and",
        "textdich": ""
    },
    {
        "start": 1510.799,
        "end": 1525.2,
        "text": "then a giant list, we could actually explore items specifically by passing in items here. So we're going to index",
        "textdich": ""
    },
    {
        "start": 1521.6,
        "end": 1535.84,
        "text": "for items and then run this now. And we have just a list now. So we're no longer working with the items. we just have a list of",
        "textdich": ""
    },
    {
        "start": 1533.4,
        "end": 1546.48,
        "text": "questions. So then what we could do is we could iterate over these. So let's get rid of this print and we'll say for",
        "textdich": ""
    },
    {
        "start": 1543.12,
        "end": 1553.2,
        "text": "data in items. Or if you want to be more specific, you could say for question in items. This will be good for now. And",
        "textdich": ""
    },
    {
        "start": 1551.84,
        "end": 1560.4,
        "text": "then what we'll do is we'll just print data. And you can just print each one individually like so. Or you can be more",
        "textdich": ""
    },
    {
        "start": 1556.72,
        "end": 1567.039,
        "text": "specific and grab something like the title, which I know is an attribute of it. So running this and you can see here",
        "textdich": ""
    },
    {
        "start": 1564.96,
        "end": 1580.08,
        "text": "are all of the titles. So that's pretty cool. So basically that is right right here, the title. We're going to be grabbing each one of these. So",
        "textdich": ""
    },
    {
        "start": 1577.6,
        "end": 1588.48,
        "text": "every single item in this list. And you could also get something like the link if you wanted. So we can say print data",
        "textdich": ""
    },
    {
        "start": 1585.24,
        "end": 1596.48,
        "text": "link and now we got a series of question and answers and let's just print a space just to make it a little bit prettier.",
        "textdich": ""
    },
    {
        "start": 1592.4,
        "end": 1604.08,
        "text": "There we go. So here is the question and then here is the link which we can control-click to open. And there you go.",
        "textdich": ""
    },
    {
        "start": 1602.559,
        "end": 1612.559,
        "text": "So maybe you could build some kind of application to help you find good Stack Overflow questions to try to answer",
        "textdich": ""
    },
    {
        "start": 1609.039,
        "end": 1618.96,
        "text": "before anyone else does. So you can be a little bit more specific. You know, you could go in here and you could check to",
        "textdich": ""
    },
    {
        "start": 1616.0,
        "end": 1627.679,
        "text": "see the answer count. Answer count is like two for this one. So maybe maybe you only want to print the ones where",
        "textdich": ""
    },
    {
        "start": 1624.32,
        "end": 1640.72,
        "text": "the answer count is zero. So you could say if data and then ask for the answer count is zero, then we want to print the",
        "textdich": ""
    },
    {
        "start": 1638.48,
        "end": 1651.76,
        "text": "data. And just to show you guys that it's working, we'll say else print skipped. And also just print another space at the end. Actually, I'll just uh",
        "textdich": ""
    },
    {
        "start": 1648.48,
        "end": 1653.64,
        "text": "take that out of the loop. There we go.",
        "textdich": ""
    },
    {
        "start": 1651.76,
        "end": 1660.4,
        "text": "So this is our setup now. And we can run this. And you can see skipped. And then we got a question and then skipped and",
        "textdich": ""
    },
    {
        "start": 1657.76,
        "end": 1666.4,
        "text": "then a question, another question. And it seems to be working. So that's how you consume an API. Now I want to talk",
        "textdich": ""
    },
    {
        "start": 1663.919,
        "end": 1677.44,
        "text": "about how we can create our own API. So what I want to do is X out of this file here and we are in a folder API and open",
        "textdich": ""
    },
    {
        "start": 1673.6,
        "end": 1685.76,
        "text": "a terminal which I have one here and we can get the path. So just make sure you're in that directory and we're going to execute a",
        "textdich": ""
    },
    {
        "start": 1684.0,
        "end": 1693.159,
        "text": "sequence of commands in the terminal here. So the very first thing is we're going to create a virtual environment.",
        "textdich": ""
    },
    {
        "start": 1690.559,
        "end": 1704.08,
        "text": "So to do that you say python 3-m virtual environment venv and then give it a name such asveenv and that's going to create a new",
        "textdich": ""
    },
    {
        "start": 1702.32,
        "end": 1713.84,
        "text": "folder in here for your virtual directory which I talk about this in my uh previous video where we deployed a python web app but this is basically to",
        "textdich": ""
    },
    {
        "start": 1711.919,
        "end": 1722.76,
        "text": "isolate the dependencies for this specific application. Now what we can do is we can activate that by saying source",
        "textdich": ""
    },
    {
        "start": 1719.76,
        "end": 1733.6,
        "text": "and then traveling to it. So it's in the uh venv folder bin activate. So that is how you activate a virtual environment. Then we",
        "textdich": ""
    },
    {
        "start": 1731.36,
        "end": 1746.159,
        "text": "can install our dependencies. pip 3 install flask and we're also going to install pip 3 install flask sql alchemy",
        "textdich": ""
    },
    {
        "start": 1743.44,
        "end": 1754.0,
        "text": "and that's going to be used to work with the database. So this is an example of an OM which I think is object relational",
        "textdich": ""
    },
    {
        "start": 1751.279,
        "end": 1763.52,
        "text": "mapper and we can output all of our dependencies in a file if we want. So we can say pip 3 freeze and put this in",
        "textdich": ""
    },
    {
        "start": 1760.52,
        "end": 1769.76,
        "text": "requirements.txt. So, anytime you uh add a new dependency, you'll want to do that just so all of our requirements are in",
        "textdich": ""
    },
    {
        "start": 1766.799,
        "end": 1777.52,
        "text": "this text file. So, uh whoever uses this project in the future can get the dependencies. Then we can just create",
        "textdich": ""
    },
    {
        "start": 1774.159,
        "end": 1787.52,
        "text": "our file. So, we'll say application. py and that's going to create this application. file, which is where we're going to do our coding. So, to start",
        "textdich": ""
    },
    {
        "start": 1785.679,
        "end": 1803.679,
        "text": "off, we'll just create a basic flask application. So we'll say from flask import flask and then we say app is flask_ame right there. So that's how we",
        "textdich": ""
    },
    {
        "start": 1801.6,
        "end": 1812.96,
        "text": "set up flask and what we can do now is we can make a simple route basically an endpoint by saying app.root and giving",
        "textdich": ""
    },
    {
        "start": 1810.72,
        "end": 1820.24,
        "text": "it a path and then we can define a method that we want hit when someone visits this route. So all we're going to",
        "textdich": ""
    },
    {
        "start": 1818.32,
        "end": 1826.72,
        "text": "do for right now is just return a string hello. All right. So let's just make sure this is working. So what we can do",
        "textdich": ""
    },
    {
        "start": 1824.159,
        "end": 1842.12,
        "text": "is run our application. To do this, we're going to create a few environment variables real quick. So flask app is application.",
        "textdich": ""
    },
    {
        "start": 1836.84,
        "end": 1851.76,
        "text": "py and the flask environment is development. And you're going to need to do that anytime you open up your terminal. So if you X out of your",
        "textdich": ""
    },
    {
        "start": 1849.36,
        "end": 1857.84,
        "text": "terminal and then reopen it, those are going to go away. So you'll need to do those again. And then you just say flask",
        "textdich": ""
    },
    {
        "start": 1855.919,
        "end": 1868.159,
        "text": "run. All right. So this is where our website's located. And we'll just open that. All right. Already made a stupid mistake. We don't put the colon here",
        "textdich": ""
    },
    {
        "start": 1865.039,
        "end": 1872.96,
        "text": "just after the uh method. So do a refresh. Now this needs to be uppercase.",
        "textdich": ""
    },
    {
        "start": 1871.12,
        "end": 1874.64,
        "text": "There we go. That should be everything.",
        "textdich": ""
    },
    {
        "start": 1872.96,
        "end": 1883.799,
        "text": "All right. All right, we got our app up and ready to go. So, the very first thing I want to do is make a get request. So, we're going to make an app",
        "textdich": ""
    },
    {
        "start": 1880.24,
        "end": 1894.08,
        "text": "to store drinks. So, we'll say app route. And the path for this is just going to be drinks and we'll say defaf get drinks and it's going to return",
        "textdich": ""
    },
    {
        "start": 1892.399,
        "end": 1901.36,
        "text": "something. We'll just say drinks for right now. But that's not a thing. So, what we need to do is we need to put some code here to make it a thing. If",
        "textdich": ""
    },
    {
        "start": 1900.08,
        "end": 1908.399,
        "text": "you want to just test it out for right now, what you could do is you could return a dictionary. And let's just say",
        "textdich": ""
    },
    {
        "start": 1906.08,
        "end": 1916.559,
        "text": "we got drinks and we'll just put drink data for right now. So we should be able to save that and it'll automatically refresh. And",
        "textdich": ""
    },
    {
        "start": 1914.399,
        "end": 1924.0,
        "text": "then when we refresh our page, well, we go to actually forward/drinks and we get some data back in JSON. So it's sort of",
        "textdich": ""
    },
    {
        "start": 1921.84,
        "end": 1931.84,
        "text": "working now. We just got to worry about connecting to a database. So to do this with the object relational mapper, we",
        "textdich": ""
    },
    {
        "start": 1929.279,
        "end": 1937.44,
        "text": "basically define all of the things we want to store in our database as models.",
        "textdich": ""
    },
    {
        "start": 1934.24,
        "end": 1948.88,
        "text": "So we're going to create a class. So we can do that up here. And all we're going to do is we're going to say class drink. And for SQL Alchemy, we",
        "textdich": ""
    },
    {
        "start": 1946.0,
        "end": 1959.279,
        "text": "just say DB domodel. So it's going to inherit from this. So it's already going to have various built-in functionalities. And that's how we can",
        "textdich": ""
    },
    {
        "start": 1955.76,
        "end": 1968.32,
        "text": "use it with SQL uh alchemy. So then we define the columns and we're going to put three of them in here. So we're going to have an ID and the way you",
        "textdich": ""
    },
    {
        "start": 1964.559,
        "end": 1978.919,
        "text": "create a column is by saying DB column and passing in any attributes of it. So it's going to be an integer and then we set it as the",
        "textdich": ""
    },
    {
        "start": 1975.2,
        "end": 1986.24,
        "text": "primary key by saying primary key is true. Next up we're going to have a name which is DB column. And this one is",
        "textdich": ""
    },
    {
        "start": 1984.0,
        "end": 1993.12,
        "text": "going to be a string. So to do that, you say db string and you can pass in a max length. We'll just say 80. And another",
        "textdich": ""
    },
    {
        "start": 1990.08,
        "end": 2001.76,
        "text": "attribute in here is unique true if you want the name to be unique. And you can also say nullable is false. So you can't",
        "textdich": ""
    },
    {
        "start": 1999.12,
        "end": 2006.519,
        "text": "have any nulls. And then the last one on here we're going to use is description.",
        "textdich": ""
    },
    {
        "start": 2004.24,
        "end": 2014.32,
        "text": "And we'll say dbc column. And this is going to be a string as well. And we'll just give this 120 characters. However, I'm not going to",
        "textdich": ""
    },
    {
        "start": 2012.96,
        "end": 2025.6,
        "text": "put any other attributes on the description. Now, we want to override another method in here and that is called the rep re reper method repr for",
        "textdich": ""
    },
    {
        "start": 2022.559,
        "end": 2033.279,
        "text": "uh representation probably. And for this we we pass in self which refers to the object. So, we can grab the object's",
        "textdich": ""
    },
    {
        "start": 2030.399,
        "end": 2035.039,
        "text": "attributes by saying self dot something.",
        "textdich": ""
    },
    {
        "start": 2033.279,
        "end": 2042.399,
        "text": "So, we're just going to return a string and this will be invoked whenever we try to print out the the drink in the list.",
        "textdich": ""
    },
    {
        "start": 2040.559,
        "end": 2055.28,
        "text": "So you'll see what I mean here soon. So we'll say f to make a parameterized string and we can say self.name and then maybe you know a hyphen and then",
        "textdich": ""
    },
    {
        "start": 2053.399,
        "end": 2062.0,
        "text": "self.escription. All right, cool. So that is how we create a model. And what we're going to do is we're going to set",
        "textdich": ""
    },
    {
        "start": 2058.8,
        "end": 2064.32,
        "text": "up our database with a table for drinks.",
        "textdich": ""
    },
    {
        "start": 2062.0,
        "end": 2072.24,
        "text": "And to do that the easiest way is to use the Python terminal. So what I'm going to do is I'm going to quit our server.",
        "textdich": ""
    },
    {
        "start": 2068.72,
        "end": 2079.04,
        "text": "Crl + C and then I'm going to say Python 3. So that's going to open up the interactive mode in Python. And what you",
        "textdich": ""
    },
    {
        "start": 2076.56,
        "end": 2086.399,
        "text": "can do is you can say from application import DB. So what we do is we import our database from application import",
        "textdich": ""
    },
    {
        "start": 2084.32,
        "end": 2093.76,
        "text": "database. However, all we did is define the model. We need to actually make this connection to the database in our code",
        "textdich": ""
    },
    {
        "start": 2091.2,
        "end": 2105.76,
        "text": "first before we can reference it. So to do that, we're going to go up here and say from flasks SQL alchemy imports SQL",
        "textdich": ""
    },
    {
        "start": 2102.28,
        "end": 2114.32,
        "text": "alchemy. So all lowercase and then SQL is capital here. Then to get that DB variable, we just say DB is an instance",
        "textdich": ""
    },
    {
        "start": 2111.359,
        "end": 2123.76,
        "text": "of SQL Alchemy and we're going to pass in our Flask app. So that's the setup for SQL Alchemy. The last thing we have to do is we need to configure our",
        "textdich": ""
    },
    {
        "start": 2121.599,
        "end": 2139.76,
        "text": "database so we can connect to it. So we say app.config and we're going to pass in a string here. SQL alchemy database urri. And you don't have to",
        "textdich": ""
    },
    {
        "start": 2137.28,
        "end": 2150.4,
        "text": "have all of this stuff memorized. You can find this in the documentation for flask fairly uh simply. And then we're going to say",
        "textdich": ""
    },
    {
        "start": 2146.92,
        "end": 2154.32,
        "text": "SQLite and then three forward slashes data.",
        "textdich": ""
    },
    {
        "start": 2151.96,
        "end": 2162.48,
        "text": "DB. So that's how we say we're going to create an SQL light database called data. DB in the same directory. And then",
        "textdich": ""
    },
    {
        "start": 2159.92,
        "end": 2174.56,
        "text": "I think this DB variable actually will come after this config. So we'll paste that there. And there we go. So we should be able to X out of the Python",
        "textdich": ""
    },
    {
        "start": 2171.28,
        "end": 2180.92,
        "text": "interactive mode. Restart it. And now what we should be able to do is say from application which refers to our application because we named it",
        "textdich": ""
    },
    {
        "start": 2179.68,
        "end": 2191.52,
        "text": "application. py import db. Great. We didn't get any errors. We did get this warning here uh warning us about significant overhead and you can",
        "textdich": ""
    },
    {
        "start": 2190.32,
        "end": 2199.28,
        "text": "change some settings but you really don't have to worry about that. So to create our tables we say db.createall.",
        "textdich": ""
    },
    {
        "start": 2195.04,
        "end": 2207.04,
        "text": "create all hit enter and you can see it actually creates the database as well since we didn't have that. Now because this is what's known as an object",
        "textdich": ""
    },
    {
        "start": 2204.4,
        "end": 2213.599,
        "text": "relational mapper the way we work with our relational database is with objects.",
        "textdich": ""
    },
    {
        "start": 2210.24,
        "end": 2221.28,
        "text": "So if we want to create a new drink we create a drink object and we can assign it to a variable called drink. And the",
        "textdich": ""
    },
    {
        "start": 2218.48,
        "end": 2234.88,
        "text": "way we pass in data to create a drink is we do named parameters. So we can say name is grape soda and then a comma description",
        "textdich": ""
    },
    {
        "start": 2231.28,
        "end": 2243.2,
        "text": "uh I don't know tastes like grapes maybe seems pretty fitting. So that is how we create oh and you see when we do this",
        "textdich": ""
    },
    {
        "start": 2240.48,
        "end": 2254.8,
        "text": "name drink is not defined. So anytime we want to use something from our file we have to import it. So this class drink needs imported as well. So from",
        "textdich": ""
    },
    {
        "start": 2251.359,
        "end": 2262.96,
        "text": "application import drink and now we should be able to use the up arrow key to bring back our previous code. Hit enter. And now we have a drink object.",
        "textdich": ""
    },
    {
        "start": 2260.8,
        "end": 2264.64,
        "text": "And you can see it by typing in drink.",
        "textdich": ""
    },
    {
        "start": 2262.96,
        "end": 2276.4,
        "text": "And it says grape soda tastes like grapes. And that is where this repr method comes in. It basically the name hyphen in the description. Now to add it",
        "textdich": ""
    },
    {
        "start": 2272.8,
        "end": 2290.839,
        "text": "to our table, we say db session.add add drink and then db.ession.comit. And that's an important step. Yeah, we want DB.Comit, not",
        "textdich": ""
    },
    {
        "start": 2287.48,
        "end": 2301.68,
        "text": "doctor. So, db session commit. Now, we should be able to get all of our drinks by saying drink.query.all. Hit enter. And you can",
        "textdich": ""
    },
    {
        "start": 2299.44,
        "end": 2310.0,
        "text": "see it's a list now with just one element, grape soda. So if you wanted to add another drink, what we can do is just go through that process again. So",
        "textdich": ""
    },
    {
        "start": 2308.16,
        "end": 2322.079,
        "text": "we'll do this one in line. So we'll say db session add. And we'll create a drink. The name we'll call this one cherry. And we'll give it this",
        "textdich": ""
    },
    {
        "start": 2320.32,
        "end": 2335.359,
        "text": "description. And this cherry drink I drink tastes exactly like this cherry ice cream. So that I used to eat. So it tastes like that one ice cream. All",
        "textdich": ""
    },
    {
        "start": 2330.079,
        "end": 2346.48,
        "text": "right. Perfect. Hit enter. and then db session.comit. Now let's check drink.query.all. Hit enter. And now you can see we have multiple elements. We",
        "textdich": ""
    },
    {
        "start": 2343.52,
        "end": 2355.28,
        "text": "have grape soda and cherry. So then we can exit and go back to flask. Let's say flask run. So we got our server running.",
        "textdich": ""
    },
    {
        "start": 2352.56,
        "end": 2363.52,
        "text": "But now we need to create a way to get those drinks inside of this route right here. So, it's going to be pretty",
        "textdich": ""
    },
    {
        "start": 2360.96,
        "end": 2373.52,
        "text": "similar to what we did earlier. If I can scroll up just a little bit. We said drinks.query.all. So, let's go ahead and",
        "textdich": ""
    },
    {
        "start": 2371.119,
        "end": 2387.68,
        "text": "do that. In this code right here, we will say drinks is equal to drink query.all. And unfortunately, it's not something that we could just put right",
        "textdich": ""
    },
    {
        "start": 2384.24,
        "end": 2390.32,
        "text": "here by saying drinks. That'd be nice.",
        "textdich": ""
    },
    {
        "start": 2387.68,
        "end": 2396.8,
        "text": "Um, but I'll show you what happens. So, what we can do is if we refresh this page and it says object of type drink is",
        "textdich": ""
    },
    {
        "start": 2394.32,
        "end": 2402.64,
        "text": "not JSON serializable. Uh, I've worked around trying to figure out how to make this as easy as possible. Uh, I I really",
        "textdich": ""
    },
    {
        "start": 2401.119,
        "end": 2411.04,
        "text": "didn't come up with too many great ideas. Um, but here's basically what I decided. We're just going to build a list. Uh, so we're just going to",
        "textdich": ""
    },
    {
        "start": 2409.04,
        "end": 2416.4,
        "text": "basically write out what the JSON should look like. So, we're going to say output is just an empty list. From here, what",
        "textdich": ""
    },
    {
        "start": 2415.68,
        "end": 2424.48,
        "text": "we're going to do is we're going to iterate through the drinks. So, we'll say for drink in drinks and we're going to describe what it will look like",
        "textdich": ""
    },
    {
        "start": 2422.64,
        "end": 2436.079,
        "text": "inside of a dictionary. So, the end goal is to have a list of dictionaries. So, we'll just say drink data is a dictionary where name comes from",
        "textdich": ""
    },
    {
        "start": 2436.119,
        "end": 2454.64,
        "text": "drink.name and the description comes from drink.escription. like so. And then once we got that dictionary, all we have to do is say",
        "textdich": ""
    },
    {
        "start": 2451.0,
        "end": 2461.76,
        "text": "output.append and pass in drink data. So that's going to add that dictionary to this list right here. And it's going to do that twice.",
        "textdich": ""
    },
    {
        "start": 2460.16,
        "end": 2473.76,
        "text": "One for each drink that's currently in in the database. And then what it'll do is we'll just say drinks and pass in output instead. So",
        "textdich": ""
    },
    {
        "start": 2470.8,
        "end": 2483.76,
        "text": "now we have a nice list of dictionaries and that should be serializable. So what we can do is do a refresh over here and",
        "textdich": ""
    },
    {
        "start": 2479.44,
        "end": 2491.76,
        "text": "there we go. We have an outer object and then key value pairs one key with the pair of a list of dictionaries. So a",
        "textdich": ""
    },
    {
        "start": 2489.2,
        "end": 2498.16,
        "text": "very similar format to how the API for Stack Overflow looked. Now what I want to do is I want to create the ability to",
        "textdich": ""
    },
    {
        "start": 2495.839,
        "end": 2505.92,
        "text": "pass in an ID in here. So, let's say we passed in a one and we were able to get the first drink. So, let's go ahead and",
        "textdich": ""
    },
    {
        "start": 2504.079,
        "end": 2510.48,
        "text": "build that functionality. I'm going to clean up my screen just a little bit here because we're not going to need",
        "textdich": ""
    },
    {
        "start": 2509.119,
        "end": 2520.079,
        "text": "this terminal right now. I'm just going to shrink that. And I'm going to hide our different files on the side there.",
        "textdich": ""
    },
    {
        "start": 2518.0,
        "end": 2531.119,
        "text": "So, what we do now is we create a new route. So, app.oute. And this is also going to be to drinks. and then forward slash and",
        "textdich": ""
    },
    {
        "start": 2528.56,
        "end": 2540.079,
        "text": "you can use less than and greater than signs to define a parameter here. So that's going to be substituted for a specific number. Now a lot of people",
        "textdich": ""
    },
    {
        "start": 2538.4,
        "end": 2548.0,
        "text": "debate on whether this should be plural or singular since we're grabbing one drink. I decided to do it plural and",
        "textdich": ""
    },
    {
        "start": 2545.839,
        "end": 2556.079,
        "text": "I'll show you why. So I found this stack overflow question singular or plural name of resource while creating it. And",
        "textdich": ""
    },
    {
        "start": 2554.16,
        "end": 2561.04,
        "text": "this person talks in here and you know there's a bunch of different thoughts in here about the best way to do it. And as",
        "textdich": ""
    },
    {
        "start": 2559.44,
        "end": 2569.44,
        "text": "I was reading this I looked up at the web address and I saw questions plural with the ID. So I was like I think I'm",
        "textdich": ""
    },
    {
        "start": 2567.04,
        "end": 2572.4,
        "text": "sold. I'm just going to keep it plural.",
        "textdich": ""
    },
    {
        "start": 2569.44,
        "end": 2578.8,
        "text": "So that is why I decided that. So let's go back to our code in here and we're going to create a new method. So we'll",
        "textdich": ""
    },
    {
        "start": 2575.76,
        "end": 2585.68,
        "text": "say defaf get drink and this one's going to have a parameter ID. So instead of having a drinks variable, we're going to",
        "textdich": ""
    },
    {
        "start": 2583.44,
        "end": 2590.079,
        "text": "have a drink variable. And now we're just going to get a drink. So to do that, we can say",
        "textdich": ""
    },
    {
        "start": 2591.72,
        "end": 2605.839,
        "text": "drink.query.get or 404. It's kind of a tongue twister there. And from here, we can pass in the ID. That's going to give us a drink",
        "textdich": ""
    },
    {
        "start": 2602.76,
        "end": 2616.4,
        "text": "object. And then we can just return that and build a quick dictionary. So we'll say jsonify and we're going to build out",
        "textdich": ""
    },
    {
        "start": 2611.92,
        "end": 2618.2,
        "text": "the JSON. The key is going to be name.",
        "textdich": ""
    },
    {
        "start": 2616.4,
        "end": 2629.4,
        "text": "That's going to come from drink.name. And then the second key is going to be description and that's going to come from",
        "textdich": ""
    },
    {
        "start": 2625.96,
        "end": 2642.0,
        "text": "drink.escription. So dictionaries are serializable instantly. You actually don't even have to call JSONify here. So you can just return",
        "textdich": ""
    },
    {
        "start": 2639.119,
        "end": 2650.079,
        "text": "uh dictionary like so. But sometimes you'll need to call jsonify if you're not working with a dictionary. So I think that should work.",
        "textdich": ""
    },
    {
        "start": 2647.599,
        "end": 2658.0,
        "text": "Let's save and let's go back to our web page. And you can see we get one drink back. And we can try it again with ID2.",
        "textdich": ""
    },
    {
        "start": 2656.0,
        "end": 2666.72,
        "text": "We get that second drink. And then we can try ID3. And we get not found because there's not a third drink in there. Now I wanted to show you real",
        "textdich": ""
    },
    {
        "start": 2662.96,
        "end": 2673.88,
        "text": "quick. If you go back to ID2 here, you can rightclick inspect and get a little bit more information about this request.",
        "textdich": ""
    },
    {
        "start": 2671.04,
        "end": 2680.56,
        "text": "So, hitting network and then do a little refresh. You can see this request here and it's a get request. The response was",
        "textdich": ""
    },
    {
        "start": 2678.24,
        "end": 2686.64,
        "text": "200. Okay. And you can see the content type is application JSON. It's a little bit different than if you're on a web",
        "textdich": ""
    },
    {
        "start": 2684.72,
        "end": 2694.88,
        "text": "page. What we can do is we can inspect on here and go to network. Get that first request on here.",
        "textdich": ""
    },
    {
        "start": 2692.56,
        "end": 2703.599,
        "text": "And that's 200. Okay. Also a get, but this time the content type is text/html. So yeah, just want to call that out for you guys. Let's go ahead",
        "textdich": ""
    },
    {
        "start": 2701.68,
        "end": 2713.52,
        "text": "and go back. And now I want to talk a little bit about adding a new drink. So let's go ahead and create another route on here. We'll say",
        "textdich": ""
    },
    {
        "start": 2711.16,
        "end": 2724.96,
        "text": "app.oute. The path is going to be drinks. And you can actually have another parameter in here which is methods and say post which is good to do",
        "textdich": ""
    },
    {
        "start": 2722.8,
        "end": 2726.56,
        "text": "if you're defining for a post request.",
        "textdich": ""
    },
    {
        "start": 2724.96,
        "end": 2728.64,
        "text": "You can put any of the methods in here.",
        "textdich": ""
    },
    {
        "start": 2726.56,
        "end": 2730.48,
        "text": "You could put get or delete or whatever.",
        "textdich": ""
    },
    {
        "start": 2728.64,
        "end": 2739.88,
        "text": "And you can actually condition. So you could check to see what method the person's requesting. So you could you could in theory define all of this in",
        "textdich": ""
    },
    {
        "start": 2738.8,
        "end": 2750.24,
        "text": "one method and then you know check to see if they're trying to get all the drinks or add all of the drinks. However, I like",
        "textdich": ""
    },
    {
        "start": 2748.72,
        "end": 2753.119,
        "text": "to just have a little bit more separate.",
        "textdich": ""
    },
    {
        "start": 2750.24,
        "end": 2754.88,
        "text": "So I put them in separate methods here.",
        "textdich": ""
    },
    {
        "start": 2753.119,
        "end": 2758.0,
        "text": "And we'll just create a separate method.",
        "textdich": ""
    },
    {
        "start": 2754.88,
        "end": 2763.92,
        "text": "So add drink. Now this one's going to be a little bit more complicated because we actually have to get the request data.",
        "textdich": ""
    },
    {
        "start": 2762.319,
        "end": 2776.64,
        "text": "So when the person calls this, they're going to pass in the structure of what a drink should look like. So we're going to get this by creating a new",
        "textdich": ""
    },
    {
        "start": 2773.8,
        "end": 2786.16,
        "text": "drink. And where are the attributes for the drink going to come from? Well, the name is going to come from request.json. So that's how you can",
        "textdich": ""
    },
    {
        "start": 2783.16,
        "end": 2787.24,
        "text": "access the JSON data that they send.",
        "textdich": ""
    },
    {
        "start": 2786.16,
        "end": 2796.28,
        "text": "It's through request.json. And we're going to be looking for name. And we're going to do the same exact thing for the",
        "textdich": ""
    },
    {
        "start": 2793.48,
        "end": 2812.56,
        "text": "description. And that is going to come from request.json description. There we go. Now we can add these by saying db.ession.add and pass in the drink",
        "textdich": ""
    },
    {
        "start": 2813.4,
        "end": 2824.24,
        "text": "db.ession. Then what we could do, we can return whatever we want. We could say successfully added. Um, or you could do",
        "textdich": ""
    },
    {
        "start": 2821.92,
        "end": 2835.359,
        "text": "the ID. So if you wanted to return the ID, it's going to look like return ID colon drink ID. So that ID attribute is",
        "textdich": ""
    },
    {
        "start": 2833.119,
        "end": 2838.16,
        "text": "going to be added to this drink object.",
        "textdich": ""
    },
    {
        "start": 2835.359,
        "end": 2841.52,
        "text": "So that's pretty convenient. Save that.",
        "textdich": ""
    },
    {
        "start": 2838.16,
        "end": 2847.68,
        "text": "And now let's give it a try. So we'll go over to here, but we can't really pass in the data for our requests really",
        "textdich": ""
    },
    {
        "start": 2845.839,
        "end": 2858.24,
        "text": "easily. So this is where Postman comes in handy. So from here, what we can do is we can define what a drink should look like in",
        "textdich": ""
    },
    {
        "start": 2855.839,
        "end": 2860.319,
        "text": "JSON inside of the body of our request.",
        "textdich": ""
    },
    {
        "start": 2858.24,
        "end": 2869.52,
        "text": "And then we just set it to post. And also, we'll want to update our web address. So you can copy that from right here. Paste that there. And what we're",
        "textdich": ""
    },
    {
        "start": 2868.16,
        "end": 2881.56,
        "text": "going to do is we're going to give this a name. Let's zoom in a little bit. What's the name going to be? Uh we'll call it cola. And then the",
        "textdich": ""
    },
    {
        "start": 2879.2,
        "end": 2893.0,
        "text": "description is delicious. All right. So, just check everything is right. We got body, raw, JSON, post, and the correct web address.",
        "textdich": ""
    },
    {
        "start": 2889.359,
        "end": 2902.16,
        "text": "Hit send. We got an error on line 42. Let's go back to our code real quick. Looks like we might have some kind of formatting issue here.",
        "textdich": ""
    },
    {
        "start": 2898.64,
        "end": 2910.24,
        "text": "Unexpected name request. For request to work, I think we need to do another import from Flask. So, we'll say request",
        "textdich": ""
    },
    {
        "start": 2908.079,
        "end": 2920.48,
        "text": "there. And hopefully that'll do the trick. I'm also getting another warning down here. I think we need to uh take this and move it up a line. It wasn't",
        "textdich": ""
    },
    {
        "start": 2918.4,
        "end": 2927.2,
        "text": "causing any issues, but best practice there. All right, let's scroll back down in our code. And it looks like we don't",
        "textdich": ""
    },
    {
        "start": 2924.16,
        "end": 2936.16,
        "text": "have any more warnings. So, we will go back to Postman and hit send. And it looks like uh we're making progress.",
        "textdich": ""
    },
    {
        "start": 2932.64,
        "end": 2946.64,
        "text": "Okay. So the issue here is that we're not using the right web address. So we need to go to drinks, no forward slash,",
        "textdich": ""
    },
    {
        "start": 2943.44,
        "end": 2953.28,
        "text": "and hit send. So that was nice that that worked. And in this situation, it returns the ID of three. So now we can",
        "textdich": ""
    },
    {
        "start": 2951.28,
        "end": 2960.079,
        "text": "get all of the drinks. We can still keep this body here. We don't have to delete that. Hit send. And you can see all the",
        "textdich": ""
    },
    {
        "start": 2957.839,
        "end": 2967.119,
        "text": "drinks there. Or you could pass in the ID of three. Hit send and you can get that new one. Last thing I want to talk",
        "textdich": ""
    },
    {
        "start": 2965.2,
        "end": 2978.839,
        "text": "about is how to delete a drink. So let's go ahead and go back to our code and create a new route. We'll say app.oute. The path is going to be drinks",
        "textdich": ""
    },
    {
        "start": 2975.839,
        "end": 2991.76,
        "text": "and we're going to take the ID so that way we know which drink to delete. And then for the methods, we're going to say delete. There we go. and",
        "textdich": ""
    },
    {
        "start": 2987.92,
        "end": 3003.119,
        "text": "we'll say defaf delete drink. So for this to delete a drink we're going to say db session delete and pass in the drink",
        "textdich": ""
    },
    {
        "start": 3000.92,
        "end": 3011.48,
        "text": "structure. The best way to get this drink structure I thought would just be to get it from the database. So we're",
        "textdich": ""
    },
    {
        "start": 3007.2,
        "end": 3018.72,
        "text": "going to create a variable drink and say drink.query.get and pass in the ID. So I'll take the ID as a parameter from",
        "textdich": ""
    },
    {
        "start": 3016.72,
        "end": 3026.64,
        "text": "this web address. And then after we delete, we say db.ession.comit. And I was having a little bit of an issue. Now in general,",
        "textdich": ""
    },
    {
        "start": 3024.72,
        "end": 3031.839,
        "text": "I haven't done a lot of like error checking and different edge cases.",
        "textdich": ""
    },
    {
        "start": 3029.839,
        "end": 3037.599,
        "text": "However, I was getting it where I would delete a drink and it wouldn't exist and I would get an issue. So I decided just",
        "textdich": ""
    },
    {
        "start": 3035.76,
        "end": 3047.359,
        "text": "to add a little bit of extra casing here. So, if drink is none, what we're going to do is we're just going to return and I'm just going to say",
        "textdich": ""
    },
    {
        "start": 3044.079,
        "end": 3051.28,
        "text": "something like error not found or something. Or you could return a 404.",
        "textdich": ""
    },
    {
        "start": 3049.839,
        "end": 3058.72,
        "text": "Just showing some different options here. And you know, if that doesn't happen, then I'm just going to assume everything's good. And we're just going",
        "textdich": ""
    },
    {
        "start": 3056.8,
        "end": 3066.96,
        "text": "to return uh we'll say message. And I don't know, we'll just say something like yeet.",
        "textdich": ""
    },
    {
        "start": 3064.24,
        "end": 3074.559,
        "text": "There we go. Okay, let's test this one out. For this, what we're going to do is we're going to do a delete. And we don't",
        "textdich": ""
    },
    {
        "start": 3072.4,
        "end": 3081.599,
        "text": "have to pass in anything with the body just to show you guys. I'll delete that just to make sure it's clear. We do pass",
        "textdich": ""
    },
    {
        "start": 3078.079,
        "end": 3093.2,
        "text": "in the ID here, however. Hit send and it says yeet. If we hit send again, it says error not found. So, that is how you do",
        "textdich": ""
    },
    {
        "start": 3089.04,
        "end": 3102.16,
        "text": "the most basic API calls. We have the ability to get all the drinks, a specific drink, add a drink, or delete a drink. I didn't really do anything for",
        "textdich": ""
    },
    {
        "start": 3100.4,
        "end": 3108.64,
        "text": "updating a drink, but a drink is so simple. Like, I feel like you could just delete a drink and then read it. Or if",
        "textdich": ""
    },
    {
        "start": 3106.64,
        "end": 3115.04,
        "text": "you want to practice, you could try some uh put requests here. But that's all I got for you guys for the basics of",
        "textdich": ""
    },
    {
        "start": 3112.0,
        "end": 3118.96,
        "text": "creating an API in Python. It's a lot more to it, but hopefully that'll get you started.",
        "textdich": ""
    }
]