[
  {
    "start": 13.12,
    "end": 25.96,
    "text": "What an intriguing group of individuals you are. To a psychologist. I've had the opportunity over the last couple of days of",
    "textdich": ""
  },
  {
    "start": 23.92,
    "end": 38.6,
    "text": "listening in on some of your conversations and watching you interact with each other and I think it's fair to say already that there are",
    "textdich": ""
  },
  {
    "start": 33.48,
    "end": 51.52,
    "text": "47 people in this audience at this moment displaying psychological symptoms I would like to discuss today and I thought you might like to know who you",
    "textdich": ""
  },
  {
    "start": 48.36,
    "end": 59.92,
    "text": "are but instead of pointing at you which would be gratuitous and intrusive. I thought I would tell you a few facts and",
    "textdich": ""
  },
  {
    "start": 57.039,
    "end": 69.84,
    "text": "stories in which you may catch a glimpse of yourself. I'm in the field of research known as personality psychology which is",
    "textdich": ""
  },
  {
    "start": 66.72,
    "end": 84.96,
    "text": "part of a larger personality science which spans the full spectrum from neurons to narratives. And what we try to do in our own way is to make sense of",
    "textdich": ""
  },
  {
    "start": 80.32,
    "end": 97.28,
    "text": "how each of us, each of you is in certain respects like all other people, like some other people and like no other",
    "textdich": ""
  },
  {
    "start": 93.64,
    "end": 110.32,
    "text": "person. Now already you may be saying of yourself, I'm not intriguing. I am the 46th most boring person in the Western",
    "textdich": ""
  },
  {
    "start": 106.92,
    "end": 124.32,
    "text": "Hemisphere. Or you may say of yourself, I am intriguing, even if I am regarded by most people as a great thundering twit. But it is your self-dagnosed",
    "textdich": ""
  },
  {
    "start": 120.96,
    "end": 133.84,
    "text": "boringness and your inherent twittiness that makes me, as a psychologist, really fascinated by you. So let me explain why",
    "textdich": ""
  },
  {
    "start": 130.56,
    "end": 141.68,
    "text": "this is so. One of the most influential approaches in personality science is known as trait psychology and it aligns",
    "textdich": ""
  },
  {
    "start": 138.72,
    "end": 155.84,
    "text": "you along five dimensions which are normally distributed that describe universally um held aspects of difference between people. Uh they spell",
    "textdich": ""
  },
  {
    "start": 152.16,
    "end": 165.92,
    "text": "out the acronym ocean. So O stands for open to experience versus those who are more closed. C stands for conscientiousness in contrast to those",
    "textdich": ""
  },
  {
    "start": 163.92,
    "end": 179.319,
    "text": "with a more lacadasical approach to life. E extraversion in contrast to more introverted people. A agreeable individuals in contrast to those",
    "textdich": ""
  },
  {
    "start": 175.2,
    "end": 188.4,
    "text": "decidedly not agreeable. and an neurotic individuals in contrast to those who are more stable. All of these dimensions have",
    "textdich": ""
  },
  {
    "start": 185.84,
    "end": 197.8,
    "text": "implications for our well-being, for how our life goes. And so we know that, for example, openness and conscientiousness",
    "textdich": ""
  },
  {
    "start": 194.64,
    "end": 209.56,
    "text": "are very good predictors of life success. But the open people achieve that success through being audacious and occasionally odd. The conscientious",
    "textdich": ""
  },
  {
    "start": 206.959,
    "end": 221.959,
    "text": "people achieve it through sticking to deadlines, to persevering as well as having some passion. Extroversion and agreeableness",
    "textdich": ""
  },
  {
    "start": 218.239,
    "end": 229.519,
    "text": "are both conducive to working well with people. Extroverts, for example, I find intriguing with my classes. I sometimes",
    "textdich": ""
  },
  {
    "start": 227.599,
    "end": 241.64,
    "text": "give them a basic fact that might be revealing with respect to their personality. I tell them that it is virtually impossible for adults to lick",
    "textdich": ""
  },
  {
    "start": 238.239,
    "end": 252.319,
    "text": "the outside of their own elbow. Did you know that? Already some of you have tried to lick the outside of your own elbow. But",
    "textdich": ""
  },
  {
    "start": 250.0,
    "end": 262.32,
    "text": "extroverts amongst you are probably those who have not only tried but they have successfully licked the elbow of the person sitting next to them. Those",
    "textdich": ""
  },
  {
    "start": 259.519,
    "end": 270.24,
    "text": "are the extroverts. Let me deal in a bit more detail with extraversion because it's consequential and it's intriguing",
    "textdich": ""
  },
  {
    "start": 267.52,
    "end": 278.96,
    "text": "and it helps us understand what I call our three natures. First, our biogenic nature, our neurohysiology. Second, our",
    "textdich": ""
  },
  {
    "start": 275.759,
    "end": 291.759,
    "text": "socioenic or second nature, which has to do with the cultural and social aspects of our lives. And third, what makes you individually you",
    "textdich": ""
  },
  {
    "start": 289.08,
    "end": 302.88,
    "text": "idiosyncratic? what I call your idiogenic nature. Let me explain. One of the things that characterizes extroverts is they need",
    "textdich": ""
  },
  {
    "start": 299.96,
    "end": 310.4,
    "text": "stimulation. And that stimulation can be achieved by finding things that are exciting. Loud noises, parties, and",
    "textdich": ""
  },
  {
    "start": 308.24,
    "end": 317.44,
    "text": "social events. Here at TED, you see the extroverts forming a magnetic core, and they all gathered together. And I've",
    "textdich": ""
  },
  {
    "start": 315.199,
    "end": 329.44,
    "text": "seen you. The introverts are more likely to spend time in the quiet spaces up on the second floor where they are able to reduce stimulation and may be",
    "textdich": ""
  },
  {
    "start": 326.6,
    "end": 339.919,
    "text": "misconstrued as being antisocial, but you're not necessarily antisocial. It may be that you simply realize that you do",
    "textdich": ""
  },
  {
    "start": 336.44,
    "end": 346.479,
    "text": "better when you have a chance to lower that level of stimulation.",
    "textdich": ""
  },
  {
    "start": 343.12,
    "end": 353.12,
    "text": "Sometimes it's a internal stimulant uh from your body. Caffeine, for example, works much better with extroverts than",
    "textdich": ""
  },
  {
    "start": 350.639,
    "end": 363.28,
    "text": "it does introverts. When extroverts come into the office at 9:00 in the morning and say, \"I really need a cup of coffee.\" They're not kidding. They",
    "textdich": ""
  },
  {
    "start": 359.759,
    "end": 371.039,
    "text": "really do. Um, introverts do not do as well, particularly if the tasks they're engaged in and they've had some coffee.",
    "textdich": ""
  },
  {
    "start": 368.479,
    "end": 381.52,
    "text": "If those tasks are speeded and if they're quantitative, introverts may give the appearance of not being particularly quantitative. But it's a",
    "textdich": ""
  },
  {
    "start": 379.72,
    "end": 390.319,
    "text": "misconsequences that are really quite intriguing. We're not always what we seem to be. And that takes me to my next",
    "textdich": ""
  },
  {
    "start": 387.24,
    "end": 399.039,
    "text": "point. I should say before getting to this something about sexual intercourse although I may not have time and so um",
    "textdich": ""
  },
  {
    "start": 397.199,
    "end": 411.28,
    "text": "if you would like me to I would yes you would okay there are studies done on the frequency with which individuals engage in the conjugal",
    "textdich": ""
  },
  {
    "start": 408.44,
    "end": 421.039,
    "text": "act as broken down by male female introvert extrovert so I ask you how many times per minute oh I'm sorry that was a rat study.",
    "textdich": ""
  },
  {
    "start": 421.16,
    "end": 444.0,
    "text": "Um, how many times per month do introverted men engage in the act? A 3.0. Extroverted men, more or less? Yes, more. 5.5. Almost twice as",
    "textdich": ""
  },
  {
    "start": 440.36,
    "end": 446.96,
    "text": "much. Introverted women, 3.1.",
    "textdich": ""
  },
  {
    "start": 444.0,
    "end": 457.599,
    "text": "Extroverted women, frankly, speaking as an introverted male, which I will explain later, they are heroic.",
    "textdich": ""
  },
  {
    "start": 454.759,
    "end": 473.919,
    "text": "7.5. They not only handle all the male extroverts, they pick up a few introverts as [Applause] well. We communicate differently.",
    "textdich": ""
  },
  {
    "start": 471.84,
    "end": 476.16,
    "text": "Extroverts and introverts.",
    "textdich": ""
  },
  {
    "start": 473.919,
    "end": 485.68,
    "text": "Um, extroverts when they interact want to have lots of social encounter punctuated by closeness. They like to stand close for comfortable",
    "textdich": ""
  },
  {
    "start": 483.56,
    "end": 493.199,
    "text": "communication. They like to have a lot of eye contact or mutual gaze. Um, we found in some research that they use",
    "textdich": ""
  },
  {
    "start": 491.12,
    "end": 503.039,
    "text": "more dimminuative terms when they meet somebody. So when an extrovert meets uh Charles, it rapidly becomes Charlie and",
    "textdich": ""
  },
  {
    "start": 498.4,
    "end": 504.72,
    "text": "then Chuck and then chuckles baby.",
    "textdich": ""
  },
  {
    "start": 503.039,
    "end": 519.12,
    "text": "Whereas for introverts, it remains Charles until he has given a pass to be more intimate um by the person he's talking to. We speak",
    "textdich": ""
  },
  {
    "start": 516.039,
    "end": 526.959,
    "text": "differently. Extroverts prefer black and white concrete simple language.",
    "textdich": ""
  },
  {
    "start": 523.919,
    "end": 539.8,
    "text": "Introverts prefer, and I must again tell you that I am as extreme an introvert as you could possibly imagine. We speak differently. We",
    "textdich": ""
  },
  {
    "start": 535.8,
    "end": 556.32,
    "text": "prefer contextually complex, contingent weaselword sentences, more or less, as it were. not to put too fine a point upon it like",
    "textdich": ""
  },
  {
    "start": 553.0,
    "end": 565.56,
    "text": "that. When we talk, we sometimes talk past each other. I had a consulting contract I shared with a colleague who is as different from me as two people",
    "textdich": ""
  },
  {
    "start": 562.399,
    "end": 578.16,
    "text": "can possibly be. First, his name is Tom. Mine isn't. Secondly, he's 6'5. I have a tendency not to be. And thirdly, he's as",
    "textdich": ""
  },
  {
    "start": 575.519,
    "end": 587.6,
    "text": "extroverted person as you could find. I am seriously introverted. I overload so much I can't even have a cup of coffee",
    "textdich": ""
  },
  {
    "start": 585.12,
    "end": 592.8,
    "text": "after uh 3:00 in the afternoon and expect to sleep in the evening. We had",
    "textdich": ""
  },
  {
    "start": 601.64,
    "end": 613.519,
    "text": "succoned him asked Tom and me, \"What do you make of Michael?\" Well, I'll tell you what Tom said in a minute. He spoke in classic",
    "textdich": ""
  },
  {
    "start": 610.92,
    "end": 622.64,
    "text": "extrovertes. And here is how extroverted ears heard what I said, which is actually pretty accurate. I said, \"Well,",
    "textdich": ""
  },
  {
    "start": 618.68,
    "end": 632.56,
    "text": "Michael does have a tendency at times of behaving in a way that some of us might see as perhaps more assertive than is normally called for.\"",
    "textdich": ""
  },
  {
    "start": 633.68,
    "end": 651.0,
    "text": "Tom rolled his eyes and he said, \"Brian, that's what I said. He's an [Applause] asshole.\" Now, as an introvert, I might",
    "textdich": ""
  },
  {
    "start": 647.44,
    "end": 658.36,
    "text": "gently allude to certain assholic qualities in this man's behavior, but I'm not going to lunge for the A word.",
    "textdich": ""
  },
  {
    "start": 659.36,
    "end": 669.76,
    "text": "The extrovert says if he walks like one, if he talks like one, I'd call him one and we go past each other. Now, is this",
    "textdich": ""
  },
  {
    "start": 666.44,
    "end": 671.519,
    "text": "something that we should be heedful of?",
    "textdich": ""
  },
  {
    "start": 669.76,
    "end": 685.839,
    "text": "Of course, it's important that we know this. Is that all we are? Are we just a bunch of traits? No, we're not. Remember, you're like some other",
    "textdich": ""
  },
  {
    "start": 682.12,
    "end": 697.12,
    "text": "people and like no other person. How about that idiosyncratic you? As Elizabeth or as George, you may share your extraversion or your",
    "textdich": ""
  },
  {
    "start": 695.24,
    "end": 707.24,
    "text": "neuroticism, but are there some distinctively Elizabethan features of your behavior or Georgian of yours that makes us understand you",
    "textdich": ""
  },
  {
    "start": 705.2,
    "end": 720.8,
    "text": "better than just a bunch of traits that make us love you? Not just because you're a certain type of person. I'm uncomfortable putting people in pigeon",
    "textdich": ""
  },
  {
    "start": 718.04,
    "end": 731.68,
    "text": "holes. I don't even think pigeons belong in pigeon holes. So, what is it that makes us different? It's the doings that we have",
    "textdich": ""
  },
  {
    "start": 728.16,
    "end": 739.6,
    "text": "in our life. The personal projects. You have a personal project right now, but nobody really may nobody may know it",
    "textdich": ""
  },
  {
    "start": 736.44,
    "end": 749.36,
    "text": "here. It relates to your kid. You've been back three times to the hospital and they still don't know what's wrong. or it could be your",
    "textdich": ""
  },
  {
    "start": 747.0,
    "end": 760.56,
    "text": "mom and you've been acting out of character. These are free traits. You're very agreeable, but you act disagreeably in order to break down",
    "textdich": ""
  },
  {
    "start": 757.92,
    "end": 770.399,
    "text": "those barriers of administrative torper in the hospital to get something for your mom or your child. What are these free traits?",
    "textdich": ""
  },
  {
    "start": 767.36,
    "end": 779.44,
    "text": "They're where we enact a script in order to advance a core project in our lives. and they are what matters. Don't ask",
    "textdich": ""
  },
  {
    "start": 776.399,
    "end": 787.399,
    "text": "people what type you are. Ask them what are your core projects in your life and we enact those three traits. I'm an introvert but I have a core project",
    "textdich": ""
  },
  {
    "start": 786.079,
    "end": 804.56,
    "text": "which is to profess. I'm a professor and I adore my students and I adore my field and I can't wait to tell them about what's",
    "textdich": ""
  },
  {
    "start": 800.76,
    "end": 810.24,
    "text": "new, what's exciting, what I can't wait to tell them about. And so I act in an extroverted way because at 8 in the",
    "textdich": ""
  },
  {
    "start": 808.8,
    "end": 821.8,
    "text": "morning the students need a little bit of humor, a little bit of engagement to keep them going in arduous days of study. But we need to be very careful",
    "textdich": ""
  },
  {
    "start": 818.399,
    "end": 834.24,
    "text": "when we act protractedly out of character. Sometimes we may find that we don't take care of ourselves. I find for example after a",
    "textdich": ""
  },
  {
    "start": 831.12,
    "end": 841.36,
    "text": "period of pseudo extroverted behavior I need to repair somewhere on my own.",
    "textdich": ""
  },
  {
    "start": 837.92,
    "end": 848.0,
    "text": "As Susan Kaine said in her quiet book uh in a chapter that featured this strange Canadian professor who was teaching at",
    "textdich": ""
  },
  {
    "start": 844.88,
    "end": 857.68,
    "text": "the time at Harvard, um I sometimes go to the men's room to escape the slings and arrows of outrageous extroverts.",
    "textdich": ""
  },
  {
    "start": 854.24,
    "end": 868.079,
    "text": "I remember one particular day when I was um retired to a cubicle trying to avoid over stimulation and uh a real extrovert",
    "textdich": ""
  },
  {
    "start": 865.199,
    "end": 875.68,
    "text": "came in beside me uh not right in my cubicle but in the next cubicle over and I could hear various evacuatory noises",
    "textdich": ""
  },
  {
    "start": 872.959,
    "end": 888.48,
    "text": "which we hate even our own that's why we flush during as well as after and then I then I heard this grally voice saying, \"Hey, is that Dr.",
    "textdich": ""
  },
  {
    "start": 889.72,
    "end": 908.04,
    "text": "Little?\" If anything is guaranteed to constipate, an introvert for 6 months is talking on the John. That's where I'm going now. Don't",
    "textdich": ""
  },
  {
    "start": 903.199,
    "end": 908.04,
    "text": "follow me. Thank you.",
    "textdich": ""
  }
]