[
    {
        "start": 0.24,
        "end": 15.42,
        "text": "Good morning, President Vyerson, the board of trustees, faculties, esteemed guests, family, friends, and of course,",
        "textdich": ""
    },
    {
        "start": 10.32,
        "end": 27.199,
        "text": "my fellow graduates of the SNHU class of  2025. Before I begin, I'd like to take a moment to honor my family who are here",
        "textdich": ""
    },
    {
        "start": 24.96,
        "end": 34.829,
        "text": "with me today and those who are watching all the way from Vietnam.",
        "textdich": ""
    },
    {
        "start": 29.77,
        "end": 34.829,
        "text": "",
        "textdich": ""
    },
    {
        "start": 43.52,
        "end": 57.44,
        "text": "class of 2025. It feels so good to stand before you today, especially because I finally get to see the top of everyone's head from here.",
        "textdich": ""
    },
    {
        "start": 54.8,
        "end": 69.2,
        "text": "As someone who's always the shortest in the room, I've spent my whole life looking up to others. Most of the time out of necessity, of course, but more",
        "textdich": ""
    },
    {
        "start": 65.519,
        "end": 80.96,
        "text": "often out of admiration. And the people I admire most, tower over others, not in height either, but in character. My parents, with their",
        "textdich": ""
    },
    {
        "start": 78.24,
        "end": 87.52,
        "text": "strength and endless sacrifice, are the reason why I am standing here today.",
        "textdich": ""
    },
    {
        "start": 84.32,
        "end": 99.219,
        "text": "In 2013, my family left everything familiar in Vietnam so my mom could pursue her master's degree right here at SNHU.",
        "textdich": ""
    },
    {
        "start": 94.37,
        "end": 111.92,
        "text": " At the time, she was juggling jobs to support the family, raising two young kids, taking care of my dad in the",
        "textdich": ""
    },
    {
        "start": 108.52,
        "end": 123.119,
        "text": "hospital, all while shielding me and my sister from the stress so that we could be the carefree kids all children deserve to be. Through it all, she",
        "textdich": ""
    },
    {
        "start": 120.799,
        "end": 133.52,
        "text": "graduated among the top of her class here. 10 years later, I now stand in the very place she once stood, following her",
        "textdich": ""
    },
    {
        "start": 131.12,
        "end": 148.36,
        "text": "footsteps and carrying forward her lessons with  me. My parents are the people I've always looked up to. And today, as I",
        "textdich": ""
    },
    {
        "start": 145.84,
        "end": 157.76,
        "text": "look around the room, I see the same strength, perseverance, and inspiration in all of you. Because no matter how",
        "textdich": ""
    },
    {
        "start": 155.12,
        "end": 168.8,
        "text": "different our journeys have been, we've all faced challenges and probably had to sacrifice some sleep to get here. But despite our questionable sleep",
        "textdich": ""
    },
    {
        "start": 166.44,
        "end": 178.16,
        "text": "schedules, there's one thing I know we've all mastered. Dreaming. Not the kind that happens when you actually do",
        "textdich": ""
    },
    {
        "start": 174.72,
        "end": 189.8,
        "text": "sleep, but the dreams we hold on to when we're awake. the kind that pushes you forward even when the path is unclear. And I believe we all dream of",
        "textdich": ""
    },
    {
        "start": 187.84,
        "end": 202.72,
        "text": "changing the world in some way. But the truth is before we can change the world, we need to know what it truly looks like. To see the world's",
        "textdich": ""
    },
    {
        "start": 199.04,
        "end": 211.64,
        "text": "beauty in its entirety, we must accept its pain, its chaos, and its imperfections.",
        "textdich": ""
    },
    {
        "start": 207.92,
        "end": 222.4,
        "text": "Most importantly, we need to look within ourselves because change doesn't start out there. It starts right here. If you",
        "textdich": ""
    },
    {
        "start": 218.48,
        "end": 234.56,
        "text": "want to see kindness, be kind. If you want justice, then stand for what's right. If you want a better future, then shape it with your own",
        "textdich": ""
    },
    {
        "start": 231.319,
        "end": 241.12,
        "text": "hands. The people you and I look up to the most didn't wait for the world to change.",
        "textdich": ""
    },
    {
        "start": 237.92,
        "end": 251.439,
        "text": "They changed themselves first. They saw the world for what it was and then they imagined what it could be. And now, my",
        "textdich": ""
    },
    {
        "start": 247.92,
        "end": 260.16,
        "text": "fellow graduates, it's our turn. Soon, we'll walk across the stage ready to step into the world. But no matter where",
        "textdich": ""
    },
    {
        "start": 257.199,
        "end": 272.479,
        "text": "life takes us next, let's never stop looking up. Not just to those who inspire us, but to the possibilities ahead. to the challenges that will shape",
        "textdich": ""
    },
    {
        "start": 268.56,
        "end": 276.639,
        "text": "us and to the dreams that will drive us.",
        "textdich": ""
    },
    {
        "start": 272.479,
        "end": 283.14,
        "text": "Class of 2025, the world is waiting and the question is what will you do?",
        "textdich": ""
    },
    {
        "start": 279.6,
        "end": 287.579,
        "text": "Congratulations and thank you muna.",
        "textdich": ""
    },
    {
        "start": 283.14,
        "end": 287.579,
        "text": "",
        "textdich": ""
    }
]