[
    {
        "start": 0.16,
        "end": 11.519,
        "text": "Welcome to my channel, The English Grammar Doctor. Today I want to tell you a story. A story about a man, a very old",
        "textdich": ""
    },
    {
        "start": 8.24,
        "end": 14.08,
        "text": "man. He has no luck. He has no fish.",
        "textdich": ""
    },
    {
        "start": 11.519,
        "end": 23.6,
        "text": "People laugh at him, but he never gives up. This story is simple, but it can change your life. Because sometimes the",
        "textdich": ""
    },
    {
        "start": 21.119,
        "end": 29.439,
        "text": "biggest battles are inside us. Do you feel like you try but nothing works?",
        "textdich": ""
    },
    {
        "start": 25.92,
        "end": 37.12,
        "text": "Comment below. Do you feel that too? The old man lived near the sea. Every morning before the sun was up, he walked",
        "textdich": ""
    },
    {
        "start": 34.32,
        "end": 47.039,
        "text": "to his small wooden boat. His boat was old. His fishing lines were old. His sail had many holes and was patched with",
        "textdich": ""
    },
    {
        "start": 43.12,
        "end": 56.8,
        "text": "old cloth. Some people laughed and said his boat looks like his face full of lines. But the old man didn't listen. He",
        "textdich": ""
    },
    {
        "start": 53.6,
        "end": 66.479,
        "text": "was quiet. He didn't speak much. He didn't complain. He just walked to the sea. He was not weak. His body was thin",
        "textdich": ""
    },
    {
        "start": 63.359,
        "end": 74.96,
        "text": "but strong. His skin was brown from the sun. His hands were full of cuts and old scars. Those scars were not from today.",
        "textdich": ""
    },
    {
        "start": 72.96,
        "end": 83.2,
        "text": "They were from many years of catching big fish. He had strength but no luck.",
        "textdich": ""
    },
    {
        "start": 78.799,
        "end": 92.56,
        "text": "For 84 days he caught nothing. Not one fish, not even a small one. On some days he saw big fish swimming under his boat,",
        "textdich": ""
    },
    {
        "start": 90.24,
        "end": 100.56,
        "text": "but they did not take the bait. He waited. He hoped, but he returned home with nothing. The people in his village",
        "textdich": ""
    },
    {
        "start": 97.68,
        "end": 109.439,
        "text": "started to say, \"He is finished. He will never catch another fish again.\" But the old man still believed. He said to",
        "textdich": ""
    },
    {
        "start": 106.0,
        "end": 117.2,
        "text": "himself, \"Each day is a new day. The sea can change in one moment.\" He looked at the sea like a friend. He called it",
        "textdich": ""
    },
    {
        "start": 114.56,
        "end": 126.24,
        "text": "Lamar in Spanish. The way people talk about a woman they love. The sea was not just water for him. It was his life. It",
        "textdich": ""
    },
    {
        "start": 122.96,
        "end": 128.879,
        "text": "was his battle. It was also his hope.",
        "textdich": ""
    },
    {
        "start": 126.24,
        "end": 135.76,
        "text": "There was one boy. The boy's name was Manolan. He was not the old man's son.",
        "textdich": ""
    },
    {
        "start": 133.04,
        "end": 138.08,
        "text": "But he loved him like a father.",
        "textdich": ""
    },
    {
        "start": 135.76,
        "end": 145.52,
        "text": "When the boy was 5 years old, the old man took him out on the boat. He learned to fish from him. He learned to hold the",
        "textdich": ""
    },
    {
        "start": 142.56,
        "end": 150.959,
        "text": "line, to wait with patience, to feel the sea. They had many good days together.",
        "textdich": ""
    },
    {
        "start": 148.8,
        "end": 160.959,
        "text": "But after 40 days without a fish, the boy's parents said, \"He has no luck. Go fish with someone else.\" And the boy",
        "textdich": ""
    },
    {
        "start": 157.36,
        "end": 168.56,
        "text": "listened. He was sad, but he obeyed. On the other boat, the boy helped catch big fish. On the first day, they caught",
        "textdich": ""
    },
    {
        "start": 165.84,
        "end": 177.44,
        "text": "three good ones. The boy's parents were happy, but the boy was not. His heart stayed with the old man. Every day when",
        "textdich": ""
    },
    {
        "start": 174.879,
        "end": 185.2,
        "text": "the old man returned with an empty boat, the boy waited for him. He helped him carry the lines, the sail, and the small",
        "textdich": ""
    },
    {
        "start": 182.64,
        "end": 193.84,
        "text": "wooden box. They didn't speak much, but they understood each other. One evening, the boy said, \"I want to fish with you",
        "textdich": ""
    },
    {
        "start": 190.56,
        "end": 205.519,
        "text": "again.\" The old man smiled and said, \"You are on a lucky boat now. Stay there. Do not worry about me.\" The boy looked down. I don't care about luck. I",
        "textdich": ""
    },
    {
        "start": 203.44,
        "end": 218.319,
        "text": "care about you. You taught me everything. The old man looked at the boy with kind eyes. I know, but this is how life is. Sometimes we must do what",
        "textdich": ""
    },
    {
        "start": 214.72,
        "end": 225.92,
        "text": "we don't like. The boy nodded. He felt the truth, but his heart still wanted to go back to the sea with the old man.",
        "textdich": ""
    },
    {
        "start": 223.599,
        "end": 236.56,
        "text": "They sat together on the terrace, a small open cafe near the water. Other fishermen were there. Some made jokes about the old man. Some were quiet. The",
        "textdich": ""
    },
    {
        "start": 234.08,
        "end": 243.36,
        "text": "older men respected him. They remembered when he was young and strong. They knew he once caught the biggest fish anyone",
        "textdich": ""
    },
    {
        "start": 240.72,
        "end": 250.56,
        "text": "had seen. They did not laugh. They talked about the wind and the sea, about the fish and the weather. But their eyes",
        "textdich": ""
    },
    {
        "start": 247.68,
        "end": 259.6,
        "text": "watched the old man. They saw more than his thin body. They saw his strength, not in muscles, but in spirit. The boy",
        "textdich": ""
    },
    {
        "start": 256.88,
        "end": 266.08,
        "text": "and the old man drank a cold beer. They watched the sky. It was getting dark.",
        "textdich": ""
    },
    {
        "start": 262.72,
        "end": 278.88,
        "text": "The sea was calm. \"Tomorrow will be a good day,\" the old man said. \"Yes,\" the boy answered. \"I will get your bait and I will bring you some sardines.\"",
        "textdich": ""
    },
    {
        "start": 275.44,
        "end": 288.16,
        "text": "The old man said, \"I can do it. You should go play baseball. I can still row. I can still fish.\" The boy smiled.",
        "textdich": ""
    },
    {
        "start": 286.08,
        "end": 298.479,
        "text": "I want to help. And I will get the sardines and I will bring four fresh baits, too. The old man asked. You didn't steal them, right? The boy",
        "textdich": ""
    },
    {
        "start": 295.68,
        "end": 307.84,
        "text": "laughed. No, I bought them, but I would steal them for you. The old man laughed, too. Thank you. You are already a man.",
        "textdich": ""
    },
    {
        "start": 305.84,
        "end": 316.56,
        "text": "That night, they walked to the old man's house. It was a small shack made of palm leaves. There was only one room. It had",
        "textdich": ""
    },
    {
        "start": 313.36,
        "end": 325.36,
        "text": "a bed, a table, a chair, and a place to cook with charcoal. There used to be a photo of the old man's wife, but he took",
        "textdich": ""
    },
    {
        "start": 321.6,
        "end": 336.56,
        "text": "it down. It made him too sad. Now it was hidden under his clean shirt on the shelf. The boy asked, \"Do you have food?\" The old man smiled. \"Yes, I have",
        "textdich": ""
    },
    {
        "start": 333.919,
        "end": 346.0,
        "text": "rice and fish, but there was no food. It was only a story. They made this story every night.\" The boy said, \"Do you want",
        "textdich": ""
    },
    {
        "start": 342.8,
        "end": 356.479,
        "text": "me to make a fire?\" The old man said, \"No, I will eat later, or I will eat it cold.\" They both knew there was nothing,",
        "textdich": ""
    },
    {
        "start": 352.56,
        "end": 366.639,
        "text": "but they smiled. The boy said, \"85 is a lucky number.\" The old man said, \"Yes, tomorrow is the 85th day. Maybe I will",
        "textdich": ""
    },
    {
        "start": 363.28,
        "end": 371.919,
        "text": "catch one that weighs 1,000 lb.\" The boy nodded. I will keep your sardines cold.",
        "textdich": ""
    },
    {
        "start": 369.6,
        "end": 381.28,
        "text": "We can share them in the morning. The old man said, \"The Yankees cannot lose.\" The boy laughed. But I fear the Indians",
        "textdich": ""
    },
    {
        "start": 378.08,
        "end": 389.44,
        "text": "of Cleveland. The old man said, \"Have faith in Deaggio.\" The boy said, \"Do you think we can buy a lottery ticket with",
        "textdich": ""
    },
    {
        "start": 386.4,
        "end": 395.84,
        "text": "the number 85?\" The old man thought for a second. \"Maybe, but we need money.",
        "textdich": ""
    },
    {
        "start": 393.039,
        "end": 405.44,
        "text": "First you borrow, then you beg.\" The boy said, \"I will borrow the money. Don't worry. The old man looked at the boy and",
        "textdich": ""
    },
    {
        "start": 401.68,
        "end": 414.8,
        "text": "smiled. You are good. Go now. Tomorrow is a new day, a big day. The boy said, \"Good night, old man.\" The old man said,",
        "textdich": ""
    },
    {
        "start": 411.68,
        "end": 423.28,
        "text": "\"Sleep well, my son.\" He sat by the door and looked at the sea. His heart was quiet, but his spirit was ready.",
        "textdich": ""
    },
    {
        "start": 420.24,
        "end": 432.479,
        "text": "Tomorrow he would go far, far out into the sea, where no one else would go. The evening was quiet. The sun was low. The",
        "textdich": ""
    },
    {
        "start": 429.919,
        "end": 442.24,
        "text": "sky turned from yellow to pink and then to dark blue. The sea was calm. The wind was soft. The boats were back. Some",
        "textdich": ""
    },
    {
        "start": 438.72,
        "end": 445.759,
        "text": "boats had big fish. Some had small fish.",
        "textdich": ""
    },
    {
        "start": 442.24,
        "end": 455.919,
        "text": "The old man's boat had nothing. No fish, no luck. But still, he looked calm. He tied his boat. He carried the sail. He",
        "textdich": ""
    },
    {
        "start": 452.56,
        "end": 464.96,
        "text": "walked slowly. His legs were tired. His back hurt, but he did not show it. The boy was waiting. Like every evening, he",
        "textdich": ""
    },
    {
        "start": 462.4,
        "end": 474.08,
        "text": "helped the old man. He took the fishing lines. He took the box. He carried the gaff and the harpoon. He did not say",
        "textdich": ""
    },
    {
        "start": 470.639,
        "end": 476.16,
        "text": "much. He just walked beside the old man.",
        "textdich": ""
    },
    {
        "start": 474.08,
        "end": 478.4,
        "text": "The other fisherman talked and laughed.",
        "textdich": ""
    },
    {
        "start": 476.16,
        "end": 484.16,
        "text": "Some looked at the old man. Some laughed at him. Some felt sad but said nothing.",
        "textdich": ""
    },
    {
        "start": 481.919,
        "end": 491.919,
        "text": "The old man did not look at them. His eyes looked at the sea. His steps were slow, but he walked like a man who still",
        "textdich": ""
    },
    {
        "start": 489.44,
        "end": 503.52,
        "text": "had a dream. The boy wanted to say something, but he waited. He looked at the old man's face. The face had many lines. It looked tired. But the eyes,",
        "textdich": ""
    },
    {
        "start": 500.8,
        "end": 514.479,
        "text": "the eyes still had light, still had life. The boy thought, \"He is old, but he is not broken. He still has a dream in his heart.\"",
        "textdich": ""
    },
    {
        "start": 512.08,
        "end": 527.12,
        "text": "They reached the small house. It was made of dry palm leaves. Inside there was only one room. There was a bed, a table, a chair, and a small place to",
        "textdich": ""
    },
    {
        "start": 523.839,
        "end": 538.72,
        "text": "cook. Now he kept it under his clean shirt on the shelf. He looked at it sometimes, but not tonight. Tonight he was thinking about the sea. The boy",
        "textdich": ""
    },
    {
        "start": 536.24,
        "end": 544.399,
        "text": "placed the gear on the floor. The old man leaned the mast against the wall.",
        "textdich": ""
    },
    {
        "start": 541.279,
        "end": 554.72,
        "text": "The room was silent, but their silence was warm. It was not cold. The boy asked, \"Do you have food?\" The old man",
        "textdich": ""
    },
    {
        "start": 551.68,
        "end": 564.399,
        "text": "smiled and said, \"Yes, I have some rice and fish.\" But there was no rice, no fish, no food. The boy knew that. The",
        "textdich": ""
    },
    {
        "start": 561.839,
        "end": 574.16,
        "text": "old man knew that. But they played the same story every night. It was not a lie. It was a way to keep hope. The boy",
        "textdich": ""
    },
    {
        "start": 571.04,
        "end": 584.16,
        "text": "said, \"Do you want me to make the fire?\" The old man said, \"No, maybe I will eat the rice cold.\" The boy smiled. They",
        "textdich": ""
    },
    {
        "start": 581.519,
        "end": 590.8,
        "text": "both knew the truth, but the game helped them feel strong. The night came slowly.",
        "textdich": ""
    },
    {
        "start": 588.24,
        "end": 602.399,
        "text": "The old man sat by the door. The boy said, \"I will get the sardines, and I will bring four baits.\" The old man said, \"I have two.\" I put them in salt.",
        "textdich": ""
    },
    {
        "start": 599.92,
        "end": 615.279,
        "text": "The boy said, \"But I will bring fresh ones.\" The old man looked at him. \"You didn't steal them, right?\" The boy smiled. \"No, I bought them, but I would",
        "textdich": ""
    },
    {
        "start": 611.36,
        "end": 623.519,
        "text": "steal for you.\" The old man said, \"Thank you. You are already a man.\" The boy asked, \"Do you remember the first time",
        "textdich": ""
    },
    {
        "start": 620.959,
        "end": 633.839,
        "text": "you took me in the boat?\" The old man laughed. Yes, you were five and I caught a big fish. It was too strong. It broke",
        "textdich": ""
    },
    {
        "start": 630.64,
        "end": 643.44,
        "text": "the boat. It almost killed you. The boy said, \"I remember the noise. I remember you threw me into the front. I remember",
        "textdich": ""
    },
    {
        "start": 639.839,
        "end": 652.32,
        "text": "the smell of blood. I was not afraid. I was happy.\" The old man looked at him. I told you that story many times. Maybe",
        "textdich": ""
    },
    {
        "start": 649.44,
        "end": 660.399,
        "text": "you remember because I told you. The boy said, \"No, I remember everything from the first day. You are my teacher.\" The",
        "textdich": ""
    },
    {
        "start": 658.32,
        "end": 669.279,
        "text": "old man looked at the boy with eyes full of love. \"If you were my son, I would take you out tomorrow. But you have your",
        "textdich": ""
    },
    {
        "start": 667.279,
        "end": 677.44,
        "text": "parents. They want you to fish on the lucky boat.\" The boy said, \"Yes, but my heart is with you.\" The boy said, \"I",
        "textdich": ""
    },
    {
        "start": 674.8,
        "end": 686.399,
        "text": "will go now and get the sardines.\" The old man nodded. Go, my son. Tomorrow will be a big day. The boy walked away.",
        "textdich": ""
    },
    {
        "start": 683.76,
        "end": 696.72,
        "text": "The old man sat alone. He watched the sea. He could not see the sea, but he could feel it. He sat quietly. The wind",
        "textdich": ""
    },
    {
        "start": 692.88,
        "end": 700.32,
        "text": "touched his face. His eyes looked far.",
        "textdich": ""
    },
    {
        "start": 696.72,
        "end": 708.88,
        "text": "Then he stood up. He went to his bed. He rolled up his pants and used them as a pillow. He covered himself with an old",
        "textdich": ""
    },
    {
        "start": 705.12,
        "end": 718.399,
        "text": "blanket. He closed his eyes. The room was dark, but in his mind there was light. He did not dream of fish. He did",
        "textdich": ""
    },
    {
        "start": 716.16,
        "end": 727.839,
        "text": "not dream of his wife. He did not dream of the sea. He dreamed of lions. Yes, lions. Golden lions running on a white",
        "textdich": ""
    },
    {
        "start": 725.12,
        "end": 739.839,
        "text": "beach. He saw them every night. They played like children. They ran in the sand. He loved the lions. They were strong. They were free.",
        "textdich": ""
    },
    {
        "start": 737.76,
        "end": 750.0,
        "text": "They reminded him of something from long ago. When he was young, when he had power, when he had dreams.",
        "textdich": ""
    },
    {
        "start": 746.72,
        "end": 759.44,
        "text": "He smiled in his sleep. The lions were there. They were not afraid. They did not need luck. They were simply there,",
        "textdich": ""
    },
    {
        "start": 756.16,
        "end": 765.36,
        "text": "proud and wild and beautiful. The boy came back. He saw the old man sleeping.",
        "textdich": ""
    },
    {
        "start": 762.72,
        "end": 774.24,
        "text": "He did not wake him. He took a blanket and put it over his shoulders. He looked at the old man's face. It was full of",
        "textdich": ""
    },
    {
        "start": 770.88,
        "end": 785.44,
        "text": "lines, but it was peaceful. His hands were open. His breath was slow. The boy sat near the door. He said nothing. He",
        "textdich": ""
    },
    {
        "start": 781.12,
        "end": 788.72,
        "text": "just sat. He felt quiet. He felt proud.",
        "textdich": ""
    },
    {
        "start": 785.44,
        "end": 797.2,
        "text": "He looked at the stars and he thought, \"Tomorrow will be different.\" The sea was waiting. The fish were waiting. And",
        "textdich": ""
    },
    {
        "start": 794.16,
        "end": 806.32,
        "text": "the old man, the man with no fish, he was dreaming of lions. It was still dark. The sky had no color. The village",
        "textdich": ""
    },
    {
        "start": 803.36,
        "end": 809.12,
        "text": "was asleep, but the old man was awake.",
        "textdich": ""
    },
    {
        "start": 806.32,
        "end": 816.72,
        "text": "He opened his eyes and listened. It was quiet. Only the wind moved outside.",
        "textdich": ""
    },
    {
        "start": 813.68,
        "end": 828.0,
        "text": "The sea was calling him. He could feel it in his bones. He sat up slowly. His body hurt. His back was stiff. His hands",
        "textdich": ""
    },
    {
        "start": 824.639,
        "end": 839.44,
        "text": "felt weak, but he did not complain. This was normal. This was life. He stood, rolled up his blanket, and put on his pants. The room was cold. The air",
        "textdich": ""
    },
    {
        "start": 836.72,
        "end": 848.8,
        "text": "smelled of the sea. He looked at the little table, the chair, and the pictures on the wall. He looked at the shelf where he kept his wife's photo",
        "textdich": ""
    },
    {
        "start": 846.079,
        "end": 857.04,
        "text": "under his clean shirt. He didn't take it out. Not today. He knew today would be important. Today might be the day. The",
        "textdich": ""
    },
    {
        "start": 854.72,
        "end": 864.8,
        "text": "day he catches the big one. The day he becomes lucky again. He whispered 85.",
        "textdich": ""
    },
    {
        "start": 861.76,
        "end": 872.88,
        "text": "A lucky number. Then he opened the door and stepped outside into the dark morning. He walked to the boy's house.",
        "textdich": ""
    },
    {
        "start": 870.079,
        "end": 884.639,
        "text": "The boy was still sleeping. The door was not locked. The old man walked in slowly. His feet made no sound. He saw the boy sleeping on a small bed. He",
        "textdich": ""
    },
    {
        "start": 882.48,
        "end": 896.639,
        "text": "walked to him, touched his foot and waited. The boy opened his eyes and saw the old man. He did not speak. He just got up and put on his clothes. They",
        "textdich": ""
    },
    {
        "start": 893.44,
        "end": 907.199,
        "text": "walked together without talking. The road was quiet. Other men were also walking with their fishing gear. No one spoke much. They were all tired. They",
        "textdich": ""
    },
    {
        "start": 904.72,
        "end": 914.24,
        "text": "were all thinking of the sea. The boy carried the lines and the harpoon. The old man carried the mast and sail. The",
        "textdich": ""
    },
    {
        "start": 912.399,
        "end": 921.519,
        "text": "wood felt heavy on his shoulder, but he said nothing. They walked to the beach where the small boat waited. The boat",
        "textdich": ""
    },
    {
        "start": 919.04,
        "end": 931.44,
        "text": "looked small against the dark sea, but the old man did not feel fear. He only felt calm. The boy said, \"Do you want",
        "textdich": ""
    },
    {
        "start": 927.839,
        "end": 938.56,
        "text": "coffee?\" The old man nodded. \"We will put the gear in the boat first.\" They placed everything carefully. The boy ran",
        "textdich": ""
    },
    {
        "start": 936.399,
        "end": 945.68,
        "text": "off to get the coffee. He brought it in an old tin can. It was hot and strong.",
        "textdich": ""
    },
    {
        "start": 942.24,
        "end": 957.519,
        "text": "The old man drank it slowly. He said, \"This will be the only thing I drink today.\" The boy said, \"I will get your sardines.\" The old man nodded again.",
        "textdich": ""
    },
    {
        "start": 954.16,
        "end": 964.88,
        "text": "\"You are a good boy.\" The boy smiled and ran off again. The old man sat on the side of the boat and looked at the sea.",
        "textdich": ""
    },
    {
        "start": 962.639,
        "end": 973.839,
        "text": "It was still too dark to see clearly, but he knew it was out there waiting deep, full of mystery, full of life. He",
        "textdich": ""
    },
    {
        "start": 970.88,
        "end": 985.04,
        "text": "did not hate the sea. He loved it. But he also knew it could be cruel. The sea was not a friend and not an enemy. It was something more, something big,",
        "textdich": ""
    },
    {
        "start": 982.72,
        "end": 992.16,
        "text": "something powerful. He had spent his life on the sea, and today he would go far, farther than before.",
        "textdich": ""
    },
    {
        "start": 990.079,
        "end": 1004.24,
        "text": "The boy returned with the bait wrapped in newspaper. He handed it to the old man. Good luck, he said. The old man nodded and smiled.",
        "textdich": ""
    },
    {
        "start": 1001.279,
        "end": 1011.759,
        "text": "Good luck to you, too. The boy helped him push the boat into the water. Then he stood and watched as the old man got",
        "textdich": ""
    },
    {
        "start": 1009.12,
        "end": 1017.36,
        "text": "in and began to row. The boy stood on the shore for a long time, looking out.",
        "textdich": ""
    },
    {
        "start": 1014.88,
        "end": 1027.199,
        "text": "The boat grew smaller and smaller in the dark water. The boy did not move. He only watched. He believed in the old man. He believed today would be",
        "textdich": ""
    },
    {
        "start": 1025.679,
        "end": 1031.439,
        "text": "different.",
        "textdich": ""
    },
    {
        "start": 1027.199,
        "end": 1039.919,
        "text": "The old man rode. He did not hurry. He moved slowly with care. The sea was dark and soft. The boat made little noise.",
        "textdich": ""
    },
    {
        "start": 1037.039,
        "end": 1047.439,
        "text": "The stars were still in the sky. He rode far, farther than other boats. He wanted to go where no one else went, where the",
        "textdich": ""
    },
    {
        "start": 1045.12,
        "end": 1058.16,
        "text": "big fish waited. His hands moved the oars like they had done for years. His arms pulled the boat forward. He was old, but he still had strength. He did",
        "textdich": ""
    },
    {
        "start": 1054.96,
        "end": 1068.08,
        "text": "not look back. He looked ahead. Always ahead. The sky slowly changed. A little light touched the water. The stars began",
        "textdich": ""
    },
    {
        "start": 1064.799,
        "end": 1076.88,
        "text": "to fade. The sea changed color. First gray, then blue. The old man smiled. He felt ready. Today was different. He",
        "textdich": ""
    },
    {
        "start": 1075.039,
        "end": 1084.96,
        "text": "could feel it in the air, in the water, in his bones. He reached the deep part of the sea. He called it the great well.",
        "textdich": ""
    },
    {
        "start": 1082.48,
        "end": 1087.84,
        "text": "It was a place where fish came together.",
        "textdich": ""
    },
    {
        "start": 1084.96,
        "end": 1097.679,
        "text": "He saw birds flying low. He saw flying fish jump out of the water. He saw seaweed floating near the boat. He knew this was a good sign. He dropped his",
        "textdich": ""
    },
    {
        "start": 1094.799,
        "end": 1108.559,
        "text": "lines into the water. One line went 40 fathoms down. Another went 60, another at 100, and one at 125. Each line was",
        "textdich": ""
    },
    {
        "start": 1105.84,
        "end": 1117.84,
        "text": "perfect. Each hook was hidden with fresh sardines. The bait looked real. It smelled sweet. It was placed with care.",
        "textdich": ""
    },
    {
        "start": 1115.12,
        "end": 1127.6,
        "text": "The old man looked at the lines. They stood straight in the water. He watched them. He waited. He listened. He felt",
        "textdich": ""
    },
    {
        "start": 1123.84,
        "end": 1136.64,
        "text": "the sea. He said nothing but inside his heart he was speaking. Come big fish, come and find me. I am here. I am ready.",
        "textdich": ""
    },
    {
        "start": 1134.4,
        "end": 1141.84,
        "text": "The sun was rising now. It touched the sea like gold. The boat rocked gently.",
        "textdich": ""
    },
    {
        "start": 1139.919,
        "end": 1151.6,
        "text": "The lines were quiet, but the old man knew this was the moment. This was the new day, a new chance. He was far from",
        "textdich": ""
    },
    {
        "start": 1148.24,
        "end": 1161.76,
        "text": "land, alone with the sea. But he was not afraid. He was full of hope. He did not feel old now. He felt alive. He felt",
        "textdich": ""
    },
    {
        "start": 1158.64,
        "end": 1167.84,
        "text": "strong. He watched the sea. He watched the sky. And he waited for his chance.",
        "textdich": ""
    },
    {
        "start": 1165.2,
        "end": 1182.32,
        "text": "His heartbeat slowly. His hands were ready. His mind was calm. This was the life he had chosen. This was his place, his sea, his dream. And maybe today",
        "textdich": ""
    },
    {
        "start": 1179.039,
        "end": 1193.2,
        "text": "would be the day. The old man was now far out on the water. The land was behind him. He could not see the shore anymore. But he was not worried. This",
        "textdich": ""
    },
    {
        "start": 1190.559,
        "end": 1202.32,
        "text": "was his sea. This was where he felt at home. The boat moved gently on the water. The waves were soft. The sky was",
        "textdich": ""
    },
    {
        "start": 1199.12,
        "end": 1214.0,
        "text": "wide and blue. The sun was warm on his back. The air smelled clean. The sea was deep, very deep. a quiet dark blue that",
        "textdich": ""
    },
    {
        "start": 1210.799,
        "end": 1224.32,
        "text": "went down forever. It looked peaceful, but the old man knew this water could hide big things, strong things, beautiful and dangerous things. He loved",
        "textdich": ""
    },
    {
        "start": 1221.679,
        "end": 1234.08,
        "text": "the sea. He called her Lamar, like a woman, kind, wild, mysterious. Some fishermen called it Elmar, like a man.",
        "textdich": ""
    },
    {
        "start": 1230.799,
        "end": 1245.36,
        "text": "But to him, the sea was soft. The sea was a partner, sometimes a lover, sometimes a mother, sometimes a fighter, but never a stranger. He looked down",
        "textdich": ""
    },
    {
        "start": 1242.72,
        "end": 1254.08,
        "text": "into the water. The light touched the surface and danced like gold. The deep water below was full of life. Tiny fish",
        "textdich": ""
    },
    {
        "start": 1251.84,
        "end": 1262.159,
        "text": "swam near the boat. They moved like silver rain. He saw jellyfish with long purple threads. He saw flying fish jump",
        "textdich": ""
    },
    {
        "start": 1260.08,
        "end": 1271.52,
        "text": "and glide above the surface like little birds. He saw the thin yellow lines of saraso weed floating slowly past. These",
        "textdich": ""
    },
    {
        "start": 1268.799,
        "end": 1277.44,
        "text": "were all signs, signs that fish were near. The old man watched everything.",
        "textdich": ""
    },
    {
        "start": 1274.48,
        "end": 1286.32,
        "text": "The sea was talking and he listened. A bird flew above the boat, small and black. It looked down at the water. It",
        "textdich": ""
    },
    {
        "start": 1282.48,
        "end": 1290.159,
        "text": "circled and cried. The old man smiled.",
        "textdich": ""
    },
    {
        "start": 1286.32,
        "end": 1294.159,
        "text": "He said quietly, \"You're looking, too.",
        "textdich": ""
    },
    {
        "start": 1290.159,
        "end": 1304.559,
        "text": "You're hunting just like me. His hands touched the fishing lines. He checked them one by one. They were strong, clean, perfect. Each hook had been",
        "textdich": ""
    },
    {
        "start": 1301.919,
        "end": 1313.12,
        "text": "prepared with care. Each sardine was fresh and sweet. He had set four lines at four different depths. One line went",
        "textdich": ""
    },
    {
        "start": 1310.24,
        "end": 1321.84,
        "text": "deep. One stayed near the middle. Two were closer to the surface. He did not trust luck. He trusted preparation. The",
        "textdich": ""
    },
    {
        "start": 1318.799,
        "end": 1324.559,
        "text": "lines did not move yet, but he waited.",
        "textdich": ""
    },
    {
        "start": 1321.84,
        "end": 1334.799,
        "text": "He always waited. He did not rush the sea. The sea worked in her own time. He sat quietly in the boat. The sun rose",
        "textdich": ""
    },
    {
        "start": 1331.44,
        "end": 1341.679,
        "text": "higher. His face was warm. His eyes were narrow from the light. He did not mind.",
        "textdich": ""
    },
    {
        "start": 1338.32,
        "end": 1349.919,
        "text": "This was his world. The boat, the sun, the sky, the sea, and the dream of a fish.",
        "textdich": ""
    },
    {
        "start": 1347.28,
        "end": 1362.559,
        "text": "The hours passed. The boat floated gently. The lines hung still. Nothing pulled, but he was not sad. He was not bored. He looked out and smiled.",
        "textdich": ""
    },
    {
        "start": 1360.159,
        "end": 1377.12,
        "text": "It is only the beginning, he said softly. The fish will come. He drank some water from his bottle. He looked at the sky. The clouds were light. No",
        "textdich": ""
    },
    {
        "start": 1372.72,
        "end": 1382.08,
        "text": "storms, only wind, light, and the long day ahead.",
        "textdich": ""
    },
    {
        "start": 1379.039,
        "end": 1388.799,
        "text": "The boat moved with the current. The old man rode a little, just enough to keep the lines straight. He did not want the",
        "textdich": ""
    },
    {
        "start": 1386.159,
        "end": 1398.88,
        "text": "bait to move. He wanted the fish to find it, to think it was real. That was the secret, to wait, to be quiet, to not",
        "textdich": ""
    },
    {
        "start": 1394.88,
        "end": 1401.2,
        "text": "scare the sea. He watched the seabirds.",
        "textdich": ""
    },
    {
        "start": 1398.88,
        "end": 1408.88,
        "text": "They flew low. They looked for bait fish. He followed their path with his eyes. He saw them dive into the water.",
        "textdich": ""
    },
    {
        "start": 1406.48,
        "end": 1413.039,
        "text": "He watched the ripples. Sometimes a school of fish pushed to the surface.",
        "textdich": ""
    },
    {
        "start": 1410.96,
        "end": 1419.2,
        "text": "Sometimes a splash meant something big was below. The old man watched it all.",
        "textdich": ""
    },
    {
        "start": 1416.48,
        "end": 1429.44,
        "text": "He was like a part of the sea. A shadow on the water. A patient hunter. He said, \"Show yourself. I am ready.\" Still the",
        "textdich": ""
    },
    {
        "start": 1426.4,
        "end": 1441.679,
        "text": "lines did not move. Still the sea was silent. But the old man smiled. \"Maybe you are deep,\" he said. \"Maybe you are watching me, too. He remembered his",
        "textdich": ""
    },
    {
        "start": 1439.2,
        "end": 1449.6,
        "text": "younger days. He remembered the sound of the line pulling fast, the fight, the power, the fish that jumped into the",
        "textdich": ""
    },
    {
        "start": 1447.36,
        "end": 1462.799,
        "text": "air, the fish that pulled the boat for hours. He remembered the feel of the rope burning into his hands, the pain, the pride, the wind. He missed those",
        "textdich": ""
    },
    {
        "start": 1459.2,
        "end": 1472.72,
        "text": "days. But he was still here. Still strong enough to row, strong enough to hope. He had lost many things in life.",
        "textdich": ""
    },
    {
        "start": 1468.4,
        "end": 1482.72,
        "text": "Friends, money, time, but not this. Not the sea, and not the dream. That was still inside him, stronger than before.",
        "textdich": ""
    },
    {
        "start": 1479.6,
        "end": 1492.159,
        "text": "The sun was now high. The heat touched his skin. He took off his hat and wiped his forehead. He looked into the blue",
        "textdich": ""
    },
    {
        "start": 1487.679,
        "end": 1501.36,
        "text": "water again. It was calm, silent, full of mystery. He leaned over the side of the boat. He could see deep, very deep.",
        "textdich": ""
    },
    {
        "start": 1498.72,
        "end": 1508.08,
        "text": "The water changed from blue to purple to black. It felt like looking into space.",
        "textdich": ""
    },
    {
        "start": 1505.12,
        "end": 1522.24,
        "text": "\"You are beautiful,\" he whispered to the sea. \"And today you will give me something. I feel it.\" He sat again, quiet, ready. The boat rocked softly.",
        "textdich": ""
    },
    {
        "start": 1519.039,
        "end": 1532.799,
        "text": "The line stayed still. But the moment was close. He could feel it. He looked at the bird again. It flew far now into",
        "textdich": ""
    },
    {
        "start": 1528.48,
        "end": 1542.48,
        "text": "the sky. It was alone. Just like him. He watched it go. Just like him. He watched it go. Then he looked down again. His",
        "textdich": ""
    },
    {
        "start": 1539.76,
        "end": 1551.919,
        "text": "hands touched the lines. His eyes scanned the water, his heartbeat slow but strong. This was the deep blue sea.",
        "textdich": ""
    },
    {
        "start": 1549.279,
        "end": 1561.039,
        "text": "And this was his place. He was not afraid. He was not tired. He was one with the ocean. He did not need a crowd.",
        "textdich": ""
    },
    {
        "start": 1558.4,
        "end": 1569.039,
        "text": "He did not need applause. He only needed a fish. And the sea would give him one.",
        "textdich": ""
    },
    {
        "start": 1564.24,
        "end": 1573.679,
        "text": "One fish, one chance. That was enough.",
        "textdich": ""
    },
    {
        "start": 1569.039,
        "end": 1579.36,
        "text": "Chapter 5. The fish takes the bait. The sun was high now. The sea was shining.",
        "textdich": ""
    },
    {
        "start": 1576.4,
        "end": 1582.48,
        "text": "The water was flat. The sky was clean.",
        "textdich": ""
    },
    {
        "start": 1579.36,
        "end": 1590.88,
        "text": "The boat moved slowly with the wind. The old man sat quietly. He watched his lines. He checked them again and again.",
        "textdich": ""
    },
    {
        "start": 1588.48,
        "end": 1594.799,
        "text": "He touched them gently with his fingers.",
        "textdich": ""
    },
    {
        "start": 1590.88,
        "end": 1597.44,
        "text": "He waited. He was calm. He was patient.",
        "textdich": ""
    },
    {
        "start": 1594.799,
        "end": 1605.6,
        "text": "He was not thinking of food. He was not thinking of pain. He was thinking of the fish. Somewhere down there, deep under",
        "textdich": ""
    },
    {
        "start": 1602.799,
        "end": 1615.52,
        "text": "the boat, the fish was swimming. He did not know when. He did not know how, but he felt it. He felt that something big",
        "textdich": ""
    },
    {
        "start": 1612.0,
        "end": 1618.64,
        "text": "was near. He could feel it in the rope.",
        "textdich": ""
    },
    {
        "start": 1615.52,
        "end": 1622.4,
        "text": "He could feel it in the air. It was not noise.",
        "textdich": ""
    },
    {
        "start": 1620.159,
        "end": 1630.4,
        "text": "It was not movement. It was something else. A sense, a whisper from the sea.",
        "textdich": ""
    },
    {
        "start": 1627.36,
        "end": 1638.96,
        "text": "He said nothing, but inside he was awake, alive. Every part of him was ready.",
        "textdich": ""
    },
    {
        "start": 1635.679,
        "end": 1648.96,
        "text": "Then it happened. Just a small touch, very soft, on the line. The old man felt it with his fingers. It was not strong.",
        "textdich": ""
    },
    {
        "start": 1646.08,
        "end": 1655.36,
        "text": "It was not fast. Just a little change in the rope, like a breath, like a blink.",
        "textdich": ""
    },
    {
        "start": 1652.4,
        "end": 1658.48,
        "text": "He stopped moving. He held his hand still.",
        "textdich": ""
    },
    {
        "start": 1656.72,
        "end": 1661.279,
        "text": "He waited.",
        "textdich": ""
    },
    {
        "start": 1658.48,
        "end": 1672.48,
        "text": "His eyes looked at the water. Nothing moved, but the feelings stayed. Then it came again. A soft pull. The line moved",
        "textdich": ""
    },
    {
        "start": 1669.039,
        "end": 1678.559,
        "text": "a little. Then it stopped. Then it moved again. The old man smiled.",
        "textdich": ""
    },
    {
        "start": 1676.24,
        "end": 1690.88,
        "text": "But he did not speak. He had seen this before. The fish was near. It was smelling the bait. It was touching it gently. It was not sure yet. The old man",
        "textdich": ""
    },
    {
        "start": 1687.2,
        "end": 1699.84,
        "text": "said in a quiet voice, \"Come, fish. Take your time. I have waited many days. I can wait some more.\" The fish did not",
        "textdich": ""
    },
    {
        "start": 1696.799,
        "end": 1703.039,
        "text": "take it yet. It was smart. It was big.",
        "textdich": ""
    },
    {
        "start": 1699.84,
        "end": 1713.679,
        "text": "It was strong. It was careful. The old man felt another soft pull, a second, a third. The fish was tasting the sardines. It was near the hook, but it",
        "textdich": ""
    },
    {
        "start": 1711.279,
        "end": 1726.24,
        "text": "was slow. The old man's fingers were like soft feathers. He let the line move. He did not pull. He did not show tension. He let the fish feel nothing.",
        "textdich": ""
    },
    {
        "start": 1722.96,
        "end": 1732.0,
        "text": "No fear, no weight. Just sweet, soft bait floating in the deep blue water.",
        "textdich": ""
    },
    {
        "start": 1728.96,
        "end": 1741.039,
        "text": "The fish circled the bait again. The old man whispered, \"Eat it, my friend. Eat it all. Take the whole thing. Then I",
        "textdich": ""
    },
    {
        "start": 1738.96,
        "end": 1748.88,
        "text": "will know you and you will know me.\" And then it happened. The fish took the bait. The line moved faster now, but the",
        "textdich": ""
    },
    {
        "start": 1745.919,
        "end": 1759.919,
        "text": "old man still held it soft. He let it slide through his fingers. He let the fish swim with it. He did not pull. He did not shout. He did not fight. Not",
        "textdich": ""
    },
    {
        "start": 1756.24,
        "end": 1767.52,
        "text": "yet. The fish swam deep, very deep. It did not rush. It was not afraid. It took the bait sideways in its mouth. The old",
        "textdich": ""
    },
    {
        "start": 1765.2,
        "end": 1777.44,
        "text": "man knew this moment. He had lived it many times in the past, but this time it was different. This fish was bigger.",
        "textdich": ""
    },
    {
        "start": 1774.0,
        "end": 1782.559,
        "text": "This fish was older. This fish was stronger.",
        "textdich": ""
    },
    {
        "start": 1778.96,
        "end": 1788.64,
        "text": "And this fish was his test, his chance, his mountain to climb.",
        "textdich": ""
    },
    {
        "start": 1785.12,
        "end": 1798.08,
        "text": "The old man let the line go. Slowly, carefully, it slipped between his thumb and finger. The fish swam deeper. The boat rocked a little. The water",
        "textdich": ""
    },
    {
        "start": 1795.679,
        "end": 1810.08,
        "text": "whispered under the sun. The old man reached for the reserve coils. He tied them together. He checked the knots. He breathed slowly. He said, \"Not yet.",
        "textdich": ""
    },
    {
        "start": 1806.799,
        "end": 1818.96,
        "text": "Wait. Let him eat it well.\" The fish slowed down. The line was tight now, but not too tight. The old man knew the",
        "textdich": ""
    },
    {
        "start": 1816.48,
        "end": 1827.919,
        "text": "right moment. He had missed it before, but not today. Today he would be perfect. He would not be early. He would",
        "textdich": ""
    },
    {
        "start": 1824.64,
        "end": 1833.679,
        "text": "not be late. He would be exact. Then the line pulled hard, strong, deep, heavy.",
        "textdich": ""
    },
    {
        "start": 1831.84,
        "end": 1842.32,
        "text": "The fish was swimming with the bait in its mouth. The fish was his now. The old man pulled back with both hands. He",
        "textdich": ""
    },
    {
        "start": 1839.84,
        "end": 1851.44,
        "text": "stood up and used all his strength. He pulled hard, once, twice, again. The rope burned his hands. The boat jumped.",
        "textdich": ""
    },
    {
        "start": 1848.96,
        "end": 1860.159,
        "text": "The sea splashed. The line went tight like a wire. The fight began. The old man shouted, \"Now we start.\" The boat",
        "textdich": ""
    },
    {
        "start": 1857.279,
        "end": 1863.2,
        "text": "moved. The fish pulled. It did not jump.",
        "textdich": ""
    },
    {
        "start": 1860.159,
        "end": 1873.2,
        "text": "It did not rush. It just pulled deep, heavy. The boat moved with it. Slowly out to sea, far from the shore. The old",
        "textdich": ""
    },
    {
        "start": 1869.84,
        "end": 1876.48,
        "text": "man leaned back. He let the fish pull.",
        "textdich": ""
    },
    {
        "start": 1873.2,
        "end": 1885.919,
        "text": "He did not try to stop it. Not yet. He needed time. He needed to understand this fish. The line cut into his back.",
        "textdich": ""
    },
    {
        "start": 1882.32,
        "end": 1896.559,
        "text": "His hands were red, but he smiled. \"You are big,\" he said. \"You are strong, but so am I.\" The boat moved farther. The",
        "textdich": ""
    },
    {
        "start": 1893.2,
        "end": 1899.519,
        "text": "sun dropped lower. The sky turned gold.",
        "textdich": ""
    },
    {
        "start": 1896.559,
        "end": 1909.2,
        "text": "The sea was quiet. But the line was tight. The fish was still pulling. The old man braced his body. His arms shook.",
        "textdich": ""
    },
    {
        "start": 1905.519,
        "end": 1923.12,
        "text": "His back hurt. But he held on. I will not let go, he whispered. No matter how far you go. Chapter 6. Pulled by a giant. The fish was not small. It was",
        "textdich": ""
    },
    {
        "start": 1919.519,
        "end": 1928.72,
        "text": "not weak. It was a giant. The old man knew it now. This was no ordinary catch.",
        "textdich": ""
    },
    {
        "start": 1926.32,
        "end": 1934.88,
        "text": "This fish was a fighter. This fish was full of strength. It pulled and pulled.",
        "textdich": ""
    },
    {
        "start": 1931.76,
        "end": 1943.679,
        "text": "The line was tight like steel. The old man sat low in the boat. His hands held the line. His back leaned against the",
        "textdich": ""
    },
    {
        "start": 1940.32,
        "end": 1953.12,
        "text": "wood. He could not rest. He could not move much. His arms were tired. But he did not give up. The fish was pulling",
        "textdich": ""
    },
    {
        "start": 1949.84,
        "end": 1963.76,
        "text": "him into the deep sea, far from land, far from help. But he did not fear. He smiled to himself. \"If you want to pull,",
        "textdich": ""
    },
    {
        "start": 1960.24,
        "end": 1972.399,
        "text": "then pull,\" he said softly. \"I will go with you wherever you take me. I will not stop.",
        "textdich": ""
    },
    {
        "start": 1968.48,
        "end": 1984.559,
        "text": "The boat moved slowly, very slowly, over the wide blue water. The sun was still in the sky. The wind was soft, but inside there was a storm. A storm of",
        "textdich": ""
    },
    {
        "start": 1981.44,
        "end": 1993.679,
        "text": "strength, a storm of silence, a storm between the man and the fish. The fish did not jump. It did not shake the line.",
        "textdich": ""
    },
    {
        "start": 1990.559,
        "end": 2001.44,
        "text": "It just swam deep. It pulled with power, with patience, like a big boat under the sea. The old man felt it in his bones.",
        "textdich": ""
    },
    {
        "start": 1999.44,
        "end": 2010.08,
        "text": "This fish was smart. This fish was careful. It did not waste energy. It did not play. It just moved forward farther",
        "textdich": ""
    },
    {
        "start": 2006.559,
        "end": 2025.44,
        "text": "and farther. You are like me, said the old man. You do not fight fast. You fight slow. You use time. You use silence. He liked the fish. He respected",
        "textdich": ""
    },
    {
        "start": 2021.6,
        "end": 2034.48,
        "text": "it. It was an equal, a worthy enemy and also a friend. Yes, a friend. Because in this great sea, only the two of them",
        "textdich": ""
    },
    {
        "start": 2031.12,
        "end": 2044.64,
        "text": "were alive in this fight alone. No one else. Just the man, the fish, and the ocean around them. His hands hurt. The",
        "textdich": ""
    },
    {
        "start": 2041.84,
        "end": 2047.2,
        "text": "rope had made small cuts in his skin.",
        "textdich": ""
    },
    {
        "start": 2044.64,
        "end": 2060.72,
        "text": "Blood came out. The salt water touched the wounds. It stung. But he did not cry. He did not complain. He had seen worse. He had felt worse. This was",
        "textdich": ""
    },
    {
        "start": 2056.8,
        "end": 2063.2,
        "text": "nothing. This was part of the journey.",
        "textdich": ""
    },
    {
        "start": 2060.72,
        "end": 2072.8,
        "text": "He moved the rope slowly, carefully to another part of his hand. He shifted his body. He breathed. He had to save",
        "textdich": ""
    },
    {
        "start": 2069.359,
        "end": 2080.879,
        "text": "energy. He had to think clear. He had to be ready because the real fight was not just in the arms. It was in the heart.",
        "textdich": ""
    },
    {
        "start": 2078.48,
        "end": 2091.119,
        "text": "It was in the mind. The one who stayed calm would win. The one who stayed awake, who stayed smart, who stayed focused, that one would win. And he",
        "textdich": ""
    },
    {
        "start": 2088.48,
        "end": 2100.32,
        "text": "wanted to win. Not just for food, not just for the fish, but for himself, for the boy, for the dream.",
        "textdich": ""
    },
    {
        "start": 2097.119,
        "end": 2112.16,
        "text": "Hours passed. The boat was now far from land. The old man looked back. He saw nothing, only water. only waves. The",
        "textdich": ""
    },
    {
        "start": 2108.64,
        "end": 2122.079,
        "text": "land was gone, but he felt no fear. He felt peace. He whispered, \"I've gone too far before. I will return again.\" He",
        "textdich": ""
    },
    {
        "start": 2118.88,
        "end": 2125.359,
        "text": "looked at the sky. The clouds were soft.",
        "textdich": ""
    },
    {
        "start": 2122.079,
        "end": 2127.839,
        "text": "The sun was low. The evening was near.",
        "textdich": ""
    },
    {
        "start": 2125.359,
        "end": 2137.359,
        "text": "But the fish kept swimming, and the old man kept holding. The sea was quiet. The boat was small. But the fight was great.",
        "textdich": ""
    },
    {
        "start": 2134.8,
        "end": 2146.56,
        "text": "Bigger than most men ever know. Bigger than a story. Bigger than a day. This was the kind of fight that changes you.",
        "textdich": ""
    },
    {
        "start": 2143.599,
        "end": 2154.64,
        "text": "He remembered other fights long ago when he was young, when he was strong. He remembered a contest in a cafe, a hand",
        "textdich": ""
    },
    {
        "start": 2151.839,
        "end": 2163.52,
        "text": "wrestling match. It lasted one full day all night until morning. People watched, people cheered, but he said nothing. He",
        "textdich": ""
    },
    {
        "start": 2160.72,
        "end": 2177.839,
        "text": "just held the hand of the other man. He did not move. He did not blink. He waited. And in the end, the other man gave up. He won. Not with fast moves,",
        "textdich": ""
    },
    {
        "start": 2174.079,
        "end": 2180.48,
        "text": "not with noise, but with quiet power.",
        "textdich": ""
    },
    {
        "start": 2177.839,
        "end": 2190.24,
        "text": "This was the same. This was that fight again. But now his opponent was the sea and the fish.",
        "textdich": ""
    },
    {
        "start": 2186.96,
        "end": 2201.44,
        "text": "The stars began to shine. The sky turned dark. The moon came slowly. The old man was tired. But he did not sleep. He",
        "textdich": ""
    },
    {
        "start": 2198.16,
        "end": 2210.72,
        "text": "could not. The rope was in his hand. If he slept, he might lose it. And if he lost the line, he lost the fish. And if",
        "textdich": ""
    },
    {
        "start": 2207.599,
        "end": 2219.44,
        "text": "he lost the fish, he lost everything. So he stayed awake. He drank water. He chewed a little piece of tuna. It was",
        "textdich": ""
    },
    {
        "start": 2216.48,
        "end": 2230.32,
        "text": "not much, but it helped. He talked to himself. He whispered to the fish. You are strong, he said. But I will hold. I",
        "textdich": ""
    },
    {
        "start": 2226.32,
        "end": 2238.88,
        "text": "am old. Yes, but I am not finished. The boat moved in the night. The fish swam deep. The rope stayed tight. The sea was",
        "textdich": ""
    },
    {
        "start": 2236.079,
        "end": 2249.2,
        "text": "black now, silent, full of stars above and darkness below. But still, the old man did not let go. He smiled in the",
        "textdich": ""
    },
    {
        "start": 2244.8,
        "end": 2258.48,
        "text": "dark. He whispered, \"We are one now. You pull, I hold. We are together in this dance.\" His back was tired, his legs",
        "textdich": ""
    },
    {
        "start": 2256.16,
        "end": 2267.44,
        "text": "were stiff, his arms were shaking, but his mind was clear. His heart was calm, his spirit was awake. This was his",
        "textdich": ""
    },
    {
        "start": 2264.24,
        "end": 2276.64,
        "text": "mountain. This was his test. And he was ready for more. Chapter 7. Alone with the ocean night had come. The sea was",
        "textdich": ""
    },
    {
        "start": 2273.76,
        "end": 2284.88,
        "text": "black. The stars were shining. The moon was soft in the sky. The old man sat alone in his small boat. The rope was",
        "textdich": ""
    },
    {
        "start": 2282.48,
        "end": 2290.16,
        "text": "still tight in his hand. The fish was still pulling slowly in the deep water.",
        "textdich": ""
    },
    {
        "start": 2287.599,
        "end": 2301.359,
        "text": "The boat moved little by little. There was no sound but the sea. No voice, no bird, only the wind and the quiet rhythm",
        "textdich": ""
    },
    {
        "start": 2297.28,
        "end": 2312.56,
        "text": "of the waves. He was tired, but he was not done. He was hurting, but he was not broken. His hands were cut. His arms",
        "textdich": ""
    },
    {
        "start": 2309.119,
        "end": 2320.88,
        "text": "were stiff. His back was sore, but he held the rope with care. He talked to the fish in his heart. He said, \"I am",
        "textdich": ""
    },
    {
        "start": 2318.32,
        "end": 2328.16,
        "text": "still with you, big one. I am not going anywhere. I will stay with you. I am your brother and we are not finished.",
        "textdich": ""
    },
    {
        "start": 2326.56,
        "end": 2341.28,
        "text": "The old man had been awake since morning. Now it was deep night. He had not slept. He had not rested. But he did not feel lonely. He did not feel fear.",
        "textdich": ""
    },
    {
        "start": 2338.32,
        "end": 2347.04,
        "text": "He had the sea with him. The stars were above him. The great fish was under him.",
        "textdich": ""
    },
    {
        "start": 2344.8,
        "end": 2359.28,
        "text": "He was not alone. He was part of something big. The world was quiet. But his mind was full. He thought about the boy. He saw his face. He heard his",
        "textdich": ""
    },
    {
        "start": 2356.48,
        "end": 2373.359,
        "text": "voice. The boy would be worried. But the old man could not stop now. He whispered, \"Don't worry, boy. I am still strong. I will come back. I will not",
        "textdich": ""
    },
    {
        "start": 2369.119,
        "end": 2381.839,
        "text": "lose this fish. I will not lose myself.\" He looked at the stars again. He knew the stars. They were old friends. He had",
        "textdich": ""
    },
    {
        "start": 2379.2,
        "end": 2388.56,
        "text": "watched them all his life. They helped him find his way. They helped him dream.",
        "textdich": ""
    },
    {
        "start": 2385.44,
        "end": 2400.8,
        "text": "He thought, \"The fish is under me. The stars are above me, and I am in the middle. I am the line between the sea and the sky.\" He smiled. His smile was",
        "textdich": ""
    },
    {
        "start": 2397.52,
        "end": 2408.64,
        "text": "tired, but real. He had nothing but his boat, his line, his hands, and his will.",
        "textdich": ""
    },
    {
        "start": 2405.359,
        "end": 2416.48,
        "text": "But it was enough. He was enough. He had learned to live with little. He had learned to be strong in silence. And",
        "textdich": ""
    },
    {
        "start": 2413.68,
        "end": 2426.64,
        "text": "now, in this long night, his spirit was like the ocean, wide, deep, still, and powerful. His hands were shaking now.",
        "textdich": ""
    },
    {
        "start": 2423.839,
        "end": 2436.32,
        "text": "His right hand was cramped. The fingers were tight and cold. He could not open them. He held the rope with his left",
        "textdich": ""
    },
    {
        "start": 2432.0,
        "end": 2445.839,
        "text": "hand. Now he said, \"Hand, open up. We need to work. Don't fail me now. He breathed slowly. He moved his hand again",
        "textdich": ""
    },
    {
        "start": 2442.4,
        "end": 2454.72,
        "text": "and again. It hurt, but little by little the pain passed. The fingers moved. He smiled again.",
        "textdich": ""
    },
    {
        "start": 2451.76,
        "end": 2465.52,
        "text": "You see, he said to himself, \"The body listens when the heart is strong.\" Then he felt the fish pull again. Not fast,",
        "textdich": ""
    },
    {
        "start": 2460.48,
        "end": 2475.599,
        "text": "not wild, just deep, strong, quiet. The fish was still full of life. The old man said, \"You were brave. You were smart.",
        "textdich": ""
    },
    {
        "start": 2473.04,
        "end": 2483.839,
        "text": "But I am old and I know things. I know how to wait. I know how to fight without noise.\" He ate a small piece of tuna,",
        "textdich": ""
    },
    {
        "start": 2480.96,
        "end": 2497.599,
        "text": "just enough to keep going. He drank a little water. His mouth was dry. His stomach was empty, but his soul was full. He looked at the sea. It was dark",
        "textdich": ""
    },
    {
        "start": 2493.119,
        "end": 2500.96,
        "text": "and wide. It had no end. It had no name.",
        "textdich": ""
    },
    {
        "start": 2497.599,
        "end": 2512.48,
        "text": "But he felt peace in it. He loved the sea. It was his home. It had taken things from him, but it had also given him everything.",
        "textdich": ""
    },
    {
        "start": 2508.8,
        "end": 2526.48,
        "text": "He said, \"You are a wild sister, sometimes kind, sometimes cruel. But I love you, and I will not leave you.\" The fish pulled again. A strong pull. It",
        "textdich": ""
    },
    {
        "start": 2523.52,
        "end": 2536.96,
        "text": "hurt his back, but the old man held the line. His body shook, but his eyes were clear. He talked to the fish. You do not",
        "textdich": ""
    },
    {
        "start": 2533.359,
        "end": 2546.4,
        "text": "want to die. I understand. I do not want to lose. We are the same. You are in the water. I am in the boat. But we are both",
        "textdich": ""
    },
    {
        "start": 2542.88,
        "end": 2554.96,
        "text": "alive. We are both proud. This is our story. Then he remembered something. A time when he was young. He was a strong",
        "textdich": ""
    },
    {
        "start": 2552.4,
        "end": 2569.2,
        "text": "man. He had fought in a big game of hand wrestling. Many men watched. He was quiet. His enemy was strong. But the old man, young then, did not stop. He",
        "textdich": ""
    },
    {
        "start": 2564.16,
        "end": 2577.04,
        "text": "waited. He watched. He held. He won. He had not forgotten that strength. It was still in him. Maybe slower, maybe",
        "textdich": ""
    },
    {
        "start": 2574.0,
        "end": 2586.48,
        "text": "smaller, but it was there. The sky began to change. A new light was coming. The stars faded. The sea turned gray. The",
        "textdich": ""
    },
    {
        "start": 2583.359,
        "end": 2589.92,
        "text": "night was ending. Morning was near.",
        "textdich": ""
    },
    {
        "start": 2586.48,
        "end": 2598.319,
        "text": "Another day. The old man whispered. You are still pulling my fish. You did not stop. I respect you. But the sun is",
        "textdich": ""
    },
    {
        "start": 2595.359,
        "end": 2601.52,
        "text": "coming and soon we will see each other.",
        "textdich": ""
    },
    {
        "start": 2598.319,
        "end": 2614.0,
        "text": "Then one of us will win. He tied the rope carefully. He looked at the horizon. He stretched his legs. He closed his eyes for a second. Just a",
        "textdich": ""
    },
    {
        "start": 2610.4,
        "end": 2624.64,
        "text": "second. He breathed. Then he opened his eyes again. Wide, awake, ready. This was not just a fight for a fish. It was a",
        "textdich": ""
    },
    {
        "start": 2620.96,
        "end": 2631.76,
        "text": "fight for his soul. And he was not giving up. Chapter 8. A battle of will.",
        "textdich": ""
    },
    {
        "start": 2629.76,
        "end": 2639.52,
        "text": "It was not the same strength of a young man. It was not fast or full of fire. It was quiet.",
        "textdich": ""
    },
    {
        "start": 2636.96,
        "end": 2647.52,
        "text": "It was deep. It was the kind of strength that is born from pain. The kind that comes only after you've lost many",
        "textdich": ""
    },
    {
        "start": 2644.0,
        "end": 2650.0,
        "text": "things, but still choose to fight again.",
        "textdich": ""
    },
    {
        "start": 2647.52,
        "end": 2655.52,
        "text": "That morning, the old man was no longer just a fisherman. He was something else.",
        "textdich": ""
    },
    {
        "start": 2652.8,
        "end": 2666.56,
        "text": "A man holding on to the last part of his pride. A man facing a giant alone in the sea. He looked at the sky. He looked at",
        "textdich": ""
    },
    {
        "start": 2663.119,
        "end": 2677.839,
        "text": "his hands. he whispered. \"This is a battle of will. I do not need to be the strongest. I only need to last longer.\" The fish had not jumped. It had not",
        "textdich": ""
    },
    {
        "start": 2675.28,
        "end": 2688.24,
        "text": "tried to escape. It just kept pulling, pulling slow, pulling steady. It was testing him. It was waiting. The old man",
        "textdich": ""
    },
    {
        "start": 2684.319,
        "end": 2698.8,
        "text": "knew it. He respected it. \"You are like me,\" he said to the fish. \"You wait. You endure. You are not wild, you are wise.",
        "textdich": ""
    },
    {
        "start": 2696.16,
        "end": 2712.16,
        "text": "The rope cut deeper into his skin. His fingers were numb. His left hand was cramped again. It was closed like a rock. He hid it against his knee.",
        "textdich": ""
    },
    {
        "start": 2707.2,
        "end": 2725.52,
        "text": "Slowly, again, and again. He breathed in, breathed out slowly. He did not scream. He did not curse. He knew the pain. It was his old friend, a friend",
        "textdich": ""
    },
    {
        "start": 2723.2,
        "end": 2737.359,
        "text": "that always comes when you do something great. He looked down at the sea. He said, \"Pain is nothing. I can feel pain.",
        "textdich": ""
    },
    {
        "start": 2733.76,
        "end": 2743.68,
        "text": "But I will not stop. Not today.\" The boat drifted farther into the deep.",
        "textdich": ""
    },
    {
        "start": 2740.48,
        "end": 2754.0,
        "text": "He could not see land, only water and sky. The fish had led him far, and still it swam, still it pulled. The old man",
        "textdich": ""
    },
    {
        "start": 2751.359,
        "end": 2762.0,
        "text": "laughed softly. \"You are strong,\" he said. \"Maybe stronger than me, but I am not finished.\" He remembered something",
        "textdich": ""
    },
    {
        "start": 2759.04,
        "end": 2774.48,
        "text": "from his past. A mountain he climbed alone with no guide. The way was long, his legs hurt, the sun was hot, but he kept going, step by step. Even when",
        "textdich": ""
    },
    {
        "start": 2772.0,
        "end": 2777.2,
        "text": "others had turned back, he had climbed.",
        "textdich": ""
    },
    {
        "start": 2774.48,
        "end": 2787.119,
        "text": "And at the top he saw the world, the sea, the sky, the hills. It was quiet up there, beautiful, peaceful. That day he",
        "textdich": ""
    },
    {
        "start": 2784.319,
        "end": 2797.68,
        "text": "had cried. Not from weakness, from something else, something deeper. He remembered that feeling now. He was not crying, but something in his chest felt",
        "textdich": ""
    },
    {
        "start": 2795.28,
        "end": 2806.319,
        "text": "full. Something in him was remembering who he really was. The fish made a sudden move. Not fast, just stronger. A",
        "textdich": ""
    },
    {
        "start": 2804.079,
        "end": 2814.16,
        "text": "pull that made the boat shift. The rope pulled hard against his chest. The old man's neck bent. His back shook. He",
        "textdich": ""
    },
    {
        "start": 2811.2,
        "end": 2823.839,
        "text": "almost fell, but he stayed up. He held the rope. His knees bent. His feet were firm. He whispered, \"You will not win",
        "textdich": ""
    },
    {
        "start": 2820.64,
        "end": 2832.48,
        "text": "like that. I have waited too long. I have come too far. I have nothing left to lose.\" His voice was soft but full of",
        "textdich": ""
    },
    {
        "start": 2829.52,
        "end": 2841.839,
        "text": "power. His arms were shaking but his eyes were sharp. He was not angry. He was not afraid. He was ready. He was",
        "textdich": ""
    },
    {
        "start": 2838.72,
        "end": 2852.48,
        "text": "more than ready. He was inside the fight now. Body and mind, flesh and spirit. He thought about the boy again. The boy",
        "textdich": ""
    },
    {
        "start": 2849.76,
        "end": 2860.72,
        "text": "would be waiting, watching the sea, hoping the old man would come back. He would cry if he saw the old man's hands,",
        "textdich": ""
    },
    {
        "start": 2857.52,
        "end": 2863.2,
        "text": "if he saw the blood, if he saw the cuts.",
        "textdich": ""
    },
    {
        "start": 2860.72,
        "end": 2873.599,
        "text": "But he would understand. He would know this was not just fishing. This was about something more. This was about showing the sea and himself. That he",
        "textdich": ""
    },
    {
        "start": 2871.28,
        "end": 2879.44,
        "text": "still mattered. That he still had something strong inside.",
        "textdich": ""
    },
    {
        "start": 2876.319,
        "end": 2889.76,
        "text": "Boy, he whispered, \"I am fighting for us. Not just for the fish, not just for food, but for belief, for memory, for",
        "textdich": ""
    },
    {
        "start": 2886.48,
        "end": 2901.76,
        "text": "the story of who I am. The fish moved again. It was getting tired, too. The old man felt it. The line was not pulling as deep. The movement was",
        "textdich": ""
    },
    {
        "start": 2897.68,
        "end": 2904.64,
        "text": "smaller, slower. He knew what it meant.",
        "textdich": ""
    },
    {
        "start": 2901.76,
        "end": 2917.44,
        "text": "The fish had fought for hours, maybe longer. Now it was near the end, but it would not give up easily. Just like him, the fight was not over. Not yet.",
        "textdich": ""
    },
    {
        "start": 2915.28,
        "end": 2930.0,
        "text": "The old man sat straighter. He rolled his shoulders. He breathed deep. The pain in his hand was sharp, but his heart was calm. He said, \"Let's see who",
        "textdich": ""
    },
    {
        "start": 2925.839,
        "end": 2943.04,
        "text": "breaks first, you or me.\" The sun rose higher. The sea shimmerred. The boat floated gently. The line was still tight. The old man, now shaking, now",
        "textdich": ""
    },
    {
        "start": 2939.44,
        "end": 2954.24,
        "text": "quiet, was ready. The fish was somewhere deep, tired, but still pulling. And the ocean, wide, endless, watched them both.",
        "textdich": ""
    },
    {
        "start": 2950.319,
        "end": 2964.88,
        "text": "Two living things, two souls. One fight, no noise, no crowd, just a line, a man, and a fish in a silent war of willpower.",
        "textdich": ""
    },
    {
        "start": 2962.64,
        "end": 2968.16,
        "text": "Chapter nine.",
        "textdich": ""
    },
    {
        "start": 2964.88,
        "end": 2976.24,
        "text": "The fish jumps. The line was soft and slow as the fish swam deep under the water. The old man was tired. His bones",
        "textdich": ""
    },
    {
        "start": 2973.2,
        "end": 2986.48,
        "text": "achd. His muscles were weak. But he was not done. He was still strong inside. He had not come this far to give up. He",
        "textdich": ""
    },
    {
        "start": 2982.96,
        "end": 2989.04,
        "text": "looked at the sky. He looked at the sea.",
        "textdich": ""
    },
    {
        "start": 2986.48,
        "end": 2995.839,
        "text": "He looked at his hands. he whispered.",
        "textdich": ""
    },
    {
        "start": 2991.359,
        "end": 2998.4,
        "text": "Soon something is coming. I can feel it.",
        "textdich": ""
    },
    {
        "start": 2995.839,
        "end": 3007.04,
        "text": "His heart beats slower now, but each beat was full of purpose. He felt close to something great. He did not know if",
        "textdich": ""
    },
    {
        "start": 3004.24,
        "end": 3018.72,
        "text": "he would win, but he knew it would be beautiful. Then it happened. The rope pulled harder, not fast, but deep. It was like a breath under the sea, a",
        "textdich": ""
    },
    {
        "start": 3015.359,
        "end": 3022.559,
        "text": "breath full of power. The boat moved.",
        "textdich": ""
    },
    {
        "start": 3018.72,
        "end": 3034.0,
        "text": "The line sang. The old man stood. His legs shook. His arms tensed. The fish was rising. He could feel it. He whispered, \"Come up. Let me see you.\"",
        "textdich": ""
    },
    {
        "start": 3031.68,
        "end": 3043.52,
        "text": "And then, for the first time, the fish came out of the water. It rose slowly, gracefully, like a shadow from another",
        "textdich": ""
    },
    {
        "start": 3039.76,
        "end": 3054.88,
        "text": "world. The fish was giant, long, and silver. Its body was taller than the boat. Its tail splashed the sea. Its head was strong. Its eyes were dark. The",
        "textdich": ""
    },
    {
        "start": 3052.319,
        "end": 3058.0,
        "text": "water flew around it like a fountain.",
        "textdich": ""
    },
    {
        "start": 3054.88,
        "end": 3067.68,
        "text": "The sun hid its skin. And it shined like a sword. The old man saw it all. He did not speak. He just looked. It was",
        "textdich": ""
    },
    {
        "start": 3065.28,
        "end": 3073.04,
        "text": "beautiful. It was the biggest fish he had ever seen. Bigger than his dreams.",
        "textdich": ""
    },
    {
        "start": 3070.72,
        "end": 3086.0,
        "text": "Bigger than his fear. It was like looking at a king. The fish went back down. The splash was soft but deep. The sea swallowed it again. The line sang.",
        "textdich": ""
    },
    {
        "start": 3082.96,
        "end": 3096.96,
        "text": "The old man stood. He could feel it. It was like a breath under the sea. A breath full of power. It was like a breath under the sea. It was silent. It",
        "textdich": ""
    },
    {
        "start": 3094.16,
        "end": 3106.559,
        "text": "was honest. It did not pull in panic. It did not run in fear. It fought with grace. It fought with dignity. And that",
        "textdich": ""
    },
    {
        "start": 3102.24,
        "end": 3108.64,
        "text": "made the old man feel love. Yes, love.",
        "textdich": ""
    },
    {
        "start": 3106.559,
        "end": 3114.0,
        "text": "Not the love of family, not the love of a woman, but the deep love of respect.",
        "textdich": ""
    },
    {
        "start": 3111.92,
        "end": 3123.52,
        "text": "The kind of love you feel when you see truth. The kind of love that makes you cry without tears. He whispered again,",
        "textdich": ""
    },
    {
        "start": 3119.92,
        "end": 3126.4,
        "text": "\"We are not enemies. We are brothers.",
        "textdich": ""
    },
    {
        "start": 3123.52,
        "end": 3137.52,
        "text": "But one of us must die.\" The words hurt, but they were true. He did not want to kill the fish, but he had to. Not for glory, not for money,",
        "textdich": ""
    },
    {
        "start": 3134.48,
        "end": 3144.88,
        "text": "but because it was the way. The old man was a fisherman. The fish was his test.",
        "textdich": ""
    },
    {
        "start": 3142.0,
        "end": 3156.319,
        "text": "This was the life he had chosen. He looked at the sea again. The water was calm, but his heart was not. It beat with fire now, not the fire of anger,",
        "textdich": ""
    },
    {
        "start": 3153.44,
        "end": 3165.2,
        "text": "but the fire of purpose. He reached for his harpoon. It was old like him, but still sharp, still ready. He held it",
        "textdich": ""
    },
    {
        "start": 3162.559,
        "end": 3175.28,
        "text": "tight. He looked at the rope. He watched for signs. The fish was deeper now, resting, waiting. The old man knew it would rise again. Maybe not now, but",
        "textdich": ""
    },
    {
        "start": 3173.04,
        "end": 3186.8,
        "text": "soon. And when it did, he would be ready. His arms hurt. His back hurt. But his eyes were clear. His soul was calm.",
        "textdich": ""
    },
    {
        "start": 3183.68,
        "end": 3189.68,
        "text": "He whispered, \"Come back, my friend.",
        "textdich": ""
    },
    {
        "start": 3186.8,
        "end": 3196.48,
        "text": "Show yourself again. The boat rocked gently. The sun moved slowly in the sky.",
        "textdich": ""
    },
    {
        "start": 3193.28,
        "end": 3205.92,
        "text": "Time was quiet. The sea was deep. The fish was under him. The harpoon was in his hand. The old man was alone, but not",
        "textdich": ""
    },
    {
        "start": 3202.319,
        "end": 3212.64,
        "text": "afraid. He was tired, but not broken. He was at the edge of something. He did not know how the story would end, but he",
        "textdich": ""
    },
    {
        "start": 3210.4,
        "end": 3222.48,
        "text": "knew one thing. He would fight with honor, and whatever happened, he would be proud. Not proud of the catch. Not proud of the win. But proud of the",
        "textdich": ""
    },
    {
        "start": 3220.0,
        "end": 3235.839,
        "text": "fight. Proud of staying when others would leave. Proud of holding when it hurt. Proud of rising when the soul said, \"You can't.\" That was his victory.",
        "textdich": ""
    },
    {
        "start": 3232.4,
        "end": 3244.48,
        "text": "Chapter 10. A strike of strength. The sea was still for a while. The old man sat quietly in his small boat. The rope",
        "textdich": ""
    },
    {
        "start": 3241.28,
        "end": 3254.079,
        "text": "was in his hands. The line pulled softly now. The fish was tired, but it was not done. And the old man was tired, too.",
        "textdich": ""
    },
    {
        "start": 3251.599,
        "end": 3260.0,
        "text": "His body was not young anymore. His muscles were slow. His hands were hurt.",
        "textdich": ""
    },
    {
        "start": 3257.2,
        "end": 3266.48,
        "text": "His eyes burned from the sun. But inside, he was ready. He was waiting.",
        "textdich": ""
    },
    {
        "start": 3263.44,
        "end": 3275.119,
        "text": "The harpoon was near him, sharp, cold, simple. It was not a machine. It was not special. But in this quiet boat, it was",
        "textdich": ""
    },
    {
        "start": 3272.96,
        "end": 3283.92,
        "text": "everything. It was the one thing that could end this long fight. The one thing that could bring the fish into the",
        "textdich": ""
    },
    {
        "start": 3279.599,
        "end": 3293.119,
        "text": "light. The old man breathed slowly. He whispered, \"Be strong now. Just once more. Just one true strike.\" He thought",
        "textdich": ""
    },
    {
        "start": 3291.04,
        "end": 3303.44,
        "text": "of everything he had been through. He had left the shore many hours ago, maybe more than a day, maybe two. He didn't know anymore.",
        "textdich": ""
    },
    {
        "start": 3300.48,
        "end": 3316.96,
        "text": "Time felt strange now. The sea had become his world. The fish had become his partner, his enemy, his test, his mirror. They had danced together, pulled",
        "textdich": ""
    },
    {
        "start": 3313.2,
        "end": 3325.68,
        "text": "each other, waited together, and now this long dance was coming to its final moment. The old man felt it. The fish",
        "textdich": ""
    },
    {
        "start": 3322.8,
        "end": 3334.319,
        "text": "was rising. It had no more tricks. It had no more strength. It was close now, almost too close. The line moved in",
        "textdich": ""
    },
    {
        "start": 3331.119,
        "end": 3337.04,
        "text": "small circles. The boat turned slowly.",
        "textdich": ""
    },
    {
        "start": 3334.319,
        "end": 3340.72,
        "text": "The fish was swimming around the boat.",
        "textdich": ""
    },
    {
        "start": 3337.04,
        "end": 3346.8,
        "text": "One last circle. One last goodbye. The old man stood up slowly. His knees hurt.",
        "textdich": ""
    },
    {
        "start": 3344.48,
        "end": 3355.119,
        "text": "His back was tight. His shoulders were stiff, but his arms were strong now, full of quiet power. He held the rope in",
        "textdich": ""
    },
    {
        "start": 3352.4,
        "end": 3365.92,
        "text": "one hand, the harpoon in the other. He watched the water. It moved gently. It was blue and green. Then he saw it. A",
        "textdich": ""
    },
    {
        "start": 3361.44,
        "end": 3368.64,
        "text": "dark shadow below, large, wide, slow.",
        "textdich": ""
    },
    {
        "start": 3365.92,
        "end": 3374.48,
        "text": "The fish, it was close now. It had come to meet him. The old man didn't speak.",
        "textdich": ""
    },
    {
        "start": 3371.599,
        "end": 3379.359,
        "text": "He just watched. He waited. The fish came up a little more, a little more.",
        "textdich": ""
    },
    {
        "start": 3376.72,
        "end": 3388.319,
        "text": "Its head showed first, then its body, long and beautiful, like silver moving under the sky. The old man's heart beat",
        "textdich": ""
    },
    {
        "start": 3385.2,
        "end": 3397.599,
        "text": "faster. His hands were steady. He lifted the harpoon. In that moment, everything became quiet. No sound, no time. Just",
        "textdich": ""
    },
    {
        "start": 3394.319,
        "end": 3401.76,
        "text": "the old man, the fish, the sea, the sun.",
        "textdich": ""
    },
    {
        "start": 3397.599,
        "end": 3415.2,
        "text": "His arms moved slow, then fast. The harpoon flew. It hit the fish just above the heart, deep, clean. The fish moved once, twice, then stopped. The sea",
        "textdich": ""
    },
    {
        "start": 3412.079,
        "end": 3424.799,
        "text": "turned red. The fish sank a little, then floated beside the boat. The fight was over. The old man dropped the rope. His",
        "textdich": ""
    },
    {
        "start": 3421.04,
        "end": 3432.88,
        "text": "hands shook, his legs bent. He sat down slowly. He looked at the fish. It was bigger than he thought, longer than the",
        "textdich": ""
    },
    {
        "start": 3430.0,
        "end": 3442.799,
        "text": "boat, stronger than anything he had ever caught. Tears came to his eyes, but not because he was sad. He was proud. He was",
        "textdich": ""
    },
    {
        "start": 3439.92,
        "end": 3452.96,
        "text": "thankful. He had done his best and the fish had done its best. This was not a win or a loss. This was something else.",
        "textdich": ""
    },
    {
        "start": 3449.68,
        "end": 3455.599,
        "text": "This was a meeting of two strong souls.",
        "textdich": ""
    },
    {
        "start": 3452.96,
        "end": 3466.319,
        "text": "One had to die, but both had shown their heart. The old man whispered, \"Thank you, my friend. You are the greatest fish, and you gave me the greatest",
        "textdich": ""
    },
    {
        "start": 3463.839,
        "end": 3474.4,
        "text": "fight.\" He tied the fish to the side of the boat. It was too big to bring inside. The head was near the front. The",
        "textdich": ""
    },
    {
        "start": 3471.68,
        "end": 3482.64,
        "text": "tail stretched past the back. The body was heavy. The blood moved with the waves. The sea was red now. But the old",
        "textdich": ""
    },
    {
        "start": 3479.839,
        "end": 3489.28,
        "text": "man did not look away. He looked at the fish again and again. It was beautiful.",
        "textdich": ""
    },
    {
        "start": 3486.72,
        "end": 3500.559,
        "text": "Even in death, it was still full of life. It still had power. It still had spirit. The old man felt something inside him. Something quiet. Something",
        "textdich": ""
    },
    {
        "start": 3497.44,
        "end": 3509.839,
        "text": "deep. Not joy. Not sadness, something more honest, something only the sea can give. The sun was high now. The old man",
        "textdich": ""
    },
    {
        "start": 3507.28,
        "end": 3516.48,
        "text": "took a drink of water. He ate a small piece of dry tuna. His body needed rest.",
        "textdich": ""
    },
    {
        "start": 3513.76,
        "end": 3523.04,
        "text": "But there was no time. He had to go back. Home was far, but he had to try.",
        "textdich": ""
    },
    {
        "start": 3520.559,
        "end": 3532.0,
        "text": "He had to bring this fish back. He had to show the boy. He had to show the others. Not to say, \"Look, I won.\" but",
        "textdich": ""
    },
    {
        "start": 3528.24,
        "end": 3538.16,
        "text": "to say, \"Look, I did not give up.\" That was the real prize. Not the fish, not the meat, but the story, the journey,",
        "textdich": ""
    },
    {
        "start": 3536.079,
        "end": 3546.559,
        "text": "the proof that he was still alive, still strong, still a man. He looked at the sea again. He looked at the sky. He",
        "textdich": ""
    },
    {
        "start": 3543.599,
        "end": 3560.88,
        "text": "touched the fish with his hand softly, like a goodbye. He whispered, \"We go home now.\" He picked up the oars. He started to row slow, gentle. Each",
        "textdich": ""
    },
    {
        "start": 3557.76,
        "end": 3571.359,
        "text": "movement hurt, but he did not stop. The sea was waiting. The long road back had begun. Chapter 11.",
        "textdich": ""
    },
    {
        "start": 3568.0,
        "end": 3579.119,
        "text": "Blood in the water. The fish was tied to the side of the boat. Its body moved with the sea. It was long, strong, and",
        "textdich": ""
    },
    {
        "start": 3576.72,
        "end": 3588.88,
        "text": "still beautiful. The old man looked at it again and again. He felt pain in his back but peace in his heart. He had",
        "textdich": ""
    },
    {
        "start": 3585.359,
        "end": 3599.92,
        "text": "fought well. He had won the fish. But deep inside he knew the fight was not over. The sea was quiet now, but he had seen it many times before. It could",
        "textdich": ""
    },
    {
        "start": 3597.28,
        "end": 3602.799,
        "text": "change quickly. It could bring trouble.",
        "textdich": ""
    },
    {
        "start": 3599.92,
        "end": 3608.559,
        "text": "It could bring sharks. And the blood, yes, the blood was already in the water.",
        "textdich": ""
    },
    {
        "start": 3605.68,
        "end": 3619.92,
        "text": "It spread slowly like red smoke. It moved far. It called to other creatures, creatures with sharp teeth, hungry teeth. The old man knew this. He had",
        "textdich": ""
    },
    {
        "start": 3617.28,
        "end": 3628.48,
        "text": "lived many years. He had seen what blood could do in the sea. He picked up his ore and looked around. Nothing yet. No",
        "textdich": ""
    },
    {
        "start": 3625.359,
        "end": 3637.28,
        "text": "fin, no shadow, just the quiet sound of water against wood. He started to row slowly. The boat moved. The fish pulled",
        "textdich": ""
    },
    {
        "start": 3634.96,
        "end": 3645.68,
        "text": "the boat sideways. It made the work harder. His arms were tired, but he rode. He had to get home. He had to show",
        "textdich": ""
    },
    {
        "start": 3642.559,
        "end": 3648.4,
        "text": "the boy. He had to complete the journey.",
        "textdich": ""
    },
    {
        "start": 3645.68,
        "end": 3658.319,
        "text": "He whispered, \"Hold on, old man. Don't stop now.\" His hands were sore. The sun burned his back. The salt touched his",
        "textdich": ""
    },
    {
        "start": 3654.799,
        "end": 3660.88,
        "text": "cuts and made them sting, but he rode.",
        "textdich": ""
    },
    {
        "start": 3658.319,
        "end": 3673.2,
        "text": "Each pull was slow, but each pull was strong. Then he saw it. A shadow under the sea. A soft wave. A dark fin. The",
        "textdich": ""
    },
    {
        "start": 3669.599,
        "end": 3684.799,
        "text": "first shark had come. It moved fast. It came from far away. It smelled the blood. The old man watched it come. It was a big one. A strong one. A shark",
        "textdich": ""
    },
    {
        "start": 3681.92,
        "end": 3697.359,
        "text": "with big jaws and hard teeth. It came closer. It did not stop. It wanted the fish. It wanted to eat. The old man picked up his harpoon. His arms shook,",
        "textdich": ""
    },
    {
        "start": 3694.319,
        "end": 3706.4,
        "text": "but his eyes were sharp. He waited. The shark came fast. It opened its mouth. It bit into the fish. The old man shouted,",
        "textdich": ""
    },
    {
        "start": 3703.04,
        "end": 3719.68,
        "text": "\"No!\" and threw the harpoon. The point hit deep. The shark twisted. It thrashed. It bled. Then it sank. The sea was quiet again, but only for a minute.",
        "textdich": ""
    },
    {
        "start": 3716.72,
        "end": 3725.359,
        "text": "The old man pulled back his rope. His harpoon was gone, stuck in the shark.",
        "textdich": ""
    },
    {
        "start": 3722.72,
        "end": 3730.799,
        "text": "Now he had no weapon. He looked at the fish. The shark had taken a big piece.",
        "textdich": ""
    },
    {
        "start": 3728.4,
        "end": 3736.559,
        "text": "The old man felt a pain in his chest, not from his body, but from his heart.",
        "textdich": ""
    },
    {
        "start": 3733.2,
        "end": 3745.119,
        "text": "He whispered, \"You gave me your best. I could not protect you.\" Then he looked around again. The red water was still",
        "textdich": ""
    },
    {
        "start": 3741.92,
        "end": 3754.559,
        "text": "there, still calling. More sharks would come. He found his knife. It was old, small, not made for sharks, but it was",
        "textdich": ""
    },
    {
        "start": 3750.96,
        "end": 3763.28,
        "text": "all he had. He tied it to an ore. Now he had a new weapon. Not strong, but sharp enough to fight. He waited. Another",
        "textdich": ""
    },
    {
        "start": 3760.319,
        "end": 3766.48,
        "text": "shark came. Then another two at once.",
        "textdich": ""
    },
    {
        "start": 3763.28,
        "end": 3769.119,
        "text": "The old man stood up. He fought. He hit.",
        "textdich": ""
    },
    {
        "start": 3766.48,
        "end": 3776.96,
        "text": "He shouted. The shark circled. They came close. He stabbed one in the eye. It bled. It swam away. The other bit deep",
        "textdich": ""
    },
    {
        "start": 3774.48,
        "end": 3787.04,
        "text": "into the fish. The old man hit it hard again and again. His hands were red. His eyes were full of salt and sweat. But he",
        "textdich": ""
    },
    {
        "start": 3783.839,
        "end": 3796.4,
        "text": "did not stop. One shark was gone. The other floated dead. But the water was worse now. It was not blue anymore. It",
        "textdich": ""
    },
    {
        "start": 3793.599,
        "end": 3806.16,
        "text": "was red and dark. The fish was not the same. Its side was broken. Its meat was torn. The old man looked at it. He",
        "textdich": ""
    },
    {
        "start": 3802.48,
        "end": 3815.839,
        "text": "wanted to cry, but no tears came. He had no water left in him, he whispered, but he kept rowing. The sun moved lower. The",
        "textdich": ""
    },
    {
        "start": 3812.88,
        "end": 3829.28,
        "text": "sky began to turn orange. The day was ending, but the fight was not done. He saw more shadows, more fins, more sharks. They were smaller now, but many.",
        "textdich": ""
    },
    {
        "start": 3825.92,
        "end": 3837.599,
        "text": "He was weak. But he stood again. He held his ore tight. His knife was ready. He shouted into the wind, \"I will not give",
        "textdich": ""
    },
    {
        "start": 3834.559,
        "end": 3847.28,
        "text": "you up.\" And he fought, he hit, he stabbed, he screamed. He was just one man in a small boat, but he had the heart of a lion. He had the heart of a",
        "textdich": ""
    },
    {
        "start": 3844.72,
        "end": 3854.079,
        "text": "mountain. He would not stop, not while he had hands, not while he had breath.",
        "textdich": ""
    },
    {
        "start": 3850.64,
        "end": 3864.16,
        "text": "He hit until the knife broke. He fought with the broken wood. He fought with all he had. Finally, the sea was quiet",
        "textdich": ""
    },
    {
        "start": 3860.72,
        "end": 3872.64,
        "text": "again. The sharks were gone for now. The old man sat down. He could not move. His hands were red and open. His back was",
        "textdich": ""
    },
    {
        "start": 3869.92,
        "end": 3885.839,
        "text": "broken with pain. His eyes closed slowly. He looked at the fish. Only bones were left, a white shape, long, empty, beautiful in its own way. The old",
        "textdich": ""
    },
    {
        "start": 3882.559,
        "end": 3894.64,
        "text": "man whispered, \"They took the meat.\" But they could not take the fight. and they could not take the story. He touched the",
        "textdich": ""
    },
    {
        "start": 3890.96,
        "end": 3908.64,
        "text": "bones. He said, \"You are still great and I will still take you home.\" Chapter 12. The fight gets worse. The old man was tired. His hands were cut.",
        "textdich": ""
    },
    {
        "start": 3905.119,
        "end": 3911.839,
        "text": "His back was sore. His arms were weak.",
        "textdich": ""
    },
    {
        "start": 3908.64,
        "end": 3914.64,
        "text": "But still, he was alive.",
        "textdich": ""
    },
    {
        "start": 3911.839,
        "end": 3917.839,
        "text": "Still he was sitting in his little boat.",
        "textdich": ""
    },
    {
        "start": 3914.64,
        "end": 3929.68,
        "text": "The sea was quiet for a short time. The sun was lower now. The sky was turning red and gold. The old man looked at the bones of the fish. It was just a",
        "textdich": ""
    },
    {
        "start": 3926.48,
        "end": 3937.839,
        "text": "skeleton now. The meat was gone. The sharks had taken most of it, but the shape was still there. The long, strong",
        "textdich": ""
    },
    {
        "start": 3934.48,
        "end": 3945.599,
        "text": "bones, the great head, the tail. It was still the biggest fish he had ever caught. And even in this broken form, it",
        "textdich": ""
    },
    {
        "start": 3943.039,
        "end": 3955.28,
        "text": "was beautiful. It was still a sign of strength, a sign of his fight, a sign of his soul. He touched the fish gently. He",
        "textdich": ""
    },
    {
        "start": 3952.16,
        "end": 3964.64,
        "text": "said, \"You are still my brother.\" Then he picked up his broken ore and he rode again. He moved slowly now. His boat did",
        "textdich": ""
    },
    {
        "start": 3961.119,
        "end": 3973.599,
        "text": "not go fast. The waves were soft. The wind was light, but every part of his body hurt. His hands were shaking. His",
        "textdich": ""
    },
    {
        "start": 3970.4,
        "end": 3979.92,
        "text": "legs were weak. His eyes were tired. But he could not stop. He had to get home.",
        "textdich": ""
    },
    {
        "start": 3977.039,
        "end": 3988.4,
        "text": "He had to show the boy. He had to finish what he started. So he pulled the oars again and again. One pull, then another.",
        "textdich": ""
    },
    {
        "start": 3985.68,
        "end": 3991.359,
        "text": "He whispered to himself, \"Keep going.",
        "textdich": ""
    },
    {
        "start": 3988.4,
        "end": 4000.16,
        "text": "One more pull, then one more.\" He did not think about the pain. He did not think about the blood. He only thought",
        "textdich": ""
    },
    {
        "start": 3996.079,
        "end": 4003.119,
        "text": "about the boat, the boy, and the shore.",
        "textdich": ""
    },
    {
        "start": 4000.16,
        "end": 4011.839,
        "text": "Then he saw it. Another fin cutting the water. Then another and another. Three sharks coming fast. They had smelled the",
        "textdich": ""
    },
    {
        "start": 4008.0,
        "end": 4023.2,
        "text": "blood. The sea had called them. And now they were here. The old man sat up. He had no harpoon. He had no knife. Only",
        "textdich": ""
    },
    {
        "start": 4019.68,
        "end": 4033.039,
        "text": "the broken ore, just a stick now. But he picked it up. He held it tight. He said, \"You will not take what is left. I will",
        "textdich": ""
    },
    {
        "start": 4029.68,
        "end": 4035.68,
        "text": "not let you. The sharks came close.",
        "textdich": ""
    },
    {
        "start": 4033.039,
        "end": 4046.88,
        "text": "Their eyes were cold. Their mouths were open. Sharp teeth, strong jaws. They circled the boat. They touched the fishbones. They smelled the air. Then",
        "textdich": ""
    },
    {
        "start": 4044.4,
        "end": 4056.079,
        "text": "one of them attacked. The old man hit it with a stick. He shouted. The shark pulled back. But another came. It bit",
        "textdich": ""
    },
    {
        "start": 4052.799,
        "end": 4059.44,
        "text": "the tail of the fish. The man hit again.",
        "textdich": ""
    },
    {
        "start": 4056.079,
        "end": 4065.76,
        "text": "His arms burned. His head felt hot. His heart beat fast. He hit again and again.",
        "textdich": ""
    },
    {
        "start": 4062.559,
        "end": 4073.92,
        "text": "The wood cracked, but he kept going. One shark turned away, but another came, then two more. He was surrounded now.",
        "textdich": ""
    },
    {
        "start": 4071.2,
        "end": 4079.2,
        "text": "The sea was not quiet anymore. It was loud, full of splashes, full of teeth.",
        "textdich": ""
    },
    {
        "start": 4076.88,
        "end": 4089.039,
        "text": "The fish skeleton was breaking. The sharks were pulling it apart. The old man fought like a wild animal, like a fire. He hit with all he had. Even when",
        "textdich": ""
    },
    {
        "start": 4086.799,
        "end": 4099.679,
        "text": "his stick broke more, even when his hands bled again, he hit with his fists, with his elbows, with his heart. He shouted into the wind, \"Go away! Leave",
        "textdich": ""
    },
    {
        "start": 4097.04,
        "end": 4111.199,
        "text": "him!\" He gave me everything. You cannot have more. But the sharks did not listen. They never listen. They only follow the smell. They only follow the",
        "textdich": ""
    },
    {
        "start": 4108.319,
        "end": 4122.56,
        "text": "blood. They do not care about dreams or fights or love. They just eat. The old man knew that, but he did not stop. He",
        "textdich": ""
    },
    {
        "start": 4118.48,
        "end": 4130.48,
        "text": "had to try. Even if he could not win, even if it was already too late, he had to show the sea. He had to show the sky",
        "textdich": ""
    },
    {
        "start": 4128.0,
        "end": 4139.199,
        "text": "that he was still here, that he was still a man. One by one, the sharks went away. Some were hit, some were full,",
        "textdich": ""
    },
    {
        "start": 4136.88,
        "end": 4150.64,
        "text": "some were just done. The water was red again. The boat was wet. The man was broken, but he was still alive. He looked at what was left of the fish. Not",
        "textdich": ""
    },
    {
        "start": 4147.04,
        "end": 4161.92,
        "text": "much, just the spine, just the bones, the head, the tail. But they were still big, still strong. He smiled a little, a",
        "textdich": ""
    },
    {
        "start": 4158.08,
        "end": 4174.0,
        "text": "sad smile, a tired smile, and he said, \"They got the meat, but not the meaning.\" He sat down. He looked at his hands. They were full of cuts, full of",
        "textdich": ""
    },
    {
        "start": 4170.08,
        "end": 4183.279,
        "text": "salt, full of pain, but they were also full of truth. These were hands that had fought, that had not let go. He closed",
        "textdich": ""
    },
    {
        "start": 4180.48,
        "end": 4191.359,
        "text": "his eyes for a moment. The wind touched his face. The stars were starting to come out. The sky was dark blue now. The",
        "textdich": ""
    },
    {
        "start": 4188.719,
        "end": 4205.199,
        "text": "day was gone, but the story was still here. He opened his eyes. He picked up the ore again. It was short now, just enough to row, and he rode slowly,",
        "textdich": ""
    },
    {
        "start": 4201.679,
        "end": 4207.92,
        "text": "softly. His boat moved through the sea.",
        "textdich": ""
    },
    {
        "start": 4205.199,
        "end": 4217.76,
        "text": "The fishbones made a sound in the water, like a song, like a whisper, like the end of a dream. And the old man thought,",
        "textdich": ""
    },
    {
        "start": 4214.48,
        "end": 4231.28,
        "text": "they think, \"I have lost.\" But they do not know. They do not see. I have won something greater. I have not given up and I will not. Chapter 13. What is",
        "textdich": ""
    },
    {
        "start": 4227.44,
        "end": 4240.159,
        "text": "left? The sea was quiet again. The stars were above. The waves were soft. The wind was gentle. The night had come. The",
        "textdich": ""
    },
    {
        "start": 4236.88,
        "end": 4250.159,
        "text": "old man sat alone in his boat. He did not speak. He did not cry. His heart was too tired for tears. His body was too",
        "textdich": ""
    },
    {
        "start": 4247.04,
        "end": 4253.199,
        "text": "tired for words. His hands were open.",
        "textdich": ""
    },
    {
        "start": 4250.159,
        "end": 4255.52,
        "text": "His arms were weak. His back was heavy.",
        "textdich": ""
    },
    {
        "start": 4253.199,
        "end": 4265.84,
        "text": "He looked at the fish beside him, but it was not the fish anymore. It was just bones now. Long white shining bones. A",
        "textdich": ""
    },
    {
        "start": 4262.64,
        "end": 4276.88,
        "text": "head, a spine, a tail. The meat was gone. The sharks had taken it all. They had come again and again, and he had fought. But they were too many, too",
        "textdich": ""
    },
    {
        "start": 4273.84,
        "end": 4286.8,
        "text": "strong, too hungry. He had nothing left to fight with. only a stick, only his hands, only his heart. And in the end,",
        "textdich": ""
    },
    {
        "start": 4283.6,
        "end": 4296.88,
        "text": "he could not save the fish. The dream he caught with so much pain, the dream he fought for with his life, was now just a",
        "textdich": ""
    },
    {
        "start": 4291.92,
        "end": 4308.88,
        "text": "skeleton, still big, still proud, but empty. The old man looked at it and said, \"So this is what is left.\" He touched the bones with his hand. They",
        "textdich": ""
    },
    {
        "start": 4304.88,
        "end": 4316.88,
        "text": "were cold, wet, smooth like stone. But they were real. He had not imagined the fish. He had not dreamed the fight. It",
        "textdich": ""
    },
    {
        "start": 4314.719,
        "end": 4325.199,
        "text": "had all happened. Every pull of the line, every cut on his hand, every hour without sleep, every shark, every wave,",
        "textdich": ""
    },
    {
        "start": 4322.719,
        "end": 4334.88,
        "text": "all of it was real. He had lived it. He had survived it. He had done it all alone in the middle of the sea with no",
        "textdich": ""
    },
    {
        "start": 4331.44,
        "end": 4345.92,
        "text": "help, no sound, just the sky, the water, the fish, and his soul. And now he was still alive. He was still rowing slowly",
        "textdich": ""
    },
    {
        "start": 4343.04,
        "end": 4357.28,
        "text": "toward home. The boat moved like a shadow across the water. The fishbones made a soft sound like old wood on stone. The night was long. The cold",
        "textdich": ""
    },
    {
        "start": 4354.719,
        "end": 4367.199,
        "text": "touched his face. The stars watched him in silence and he thought, \"What do I have now? I have no fish to sell, no",
        "textdich": ""
    },
    {
        "start": 4363.52,
        "end": 4379.12,
        "text": "money to bring home, no meat to show, only bones.\" But then another voice inside him said, \"You have the story. You have the fight.",
        "textdich": ""
    },
    {
        "start": 4376.4,
        "end": 4390.0,
        "text": "You have the truth.\" And he understood something. The sea did not take everything. The sharks did not win everything. They only took the outside,",
        "textdich": ""
    },
    {
        "start": 4386.719,
        "end": 4397.84,
        "text": "the meat, the prize. But they did not take the meaning. They did not take the memory. They did not take what the fight",
        "textdich": ""
    },
    {
        "start": 4395.199,
        "end": 4404.4,
        "text": "had made him become. He looked at his hands. They were full of blood and salt.",
        "textdich": ""
    },
    {
        "start": 4401.199,
        "end": 4406.56,
        "text": "They were swollen and sore.",
        "textdich": ""
    },
    {
        "start": 4404.4,
        "end": 4415.36,
        "text": "But they were the hands of a man who did not quit. The hands of someone who went deep into the sea and faced what was",
        "textdich": ""
    },
    {
        "start": 4412.32,
        "end": 4426.239,
        "text": "there. the hands of someone who gave everything. Not for money, not for glory, but for something inside, something that lives in the soul,",
        "textdich": ""
    },
    {
        "start": 4423.36,
        "end": 4435.84,
        "text": "something that says, \"Keep going.\" He smiled a little. \"Just a small smile. It hurt to smile, but it felt right. They",
        "textdich": ""
    },
    {
        "start": 4433.12,
        "end": 4446.08,
        "text": "can take the fish,\" he said softly. \"But they cannot take my heart.\" And so he kept rowing slowly, gently.",
        "textdich": ""
    },
    {
        "start": 4443.36,
        "end": 4461.28,
        "text": "The stars moved above him. The moon rose. The sky turned dark blue, then black. Time passed. The fish skeleton lay beside him like a ghost, but not a",
        "textdich": ""
    },
    {
        "start": 4456.96,
        "end": 4471.6,
        "text": "sad ghost, a proud ghost, a memory of greatness, of strength, of the sea. The old man was not afraid anymore. not of",
        "textdich": ""
    },
    {
        "start": 4468.239,
        "end": 4479.52,
        "text": "sharks, not of pain, not of losing, because he had already faced all of them and he was still here, still moving,",
        "textdich": ""
    },
    {
        "start": 4476.08,
        "end": 4488.0,
        "text": "still alive. He thought of the boy. The boy would be waiting. The boy would see the bones. He would understand.",
        "textdich": ""
    },
    {
        "start": 4485.28,
        "end": 4495.28,
        "text": "Maybe the others would not. Maybe they would laugh. Maybe they would say, \"You caught nothing.\" But the boy would know.",
        "textdich": ""
    },
    {
        "start": 4493.6,
        "end": 4504.32,
        "text": "The boy would see the truth in the bones. the story in the old man's hands, the fire in his eyes, even if they were",
        "textdich": ""
    },
    {
        "start": 4501.04,
        "end": 4514.719,
        "text": "tired, and the boy would say, \"He's not finished. He is still the fisherman.\" The old man closed his eyes for a",
        "textdich": ""
    },
    {
        "start": 4510.32,
        "end": 4526.48,
        "text": "moment. He was so tired, but not broken, not sad. He whispered, \"This is what is left, and it is enough.\" The boat moved",
        "textdich": ""
    },
    {
        "start": 4523.04,
        "end": 4529.12,
        "text": "on. The sea rocked him like a cradle.",
        "textdich": ""
    },
    {
        "start": 4526.48,
        "end": 4538.48,
        "text": "The fishbones floated beside him. The stars watched from above. The night was deep. The world was quiet. And the old",
        "textdich": ""
    },
    {
        "start": 4535.36,
        "end": 4546.719,
        "text": "man, with nothing left but bones, pride, and peace, rode toward home.",
        "textdich": ""
    },
    {
        "start": 4542.4,
        "end": 4549.52,
        "text": "Chapter 14. The long way home.",
        "textdich": ""
    },
    {
        "start": 4546.719,
        "end": 4556.48,
        "text": "The old man was tired, more tired than he had ever been in his whole life. His back hurt with every breath. His hands",
        "textdich": ""
    },
    {
        "start": 4553.92,
        "end": 4567.92,
        "text": "were cut and open. His arms felt like they were made of wood. But still he held the oars. Still he rode. The sea was calm now, and the stars were soft",
        "textdich": ""
    },
    {
        "start": 4565.28,
        "end": 4576.239,
        "text": "above him. The fish beside his boat was only bones. It no longer had meat, but it still had its shape. It still looked",
        "textdich": ""
    },
    {
        "start": 4573.28,
        "end": 4585.04,
        "text": "like a great fish, the biggest he had ever caught. And in its bones, the old man could still feel pride. Even when",
        "textdich": ""
    },
    {
        "start": 4582.56,
        "end": 4595.12,
        "text": "there was pain in his body, there was peace in his heart. He had fought the sea. He had fought the sharks. He had fought his own weakness. And he was",
        "textdich": ""
    },
    {
        "start": 4592.239,
        "end": 4607.44,
        "text": "still here, still alive, still rowing home. Slowly, very slowly, the boat moved through the water. He spoke softly to the fishbones.",
        "textdich": ""
    },
    {
        "start": 4604.64,
        "end": 4615.6,
        "text": "We did our best, my friend. He said, \"You gave everything and so did I. You pulled me far from land and I followed.",
        "textdich": ""
    },
    {
        "start": 4613.04,
        "end": 4625.679,
        "text": "We were together in the fight and now we go home together.\" His voice was low, almost a whisper. There was no one else",
        "textdich": ""
    },
    {
        "start": 4621.92,
        "end": 4636.08,
        "text": "to hear him. Only the sea, the stars, and the fish skeleton. But still, he spoke because he needed to say it, because he needed to feel it. This",
        "textdich": ""
    },
    {
        "start": 4633.52,
        "end": 4649.52,
        "text": "journey had changed him. He had gone out alone. He had lost much. But he had found something too. Something deep inside himself, something quiet,",
        "textdich": ""
    },
    {
        "start": 4645.84,
        "end": 4658.159,
        "text": "something strong, something real. The night air was cold now. The wind touched his face like soft fingers. The stars",
        "textdich": ""
    },
    {
        "start": 4655.28,
        "end": 4666.56,
        "text": "above looked like tiny fires. He rode with slow arms. His body moved like a machine that was almost out of power,",
        "textdich": ""
    },
    {
        "start": 4663.76,
        "end": 4676.4,
        "text": "but not completely. Each stroke of the ore took great effort. But he did not stop. He could not stop. He had to go",
        "textdich": ""
    },
    {
        "start": 4672.88,
        "end": 4688.4,
        "text": "home. Not just for rest, not just for food, but for the boy. The boy who still believed in him. The boy who loved him.",
        "textdich": ""
    },
    {
        "start": 4684.88,
        "end": 4697.84,
        "text": "Deep inside himself. Something quiet. something strong, something real. The night air was cold now. The wind touched",
        "textdich": ""
    },
    {
        "start": 4695.04,
        "end": 4708.64,
        "text": "his face like soft fingers. The stars above looked like tiny fires. He rode with slow arms. His body moved like a machine that was almost out of power,",
        "textdich": ""
    },
    {
        "start": 4706.0,
        "end": 4720.32,
        "text": "but not completely. Each stroke of the ore took great effort, but he did not stop. He could not stop. He had to go home not just for rest, not just for",
        "textdich": ""
    },
    {
        "start": 4717.12,
        "end": 4724.96,
        "text": "food, but for the boy. The boy who still believed in him. The boy who loved him.",
        "textdich": ""
    },
    {
        "start": 4722.56,
        "end": 4730.64,
        "text": "The boy who waited. He remembered the first time he had taken the boy fishing.",
        "textdich": ""
    },
    {
        "start": 4727.6,
        "end": 4733.28,
        "text": "How small the boy had been. How excited.",
        "textdich": ""
    },
    {
        "start": 4730.64,
        "end": 4740.32,
        "text": "How he had asked so many questions. The old man had taught him everything. How to tie the line, how to feel the pull,",
        "textdich": ""
    },
    {
        "start": 4737.199,
        "end": 4745.52,
        "text": "how to wait, how to respect the sea. Now the old man was the one learning.",
        "textdich": ""
    },
    {
        "start": 4742.64,
        "end": 4748.239,
        "text": "Learning how deep the sea really is.",
        "textdich": ""
    },
    {
        "start": 4745.52,
        "end": 4750.48,
        "text": "Learning how long a man can last.",
        "textdich": ""
    },
    {
        "start": 4748.239,
        "end": 4762.4,
        "text": "Learning what it means to lose and still feel proud. He thought, \"The boy must see me. He must see the fishbones. Then he will understand.\"",
        "textdich": ""
    },
    {
        "start": 4759.28,
        "end": 4771.84,
        "text": "Hours passed. The sky changed from black to deep blue, then purple, then a soft red. The sun was coming. The night was",
        "textdich": ""
    },
    {
        "start": 4768.56,
        "end": 4778.32,
        "text": "ending. The world was waking up. But the old man was still rowing, still moving.",
        "textdich": ""
    },
    {
        "start": 4775.36,
        "end": 4785.92,
        "text": "The land was near now. He could see the lights of the village far away like stars on the ground. That was his home.",
        "textdich": ""
    },
    {
        "start": 4783.36,
        "end": 4794.4,
        "text": "That was where he belonged. His small shack, his empty bed, the boy's house nearby, and maybe if he was lucky, some",
        "textdich": ""
    },
    {
        "start": 4791.6,
        "end": 4803.36,
        "text": "hot food. But first, he had to reach the shore. The last part was always the hardest. His arms shook now. His eyes",
        "textdich": ""
    },
    {
        "start": 4800.4,
        "end": 4812.48,
        "text": "were dry, his hands were numb, but the boat moved slowly forward. The sea was kind now, like it was saying, \"You have",
        "textdich": ""
    },
    {
        "start": 4809.12,
        "end": 4820.88,
        "text": "passed the test. I will take you home.\" The old man looked one more time at the fish skeleton. It was shining in the",
        "textdich": ""
    },
    {
        "start": 4817.199,
        "end": 4824.719,
        "text": "morning light, white, long, and proud.",
        "textdich": ""
    },
    {
        "start": 4820.88,
        "end": 4827.76,
        "text": "He touched it again, this time gently.",
        "textdich": ""
    },
    {
        "start": 4824.719,
        "end": 4841.04,
        "text": "\"Thank you,\" he said. \"You gave me your fight. You gave me your strength. You showed me who I am. And with those words, he kept rowing. The village was",
        "textdich": ""
    },
    {
        "start": 4837.6,
        "end": 4843.36,
        "text": "quiet. Most people were still asleep.",
        "textdich": ""
    },
    {
        "start": 4841.04,
        "end": 4846.56,
        "text": "The houses looked small and peaceful.",
        "textdich": ""
    },
    {
        "start": 4843.36,
        "end": 4856.32,
        "text": "The beach was empty, just sand and wind and early light. He reached the shore at last. The boat touched the sand. He",
        "textdich": ""
    },
    {
        "start": 4853.12,
        "end": 4858.32,
        "text": "dropped the oars. He sat for a moment.",
        "textdich": ""
    },
    {
        "start": 4856.32,
        "end": 4860.56,
        "text": "His head fell forward.",
        "textdich": ""
    },
    {
        "start": 4858.32,
        "end": 4866.0,
        "text": "He was too tired to move. But he was home. He had made it. He had returned.",
        "textdich": ""
    },
    {
        "start": 4864.159,
        "end": 4877.92,
        "text": "And though he had nothing to sell, though he had no fish to give, he had something better. He had the story. He had the bones. He had his pride. And",
        "textdich": ""
    },
    {
        "start": 4875.04,
        "end": 4882.4,
        "text": "deep inside he had a strange feeling.",
        "textdich": ""
    },
    {
        "start": 4877.92,
        "end": 4891.04,
        "text": "Not joy, not sadness, something quieter, something stronger, peace. Because even in loss, he had won something that could",
        "textdich": ""
    },
    {
        "start": 4888.08,
        "end": 4898.32,
        "text": "not be taken. Not by sharks, not by time, not by the sea.",
        "textdich": ""
    },
    {
        "start": 4894.48,
        "end": 4900.88,
        "text": "Chapter 15. The return.",
        "textdich": ""
    },
    {
        "start": 4898.32,
        "end": 4910.08,
        "text": "The boat touched the land. The waves were small. The wind was soft. The sea had brought him home. But the old man",
        "textdich": ""
    },
    {
        "start": 4906.8,
        "end": 4919.28,
        "text": "could not move. His hands were open. His arms were weak. His body was heavy. He sat in the boat and breathed slowly. He",
        "textdich": ""
    },
    {
        "start": 4916.48,
        "end": 4925.36,
        "text": "looked at the beach. It was empty. The sky was turning blue. Morning had come.",
        "textdich": ""
    },
    {
        "start": 4922.32,
        "end": 4934.88,
        "text": "The world was waking up. But he sat still. He looked at the fishbones beside him. They were white and long and quiet.",
        "textdich": ""
    },
    {
        "start": 4932.239,
        "end": 4945.52,
        "text": "They had no voice, but they told a story. A story of the sea. A story of a fight. A story of heart. A story of a",
        "textdich": ""
    },
    {
        "start": 4941.679,
        "end": 4949.44,
        "text": "man who did not quit. He tried to stand.",
        "textdich": ""
    },
    {
        "start": 4945.52,
        "end": 4956.239,
        "text": "His legs shook. His knees were weak. But he stood slowly like a tree in the wind.",
        "textdich": ""
    },
    {
        "start": 4953.199,
        "end": 4965.84,
        "text": "He picked up the mast. He put it on his shoulders. It was not heavy before, but now it felt like a mountain. He walked",
        "textdich": ""
    },
    {
        "start": 4963.12,
        "end": 4977.36,
        "text": "one slow step at a time. His feet touched the sand. The sand was cold. He left the boat. He left the skeleton. He left the sea behind him. The mast",
        "textdich": ""
    },
    {
        "start": 4974.639,
        "end": 4986.159,
        "text": "pressed on his back. His arms held it like a cross. He walked to his small house. No one saw him. No one spoke. But",
        "textdich": ""
    },
    {
        "start": 4983.44,
        "end": 4994.8,
        "text": "the world seemed to know. The birds were quiet. The sky was soft. Even the wind walked slowly beside him. He reached his",
        "textdich": ""
    },
    {
        "start": 4991.92,
        "end": 5009.36,
        "text": "door. He opened it. He put the mask down. He went inside. His room was small. His bed was small, but it was home. He lay down. He closed his eyes.",
        "textdich": ""
    },
    {
        "start": 5006.719,
        "end": 5023.679,
        "text": "His breath was slow. His hands were still. He did not sleep. Not yet. He just lay there, quiet, still. Home. The boy came later. The boy had waited all",
        "textdich": ""
    },
    {
        "start": 5021.52,
        "end": 5033.52,
        "text": "night. He ran to the beach in the morning. He saw the boat. He saw the bones. He stopped. He could not speak.",
        "textdich": ""
    },
    {
        "start": 5030.96,
        "end": 5042.8,
        "text": "His eyes were full. He walked to the boat. He touched the fish skeleton. He felt the story. Then he ran to the old",
        "textdich": ""
    },
    {
        "start": 5039.36,
        "end": 5052.32,
        "text": "man's house. He opened the door. The old man was asleep. His face was thin. His hands were wrapped in cloth. His body",
        "textdich": ""
    },
    {
        "start": 5048.4,
        "end": 5055.36,
        "text": "was broken. But his spirit was there.",
        "textdich": ""
    },
    {
        "start": 5052.32,
        "end": 5064.88,
        "text": "The boy sat beside him. He looked at him for a long time. Then he began to cry.",
        "textdich": ""
    },
    {
        "start": 5059.6,
        "end": 5074.8,
        "text": "Not loud, just tears. Quiet tears. Tears of love. Tears of respect. He went out and brought food, hot food, bread,",
        "textdich": ""
    },
    {
        "start": 5071.28,
        "end": 5085.6,
        "text": "coffee, water. He came back. He put the food near the bed. He sat again. He waited. The old man opened his eyes. He",
        "textdich": ""
    },
    {
        "start": 5080.88,
        "end": 5089.6,
        "text": "saw the boy. He smiled. a small smile.",
        "textdich": ""
    },
    {
        "start": 5085.6,
        "end": 5093.12,
        "text": "\"You are here,\" he said. The boy nodded.",
        "textdich": ""
    },
    {
        "start": 5089.6,
        "end": 5100.0,
        "text": "\"Yes, and I will always be here,\" he said. The old man closed his eyes again.",
        "textdich": ""
    },
    {
        "start": 5096.56,
        "end": 5109.52,
        "text": "His breath was soft. He whispered, \"We caught a big one.\" The boy touched his hand. \"Yes, we did.\" Others came to the",
        "textdich": ""
    },
    {
        "start": 5106.159,
        "end": 5115.679,
        "text": "beach. They saw the boat. They saw the skeleton. It was longer than the boat.",
        "textdich": ""
    },
    {
        "start": 5112.96,
        "end": 5128.0,
        "text": "The people were surprised. They spoke in quiet voices. This fish was huge. They said he caught this alone. Yes, someone",
        "textdich": ""
    },
    {
        "start": 5123.36,
        "end": 5135.92,
        "text": "said it is true. And slowly respect came back. The old man had no meat to sell, but he had shown something bigger,",
        "textdich": ""
    },
    {
        "start": 5133.679,
        "end": 5144.32,
        "text": "something you cannot weigh, something you cannot buy. Strength, courage, heart.",
        "textdich": ""
    },
    {
        "start": 5141.84,
        "end": 5155.76,
        "text": "At the cafe, the men talked. Some laughed before. Not now. Now they were quiet. Now they looked at the boy with respect. And the boy looked back with",
        "textdich": ""
    },
    {
        "start": 5152.719,
        "end": 5165.44,
        "text": "strong eyes. I fish with him again. The boy said, \"He is not finished.\" The men nodded. They said nothing. But their",
        "textdich": ""
    },
    {
        "start": 5162.239,
        "end": 5175.6,
        "text": "silence was full of meaning. The old man slept again. Deep sleep. Long sleep. His body needed time. His hands needed rest.",
        "textdich": ""
    },
    {
        "start": 5172.239,
        "end": 5184.32,
        "text": "His heart was still strong. The boy sat beside him. He watched the old man. He thought, \"I will learn from him. I will",
        "textdich": ""
    },
    {
        "start": 5181.76,
        "end": 5199.6,
        "text": "go to sea with him. I will be strong like him.\" In his heart, the fire burned, a quiet fire, a strong fire, the same fire the old man had.",
        "textdich": ""
    },
    {
        "start": 5195.679,
        "end": 5210.48,
        "text": "Outside the sea was calm, the wind was soft. The fishbones still lay beside the boat, white, beautiful, proud. The old",
        "textdich": ""
    },
    {
        "start": 5207.679,
        "end": 5219.44,
        "text": "man had returned, not with meat, not with money, but with something greater, with his story, with his truth, with the",
        "textdich": ""
    },
    {
        "start": 5216.56,
        "end": 5225.12,
        "text": "respect of the sea, the village, and the boy.",
        "textdich": ""
    },
    {
        "start": 5220.96,
        "end": 5227.92,
        "text": "Chapter 16. The respect returns.",
        "textdich": ""
    },
    {
        "start": 5225.12,
        "end": 5237.44,
        "text": "The sun was high in the sky. The boy brought soup. The old man was still in bed. His eyes opened slowly. He smelled",
        "textdich": ""
    },
    {
        "start": 5234.239,
        "end": 5248.239,
        "text": "the soup. He tried to sit up, but his back hurt. His hands were wrapped in clean cloth. His face looked tired.",
        "textdich": ""
    },
    {
        "start": 5244.159,
        "end": 5251.92,
        "text": "But his eyes were calm. The boy smiled.",
        "textdich": ""
    },
    {
        "start": 5248.239,
        "end": 5258.96,
        "text": "\"I brought food,\" he said. The old man looked at him with soft eyes. He nodded.",
        "textdich": ""
    },
    {
        "start": 5255.44,
        "end": 5271.76,
        "text": "\"Thank you,\" he said. His voice was weak. The boy helped him eat slowly, one spoon at a time. The old man ate the soup. He drank water. Then he leaned",
        "textdich": ""
    },
    {
        "start": 5268.639,
        "end": 5280.56,
        "text": "back and closed his eyes. He was not sleeping. He was thinking. The boy did not ask anything. He just sat near the",
        "textdich": ""
    },
    {
        "start": 5277.52,
        "end": 5288.159,
        "text": "bed and waited. Outside, people still came to see the fishbones. They walked to the boat. They touched the long",
        "textdich": ""
    },
    {
        "start": 5285.12,
        "end": 5297.6,
        "text": "spine. They counted the ribs. They stood in silence. They asked questions. \"Did he really catch this alone?\" Someone",
        "textdich": ""
    },
    {
        "start": 5293.92,
        "end": 5305.84,
        "text": "asked. \"Yes,\" another said. \"He fought it for days.\" The people did not laugh now. They did not call him unlucky now.",
        "textdich": ""
    },
    {
        "start": 5303.44,
        "end": 5316.719,
        "text": "They saw the truth. They saw the size of the fish. They saw what the old man had done. and they felt respect, deep respect, quiet respect. The kind of",
        "textdich": ""
    },
    {
        "start": 5313.76,
        "end": 5319.04,
        "text": "respect that does not need big words.",
        "textdich": ""
    },
    {
        "start": 5316.719,
        "end": 5325.679,
        "text": "Back in the room, the boy was still there. He looked at the old man's hands.",
        "textdich": ""
    },
    {
        "start": 5322.48,
        "end": 5328.719,
        "text": "The cuts were deep. The skin was broken.",
        "textdich": ""
    },
    {
        "start": 5325.679,
        "end": 5338.32,
        "text": "But the old man did not complain. He did not talk about pain. He did not talk about loss. He just breathed quietly.",
        "textdich": ""
    },
    {
        "start": 5335.44,
        "end": 5348.96,
        "text": "The boy said, \"I want to fish with you again.\" The old man opened his eyes. He looked at the boy. \"You are strong,\" he",
        "textdich": ""
    },
    {
        "start": 5345.36,
        "end": 5356.0,
        "text": "said. The boy nodded. \"I learned from you.\" The old man smiled a little.",
        "textdich": ""
    },
    {
        "start": 5352.639,
        "end": 5362.239,
        "text": "\"We'll fish together,\" he said. \"Not now, but soon.\" The boy stayed all day.",
        "textdich": ""
    },
    {
        "start": 5359.92,
        "end": 5372.639,
        "text": "He cleaned the room. He changed the cloth on the hands. He brought more water. He brought more soup. The old man spoke very little. But the boy didn't",
        "textdich": ""
    },
    {
        "start": 5370.08,
        "end": 5384.56,
        "text": "mind. He didn't need the old man to speak. He already knew his heart. He could feel the power in the silence. He could feel the love. The old man had",
        "textdich": ""
    },
    {
        "start": 5381.44,
        "end": 5394.48,
        "text": "nothing in his hands now. No money, no fish, no strength. But still, the boy looked at him like a hero. Because real",
        "textdich": ""
    },
    {
        "start": 5391.28,
        "end": 5405.52,
        "text": "strength does not need to shout. Real strength is quiet. Real strength is soft. Real strength is in the eyes, in the heart, in the way someone never",
        "textdich": ""
    },
    {
        "start": 5402.4,
        "end": 5414.159,
        "text": "gives up, even when it hurts. Later, some fishermen came to the house. They did not come to ask questions. They did not come to joke. They came to say",
        "textdich": ""
    },
    {
        "start": 5412.239,
        "end": 5422.159,
        "text": "something simple. They stood at the door. The boy opened it. The old man was still in bed. The men looked at him.",
        "textdich": ""
    },
    {
        "start": 5419.76,
        "end": 5433.679,
        "text": "Then one of them said, \"It was a great fish.\" Another said, \"You are strong.\" The old man did not speak. He just looked at them and gave a small nod.",
        "textdich": ""
    },
    {
        "start": 5431.04,
        "end": 5443.6,
        "text": "That was enough. The man turned and left. But the boy saw something. The old man's eyes were wet, just a little. Not",
        "textdich": ""
    },
    {
        "start": 5440.32,
        "end": 5455.28,
        "text": "tears, just water. Like the sea in his eyes, the sea that was always inside him. The respect had returned. Not because of a story, not because of a",
        "textdich": ""
    },
    {
        "start": 5451.84,
        "end": 5464.239,
        "text": "show, but because of the truth. The fish was gone, but the bones were there. The old man had lost the fight, but he had",
        "textdich": ""
    },
    {
        "start": 5461.679,
        "end": 5472.4,
        "text": "won something bigger. He had won the heart of the boy. He had won the respect of the village. And more than that, he",
        "textdich": ""
    },
    {
        "start": 5469.679,
        "end": 5480.96,
        "text": "had won himself. He had shown that even when you are tired, even when you are old, even when the world thinks you are",
        "textdich": ""
    },
    {
        "start": 5477.44,
        "end": 5486.719,
        "text": "finished, you can still rise. You can still fight. You can still be great.",
        "textdich": ""
    },
    {
        "start": 5484.32,
        "end": 5494.639,
        "text": "That night, the boy sat next to him again. The old man was asleep. The boy did not sleep. He looked at the man. He",
        "textdich": ""
    },
    {
        "start": 5492.719,
        "end": 5504.88,
        "text": "looked at the hands. He looked at the face. He thought, \"I want to be like him. Not just to catch fish, but to live",
        "textdich": ""
    },
    {
        "start": 5500.88,
        "end": 5516.08,
        "text": "like this, to be brave, to be quiet, to be true.\" Outside, the stars moved in the sky. The sea whispered in the dark. And in that",
        "textdich": ""
    },
    {
        "start": 5512.56,
        "end": 5525.6,
        "text": "little house, one old man slept, and one boy began to grow into something greater. Chapter 17. A lesson in pride.",
        "textdich": ""
    },
    {
        "start": 5522.639,
        "end": 5536.48,
        "text": "The next morning was quiet. The old man opened his eyes. The sun was not high yet. The air was soft. The boy was already there. He was sitting on the",
        "textdich": ""
    },
    {
        "start": 5533.92,
        "end": 5546.159,
        "text": "floor beside the bed. He had a small notebook in his hand, but he was not writing. He was just looking at the old man's face, watching him breathe,",
        "textdich": ""
    },
    {
        "start": 5543.6,
        "end": 5558.159,
        "text": "watching him rest. The old man turned his head slowly. He smiled. A very small smile. The kind of smile that says, \"I",
        "textdich": ""
    },
    {
        "start": 5554.159,
        "end": 5569.12,
        "text": "see you. I'm still here.\" The boy smiled back. \"Do you want to talk today?\" he asked softly. The old man did not speak",
        "textdich": ""
    },
    {
        "start": 5564.56,
        "end": 5580.239,
        "text": "for a moment. Then he said, \"Yes, but only a little.\" The boy moved closer. He sat on the edge of the bed. \"Now, I want",
        "textdich": ""
    },
    {
        "start": 5575.6,
        "end": 5583.12,
        "text": "to know,\" he said. I want to understand.",
        "textdich": ""
    },
    {
        "start": 5580.239,
        "end": 5594.96,
        "text": "Why did you go so far? The old man looked at the ceiling. His eyes were still like the deep sea. I went far, he said. Because I had to. The boy waited.",
        "textdich": ""
    },
    {
        "start": 5592.96,
        "end": 5605.28,
        "text": "He knew the old man was choosing his words slowly. The fish was out there, he said. And if I did not go, I would never",
        "textdich": ""
    },
    {
        "start": 5602.4,
        "end": 5616.32,
        "text": "know. I would never know if I was still strong. I would never know if I could still fight. The boy nodded. But why alone? He asked.",
        "textdich": ""
    },
    {
        "start": 5614.0,
        "end": 5624.96,
        "text": "Because that was the way, the old man said. Some battles are only yours. Some fights are meant to be quiet.",
        "textdich": ""
    },
    {
        "start": 5621.76,
        "end": 5634.08,
        "text": "The boy was quiet for a long time. Then he said, \"Were you proud?\" The old man turned his head and looked straight into",
        "textdich": ""
    },
    {
        "start": 5630.239,
        "end": 5644.4,
        "text": "the boy's eyes. \"Yes,\" he said. \"Very proud.\" Then he looked away again, but not proud like a loud man. Not proud with noise. Proud in my heart. Proud",
        "textdich": ""
    },
    {
        "start": 5642.0,
        "end": 5658.0,
        "text": "that I did not stop, that I did not break. The boy looked down. He thought about those words. They were slow. They were simple, but they were full of",
        "textdich": ""
    },
    {
        "start": 5654.08,
        "end": 5660.719,
        "text": "power. The old man took a deep breath.",
        "textdich": ""
    },
    {
        "start": 5658.0,
        "end": 5663.679,
        "text": "You must learn something, he said.",
        "textdich": ""
    },
    {
        "start": 5660.719,
        "end": 5674.8,
        "text": "Listen. When you fish, when you live, don't use anger. Use heart. Don't fight because of ego. Fight because it matters. The boy nodded again. You mean",
        "textdich": ""
    },
    {
        "start": 5672.08,
        "end": 5685.6,
        "text": "fight because you love? The old man smiled. Yes. Love the sea, love the fish, love the work, and love yourself, too. That's what keeps you alive.",
        "textdich": ""
    },
    {
        "start": 5682.88,
        "end": 5696.239,
        "text": "The boy looked outside. The wind moved the leaves. The sound was soft. He turned back. I want to learn more, he",
        "textdich": ""
    },
    {
        "start": 5692.719,
        "end": 5699.679,
        "text": "said. I want to know how to be like you.",
        "textdich": ""
    },
    {
        "start": 5696.239,
        "end": 5708.719,
        "text": "The old man shook his head slowly. No, he said, don't be like me. Be like you, but be strong. Be honest. Be quiet when",
        "textdich": ""
    },
    {
        "start": 5706.0,
        "end": 5713.6,
        "text": "the world is loud. And when you fall, fall with grace.",
        "textdich": ""
    },
    {
        "start": 5710.88,
        "end": 5723.12,
        "text": "The boy stood up. He felt something new in his chest. A kind of fire, but not wild, not loud. A fire that warmed him",
        "textdich": ""
    },
    {
        "start": 5720.159,
        "end": 5731.199,
        "text": "from the inside. A fire that whispered, not shouted. He walked to the small table and poured water into a cup. He",
        "textdich": ""
    },
    {
        "start": 5728.56,
        "end": 5741.76,
        "text": "brought it to the old man. The old man drank slowly. He nodded once. \"You will be a good man,\" he said. \"You already",
        "textdich": ""
    },
    {
        "start": 5738.08,
        "end": 5750.48,
        "text": "are.\" Later that day, the boy walked to the sea. He sat on the sand. He looked at the water, the same water that took",
        "textdich": ""
    },
    {
        "start": 5747.52,
        "end": 5759.52,
        "text": "the old man far away, the same water that brought him back. The sea was not the enemy. The sea was a teacher.",
        "textdich": ""
    },
    {
        "start": 5756.639,
        "end": 5770.88,
        "text": "Sometimes it was kind, sometimes it was cruel, but it always gave truth. He picked up a stone and threw it. It landed with a small splash. He closed",
        "textdich": ""
    },
    {
        "start": 5768.4,
        "end": 5780.639,
        "text": "his eyes and thought of the fish, the big one, the one that gave the old man pain, but also gave him purpose. And the",
        "textdich": ""
    },
    {
        "start": 5777.6,
        "end": 5792.48,
        "text": "boy understood something. The fish was not just a fish. It was life. It was struggle. It was the thing that made the old man alive.",
        "textdich": ""
    },
    {
        "start": 5790.08,
        "end": 5798.0,
        "text": "Back at the house, the old man was sleeping again. He dreamed of the lions.",
        "textdich": ""
    },
    {
        "start": 5796.08,
        "end": 5808.0,
        "text": "He dreamed of strength and beauty and freedom. But outside the dream, something had changed. The boy had changed. The old man had passed",
        "textdich": ""
    },
    {
        "start": 5805.52,
        "end": 5819.28,
        "text": "something on. Not money, not power, but wisdom. Deep wisdom. And that was more than enough. Chapter 18. Strength in silence.",
        "textdich": ""
    },
    {
        "start": 5816.48,
        "end": 5828.96,
        "text": "The house was quiet again. The sun moved across the sky, slow and golden. The old man sat near the door now, not in bed,",
        "textdich": ""
    },
    {
        "start": 5825.6,
        "end": 5838.0,
        "text": "not in pain, just still. The boy had placed a chair for him. It was an old wooden chair, a little broken, but strong enough. The old man sat with a",
        "textdich": ""
    },
    {
        "start": 5835.679,
        "end": 5846.32,
        "text": "blanket around his shoulders. His hands were still wrapped, his body still tired, but his eyes were clear, and they",
        "textdich": ""
    },
    {
        "start": 5843.119,
        "end": 5855.36,
        "text": "looked at the sea, not in anger, not in sadness, but in peace. like someone looking at an old friend. A friend who",
        "textdich": ""
    },
    {
        "start": 5852.08,
        "end": 5861.28,
        "text": "gave him pain, yes, but also meaning, a friend who showed him who he really was.",
        "textdich": ""
    },
    {
        "start": 5858.4,
        "end": 5869.92,
        "text": "He did not speak much now. He didn't need to. The boy sat next to him, sometimes speaking, sometimes quiet.",
        "textdich": ""
    },
    {
        "start": 5867.84,
        "end": 5878.96,
        "text": "Sometimes he read small things from an old book. Sometimes he just looked at the waves, too. No one came to the house",
        "textdich": ""
    },
    {
        "start": 5875.92,
        "end": 5888.4,
        "text": "today. No fishermen, no visitors. The people had already said what they needed to say, and the old man had already heard what he needed to hear. He had",
        "textdich": ""
    },
    {
        "start": 5885.76,
        "end": 5897.52,
        "text": "nothing more to prove. He had no need to explain because real strength does not shout. Real strength is quiet. It is in",
        "textdich": ""
    },
    {
        "start": 5894.159,
        "end": 5905.04,
        "text": "the way a man sits, the way he breathes, the way he looks at the world after losing everything and still sees beauty.",
        "textdich": ""
    },
    {
        "start": 5902.4,
        "end": 5906.96,
        "text": "The boy looked at him for a long time.",
        "textdich": ""
    },
    {
        "start": 5905.04,
        "end": 5914.88,
        "text": "He wanted to ask more questions about fishing, about pain, about what it meant to be a man. But he stopped himself.",
        "textdich": ""
    },
    {
        "start": 5913.119,
        "end": 5923.6,
        "text": "Something told him the answers were already here, not in words, but in this silence, in this presence, in this deep",
        "textdich": ""
    },
    {
        "start": 5920.639,
        "end": 5933.44,
        "text": "stillness between them, the boy felt something heavy in his chest. But not a bad heavy, a deep quiet feeling, like standing at the edge of the sea and",
        "textdich": ""
    },
    {
        "start": 5930.96,
        "end": 5942.32,
        "text": "knowing how small you are and also how important. like the sea itself was inside him. The old man lifted his hand",
        "textdich": ""
    },
    {
        "start": 5939.52,
        "end": 5948.639,
        "text": "just a little. The boy helped him drink water. The old man gave a small nod.",
        "textdich": ""
    },
    {
        "start": 5946.08,
        "end": 5959.92,
        "text": "That nod said more than a speech. It said, \"Thank you.\" It said, \"I'm okay.\" It said, \"I'm still here.\" The boy nodded back, and the silence between",
        "textdich": ""
    },
    {
        "start": 5957.04,
        "end": 5971.76,
        "text": "them became warm, like music without sound. The day passed slowly. The sky turned orange, then pink. The sea shimmerred like silver glass. The boy",
        "textdich": ""
    },
    {
        "start": 5969.76,
        "end": 5984.96,
        "text": "said, \"They are still talking about the fish.\" The old man smiled gently. He didn't answer. The boy said, \"They respect you now. Everyone does.\" Still,",
        "textdich": ""
    },
    {
        "start": 5981.36,
        "end": 5998.8,
        "text": "the old man stayed silent. Then, after a while, he said, \"That is not why I went.\" The boy nodded. \"I know,\" he said. The old man looked at the sea",
        "textdich": ""
    },
    {
        "start": 5994.88,
        "end": 6001.52,
        "text": "again. I went to remember, he whispered.",
        "textdich": ""
    },
    {
        "start": 5998.8,
        "end": 6004.8,
        "text": "The boy didn't ask what he meant.",
        "textdich": ""
    },
    {
        "start": 6001.52,
        "end": 6014.159,
        "text": "Somehow he already knew. The old man had gone to remember who he was, to meet the sea again, to find the fight inside him.",
        "textdich": ""
    },
    {
        "start": 6010.96,
        "end": 6023.199,
        "text": "Not for others, not for fame, but for himself. As the stars came out, the boy helped him back inside. He laid him",
        "textdich": ""
    },
    {
        "start": 6020.48,
        "end": 6029.76,
        "text": "gently on the bed. The old man did not complain. He did not speak.",
        "textdich": ""
    },
    {
        "start": 6026.719,
        "end": 6037.36,
        "text": "The boy sat beside him. He stayed even when the old man's eyes closed. He stayed even when the house was dark. He",
        "textdich": ""
    },
    {
        "start": 6035.199,
        "end": 6047.52,
        "text": "stayed because he knew that silence was not empty. It was full, full of love, full of lessons, full of strength.",
        "textdich": ""
    },
    {
        "start": 6044.4,
        "end": 6055.76,
        "text": "Outside the wind moved softly. The sea breathed in the night. And in a small house near the shore, a boy watched over",
        "textdich": ""
    },
    {
        "start": 6052.32,
        "end": 6066.8,
        "text": "an old man. And that old man, without words, without pride, without fish, was still the strongest person the boy had ever known.",
        "textdich": ""
    },
    {
        "start": 6062.96,
        "end": 6069.199,
        "text": "Chapter 19. The dream returns.",
        "textdich": ""
    },
    {
        "start": 6066.8,
        "end": 6077.84,
        "text": "The old man was sleeping again. His breath was soft, steady, quiet, like the sea on a calm day. The boy sat by the",
        "textdich": ""
    },
    {
        "start": 6074.719,
        "end": 6084.88,
        "text": "bed, not moving much, not speaking. He looked at the old man's face. There was something different now, something",
        "textdich": ""
    },
    {
        "start": 6082.08,
        "end": 6093.199,
        "text": "peaceful. The lines on his forehead were still there. The cuts on his hands were still healing. His bones were still old",
        "textdich": ""
    },
    {
        "start": 6089.84,
        "end": 6101.199,
        "text": "and tired. But his face, his face looked gentle, like a boy again, like someone remembering something beautiful. And the",
        "textdich": ""
    },
    {
        "start": 6098.56,
        "end": 6109.92,
        "text": "boy knew without being told that the old man was dreaming. He wasn't dreaming of the fish, not the great marlin he fought, not the sharks that tore it",
        "textdich": ""
    },
    {
        "start": 6107.36,
        "end": 6116.159,
        "text": "away, not the long days at sea, or the pain in his hands. No, not those things.",
        "textdich": ""
    },
    {
        "start": 6113.84,
        "end": 6124.08,
        "text": "He was dreaming of something older, something deeper, something that lived in his heart before all of this. He was",
        "textdich": ""
    },
    {
        "start": 6121.04,
        "end": 6133.199,
        "text": "dreaming of the lions. In his dream, he was not old. He was young and strong. He stood on the sands of Africa. The beach",
        "textdich": ""
    },
    {
        "start": 6130.32,
        "end": 6142.4,
        "text": "was golden. The sun was warm, and there on the shore were lions. Not one, not two, but many. They ran together. They",
        "textdich": ""
    },
    {
        "start": 6140.159,
        "end": 6150.719,
        "text": "played. They jumped through the waves like children. They were strong and free. Their mans moved in the wind.",
        "textdich": ""
    },
    {
        "start": 6148.0,
        "end": 6161.52,
        "text": "Their eyes were full of life. And the old man, who was not old in the dream, stood there and smiled. He watched them,",
        "textdich": ""
    },
    {
        "start": 6157.44,
        "end": 6167.04,
        "text": "not with fear, but with joy. These lions were not dangerous. They were beautiful.",
        "textdich": ""
    },
    {
        "start": 6164.48,
        "end": 6172.48,
        "text": "They were part of his soul. The dream was not loud. It had no story, no words.",
        "textdich": ""
    },
    {
        "start": 6170.56,
        "end": 6181.76,
        "text": "Just the feeling of strength, the feeling of freedom, the feeling of a life lived close to the sea, close to the earth, close to the heart. In this",
        "textdich": ""
    },
    {
        "start": 6179.84,
        "end": 6190.239,
        "text": "dream, he did not need to prove anything. He did not need to catch the biggest fish. He did not need to fight.",
        "textdich": ""
    },
    {
        "start": 6187.119,
        "end": 6199.36,
        "text": "He only needed to watch, to remember, to feel the wind on his face and the sand under his feet. He smiled in his sleep.",
        "textdich": ""
    },
    {
        "start": 6196.159,
        "end": 6209.44,
        "text": "The boy saw this smile. He did not wake the old man. He only watched. And in that moment, the boy felt something shift inside him. He understood",
        "textdich": ""
    },
    {
        "start": 6207.84,
        "end": 6217.6,
        "text": "something he could never learn from books. Something his teachers could never explain. that life is not only about winning, not only about catching",
        "textdich": ""
    },
    {
        "start": 6215.679,
        "end": 6225.6,
        "text": "the biggest thing or being the strongest in the room. Sometimes life is about the dreams you hold quietly, the images that",
        "textdich": ""
    },
    {
        "start": 6223.52,
        "end": 6235.44,
        "text": "come back to you, even when the world takes everything away. Outside the stars were many. The sea was soft. The night",
        "textdich": ""
    },
    {
        "start": 6232.719,
        "end": 6238.239,
        "text": "air moved through the house like a song.",
        "textdich": ""
    },
    {
        "start": 6235.44,
        "end": 6247.119,
        "text": "The boy closed his eyes for a moment. He saw the lions too, not clearly, not in detail, but he felt them. Their power,",
        "textdich": ""
    },
    {
        "start": 6244.159,
        "end": 6254.88,
        "text": "their joy, their grace. He felt that they were not just part of the old man's dream. They were something that lived in",
        "textdich": ""
    },
    {
        "start": 6252.4,
        "end": 6260.56,
        "text": "all of us, a symbol of what we could be if we stayed strong, if we stayed kind.",
        "textdich": ""
    },
    {
        "start": 6258.0,
        "end": 6265.52,
        "text": "If we remembered who we were, even when we were tired.",
        "textdich": ""
    },
    {
        "start": 6262.8,
        "end": 6273.92,
        "text": "The boy opened his eyes. He looked at the old man again. The smile was and the boy made a small promise in his heart",
        "textdich": ""
    },
    {
        "start": 6271.52,
        "end": 6284.239,
        "text": "that he would dream too. Not only of lions but of courage, of goodness, of simple things that made life full. He would carry the old man's story. Not",
        "textdich": ""
    },
    {
        "start": 6282.32,
        "end": 6291.36,
        "text": "just the story of the big fish, but the deeper story. The story of trying, the story of losing, the story of standing",
        "textdich": ""
    },
    {
        "start": 6289.199,
        "end": 6301.36,
        "text": "up again, and the story of smiling in your sleep. Because somewhere deep inside you are still running with lions.",
        "textdich": ""
    },
    {
        "start": 6297.44,
        "end": 6304.32,
        "text": "Chapter 20. The meaning of the story.",
        "textdich": ""
    },
    {
        "start": 6301.36,
        "end": 6312.96,
        "text": "The sun came up slowly. The sky turned soft blue. The sea was calm again. The waves moved like breathing. The old man",
        "textdich": ""
    },
    {
        "start": 6310.56,
        "end": 6321.679,
        "text": "was still sleeping, but the boy was now awake. He made some warm tea. He sat by the door and looked out. The town was",
        "textdich": ""
    },
    {
        "start": 6318.88,
        "end": 6328.88,
        "text": "quiet. The boats were still. The people had not come out yet, but the boy was already thinking. He was thinking about",
        "textdich": ""
    },
    {
        "start": 6326.96,
        "end": 6339.84,
        "text": "everything. The fish, the sharks, the fight, the loss, the silence, the old man. He had seen it all. And yet something in him felt stronger, not",
        "textdich": ""
    },
    {
        "start": 6336.719,
        "end": 6341.92,
        "text": "weaker. He wanted to understand why.",
        "textdich": ""
    },
    {
        "start": 6339.84,
        "end": 6351.28,
        "text": "What was the meaning of all this? What did the old man truly teach him? Later that day, the old man woke. He sat up",
        "textdich": ""
    },
    {
        "start": 6347.76,
        "end": 6360.56,
        "text": "slowly. He did not speak right away. He looked at his hands. He looked at the boy. He looked out at the sea. The boy",
        "textdich": ""
    },
    {
        "start": 6356.48,
        "end": 6364.08,
        "text": "gave him tea. The old man drank slowly.",
        "textdich": ""
    },
    {
        "start": 6360.56,
        "end": 6377.52,
        "text": "Then the boy asked very softly, \"Why did you go alone?\" The old man looked at him. He did not answer quickly. He thought for a while, then he said,",
        "textdich": ""
    },
    {
        "start": 6373.44,
        "end": 6383.84,
        "text": "\"Because I had to.\" His voice was soft, not sad, just honest.",
        "textdich": ""
    },
    {
        "start": 6380.56,
        "end": 6387.04,
        "text": "The boy said nothing, but he nodded.",
        "textdich": ""
    },
    {
        "start": 6383.84,
        "end": 6389.04,
        "text": "Somehow those simple words made sense.",
        "textdich": ""
    },
    {
        "start": 6387.04,
        "end": 6396.719,
        "text": "Sometimes in life, you do something not because it is easy, not because others understand, but because you have to,",
        "textdich": ""
    },
    {
        "start": 6393.92,
        "end": 6401.04,
        "text": "because something inside you says go.",
        "textdich": ""
    },
    {
        "start": 6396.719,
        "end": 6407.76,
        "text": "The boy sat closer. But the fish, you lost it. Was it worth it?",
        "textdich": ""
    },
    {
        "start": 6404.8,
        "end": 6419.28,
        "text": "The old man looked at the sea. Then he said, \"Yes, because I found myself again.\" The boy didn't understand right away. \"You found yourself?\" he asked.",
        "textdich": ""
    },
    {
        "start": 6416.4,
        "end": 6429.92,
        "text": "The old man smiled. \"When I was young, I was strong. I was brave. I fought big fish. I fought the sea.\" But then time",
        "textdich": ""
    },
    {
        "start": 6425.84,
        "end": 6442.239,
        "text": "passed. I became old. People said I was finished, that I had no luck, that I should stay home. But I knew inside me the man I was was still alive.",
        "textdich": ""
    },
    {
        "start": 6439.76,
        "end": 6452.56,
        "text": "I went out to meet him again. That was the real reason. The boy felt something in his heart. The old man continued. The",
        "textdich": ""
    },
    {
        "start": 6449.119,
        "end": 6455.36,
        "text": "fish was part of the test, not the goal.",
        "textdich": ""
    },
    {
        "start": 6452.56,
        "end": 6466.0,
        "text": "I fought him. I respected him. He was strong. But the real fight was here, he said, pointing to his chest. inside",
        "textdich": ""
    },
    {
        "start": 6462.639,
        "end": 6472.0,
        "text": "against fear, against giving up, against the voice that said, \"You are too old.",
        "textdich": ""
    },
    {
        "start": 6469.679,
        "end": 6485.119,
        "text": "You can't do it anymore.\" The boy looked at his hands. He thought about his own life, his own fears, his own dreams. \"And the sharks,\" he asked.",
        "textdich": ""
    },
    {
        "start": 6482.08,
        "end": 6498.159,
        "text": "\"The sharks were life,\" said the old man. \"They come when you win. They come to take what you fought for. You can cry, you can shout, or you can fight.",
        "textdich": ""
    },
    {
        "start": 6494.96,
        "end": 6509.52,
        "text": "Even if you lose, you still fight. That is pride. Not bad pride, but the pride of knowing you gave everything. The boy now understood.",
        "textdich": ""
    },
    {
        "start": 6507.36,
        "end": 6518.32,
        "text": "He understood the story was not about fish, not about luck, not about winning or losing. It was about something much",
        "textdich": ""
    },
    {
        "start": 6515.44,
        "end": 6529.199,
        "text": "deeper. It was about trying even when you're weak, even when you're tired, even when the world says you can't. It was about doing your best, not for a",
        "textdich": ""
    },
    {
        "start": 6526.0,
        "end": 6541.84,
        "text": "prize, but for yourself, for your soul. The old man closed his eyes again. He looked tired, but peaceful. The boy looked at him and",
        "textdich": ""
    },
    {
        "start": 6538.4,
        "end": 6552.159,
        "text": "whispered, \"You're not old. You are a lion.\" The old man didn't speak, but the smile on his face was enough. Outside, the sea",
        "textdich": ""
    },
    {
        "start": 6549.119,
        "end": 6563.199,
        "text": "moved softly. The waves came in, the waves went out. A big fish skeleton still rested by the boat. People passed by. They looked, they talked, but only",
        "textdich": ""
    },
    {
        "start": 6560.48,
        "end": 6574.32,
        "text": "the boy knew the real story. And he would carry it forever. The story of an old man, a big fish, a fight, a loss, a",
        "textdich": ""
    },
    {
        "start": 6570.88,
        "end": 6585.04,
        "text": "dream, a smile, and the deep meaning that lives behind silence, behind pain, behind the sea. It was not just a story.",
        "textdich": ""
    },
    {
        "start": 6581.119,
        "end": 6585.04,
        "text": "It was a lesson for all of",
        "textdich": ""
    }
]