[
    {
        "start": 1.12,
        "end": 11.599,
        "text": "Welcome to English Story Today. Don't forget like and subscribe.",
        "textdich": ""
    },
    {
        "start": 6.879,
        "end": 20.72,
        "text": "My name is Emily. I am 23 years old. I live in a small city called Willow Creek with my father and my younger sister. I",
        "textdich": ""
    },
    {
        "start": 18.08,
        "end": 25.519,
        "text": "work at a small coffee shop in the city center.",
        "textdich": ""
    },
    {
        "start": 22.8,
        "end": 39.04,
        "text": "I like my job because I love meeting people and making coffee. But one morning, something very strange happened to me. It was a cold, rainy morning in",
        "textdich": ""
    },
    {
        "start": 35.84,
        "end": 49.68,
        "text": "October. I woke up early because I had an early shift at the cafe. When I checked my phone, I saw a message from",
        "textdich": ""
    },
    {
        "start": 45.84,
        "end": 63.92,
        "text": "my best friend Sophie. The message said, \"Emily, please come to the train station today. I really need you. 11 a.m. platform 5. I did not understand.",
        "textdich": ""
    },
    {
        "start": 61.52,
        "end": 74.56,
        "text": "Why did Sophie want me to go to the train station? She didn't say anything else. I called her, but her phone was",
        "textdich": ""
    },
    {
        "start": 70.64,
        "end": 86.159,
        "text": "switched off. I looked at the clock. It was already 9 a.m. I only had 2 hours to get ready and reach the train station. I",
        "textdich": ""
    },
    {
        "start": 82.799,
        "end": 97.84,
        "text": "put on my favorite jeans, a warm blue sweater, and my black boots. I grabbed my raincoat and my small black umbrella.",
        "textdich": ""
    },
    {
        "start": 94.159,
        "end": 108.96,
        "text": "My dad was making breakfast. I told him, \"Dad, I have to go to the train station.\" Sophie needs my help. My dad looked at",
        "textdich": ""
    },
    {
        "start": 106.0,
        "end": 123.119,
        "text": "me with worry. He said, \"Be careful, Emily. Call me if you need anything. I left the house and walked to the bus stop. The rain was falling heavily. I",
        "textdich": ""
    },
    {
        "start": 119.84,
        "end": 137.2,
        "text": "got on the bus. It was crowded with people going to work. I found a small space near the door. The windows were foggy and I watched the city pass by.",
        "textdich": ""
    },
    {
        "start": 134.0,
        "end": 151.599,
        "text": "After 30 minutes, I reached the train station. The station was big and full of noise. People were rushing everywhere with bags and suitcases.",
        "textdich": ""
    },
    {
        "start": 147.599,
        "end": 165.44,
        "text": "I looked for platform 5. It took me 10 minutes to find it. Because the signs were not clear, but when I reached there, Sophie was not there. I waited",
        "textdich": ""
    },
    {
        "start": 161.68,
        "end": 181.519,
        "text": "for 10 minutes, then 15 minutes, then 20 minutes. Still no Sophie. I felt worried and confused. I looked around and saw a young boy",
        "textdich": ""
    },
    {
        "start": 178.48,
        "end": 193.2,
        "text": "sitting alone on a bench. He was holding a small bag and looking very sad. I walked slowly to him and asked, \"Hey,",
        "textdich": ""
    },
    {
        "start": 189.44,
        "end": 207.92,
        "text": "are you okay?\" He looked up. His eyes were red like he had been crying. He said, \"I lost my ticket. I don't know how to go home now.\" I sat down beside",
        "textdich": ""
    },
    {
        "start": 203.28,
        "end": 217.84,
        "text": "him. I said, \"My name is Emily. Maybe I can help you. What's your name?\" He said his name was Oliver. He told me he was",
        "textdich": ""
    },
    {
        "start": 215.44,
        "end": 231.12,
        "text": "visiting his grandmother, but he dropped his train ticket somewhere. He was scared to call his mom. I gave him a small chocolate from my bag and told",
        "textdich": ""
    },
    {
        "start": 226.799,
        "end": 238.48,
        "text": "him, \"Don't worry, we will find a way.\" Just then, my phone rang. It was Sophie.",
        "textdich": ""
    },
    {
        "start": 235.519,
        "end": 246.239,
        "text": "I quickly answered, \"Sophie, where are you?\" Sophie sounded scared.",
        "textdich": ""
    },
    {
        "start": 242.879,
        "end": 261.6,
        "text": "She said, \"Emily, where are you?\" I said, \"I'm at platform 5 waiting for you.\" Sophie said, \"Oh no, I'm at platform 3. Please come quickly. I'm",
        "textdich": ""
    },
    {
        "start": 258.72,
        "end": 272.4,
        "text": "really scared.\" I looked at Oliver and said, \"Wait here for a moment. I'll be right back.\" I ran through the station",
        "textdich": ""
    },
    {
        "start": 268.16,
        "end": 283.12,
        "text": "to platform 3. My shoes were wet and my hair was damp from the rain. When I reached platform 3, I saw Sophie sitting",
        "textdich": ""
    },
    {
        "start": 279.84,
        "end": 286.16,
        "text": "on the floor near a ticket machine.",
        "textdich": ""
    },
    {
        "start": 283.12,
        "end": 290.96,
        "text": "She looked so scared.",
        "textdich": ""
    },
    {
        "start": 286.16,
        "end": 302.88,
        "text": "Sophie, I called. She looked up and ran to me. She hugged me tightly. Emily, I didn't know who to call. I was so",
        "textdich": ""
    },
    {
        "start": 299.12,
        "end": 306.72,
        "text": "scared, she said. What happened, Sophie?",
        "textdich": ""
    },
    {
        "start": 302.88,
        "end": 314.24,
        "text": "I asked. She whispered. I think someone is following me. My eyes opened wide.",
        "textdich": ""
    },
    {
        "start": 310.96,
        "end": 317.919,
        "text": "Who? Why would someone follow you?",
        "textdich": ""
    },
    {
        "start": 314.24,
        "end": 330.08,
        "text": "Sophie said. I don't know. I saw a man on my bus. He kept looking at me. When I got down, he got down, too. Now he's",
        "textdich": ""
    },
    {
        "start": 326.56,
        "end": 342.08,
        "text": "here somewhere. I looked around. People were walking everywhere. Then Sophie pointed slowly at someone near the small cafe.",
        "textdich": ""
    },
    {
        "start": 338.32,
        "end": 350.72,
        "text": "That's him, she whispered. I looked and saw a man in a dark green jacket and a black beanie hat. He was standing near",
        "textdich": ""
    },
    {
        "start": 348.08,
        "end": 359.6,
        "text": "the cafe pretending to look at his phone. I felt my heartbeat faster.",
        "textdich": ""
    },
    {
        "start": 355.44,
        "end": 361.84,
        "text": "Stay here, I said. I'll go talk to him.",
        "textdich": ""
    },
    {
        "start": 359.6,
        "end": 371.759,
        "text": "But when I stepped forward, the man looked at us and quickly walked away. We stood there watching him disappear into",
        "textdich": ""
    },
    {
        "start": 368.479,
        "end": 384.88,
        "text": "the crowd. Sophie said, \"Do you believe me now?\" I nodded. \"Yes, let's tell the station security.\" We went to the help desk and told a kind",
        "textdich": ""
    },
    {
        "start": 381.6,
        "end": 395.28,
        "text": "lady everything. She called the security guard. The guard listened carefully and said, \"Don't worry, we will check the",
        "textdich": ""
    },
    {
        "start": 391.52,
        "end": 398.56,
        "text": "cameras.\" Sophie looked a little calmer.",
        "textdich": ""
    },
    {
        "start": 395.28,
        "end": 412.24,
        "text": "She squeezed my hand and said, \"Thank you, Emily. I don't know what I would do without you.\" I said, \"Next time, send me the right platform.\"",
        "textdich": ""
    },
    {
        "start": 408.56,
        "end": 422.8,
        "text": "We laughed a little, but deep inside I was still worried. Then I remembered Oliver, the little boy. I told Sophie,",
        "textdich": ""
    },
    {
        "start": 419.759,
        "end": 432.56,
        "text": "\"Wait here. I need to help someone else, too.\" We went back to platform 5 and found Oliver still sitting there holding",
        "textdich": ""
    },
    {
        "start": 428.88,
        "end": 444.0,
        "text": "his small bag. Sophie sat with him while I went to the ticket counter. I explained Oliver<unk>'s problem. The lady at the counter was kind. She said",
        "textdich": ""
    },
    {
        "start": 441.039,
        "end": 446.8,
        "text": "she would call Oliver<unk>'s mother.",
        "textdich": ""
    },
    {
        "start": 444.0,
        "end": 452.16,
        "text": "When Oliver's mom arrived, she hugged him tightly.",
        "textdich": ""
    },
    {
        "start": 448.639,
        "end": 463.44,
        "text": "She thanked me and Sophie again and again. I felt warm inside. It felt good to help. When we left the station, it",
        "textdich": ""
    },
    {
        "start": 460.24,
        "end": 475.12,
        "text": "was still raining. Sophie and I shared my umbrella. We walked to a small cafe to rest and drink tea. We talked about what happened. Sophie told me she",
        "textdich": ""
    },
    {
        "start": 473.12,
        "end": 487.039,
        "text": "thought her old boyfriend might be behind this. He was angry when she left him. I told her, \"Don't worry. You are",
        "textdich": ""
    },
    {
        "start": 483.12,
        "end": 500.479,
        "text": "safe now. If he tries anything again, we will tell the police.\" Sophie smiled weakly. \"You're my best friend, Emily. I said always.",
        "textdich": ""
    },
    {
        "start": 496.639,
        "end": 510.16,
        "text": "After tea, we took a taxi home. I looked out the window and saw the city lights shining through the rain. Sophie rested",
        "textdich": ""
    },
    {
        "start": 506.8,
        "end": 515.68,
        "text": "her head on my shoulder. I felt tired but strong.",
        "textdich": ""
    },
    {
        "start": 512.159,
        "end": 526.72,
        "text": "So many things happened that day. The strange man helping Oliver being brave for Sophie. When I got home, my dad and",
        "textdich": ""
    },
    {
        "start": 523.76,
        "end": 539.92,
        "text": "my sister were waiting. They hugged me tight. I told them everything. My dad said, \"You are my brave girl.\" My sister",
        "textdich": ""
    },
    {
        "start": 534.959,
        "end": 550.8,
        "text": "said, \"I want to be like you one day.\" That night, I couldn't sleep well. My mind was full of questions. But I knew",
        "textdich": ""
    },
    {
        "start": 546.72,
        "end": 561.839,
        "text": "one thing. I was not alone. I had my family. I had my best friend. And I had a kind heart that helped people. One",
        "textdich": ""
    },
    {
        "start": 558.959,
        "end": 571.44,
        "text": "week later, I was making coffee at the shop when someone called my name. I turned and saw Oliver and his mother.",
        "textdich": ""
    },
    {
        "start": 568.56,
        "end": 580.399,
        "text": "They came to thank me again. They brought me a small box of homemade cookies. I felt so happy.",
        "textdich": ""
    },
    {
        "start": 577.76,
        "end": 586.0,
        "text": "That day I understood something important.",
        "textdich": ""
    },
    {
        "start": 582.16,
        "end": 594.2,
        "text": "Sometimes scary things happen. But if we help each other, if we stay brave and kind, we can face anything together.",
        "textdich": ""
    }
]