[
  {
    "start": 0.24,
    "end": 17.92,
    "text": "My name is Elellena. I am not young anymore. I am 87 years old. I have lived many years. I have seen many things. Now I am going to see my son. It",
    "textdich": ""
  },
  {
    "start": 15.519,
    "end": 30.92,
    "text": "has been a long time. The plane is ready to leave. People talk, some laugh, some are quiet. A voice says, \"Please fasten your seat",
    "textdich": ""
  },
  {
    "start": 27.16,
    "end": 37.64,
    "text": "belt.\" I listen. I follow the instructions. The plane starts moving.",
    "textdich": ""
  },
  {
    "start": 34.32,
    "end": 52.399,
    "text": "My heart feels heavy. So many memories. I think about the last time I saw my son. He was young. He had big dreams. He said, \"Mom, I want to study.",
    "textdich": ""
  },
  {
    "start": 48.399,
    "end": 60.0,
    "text": "I want a better life.\" I said, \"Go, my son. Learn. Be strong.\" Then he left.",
    "textdich": ""
  },
  {
    "start": 56.8,
    "end": 69.72,
    "text": "Years passed. Letters came, then phone calls, but I never saw him again. Now I have a ticket. I have a seat. I have a",
    "textdich": ""
  },
  {
    "start": 67.159,
    "end": 85.2,
    "text": "destination. I closed my eyes for a moment. My son said, \"Come visit me, Mom.\" I said, \"Yes, my son. It is time.\" A voice interrupts my thoughts.",
    "textdich": ""
  },
  {
    "start": 82.24,
    "end": 90.799,
    "text": "\"Would you like something to drink?\" I open my eyes.",
    "textdich": ""
  },
  {
    "start": 87.119,
    "end": 104.64,
    "text": "I look at the flight attendant. I say, \"Just water, please.\" She gives me a small cup. I hold it. The plane is quiet now. I hear whispers. I hear",
    "textdich": ""
  },
  {
    "start": 101.079,
    "end": 116.079,
    "text": "footsteps. But my mind is in the past. I remember when I was young. Life was different, hard. I worked every day. I",
    "textdich": ""
  },
  {
    "start": 111.6,
    "end": 117.32,
    "text": "helped my family. I had dreams, too.",
    "textdich": ""
  },
  {
    "start": 116.079,
    "end": 132.319,
    "text": "But I waited. I waited for the right time. Did I make the right choices? Did I do enough? The plane moves smoothly. I",
    "textdich": ""
  },
  {
    "start": 129.28,
    "end": 141.28,
    "text": "think about my son. Will he recognize me? Will he still need me? My journey is not just to another city. It is a",
    "textdich": ""
  },
  {
    "start": 139.04,
    "end": 156.48,
    "text": "journey through time, through memories, through life. I was not always an old woman. I was once a young girl. My family was poor. We did not have much.",
    "textdich": ""
  },
  {
    "start": 152.959,
    "end": 167.519,
    "text": "Every day we worked. My father worked in the fields. My mother cooked and cleaned. I helped her. That was my life.",
    "textdich": ""
  },
  {
    "start": 163.92,
    "end": 177.4,
    "text": "One day I heard children reading. Their voices were clear. They repeated words. I wanted to learn.",
    "textdich": ""
  },
  {
    "start": 174.48,
    "end": 191.2,
    "text": "I said, \"Father, can I go to school?\" He looked at me. He shook his head. \"No, Elena, girls do not need school. Girls take care of the",
    "textdich": ""
  },
  {
    "start": 187.239,
    "end": 204.879,
    "text": "house.\" I did not answer, but inside I felt something. A small fire, a question. Why? Why could boys learn? Why not me? At night, I listened to my",
    "textdich": ""
  },
  {
    "start": 201.76,
    "end": 214.799,
    "text": "brothers. They talked about school. They had books. When they slept, I took a book. I opened it. I looked at the",
    "textdich": ""
  },
  {
    "start": 211.36,
    "end": 230.239,
    "text": "letters. I traced them with my finger. I whispered the words. I did not understand everything, but I tried. My mother saw me. She said, \"Elena, you",
    "textdich": ""
  },
  {
    "start": 225.68,
    "end": 243.0,
    "text": "must sleep.\" I said, \"I want to learn.\" She sighed. She did not stop me. Years passed. I learned little by little. I listened. I copied words. I asked",
    "textdich": ""
  },
  {
    "start": 240.76,
    "end": 252.239,
    "text": "questions. Some people laughed. Why do you try? You're a girl.",
    "textdich": ""
  },
  {
    "start": 247.76,
    "end": 256.32,
    "text": "But I did not stop. Then I grew older.",
    "textdich": ""
  },
  {
    "start": 252.239,
    "end": 261.6,
    "text": "My father said, \"It is time to marry. I did not want to marry. I wanted to work.",
    "textdich": ""
  },
  {
    "start": 258.959,
    "end": 264.6,
    "text": "I wanted to learn more.",
    "textdich": ""
  },
  {
    "start": 261.6,
    "end": 280.16,
    "text": "I said, \"No, father. I want a different life.\" He was angry. He did not understand. I left my home. I was afraid. But I knew one",
    "textdich": ""
  },
  {
    "start": 274.919,
    "end": 283.04,
    "text": "thing. I wanted more. I wanted a future.",
    "textdich": ""
  },
  {
    "start": 280.16,
    "end": 289.68,
    "text": "I wanted to prove that I could be more than what others expected.",
    "textdich": ""
  },
  {
    "start": 286.24,
    "end": 303.28,
    "text": "I left my home with nothing. No money, no plan, only hope. I walked to the next town. I looked for work. People said, \"You are a",
    "textdich": ""
  },
  {
    "start": 299.16,
    "end": 315.919,
    "text": "woman. What can you do?\" I said, \"I can work hard.\" A kind woman gave me a job. She had a small store. She said, \"You can",
    "textdich": ""
  },
  {
    "start": 311.96,
    "end": 319.88,
    "text": "clean. You can help with the customers.",
    "textdich": ""
  },
  {
    "start": 315.919,
    "end": 332.479,
    "text": "I said, \"Yes, thank you.\" I worked every day, morning to night. I listened to people talk. I learned new words. I watched how they",
    "textdich": ""
  },
  {
    "start": 329.28,
    "end": 347.16,
    "text": "bought things. I watched how the woman managed the money. One day, I said, \"Can you teach me to count money?\" She looked at me. She smiled. Yes,",
    "textdich": ""
  },
  {
    "start": 344.919,
    "end": 353.88,
    "text": "Elena, I will teach you. I learned fast. I worked hard.",
    "textdich": ""
  },
  {
    "start": 351.36,
    "end": 367.039,
    "text": "Soon, I was not just cleaning. I was selling. I was helping. People started to know me. They said, \"Elena is smart. Elena is good at",
    "textdich": ""
  },
  {
    "start": 363.72,
    "end": 377.759,
    "text": "business. I saved money. It was not much, but it was mine.\" Then one day, I made a big decision. I said, \"I want my",
    "textdich": ""
  },
  {
    "start": 373.919,
    "end": 390.4,
    "text": "own store.\" The woman laughed. \"That is not easy, Elena.\" I said, \"I know, but I will try.\" I found a small space. I bought a",
    "textdich": ""
  },
  {
    "start": 387.44,
    "end": 393.919,
    "text": "few things to sell. I opened my store.",
    "textdich": ""
  },
  {
    "start": 390.4,
    "end": 406.919,
    "text": "At first, nobody came. People said, \"She is just a woman. She will fail.\" But I did not stop. I smiled. I welcomed everyone. I spoke kindly.",
    "textdich": ""
  },
  {
    "start": 404.0,
    "end": 423.4,
    "text": "Slowly people came. They bought small things. Then more. My store grew. One day a man came. He looked at me. He said, \"You are different. You are",
    "textdich": ""
  },
  {
    "start": 420.68,
    "end": 431.4,
    "text": "strong.\" I did not know what to say. He came back the next day and the next.",
    "textdich": ""
  },
  {
    "start": 428.72,
    "end": 444.24,
    "text": "He asked me, \"Will you marry me?\" I thought of my father's words. It is time to marry. But this time, I had a choice. I",
    "textdich": ""
  },
  {
    "start": 440.96,
    "end": 457.12,
    "text": "was not a girl with no power. I was a woman who had built something. I looked at the man. I said, \"Yes, but only if you respect me. Only",
    "textdich": ""
  },
  {
    "start": 454.479,
    "end": 467.28,
    "text": "if you let me keep my dreams.\" He smiled. Yes, Elena. We married. We worked together.",
    "textdich": ""
  },
  {
    "start": 463.759,
    "end": 471.599,
    "text": "We grew the business. Then we had a son.",
    "textdich": ""
  },
  {
    "start": 467.28,
    "end": 481.8,
    "text": "My son. I held him in my arms. I looked at his small face. I made a promise. I whispered, \"You will have a better life.",
    "textdich": ""
  },
  {
    "start": 478.72,
    "end": 496.56,
    "text": "You will go to school. You will learn.\" Years passed. My son grew. He was smart. He loved books. One day he said, \"Mom, I want to",
    "textdich": ""
  },
  {
    "start": 492.96,
    "end": 500.16,
    "text": "study in the city.\" My heart felt heavy.",
    "textdich": ""
  },
  {
    "start": 496.56,
    "end": 513.519,
    "text": "I wanted him close. But I remembered my own past. I remembered my dreams. I smiled. I said, \"Go, my son. Learn. Be",
    "textdich": ""
  },
  {
    "start": 510.12,
    "end": 521.44,
    "text": "strong.\" He packed his things. He hugged me. He said, \"I will write to you, Mom.",
    "textdich": ""
  },
  {
    "start": 516.64,
    "end": 524.399,
    "text": "I will call.\" Then he left and I waited.",
    "textdich": ""
  },
  {
    "start": 521.44,
    "end": 536.24,
    "text": "I waited for his letters. I waited for his voice on the phone. I waited for the day I would see him again. Years passed. My son was far",
    "textdich": ""
  },
  {
    "start": 533.32,
    "end": 543.56,
    "text": "away. At first, he wrote letters. He called me. He said, \"Mom, I am studying.",
    "textdich": ""
  },
  {
    "start": 538.959,
    "end": 556.2,
    "text": "I am learning so much.\" I smiled. I felt proud. Then the letters came less. The phone calls were short. He said, \"Mom, I",
    "textdich": ""
  },
  {
    "start": 551.76,
    "end": 570.88,
    "text": "am busy. I have exams. I have work.\" I understood, but my heart felt empty. One day I waited for his call. The phone did not ring. The next day,",
    "textdich": ""
  },
  {
    "start": 566.36,
    "end": 577.279,
    "text": "nothing. A week passed, a month. I wrote a letter.",
    "textdich": ""
  },
  {
    "start": 572.72,
    "end": 589.68,
    "text": "My son, are you okay? No answer. I asked myself, did he forget me? Did I send him too far? One night, I sat alone. The store",
    "textdich": ""
  },
  {
    "start": 586.24,
    "end": 600.56,
    "text": "was closed. The house was quiet. I looked at the empty chair. That was my son's chair. But he was not here. I thought maybe he does not need me",
    "textdich": ""
  },
  {
    "start": 598.959,
    "end": 603.0,
    "text": "anymore.",
    "textdich": ""
  },
  {
    "start": 600.56,
    "end": 614.48,
    "text": "Maybe I should not have let him go. Then one day, a letter came. My hands shook as I opened it.",
    "textdich": ""
  },
  {
    "start": 610.0,
    "end": 618.56,
    "text": "Mom, I miss you. I have a good job now.",
    "textdich": ""
  },
  {
    "start": 614.48,
    "end": 620.36,
    "text": "I want to see you. Please come visit me.",
    "textdich": ""
  },
  {
    "start": 618.56,
    "end": 634.959,
    "text": "Tears filled my eyes. I touched the paper. My son had not forgotten me. He still wanted me. But could I go? Could I leave",
    "textdich": ""
  },
  {
    "start": 631.16,
    "end": 646.16,
    "text": "everything? I sat for a long time. Then I made a decision. I would go. I bought a ticket. I packed a small bag. The day",
    "textdich": ""
  },
  {
    "start": 642.959,
    "end": 653.44,
    "text": "of my flight, I stood at the airport. I had never been on a plane before.",
    "textdich": ""
  },
  {
    "start": 649.2,
    "end": 666.399,
    "text": "Everything was new. I felt small. A voice said, \"Passengers, please board now.\" I took a deep breath. I walked forward. I entered",
    "textdich": ""
  },
  {
    "start": 662.64,
    "end": 680.24,
    "text": "the plane. I sat down. The seat belt felt tight. The plane moved. My heart beat fast. The engine roared. The plane lifted. I was in the air. I thought,",
    "textdich": ""
  },
  {
    "start": 676.32,
    "end": 691.6,
    "text": "\"This is it. I'm going to see my son.\" But one question stayed in my mind. Will he recognize me? I looked at my hands.",
    "textdich": ""
  },
  {
    "start": 687.92,
    "end": 701.92,
    "text": "They were old now. My hair was white. My face had lines. My son had left when he was young. Now he was a man. Will he",
    "textdich": ""
  },
  {
    "start": 698.72,
    "end": 715.0,
    "text": "still see me as his mother? Will he hug me like before? I closed my eyes. The memories came back, his small hands holding mine.",
    "textdich": ""
  },
  {
    "start": 711.36,
    "end": 722.64,
    "text": "His voice saying, \"Mom, tell me a story.\" His laughter filling the house.",
    "textdich": ""
  },
  {
    "start": 719.12,
    "end": 737.04,
    "text": "Now he was far away. He had his own life. He was not a boy anymore. What if he has changed? What if he does not need me? The plane flew through the",
    "textdich": ""
  },
  {
    "start": 732.92,
    "end": 750.92,
    "text": "sky. I held the letter in my hands. My son's words were there. Mom, I want to see you. But a voice inside me asked, \"What",
    "textdich": ""
  },
  {
    "start": 747.6,
    "end": 761.279,
    "text": "if he only says that because he feels guilty? What if he does not really want me there?\" The plane would land soon. My",
    "textdich": ""
  },
  {
    "start": 758.16,
    "end": 772.959,
    "text": "journey was almost over. But my biggest question was still unanswered. Will my son welcome me or will I be a stranger to him",
    "textdich": ""
  },
  {
    "start": 769.16,
    "end": 787.279,
    "text": "now? The plane started to descend. The voice said, \"We will land soon.\" My hands felt cold. My heart was beating fast. This is it. I will see my",
    "textdich": ""
  },
  {
    "start": 783.48,
    "end": 797.36,
    "text": "son. But I was afraid. I thought, \"What if he is not there? What if he changed his mind?\" The plane landed. People",
    "textdich": ""
  },
  {
    "start": 794.079,
    "end": 807.6,
    "text": "stood up. They took their bags. I sat for a moment. I took a deep breath. Then I stood up too. I walked slowly. I",
    "textdich": ""
  },
  {
    "start": 805.2,
    "end": 813.639,
    "text": "followed the other passengers. I saw a big sign.",
    "textdich": ""
  },
  {
    "start": 810.36,
    "end": 827.32,
    "text": "Exit. My steps felt heavy. I entered the airport. People were waiting. Some held signs. Some held flowers. Some hugged their",
    "textdich": ""
  },
  {
    "start": 824.519,
    "end": 834.92,
    "text": "families. I searched for my son, but I did not see him.",
    "textdich": ""
  },
  {
    "start": 830.56,
    "end": 849.279,
    "text": "I looked again. Left, right, nothing. My heart dropped. Did he forget? Did I come for nothing? I stood there. People passed",
    "textdich": ""
  },
  {
    "start": 844.92,
    "end": 859.92,
    "text": "by. Nobody looked at me. I felt small. I felt lost. Minutes passed. Then I heard a voice. Excuse me, ma'am. Are you Elena?",
    "textdich": ""
  },
  {
    "start": 858.16,
    "end": 862.48,
    "text": "I turned around.",
    "textdich": ""
  },
  {
    "start": 859.92,
    "end": 870.079,
    "text": "A young woman stood there. She had a kind face. She was holding a phone.",
    "textdich": ""
  },
  {
    "start": 866.0,
    "end": 882.32,
    "text": "\"Yes,\" I said. My voice was weak. She smiled. \"Your son sent me. He could not come. He had an important meeting. He asked me to bring you to",
    "textdich": ""
  },
  {
    "start": 878.68,
    "end": 885.839,
    "text": "him. I felt something break inside me.",
    "textdich": ""
  },
  {
    "start": 882.32,
    "end": 894.88,
    "text": "My son was not here. I traveled all this way and he was not here.\" I nodded.",
    "textdich": ""
  },
  {
    "start": 890.199,
    "end": 909.839,
    "text": "Okay. She took my bag. Follow me. I walked with her. I did not say anything. We went outside. A car was waiting. She opened the door. Please get",
    "textdich": ""
  },
  {
    "start": 905.56,
    "end": 912.72,
    "text": "in. I sat in the car. The door closed.",
    "textdich": ""
  },
  {
    "start": 909.839,
    "end": 924.639,
    "text": "The city lights passed by. My heart was heavy. He did not come. He sent someone else. I wanted to cry, but I did not.",
    "textdich": ""
  },
  {
    "start": 920.639,
    "end": 934.279,
    "text": "The car stopped. The woman smiled. We are here. I looked outside. It was a tall building. She opened the door for",
    "textdich": ""
  },
  {
    "start": 930.639,
    "end": 949.72,
    "text": "me. I stepped out. Your son is waiting inside. She said, \"I walked in. The elevator went up. The doors opened. I saw him. He stood there in a suit. He",
    "textdich": ""
  },
  {
    "start": 946.56,
    "end": 964.16,
    "text": "looked older, taller, stronger. But his face, his face was still my son's face. I wanted to smile, but I waited. I wanted him to speak",
    "textdich": ""
  },
  {
    "start": 960.92,
    "end": 976.72,
    "text": "first. He looked at me. His mouth opened, then he closed it. He took a step forward. Then he said, \"Mom, I'm so sorry.\" His voice cracked, his eyes",
    "textdich": ""
  },
  {
    "start": 974.32,
    "end": 981.68,
    "text": "filled with tears. I did not expect that. He walked to me. He took my hands.",
    "textdich": ""
  },
  {
    "start": 979.68,
    "end": 991.68,
    "text": "He held them tight. I wanted to be there. I tried, but I couldn't leave. I was scared you would be angry. I looked",
    "textdich": ""
  },
  {
    "start": 987.68,
    "end": 1006.199,
    "text": "at my son, my grown son. He was not a boy anymore. But now, in this moment, he looked like one. I smiled. I held his hands, too.",
    "textdich": ""
  },
  {
    "start": 1002.399,
    "end": 1018.36,
    "text": "My son, I said, I am here now. And at that moment, I knew he had not forgotten me. My son held my hands.",
    "textdich": ""
  },
  {
    "start": 1014.88,
    "end": 1029.039,
    "text": "His grip was strong, but his hands were shaking. His eyes were full of tears. I had not seen him cry since he was a",
    "textdich": ""
  },
  {
    "start": 1024.559,
    "end": 1042.959,
    "text": "little boy. \"Mom,\" he said again, his voice soft. I missed you. I looked at him. My son. The little boy who once held my hand on his first day of",
    "textdich": ""
  },
  {
    "start": 1040.199,
    "end": 1059.44,
    "text": "school. The boy who ran to me when he was scared. Now he was a man. A man with a suit, a job, a life of his own. But in this moment, he was still my",
    "textdich": ""
  },
  {
    "start": 1055.24,
    "end": 1074.4,
    "text": "son. \"I missed you, too,\" I said. My voice was calm. He sighed. I thought you would be angry. I thought you would feel",
    "textdich": ""
  },
  {
    "start": 1070.28,
    "end": 1086.96,
    "text": "forgotten. I shook my head. I waited for you. Yes, but I knew you were working hard. I knew you were building your future. That is what I wanted for",
    "textdich": ""
  },
  {
    "start": 1083.48,
    "end": 1089.12,
    "text": "you. He closed his eyes for a second.",
    "textdich": ""
  },
  {
    "start": 1086.96,
    "end": 1092.4,
    "text": "Then he looked at me again.",
    "textdich": ""
  },
  {
    "start": 1089.12,
    "end": 1107.64,
    "text": "Mom, I should have visited you. I should have called more. I smiled. I am here now. That is what matters. He let go of my hands and stepped",
    "textdich": ""
  },
  {
    "start": 1102.36,
    "end": 1122.36,
    "text": "back. Come, let's go home. Home? I asked. Yes, he said, smiling now. My home. Your home now. We walked out together. The air was cool. The city",
    "textdich": ""
  },
  {
    "start": 1119.6,
    "end": 1131.36,
    "text": "lights were bright. Everything was different. But something inside me felt the same. I was not just a visitor. I",
    "textdich": ""
  },
  {
    "start": 1129.039,
    "end": 1146.88,
    "text": "was not just an old woman who came from far away. I was still a mother. We got into his car. As we drove, he talked. He told me about his job, his",
    "textdich": ""
  },
  {
    "start": 1144.4,
    "end": 1149.16,
    "text": "dreams, his struggles.",
    "textdich": ""
  },
  {
    "start": 1146.88,
    "end": 1169.24,
    "text": "He asked me about my life. How was the store, Mom? How was everything? I laughed. Oh, the store is fine, but business is not as easy as before. He",
    "textdich": ""
  },
  {
    "start": 1165.64,
    "end": 1183.6,
    "text": "smiled. Maybe I can help with that. I looked at him. My son was now the one offering help. Time had changed things, but love",
    "textdich": ""
  },
  {
    "start": 1179.52,
    "end": 1186.44,
    "text": "had not changed. We arrived at his home.",
    "textdich": ""
  },
  {
    "start": 1183.6,
    "end": 1193.52,
    "text": "It was big, clean, beautiful. He opened the door for me.",
    "textdich": ""
  },
  {
    "start": 1189.919,
    "end": 1205.64,
    "text": "Come in, Mom. I stepped inside. The house was warm. On the table there was food. My favorite food. He looked at me. I cooked for you.",
    "textdich": ""
  },
  {
    "start": 1203.84,
    "end": 1214.12,
    "text": "I felt my heart grow full. Thank you, my son. We sat together. We ate. We talked.",
    "textdich": ""
  },
  {
    "start": 1213.12,
    "end": 1227.039,
    "text": "We laughed. And then, as the night became quiet, he looked at me and said, \"Mom, I learned everything from you. You",
    "textdich": ""
  },
  {
    "start": 1224.24,
    "end": 1237.28,
    "text": "taught me to work hard. You taught me to dream. You taught me to never give up. I felt tears in my eyes. I had always",
    "textdich": ""
  },
  {
    "start": 1234.32,
    "end": 1249.0,
    "text": "wondered if I had done enough, if I had made the right choices, if my son still needed me. Now I knew the answer. I reached",
    "textdich": ""
  },
  {
    "start": 1246.32,
    "end": 1259.48,
    "text": "across the table and took his hand. Life is always moving, I said. But love never changes. He smiled.",
    "textdich": ""
  },
  {
    "start": 1258.559,
    "end": 1279.2,
    "text": "Yes, mom. And now we are together again. I nodded. I was home. As I sit here in my son's home, I think about my life. The long years, the hard moments,",
    "textdich": ""
  },
  {
    "start": 1276.0,
    "end": 1291.2,
    "text": "the choices I made. I was once a girl with no voice. A girl who wanted to learn. A girl who wanted more. People",
    "textdich": ""
  },
  {
    "start": 1286.4,
    "end": 1302.64,
    "text": "told me you can't, but I did. I want you to think about my story, about my journey. Maybe you have dreams you are afraid to",
    "textdich": ""
  },
  {
    "start": 1300.2,
    "end": 1316.799,
    "text": "follow. Maybe you are waiting for someone to return. Maybe you feel forgotten. But listen to me. You are stronger than you think.",
    "textdich": ""
  },
  {
    "start": 1313.44,
    "end": 1318.2,
    "text": "You are more important than you believe.",
    "textdich": ""
  },
  {
    "start": 1316.799,
    "end": 1332.72,
    "text": "You are not alone. So do not be afraid. Move forward. Believe in yourself. And never forget love always finds a way.",
    "textdich": ""
  }
]