[
  {
    "start": 0.64,
    "end": 9.92,
    "text": "Hello my friends and welcome back. I'm Ariel.",
    "textdich": ""
  },
  {
    "start": 6.24,
    "end": 25.92,
    "text": "Today I want to tell you a story. But this story is not just a story. This story is about reading. This story is about why you must read. Many students",
    "textdich": ""
  },
  {
    "start": 21.039,
    "end": 38.239,
    "text": "ask me, Ariel, why should I read? I go to class. I listen to English. I watch English videos. Is that not enough?",
    "textdich": ""
  },
  {
    "start": 33.52,
    "end": 43.44,
    "text": "But I say no my friend, it is not enough.",
    "textdich": ""
  },
  {
    "start": 40.0,
    "end": 54.719,
    "text": "Reading is very important. Reading is not just for school. Reading is not just for books. Reading is for your life. Let",
    "textdich": ""
  },
  {
    "start": 51.12,
    "end": 65.76,
    "text": "me explain. When you read, something special happens. Your brain becomes stronger. Your English becomes better.",
    "textdich": ""
  },
  {
    "start": 61.84,
    "end": 68.64,
    "text": "You see more words. You learn new words.",
    "textdich": ""
  },
  {
    "start": 65.76,
    "end": 81.52,
    "text": "You learn grammar. You see how people use words in real life. You see how words go together. You see how one word follows another. You do not need to",
    "textdich": ""
  },
  {
    "start": 78.24,
    "end": 94.479,
    "text": "study grammar. You just read. And your brain sees the patterns. Your brain learns the rules. This is a natural way to learn English. This is a fun way,",
    "textdich": ""
  },
  {
    "start": 90.56,
    "end": 104.32,
    "text": "too. You do not feel stress. You do not feel bored. You feel happy because you enjoy the story. You like the book. You",
    "textdich": ""
  },
  {
    "start": 101.6,
    "end": 116.479,
    "text": "want to know what happens next. I understand if you say, \"But Ariel, it is hard for me. I read one page. I stop. I",
    "textdich": ""
  },
  {
    "start": 113.04,
    "end": 126.0,
    "text": "don't understand. I need a dictionary. I feel tired. I understand. I really do.",
    "textdich": ""
  },
  {
    "start": 121.52,
    "end": 136.8,
    "text": "That is why I say read easy books. Read fun books. Do not read hard books. Do not read boring books. If the book is",
    "textdich": ""
  },
  {
    "start": 132.64,
    "end": 143.84,
    "text": "too hard, stop. Find an easy one. If the book is boring, stop. Find a fun one.",
    "textdich": ""
  },
  {
    "start": 141.04,
    "end": 155.04,
    "text": "This is the secret. When the book is easy and fun, you do not feel tired. You read and you smile. You read and you",
    "textdich": ""
  },
  {
    "start": 151.2,
    "end": 166.0,
    "text": "forget the time. You read and you learn without stress. Some students say, \"Reading is not for me. I like videos. I",
    "textdich": ""
  },
  {
    "start": 162.0,
    "end": 179.44,
    "text": "like games.\" I say, \"That's okay, but try reading too, just a little. Try 10 minutes a day. That's all. Just 10 minutes. If you do that every day, you",
    "textdich": ""
  },
  {
    "start": 175.92,
    "end": 186.0,
    "text": "will grow. Your English will grow. Your mind will grow. Your world will grow.",
    "textdich": ""
  },
  {
    "start": 183.12,
    "end": 197.12,
    "text": "You will see more ideas. You will think in English. You will feel more free. You will feel more strong. Let me tell you a",
    "textdich": ""
  },
  {
    "start": 193.28,
    "end": 202.72,
    "text": "story. There was a boy. He was not good at English.",
    "textdich": ""
  },
  {
    "start": 198.56,
    "end": 208.159,
    "text": "He was shy. He could not speak well. He could not write well.",
    "textdich": ""
  },
  {
    "start": 205.04,
    "end": 223.76,
    "text": "One day his teacher said, \"Try this book. It is easy. It is fun.\" The boy said, \"Okay, I will try.\" He read one page. He liked it. He read",
    "textdich": ""
  },
  {
    "start": 219.84,
    "end": 235.68,
    "text": "two pages. He liked it more. Soon he read every day. one book, two books, three books, 10 books.",
    "textdich": ""
  },
  {
    "start": 231.44,
    "end": 247.04,
    "text": "And guess what? After 6 months, he could speak better. He could write better. He could understand more. He felt proud. He",
    "textdich": ""
  },
  {
    "start": 243.76,
    "end": 251.68,
    "text": "felt happy. All because he read easy books.",
    "textdich": ""
  },
  {
    "start": 248.64,
    "end": 266.32,
    "text": "You see, my friends, this is the power of reading. It helps your English. But not only English. It helps your thinking. It helps your feeling.",
    "textdich": ""
  },
  {
    "start": 262.32,
    "end": 269.919,
    "text": "When you read, you enter another world.",
    "textdich": ""
  },
  {
    "start": 266.32,
    "end": 272.639,
    "text": "You see new people. You see new places.",
    "textdich": ""
  },
  {
    "start": 269.919,
    "end": 285.44,
    "text": "You feel their stories. You live their lives. Your heart grows. Your mind opens. You become more kind. You become more wise.",
    "textdich": ""
  },
  {
    "start": 281.759,
    "end": 297.199,
    "text": "This is why you must read. Now you may ask. But what should I read? I say, read what you like. Read about love. Read",
    "textdich": ""
  },
  {
    "start": 293.6,
    "end": 308.96,
    "text": "about animals. Read about magic. Read about heroes. Read about real life. Read about funny things. Read what makes you smile.",
    "textdich": ""
  },
  {
    "start": 306.16,
    "end": 315.919,
    "text": "And yes, it is okay to read children's books. It is okay to read fairy tales.",
    "textdich": ""
  },
  {
    "start": 312.639,
    "end": 318.24,
    "text": "It is okay to read simple stories.",
    "textdich": ""
  },
  {
    "start": 315.919,
    "end": 333.039,
    "text": "Simple stories are good for your English. Simple stories are full of power. Do not feel shy. Do not feel small. All readers start small, but they",
    "textdich": ""
  },
  {
    "start": 328.4,
    "end": 346.88,
    "text": "grow fast like a tree. First a small seed, then a big tree. Reading is the water. Reading is the light. You are the tree. You can grow.",
    "textdich": ""
  },
  {
    "start": 344.32,
    "end": 358.32,
    "text": "Let me tell you what I do. I love learning languages. I wanted to learn Spanish. I tried classes. I tried apps.",
    "textdich": ""
  },
  {
    "start": 354.08,
    "end": 363.6,
    "text": "But I did not grow. Then I said I will try reading.",
    "textdich": ""
  },
  {
    "start": 360.32,
    "end": 376.96,
    "text": "I started with easy books. Very easy books like this one. I read one page, I smiled, I read one story, I felt happy,",
    "textdich": ""
  },
  {
    "start": 372.479,
    "end": 387.68,
    "text": "I read 10 stories, I felt strong. After one year, I could read long books. I could talk. I could understand people. I",
    "textdich": ""
  },
  {
    "start": 383.52,
    "end": 395.759,
    "text": "did not study grammar. I just read and I learned. That is the magic of reading.",
    "textdich": ""
  },
  {
    "start": 392.0,
    "end": 402.16,
    "text": "Maybe you say, \"But Ariel, I do not have time.\" I understand.",
    "textdich": ""
  },
  {
    "start": 399.36,
    "end": 413.6,
    "text": "We are all busy, but 10 minutes is enough. Read before sleep. Read after breakfast. Read on the bus. Read in the",
    "textdich": ""
  },
  {
    "start": 409.199,
    "end": 423.12,
    "text": "park. You do not need hours. Just small steps every day. Small steps make big change.",
    "textdich": ""
  },
  {
    "start": 419.759,
    "end": 431.28,
    "text": "Now I want to ask you something. Are you ready to try? Are you ready to read?",
    "textdich": ""
  },
  {
    "start": 426.88,
    "end": 444.639,
    "text": "Start today. Find an easy book. Read one page. Just one. Then read one more. Then one more. Do not worry. Do not stop. If",
    "textdich": ""
  },
  {
    "start": 441.199,
    "end": 454.56,
    "text": "it is fun, you will keep going. If it is easy, you will enjoy. And when you enjoy, you learn more. You do not need",
    "textdich": ""
  },
  {
    "start": 451.36,
    "end": 464.24,
    "text": "to remember all words. You do not need to use a dictionary. Just understand the story. Just follow the feeling. Just",
    "textdich": ""
  },
  {
    "start": 461.039,
    "end": 476.16,
    "text": "enjoy the moment. Your brain will do the rest. Your brain is smart. It will learn. It will remember. It will grow.",
    "textdich": ""
  },
  {
    "start": 472.56,
    "end": 484.0,
    "text": "My friends, this is your journey. This is your time. Reading is your friend.",
    "textdich": ""
  },
  {
    "start": 480.08,
    "end": 495.599,
    "text": "Reading is your teacher. Reading is your magic key. It opens the door. The door to good English. The door to big dreams.",
    "textdich": ""
  },
  {
    "start": 492.0,
    "end": 505.12,
    "text": "The door to a new life. So, are you ready? Pick a book. A small book. A fun book and begin.",
    "textdich": ""
  },
  {
    "start": 502.4,
    "end": 519.68,
    "text": "You do not need to be perfect. You just need to start one page, one day, one small step. Some students tell me, Ariel, I don't have good books. Where",
    "textdich": ""
  },
  {
    "start": 516.88,
    "end": 522.32,
    "text": "can I find easy books?",
    "textdich": ""
  },
  {
    "start": 519.68,
    "end": 531.76,
    "text": "That is a good question. There are many places. You can go to a library. You can go to a bookstore. You can find books",
    "textdich": ""
  },
  {
    "start": 528.8,
    "end": 543.76,
    "text": "online. You can read stories on your phone. You can use free websites. You can find short stories for English learners. You can find simple books made",
    "textdich": ""
  },
  {
    "start": 540.64,
    "end": 551.279,
    "text": "for people like you. There are books for A1 level. There are books for A2 level.",
    "textdich": ""
  },
  {
    "start": 548.24,
    "end": 554.08,
    "text": "You can also read books for children.",
    "textdich": ""
  },
  {
    "start": 551.279,
    "end": 560.88,
    "text": "Those books have easy words. They have big letters. They have fun pictures.",
    "textdich": ""
  },
  {
    "start": 557.76,
    "end": 572.959,
    "text": "They are good for you. Don't worry if they are made for kids. You are using them to grow. They are tools for your future. You can also read books you",
    "textdich": ""
  },
  {
    "start": 570.08,
    "end": 582.56,
    "text": "already know. Maybe you read them in your own language. Try reading them in English. That will help you a lot. You",
    "textdich": ""
  },
  {
    "start": 579.36,
    "end": 592.88,
    "text": "already know the story so it is easy to follow. You don't need a dictionary. You can just enjoy and learn at the same time.",
    "textdich": ""
  },
  {
    "start": 589.44,
    "end": 609.2,
    "text": "Sometimes students say, \"But Ariel, I feel slow. I read slowly. It takes time.\" And I say, \"That is okay.\" Reading slow is not bad. Slow is good.",
    "textdich": ""
  },
  {
    "start": 605.92,
    "end": 615.68,
    "text": "Slow means your brain is working. Your brain is learning. You are taking time.",
    "textdich": ""
  },
  {
    "start": 612.48,
    "end": 626.16,
    "text": "You are going deep. That is how learning works. It is not a race. It is a journey.",
    "textdich": ""
  },
  {
    "start": 621.68,
    "end": 634.399,
    "text": "Think like this. A tree grows slow. A flower opens slow. The sun rises slow.",
    "textdich": ""
  },
  {
    "start": 631.36,
    "end": 649.839,
    "text": "But they are all beautiful. You are the same. Your reading speed will grow with time. Just keep reading, day by day, page by page. Do not stop.",
    "textdich": ""
  },
  {
    "start": 646.8,
    "end": 663.04,
    "text": "Some students also ask, \"Can reading really help my speaking?\" I smile and say, \"Yes, it can.\" Reading gives you words. Reading shows you how people",
    "textdich": ""
  },
  {
    "start": 660.16,
    "end": 672.56,
    "text": "speak. Reading gives you the rhythm of English. When you read out loud, your tongue learns. Your mouth moves better.",
    "textdich": ""
  },
  {
    "start": 670.079,
    "end": 680.64,
    "text": "You feel more confident. You start thinking in English. You stop translating. You start speaking.",
    "textdich": ""
  },
  {
    "start": 678.079,
    "end": 695.839,
    "text": "Reading fills your mind with good English. Then when you speak, the words come faster. The grammar is better. The sentences are more clear. Reading is",
    "textdich": ""
  },
  {
    "start": 692.0,
    "end": 704.399,
    "text": "like food for your brain. Good food makes you strong. Good reading makes you speak well.",
    "textdich": ""
  },
  {
    "start": 701.6,
    "end": 712.16,
    "text": "I want to tell you another story. This is a true story. One girl was very shy.",
    "textdich": ""
  },
  {
    "start": 708.88,
    "end": 722.8,
    "text": "She did not speak English in class. She always looked down. She never raised her hand. But she liked stories. She liked",
    "textdich": ""
  },
  {
    "start": 718.8,
    "end": 732.88,
    "text": "fairy tales. I gave her a small book. I said, \"Try this one.\" She read it. Then she asked for more.",
    "textdich": ""
  },
  {
    "start": 729.519,
    "end": 745.04,
    "text": "She read one story every week. After some time, she started smiling more. She started speaking. She made full sentences. She helped other students.",
    "textdich": ""
  },
  {
    "start": 741.6,
    "end": 754.24,
    "text": "She became a star in the class. And all of that started with one book. Just one book.",
    "textdich": ""
  },
  {
    "start": 751.2,
    "end": 764.48,
    "text": "That is the power of reading. You may think reading is only for school, but reading is for your whole life. When you",
    "textdich": ""
  },
  {
    "start": 760.56,
    "end": 777.68,
    "text": "read, you learn how people think. You learn how people feel. You learn about the world. You learn about problems. You learn about love. You learn about",
    "textdich": ""
  },
  {
    "start": 774.079,
    "end": 784.16,
    "text": "kindness. You learn about pain. You learn about hope.",
    "textdich": ""
  },
  {
    "start": 780.16,
    "end": 793.04,
    "text": "Books open your eyes. Books open your heart. Books give you knowledge. Books give you power.",
    "textdich": ""
  },
  {
    "start": 790.16,
    "end": 797.76,
    "text": "That is why people say readers are leaders.",
    "textdich": ""
  },
  {
    "start": 794.8,
    "end": 801.04,
    "text": "Because readers can understand more.",
    "textdich": ""
  },
  {
    "start": 797.76,
    "end": 808.16,
    "text": "Readers can speak better. Readers can write better. Readers can help others.",
    "textdich": ""
  },
  {
    "start": 805.279,
    "end": 811.839,
    "text": "Now, let me tell you something fun.",
    "textdich": ""
  },
  {
    "start": 808.16,
    "end": 822.8,
    "text": "Reading also helps you relax. It helps your brain rest. It helps your body calm down. When your day is busy, read a",
    "textdich": ""
  },
  {
    "start": 818.8,
    "end": 831.6,
    "text": "story. When your heart feels sad, read a story. When you can't sleep, read a story.",
    "textdich": ""
  },
  {
    "start": 827.839,
    "end": 844.399,
    "text": "Stories are friends. Stories are quiet friends. They stay with you. They talk to you. They don't shout. They don't judge.",
    "textdich": ""
  },
  {
    "start": 840.24,
    "end": 851.04,
    "text": "They just give. They give you joy. They give you peace. They give you new dreams.",
    "textdich": ""
  },
  {
    "start": 848.56,
    "end": 861.6,
    "text": "Maybe you don't like reading now. That's okay. Many people start like that. But if you find the right story, you will",
    "textdich": ""
  },
  {
    "start": 857.92,
    "end": 874.079,
    "text": "start to like it. You will say this story is good. Then you will say I want to read more. And then you will say I love reading. So the first step is to",
    "textdich": ""
  },
  {
    "start": 871.199,
    "end": 882.959,
    "text": "find the right book. You can ask your teacher. You can ask your friend. You can search online.",
    "textdich": ""
  },
  {
    "start": 880.079,
    "end": 885.76,
    "text": "You can try short stories.",
    "textdich": ""
  },
  {
    "start": 882.959,
    "end": 888.639,
    "text": "You can try funny stories.",
    "textdich": ""
  },
  {
    "start": 885.76,
    "end": 892.0,
    "text": "You can try love stories.",
    "textdich": ""
  },
  {
    "start": 888.639,
    "end": 895.92,
    "text": "You can try stories with pictures.",
    "textdich": ""
  },
  {
    "start": 892.0,
    "end": 898.8,
    "text": "You can try stories with audio.",
    "textdich": ""
  },
  {
    "start": 895.92,
    "end": 910.48,
    "text": "There are many choices. one will be good for you. You must also remember it's okay to stop. If a book is too hard,",
    "textdich": ""
  },
  {
    "start": 906.0,
    "end": 922.079,
    "text": "stop. If a book is too boring, stop. You do not have to finish every book. It is not bad, it is smart. Because if you do",
    "textdich": ""
  },
  {
    "start": 917.519,
    "end": 936.32,
    "text": "not enjoy, you do not learn. So find a better book. A book that feels easy. A book that feels fun. That is the right one. When you enjoy, you will keep",
    "textdich": ""
  },
  {
    "start": 932.72,
    "end": 941.04,
    "text": "going. And when you keep going, you will learn more.",
    "textdich": ""
  },
  {
    "start": 938.16,
    "end": 951.839,
    "text": "Reading is not like homework. Reading is not like tests. Reading is not like a classroom. Reading is freedom. Reading",
    "textdich": ""
  },
  {
    "start": 947.519,
    "end": 959.839,
    "text": "is your time. Reading is your space. You choose the book. You choose the time.",
    "textdich": ""
  },
  {
    "start": 955.839,
    "end": 962.88,
    "text": "You choose the place. You are the boss.",
    "textdich": ""
  },
  {
    "start": 959.839,
    "end": 974.32,
    "text": "You read what you like. That is the best way to grow. No stress, no fear. Just fun and learning together.",
    "textdich": ""
  },
  {
    "start": 970.56,
    "end": 976.959,
    "text": "And now I want you to do one thing.",
    "textdich": ""
  },
  {
    "start": 974.32,
    "end": 989.839,
    "text": "After you read this story, go find a book, a small book, a simple book. Read one page. Then tomorrow read one more",
    "textdich": ""
  },
  {
    "start": 984.639,
    "end": 999.279,
    "text": "page. Every day one small step. Every step will take you higher. Every word will make you better. You will feel the",
    "textdich": ""
  },
  {
    "start": 996.079,
    "end": 1015.12,
    "text": "change. You will see the progress. You will be proud. And one day you will say I did it. I can read in English. I love it. I am strong.",
    "textdich": ""
  },
  {
    "start": 1011.839,
    "end": 1027.52,
    "text": "Some students tell me, \"Aiel, I want to read, but I forget the words. I read one page and I forget the new words the next day.\" I understand.",
    "textdich": ""
  },
  {
    "start": 1024.799,
    "end": 1038.72,
    "text": "This is normal. You do not need to remember every word. Your brain is learning even when you forget. Every time you see the same word again, your",
    "textdich": ""
  },
  {
    "start": 1035.439,
    "end": 1050.16,
    "text": "brain becomes stronger. The first time you may forget, the second time maybe you forget again. But the third or",
    "textdich": ""
  },
  {
    "start": 1045.52,
    "end": 1065.36,
    "text": "fourth time your brain says, \"Oh, I know this word now.\" That is how learning works. So do not feel bad. Do not stop reading. Just keep going.",
    "textdich": ""
  },
  {
    "start": 1062.08,
    "end": 1078.799,
    "text": "Your brain is like a garden. When you read, you plant seeds. The more you read, the more seeds you plant. One day you will see flowers.",
    "textdich": ""
  },
  {
    "start": 1075.679,
    "end": 1090.4,
    "text": "One day you will see the words grow inside you. You will remember them. You will use them. They will come to you when you speak or write. So keep",
    "textdich": ""
  },
  {
    "start": 1088.799,
    "end": 1092.559,
    "text": "planting.",
    "textdich": ""
  },
  {
    "start": 1090.4,
    "end": 1097.12,
    "text": "Keep reading.",
    "textdich": ""
  },
  {
    "start": 1092.559,
    "end": 1108.64,
    "text": "Sometimes students also say Ariel my English is too low. I cannot understand even books. And I say that is okay. You",
    "textdich": ""
  },
  {
    "start": 1105.6,
    "end": 1124.16,
    "text": "can start very small. Start with books with pictures. Start with very short stories. Even one sentence is okay. Read one sentence. Read it again.",
    "textdich": ""
  },
  {
    "start": 1120.08,
    "end": 1126.4,
    "text": "Try to say it out loud. Feel the words.",
    "textdich": ""
  },
  {
    "start": 1124.16,
    "end": 1129.679,
    "text": "Taste the English.",
    "textdich": ""
  },
  {
    "start": 1126.4,
    "end": 1145.679,
    "text": "One sentence today, two sentences tomorrow, three next week. Slowly you will grow. Like a baby learns to walk, you will learn to read.",
    "textdich": ""
  },
  {
    "start": 1141.28,
    "end": 1150.4,
    "text": "Babies fall, but they stand again. They try again.",
    "textdich": ""
  },
  {
    "start": 1147.52,
    "end": 1165.36,
    "text": "You can do the same. Do not compare yourself to others. Some people read fast, some read slow, some learn fast, some learn slow, but all can learn. You",
    "textdich": ""
  },
  {
    "start": 1162.24,
    "end": 1170.96,
    "text": "can learn, too. Now, let's talk about fun.",
    "textdich": ""
  },
  {
    "start": 1166.88,
    "end": 1180.88,
    "text": "Yes, reading can be fun. If you read the right book, it feels like a game. You feel happy. You feel free. You want to",
    "textdich": ""
  },
  {
    "start": 1178.08,
    "end": 1192.32,
    "text": "know what happens next. You turn the page. You forget your worries. You go to a new world. That is the magic of stories.",
    "textdich": ""
  },
  {
    "start": 1189.6,
    "end": 1204.24,
    "text": "You can go to the past. You can go to the future. You can go to the sea. You can go to the sky. You can be a king.",
    "textdich": ""
  },
  {
    "start": 1200.48,
    "end": 1215.84,
    "text": "You can be a queen. You can fly. You can dream. You can do all this with just one book. You don't need money. You don't",
    "textdich": ""
  },
  {
    "start": 1211.039,
    "end": 1219.6,
    "text": "need to travel. You just need to read.",
    "textdich": ""
  },
  {
    "start": 1215.84,
    "end": 1222.96,
    "text": "That is the power of reading.",
    "textdich": ""
  },
  {
    "start": 1219.6,
    "end": 1232.72,
    "text": "Let me tell you about my own story. When I was young, I did not like reading. I thought reading was boring. I thought",
    "textdich": ""
  },
  {
    "start": 1228.72,
    "end": 1243.76,
    "text": "reading was for school. But one day, I found a book I liked. It was about a boy and a dragon. I read one page, then I",
    "textdich": ""
  },
  {
    "start": 1239.919,
    "end": 1256.96,
    "text": "read another. I could not stop. I loved the story. I wanted to know what happens next. I finished the book. I felt proud.",
    "textdich": ""
  },
  {
    "start": 1251.919,
    "end": 1272.48,
    "text": "I felt strong. I felt happy. After that, I wanted more books. I read more stories. I read every day. My words grew, my ideas grew, my heart grew. That",
    "textdich": ""
  },
  {
    "start": 1269.12,
    "end": 1282.32,
    "text": "one book changed me. And maybe one book can change you, too. Reading is not just about English. Reading is about life.",
    "textdich": ""
  },
  {
    "start": 1279.84,
    "end": 1295.76,
    "text": "When you read, you learn how people feel. You understand their pain. You understand their dreams. You become kinder. You become smarter. You become",
    "textdich": ""
  },
  {
    "start": 1292.0,
    "end": 1302.08,
    "text": "more open. You learn to listen. You learn to feel. You grow inside.",
    "textdich": ""
  },
  {
    "start": 1299.919,
    "end": 1312.4,
    "text": "That is why reading is good for your soul. It helps your heart. It helps your mind. It makes you a better person. And",
    "textdich": ""
  },
  {
    "start": 1309.6,
    "end": 1324.48,
    "text": "if you want to write better, reading will help you too. When you read, you see good writing. You see how sentences are made.",
    "textdich": ""
  },
  {
    "start": 1321.039,
    "end": 1331.76,
    "text": "You see how stories flow. You see good words. You see strong ideas.",
    "textdich": ""
  },
  {
    "start": 1328.4,
    "end": 1342.159,
    "text": "All this goes into your brain. Later when you write, you use what you learned. You do not copy, you create.",
    "textdich": ""
  },
  {
    "start": 1339.12,
    "end": 1349.28,
    "text": "But reading shows you the way. Reading gives you tools. Reading gives you light.",
    "textdich": ""
  },
  {
    "start": 1346.48,
    "end": 1359.28,
    "text": "Some students ask me, \"How many books should I read?\" I say, \"As many as you can.\" But do not rush. Quality is better",
    "textdich": ""
  },
  {
    "start": 1356.559,
    "end": 1370.559,
    "text": "than number. One good book is better than 10 boring ones. One fun book is better than five hard ones.",
    "textdich": ""
  },
  {
    "start": 1366.88,
    "end": 1374.159,
    "text": "So, choose books that make you smile.",
    "textdich": ""
  },
  {
    "start": 1370.559,
    "end": 1387.44,
    "text": "Choose books that make you think. Choose books that make you feel good. That is the best way. And you can read many types of books. You can read true",
    "textdich": ""
  },
  {
    "start": 1384.4,
    "end": 1398.48,
    "text": "stories. You can read stories that are not true. You can read short books. You can read long books. You can read old",
    "textdich": ""
  },
  {
    "start": 1394.72,
    "end": 1407.84,
    "text": "books. You can read new books. You can read books from your country. You can read books from other countries. All",
    "textdich": ""
  },
  {
    "start": 1404.24,
    "end": 1416.88,
    "text": "books can teach you. All books can help you. So try different kinds. Find your favorite.",
    "textdich": ""
  },
  {
    "start": 1413.44,
    "end": 1429.36,
    "text": "Reading also helps you dream big. When you read about other people, you see what is possible. You see courage. You see hope. You see success.",
    "textdich": ""
  },
  {
    "start": 1426.24,
    "end": 1433.44,
    "text": "You think if they can do it, maybe I can too.",
    "textdich": ""
  },
  {
    "start": 1430.48,
    "end": 1443.039,
    "text": "That is the gift of stories. They show you what you can be. They show you your power. They give you wings. And here is",
    "textdich": ""
  },
  {
    "start": 1440.0,
    "end": 1454.24,
    "text": "one more tip. You can read with a friend. You can read the same story. You can talk about it. You can help each other. You can ask questions. You can",
    "textdich": ""
  },
  {
    "start": 1452.4,
    "end": 1457.039,
    "text": "laugh together.",
    "textdich": ""
  },
  {
    "start": 1454.24,
    "end": 1466.88,
    "text": "You can grow together. Reading with a friend is fun. Reading with a friend is strong. Try it. Reading also helps your",
    "textdich": ""
  },
  {
    "start": 1463.679,
    "end": 1477.039,
    "text": "brain in many ways. It makes you think faster. It helps your memory. It helps your focus. It helps your sleep. Yes,",
    "textdich": ""
  },
  {
    "start": 1474.159,
    "end": 1483.76,
    "text": "reading before sleep is very good. It makes your mind calm. It helps you rest.",
    "textdich": ""
  },
  {
    "start": 1480.4,
    "end": 1496.24,
    "text": "It gives you nice dreams. Try reading 10 minutes before bed. You will sleep better. Your brain will thank you. And if you like music, you can read song",
    "textdich": ""
  },
  {
    "start": 1492.32,
    "end": 1507.52,
    "text": "lyrics. You can read poems. You can read stories with sound. You can listen and read at the same time. That helps a lot.",
    "textdich": ""
  },
  {
    "start": 1503.919,
    "end": 1515.679,
    "text": "Your eyes see the words. Your ears hear the sounds. Your brain learns more.",
    "textdich": ""
  },
  {
    "start": 1511.52,
    "end": 1528.32,
    "text": "So my friend, I ask you again, are you ready? Are you ready to try? Are you ready to grow? Are you ready to find your first story?",
    "textdich": ""
  },
  {
    "start": 1525.12,
    "end": 1540.4,
    "text": "I hope you are because reading can change your life. Reading can make you strong. Reading can make you smile.",
    "textdich": ""
  },
  {
    "start": 1536.0,
    "end": 1544.32,
    "text": "Reading can take you far. Start small.",
    "textdich": ""
  },
  {
    "start": 1540.4,
    "end": 1547.679,
    "text": "Start easy but start now.",
    "textdich": ""
  },
  {
    "start": 1544.32,
    "end": 1557.919,
    "text": "Maybe now you are thinking yes Ariel I want to read but I do not know what is good. I do not know where to start. That",
    "textdich": ""
  },
  {
    "start": 1554.159,
    "end": 1563.039,
    "text": "is okay. I will help you. Let me give you some simple ideas.",
    "textdich": ""
  },
  {
    "start": 1560.64,
    "end": 1572.08,
    "text": "First you can read stories from your childhood. You already know them. Now read them in English. Your brain knows",
    "textdich": ""
  },
  {
    "start": 1568.96,
    "end": 1582.48,
    "text": "the story so the words are easier. You can enjoy the story and learn English too. Second, you can read books with pictures. The pictures help you",
    "textdich": ""
  },
  {
    "start": 1580.88,
    "end": 1585.76,
    "text": "understand.",
    "textdich": ""
  },
  {
    "start": 1582.48,
    "end": 1593.039,
    "text": "You do not feel lost. You do not feel tired. The story becomes fun.",
    "textdich": ""
  },
  {
    "start": 1589.84,
    "end": 1603.039,
    "text": "Third, you can read story books made for English learners. These books use easy words. They have short sentences. They",
    "textdich": ""
  },
  {
    "start": 1599.919,
    "end": 1616.24,
    "text": "are made just for you. They are not too fast. They are not too slow. They are just right. You can find them in libraries. You can find them online. You",
    "textdich": ""
  },
  {
    "start": 1613.6,
    "end": 1624.72,
    "text": "can even listen to the audio and read together. That is a great way to learn.",
    "textdich": ""
  },
  {
    "start": 1622.32,
    "end": 1636.24,
    "text": "Now, I want to tell you about one of my students. His name is Omar. Omar was a quiet boy. He did not speak much. He did",
    "textdich": ""
  },
  {
    "start": 1632.96,
    "end": 1641.84,
    "text": "not like English class. He was afraid to make mistakes.",
    "textdich": ""
  },
  {
    "start": 1638.0,
    "end": 1654.96,
    "text": "But one day I gave him a small book. It was a funny story. He smiled when he read it. The next day he asked for another book, then another. After 3",
    "textdich": ""
  },
  {
    "start": 1651.84,
    "end": 1664.159,
    "text": "months, Omar was reading one book every week. His English changed. He started speaking in class. He started writing",
    "textdich": ""
  },
  {
    "start": 1660.88,
    "end": 1675.679,
    "text": "longer sentences. He was more happy. He was more confident. He said, \"Reading helped me. I was afraid. Now I am not afraid.\"",
    "textdich": ""
  },
  {
    "start": 1672.48,
    "end": 1681.76,
    "text": "That is why I tell this story because reading can help you too.",
    "textdich": ""
  },
  {
    "start": 1678.399,
    "end": 1685.2,
    "text": "You do not need to read for many hours.",
    "textdich": ""
  },
  {
    "start": 1681.76,
    "end": 1694.159,
    "text": "Even 10 minutes is good. 10 minutes every day is better than one hour once a week. When you read a little every day,",
    "textdich": ""
  },
  {
    "start": 1691.12,
    "end": 1702.64,
    "text": "your brain stays active. Your English becomes stronger. You start to think in English. You start to dream in English.",
    "textdich": ""
  },
  {
    "start": 1699.919,
    "end": 1713.6,
    "text": "You do not need to translate. You understand fast. You feel free. That is a big step. That is the goal.",
    "textdich": ""
  },
  {
    "start": 1710.0,
    "end": 1719.6,
    "text": "Some students ask me, Ariel, what if I make mistakes?",
    "textdich": ""
  },
  {
    "start": 1715.36,
    "end": 1724.32,
    "text": "And I say, mistakes are good. Mistakes help you learn.",
    "textdich": ""
  },
  {
    "start": 1721.679,
    "end": 1736.0,
    "text": "When you read, you may not know every word. That is fine. Do not stop. Try to guess the meaning. Look at the words",
    "textdich": ""
  },
  {
    "start": 1732.08,
    "end": 1748.64,
    "text": "around it. Think about the story. You do not need to know every word. You only need to understand the main idea, the big picture.",
    "textdich": ""
  },
  {
    "start": 1744.88,
    "end": 1760.559,
    "text": "If you understand 90% or more, then the book is good for you. If you understand less than 80%, maybe try an easier book.",
    "textdich": ""
  },
  {
    "start": 1756.559,
    "end": 1773.12,
    "text": "That is not bad. That is smart. Easy books are better than hard ones. You learn more from easy books. You enjoy more. you grow more. Let's talk more",
    "textdich": ""
  },
  {
    "start": 1770.08,
    "end": 1782.159,
    "text": "about reading with fun. You can read jokes, you can read comics, you can read short poems, you can read song lyrics,",
    "textdich": ""
  },
  {
    "start": 1779.6,
    "end": 1788.799,
    "text": "you can read about food, you can read about sports, you can read about travel.",
    "textdich": ""
  },
  {
    "start": 1785.679,
    "end": 1801.6,
    "text": "All of this is reading. All of this is learning. It does not have to be a big book. It does not have to be a famous story. It can be small. It can be",
    "textdich": ""
  },
  {
    "start": 1797.679,
    "end": 1814.96,
    "text": "simple. It can be fun. The important thing is to enjoy because when you enjoy, you remember. When you enjoy, you learn faster.",
    "textdich": ""
  },
  {
    "start": 1811.84,
    "end": 1817.919,
    "text": "I also want to share something special.",
    "textdich": ""
  },
  {
    "start": 1814.96,
    "end": 1825.919,
    "text": "When I learn a new language, I always use stories. Stories are like friends.",
    "textdich": ""
  },
  {
    "start": 1822.399,
    "end": 1829.679,
    "text": "They are not fast. They do not judge.",
    "textdich": ""
  },
  {
    "start": 1825.919,
    "end": 1841.76,
    "text": "They do not shout. They speak slow. They speak clear. They wait for you. When you are sad, stories help you. When you are",
    "textdich": ""
  },
  {
    "start": 1837.679,
    "end": 1852.799,
    "text": "tired, stories give you peace. When you are bored, stories make you smile. When you feel alone, stories stay with you.",
    "textdich": ""
  },
  {
    "start": 1849.44,
    "end": 1860.88,
    "text": "That is why stories are strong. That is why I love stories. and I hope you will love them too.",
    "textdich": ""
  },
  {
    "start": 1858.08,
    "end": 1862.799,
    "text": "You can also write about what you read.",
    "textdich": ""
  },
  {
    "start": 1860.88,
    "end": 1874.96,
    "text": "You can write a few lines in your notebook. You can write, \"I read a story today. It was about a girl and her dog.",
    "textdich": ""
  },
  {
    "start": 1870.559,
    "end": 1885.52,
    "text": "The girl was happy. The dog ran away.\" But later the dog came back. You do not need to write much. Just a little. Just",
    "textdich": ""
  },
  {
    "start": 1882.559,
    "end": 1894.64,
    "text": "the main idea that will help your memory, that will help your writing, that will help your thinking.",
    "textdich": ""
  },
  {
    "start": 1891.6,
    "end": 1899.919,
    "text": "Reading and writing go together. They are good friends.",
    "textdich": ""
  },
  {
    "start": 1897.039,
    "end": 1913.679,
    "text": "Another tip is to read the same story more than once. Read it today, then read it again next week. The second time is",
    "textdich": ""
  },
  {
    "start": 1908.799,
    "end": 1924.32,
    "text": "easier. You understand more. You see new things. You feel more strong. You feel more ready. Repeating is good. Repeating",
    "textdich": ""
  },
  {
    "start": 1920.48,
    "end": 1935.36,
    "text": "is smart. Do not think I already read this. Think this story will teach me more. Now also when you read, try to say",
    "textdich": ""
  },
  {
    "start": 1932.32,
    "end": 1945.679,
    "text": "some sentences out loud. That helps your mouth. That helps your voice. That helps your memory. You see the word, you say",
    "textdich": ""
  },
  {
    "start": 1942.64,
    "end": 1959.76,
    "text": "the word, you hear the word. That is full learning. Your eyes, your mouth, your ears, your brain, all working together. That is strong learning. That",
    "textdich": ""
  },
  {
    "start": 1956.399,
    "end": 1974.08,
    "text": "is deep learning. You can also read before bed. That is a good time. Your mind is calm. Your body is resting. You can read one page, you can read one",
    "textdich": ""
  },
  {
    "start": 1970.48,
    "end": 1983.6,
    "text": "paragraph, then you sleep. Your brain will remember, your brain will keep learning during sleep. Yes, it's true.",
    "textdich": ""
  },
  {
    "start": 1980.32,
    "end": 1989.679,
    "text": "Sleep helps memory. So if you read before sleep, it is extra good.",
    "textdich": ""
  },
  {
    "start": 1986.96,
    "end": 2001.679,
    "text": "Sometimes people say, \"I do not have English books.\" But you can find many free books online. You can read from your phone. You can read from your",
    "textdich": ""
  },
  {
    "start": 1997.919,
    "end": 2005.44,
    "text": "tablet. You can read from your laptop.",
    "textdich": ""
  },
  {
    "start": 2001.679,
    "end": 2015.76,
    "text": "Many websites have free stories. Many websites have simple English. You can even search easy English stories and you",
    "textdich": ""
  },
  {
    "start": 2011.76,
    "end": 2026.96,
    "text": "will find many. Some websites also have sound. So you can read and listen at the same time. That is double power. So now",
    "textdich": ""
  },
  {
    "start": 2023.12,
    "end": 2030.0,
    "text": "I ask you again, are you ready to try?",
    "textdich": ""
  },
  {
    "start": 2026.96,
    "end": 2046.24,
    "text": "Are you ready to start? You do not need to wait. You can start today. Find a story, read one page, smile, enjoy, then come back tomorrow, read again.",
    "textdich": ""
  },
  {
    "start": 2042.559,
    "end": 2061.76,
    "text": "Little by little, day by day, you will see the change. You will feel the change. You will say, \"I can do it.\" Because yes, you can do it.",
    "textdich": ""
  },
  {
    "start": 2057.839,
    "end": 2067.76,
    "text": "One student asked me last week, \"Aariel, I read every day, but I still feel slow.",
    "textdich": ""
  },
  {
    "start": 2065.44,
    "end": 2077.119,
    "text": "I still feel like I don't understand everything.\" I looked at her and said, \"That is okay.",
    "textdich": ""
  },
  {
    "start": 2073.359,
    "end": 2080.079,
    "text": "That is normal. You are doing great.",
    "textdich": ""
  },
  {
    "start": 2077.119,
    "end": 2089.28,
    "text": "Learning a language takes time. It takes patience. You cannot see the change every day, but the change is happening.",
    "textdich": ""
  },
  {
    "start": 2086.24,
    "end": 2102.72,
    "text": "It is inside you. You are growing inside. The words are sitting in your mind. The grammar is building inside you. The understanding is getting",
    "textdich": ""
  },
  {
    "start": 2098.72,
    "end": 2113.52,
    "text": "stronger, but it is slow. It is like water in the ground. You do not see it, but the plant grows.",
    "textdich": ""
  },
  {
    "start": 2109.28,
    "end": 2127.359,
    "text": "One day you will feel it. You will read something and say, \"I understand all of this.\" That day will come. But it only comes if you keep going.",
    "textdich": ""
  },
  {
    "start": 2125.119,
    "end": 2129.2,
    "text": "So keep going.",
    "textdich": ""
  },
  {
    "start": 2127.359,
    "end": 2132.0,
    "text": "Keep reading.",
    "textdich": ""
  },
  {
    "start": 2129.2,
    "end": 2141.04,
    "text": "Even if it feels slow, even if you feel small, you are not small.",
    "textdich": ""
  },
  {
    "start": 2136.96,
    "end": 2144.88,
    "text": "You are brave. You are strong.",
    "textdich": ""
  },
  {
    "start": 2141.04,
    "end": 2147.76,
    "text": "You are becoming better every day.",
    "textdich": ""
  },
  {
    "start": 2144.88,
    "end": 2160.72,
    "text": "Now, let me tell you something fun. I have a friend named Lena. She loves cooking. She is not a student, but she wanted to learn English. She said, \"I",
    "textdich": ""
  },
  {
    "start": 2158.24,
    "end": 2172.0,
    "text": "don't want grammar books. I don't want long texts. I just want to learn for fun.\" So I told her, \"Read recipes, read",
    "textdich": ""
  },
  {
    "start": 2168.96,
    "end": 2185.76,
    "text": "cooking books, watch videos, and read the subtitles.\" She said, \"Can I really learn English like that?\" I said, \"Yes, you can.\"",
    "textdich": ""
  },
  {
    "start": 2182.64,
    "end": 2202.079,
    "text": "So she started. She read one recipe every day. She learned the names of food. She learned verbs like cut, mix, bake, boil, and fry. She learned words",
    "textdich": ""
  },
  {
    "start": 2197.52,
    "end": 2206.24,
    "text": "like sugar, flour, eggs, salt, and butter.",
    "textdich": ""
  },
  {
    "start": 2203.599,
    "end": 2215.599,
    "text": "After 6 months, she could talk about food in English. She could write her own recipes. She could help tourists in her",
    "textdich": ""
  },
  {
    "start": 2211.92,
    "end": 2226.96,
    "text": "restaurant. She was so happy. And she never opened a grammar book. She just read what she loved. So now I ask you,",
    "textdich": ""
  },
  {
    "start": 2222.64,
    "end": 2238.72,
    "text": "what do you love? What do you enjoy? Try to read that. Reading is not only for books. Reading is everywhere. Read about",
    "textdich": ""
  },
  {
    "start": 2234.48,
    "end": 2250.24,
    "text": "your hobby. Read about your dreams. Read about your favorite things. Learning can be fun. Learning can be easy. Just follow your joy.",
    "textdich": ""
  },
  {
    "start": 2247.76,
    "end": 2261.119,
    "text": "Many people think reading is only for smart people. That is not true. Reading is for everyone. Reading is for every",
    "textdich": ""
  },
  {
    "start": 2257.2,
    "end": 2273.359,
    "text": "age. You can be 10 years old or 50 years old. You can be a worker, a mother, a teacher, a farmer, a student. All people",
    "textdich": ""
  },
  {
    "start": 2268.96,
    "end": 2283.119,
    "text": "can read. All people can learn. You just need to start. You just need to try. You do not need to know every word. You do",
    "textdich": ""
  },
  {
    "start": 2280.4,
    "end": 2288.0,
    "text": "not need to be perfect. You just need to keep going.",
    "textdich": ""
  },
  {
    "start": 2284.96,
    "end": 2291.2,
    "text": "Reading is not about being the best.",
    "textdich": ""
  },
  {
    "start": 2288.0,
    "end": 2296.32,
    "text": "Reading is about growing. Reading is about changing.",
    "textdich": ""
  },
  {
    "start": 2293.599,
    "end": 2301.28,
    "text": "Reading is about understanding more and more.",
    "textdich": ""
  },
  {
    "start": 2298.079,
    "end": 2311.599,
    "text": "One more idea I want to give you. You can read with your ears. What does that mean? It means listening and reading at",
    "textdich": ""
  },
  {
    "start": 2308.32,
    "end": 2320.64,
    "text": "the same time. You can find a podcast with text. You can find an audio book with subtitles. You can hear the words",
    "textdich": ""
  },
  {
    "start": 2317.2,
    "end": 2323.04,
    "text": "and see the words. You learn the sound.",
    "textdich": ""
  },
  {
    "start": 2320.64,
    "end": 2329.52,
    "text": "You learn the spelling. You learn the meaning. You learn all at once.",
    "textdich": ""
  },
  {
    "start": 2327.119,
    "end": 2332.8,
    "text": "This is very strong.",
    "textdich": ""
  },
  {
    "start": 2329.52,
    "end": 2336.079,
    "text": "This is very good for your brain.",
    "textdich": ""
  },
  {
    "start": 2332.8,
    "end": 2347.119,
    "text": "Many of my students do this. They say it helps a lot. It helps them speak. It helps them listen. It helps them read",
    "textdich": ""
  },
  {
    "start": 2343.04,
    "end": 2360.8,
    "text": "better. So try it. Find a story with audio. Listen and read together. You will love it. And don't forget this. You don't need to read fast. Fast is not",
    "textdich": ""
  },
  {
    "start": 2357.04,
    "end": 2371.92,
    "text": "important. Some people read slow. Some people read fast. That is okay. We are all different. What is important is that",
    "textdich": ""
  },
  {
    "start": 2368.0,
    "end": 2382.4,
    "text": "you enjoy it. What is important is that you understand most of it. Not all, but most. You do not need to stop and look",
    "textdich": ""
  },
  {
    "start": 2379.2,
    "end": 2394.64,
    "text": "at the dictionary every time. You can guess. You can feel. You can follow the story. That is enough.",
    "textdich": ""
  },
  {
    "start": 2389.76,
    "end": 2399.599,
    "text": "If you understand 90% that is very good.",
    "textdich": ""
  },
  {
    "start": 2394.64,
    "end": 2403.599,
    "text": "If you understand 80% that is okay too.",
    "textdich": ""
  },
  {
    "start": 2399.599,
    "end": 2414.16,
    "text": "But if you understand only 50% it is too hard. You need to find an easier book that is not bad. That is smart. Find the",
    "textdich": ""
  },
  {
    "start": 2410.8,
    "end": 2426.32,
    "text": "right level for you. Also remember that the first book is the hardest. The second is easier. The third is even better. After five or six books, you",
    "textdich": ""
  },
  {
    "start": 2423.68,
    "end": 2437.599,
    "text": "start to feel more ready. You feel stronger. You understand more. You start to know many words. Your reading becomes",
    "textdich": ""
  },
  {
    "start": 2433.44,
    "end": 2450.64,
    "text": "faster. You feel more sure. You smile more. You are learning. But it all starts with book one. You need to find that first book. That book is the door.",
    "textdich": ""
  },
  {
    "start": 2447.68,
    "end": 2461.599,
    "text": "That book is the key. After that, everything becomes easier. Sometimes you may feel tired. Sometimes you may feel",
    "textdich": ""
  },
  {
    "start": 2457.2,
    "end": 2474.48,
    "text": "bored. That is okay. Take a break. Drink some tea. Rest your eyes. Then come back. Read again. Little by little, step",
    "textdich": ""
  },
  {
    "start": 2469.52,
    "end": 2487.28,
    "text": "by step. Even one page is good. Even one line is good. Some days you will read more, some days you will read less. That is fine.",
    "textdich": ""
  },
  {
    "start": 2483.359,
    "end": 2498.8,
    "text": "Just don't stop. Keep going. Keep reading. Every page you read makes your English better. Every page you read makes your brain stronger.",
    "textdich": ""
  },
  {
    "start": 2495.599,
    "end": 2510.0,
    "text": "And here is one last thing. Believe in yourself. You can do it. You are not too old. You are not too slow. You are not",
    "textdich": ""
  },
  {
    "start": 2505.68,
    "end": 2513.119,
    "text": "too weak. You are smart. You are brave.",
    "textdich": ""
  },
  {
    "start": 2510.0,
    "end": 2519.92,
    "text": "You are learning every day. English is hard. But you are stronger than English.",
    "textdich": ""
  },
  {
    "start": 2516.8,
    "end": 2531.2,
    "text": "And reading is your friend. Reading is your helper. Reading is your guide. So take one book, open the first page,",
    "textdich": ""
  },
  {
    "start": 2527.44,
    "end": 2536.319,
    "text": "start your journey. You are not alone. I am with you.",
    "textdich": ""
  },
  {
    "start": 2533.119,
    "end": 2542.079,
    "text": "Many people are with you. We are all learning. We are all growing.",
    "textdich": ""
  },
  {
    "start": 2539.52,
    "end": 2554.319,
    "text": "And we are all reading now. We are almost at the end of this story. But the beginning of your reading journey is just starting. You have read",
    "textdich": ""
  },
  {
    "start": 2550.319,
    "end": 2558.64,
    "text": "many words. You have seen many ideas.",
    "textdich": ""
  },
  {
    "start": 2554.319,
    "end": 2561.68,
    "text": "And now you know. Reading is not scary.",
    "textdich": ""
  },
  {
    "start": 2558.64,
    "end": 2571.2,
    "text": "Reading is not boring. Reading is not only for school. Reading is a way to grow. It is a way to enjoy. It is a way",
    "textdich": ""
  },
  {
    "start": 2568.4,
    "end": 2579.119,
    "text": "to become strong in English and strong in life. Maybe now you feel more ready.",
    "textdich": ""
  },
  {
    "start": 2575.839,
    "end": 2581.44,
    "text": "Maybe now you feel more sure.",
    "textdich": ""
  },
  {
    "start": 2579.119,
    "end": 2583.44,
    "text": "I hope so.",
    "textdich": ""
  },
  {
    "start": 2581.44,
    "end": 2592.56,
    "text": "Because you do not need to wait for someone to help you. You do not need to wait for a teacher or a class.",
    "textdich": ""
  },
  {
    "start": 2590.16,
    "end": 2595.44,
    "text": "You can help yourself.",
    "textdich": ""
  },
  {
    "start": 2592.56,
    "end": 2598.56,
    "text": "You can read by yourself.",
    "textdich": ""
  },
  {
    "start": 2595.44,
    "end": 2601.839,
    "text": "You can grow by yourself.",
    "textdich": ""
  },
  {
    "start": 2598.56,
    "end": 2611.04,
    "text": "Of course, a teacher is good. A friend is good. But when you read, you are in charge.",
    "textdich": ""
  },
  {
    "start": 2607.2,
    "end": 2614.079,
    "text": "You are the boss. You choose the book.",
    "textdich": ""
  },
  {
    "start": 2611.04,
    "end": 2621.839,
    "text": "You choose the time. You choose the place. You choose how fast or how slow.",
    "textdich": ""
  },
  {
    "start": 2617.92,
    "end": 2625.92,
    "text": "That is freedom. That is power.",
    "textdich": ""
  },
  {
    "start": 2621.839,
    "end": 2629.52,
    "text": "That is why reading is so special.",
    "textdich": ""
  },
  {
    "start": 2625.92,
    "end": 2640.64,
    "text": "One last story before I go. I met a man named Yousef. He was 65 years old. He said, \"Aariel, I never went to school. I",
    "textdich": ""
  },
  {
    "start": 2637.599,
    "end": 2653.68,
    "text": "cannot read well, but now I want to learn.\" I gave him a short story with very easy words. At first he was slow. He read one",
    "textdich": ""
  },
  {
    "start": 2649.92,
    "end": 2657.119,
    "text": "word at a time, but he did not stop.",
    "textdich": ""
  },
  {
    "start": 2653.68,
    "end": 2670.4,
    "text": "Every day he read one page. He read with his eyes. He read with his heart. After one year he read 10 books. He smiled. He",
    "textdich": ""
  },
  {
    "start": 2665.839,
    "end": 2683.119,
    "text": "laughed. He cried. He said, \"Now I feel young. Now I feel alive. I can read signs. I can read letters. I can read to my grandson.",
    "textdich": ""
  },
  {
    "start": 2679.92,
    "end": 2691.04,
    "text": "That made me so happy. It showed me that it is never too late. Anyone can learn.",
    "textdich": ""
  },
  {
    "start": 2686.96,
    "end": 2694.88,
    "text": "Anyone can read. Age does not matter.",
    "textdich": ""
  },
  {
    "start": 2691.04,
    "end": 2705.04,
    "text": "Education does not matter. What matters is your heart. What matters is your will. If you want it, you can do it. So",
    "textdich": ""
  },
  {
    "start": 2702.16,
    "end": 2712.319,
    "text": "maybe you are thinking now what do I do next? The answer is easy. Choose a book.",
    "textdich": ""
  },
  {
    "start": 2709.359,
    "end": 2721.92,
    "text": "It can be short. It can be long. It can be new. It can be old. It just needs to be something you enjoy.",
    "textdich": ""
  },
  {
    "start": 2717.92,
    "end": 2732.079,
    "text": "Start small. Start slow. Maybe 5 minutes a day. Maybe one page a day. That is enough. That is a great start. After one",
    "textdich": ""
  },
  {
    "start": 2729.28,
    "end": 2744.0,
    "text": "week, read a little more. After one month, read even more. In one year, you will look back and say, \"Wow, I read",
    "textdich": ""
  },
  {
    "start": 2739.92,
    "end": 2756.56,
    "text": "many books. I learned many words. I feel strong now.\" That is the goal. Not to be perfect, not to be fast, but to feel",
    "textdich": ""
  },
  {
    "start": 2751.92,
    "end": 2760.319,
    "text": "strong, to feel ready, to feel happy.",
    "textdich": ""
  },
  {
    "start": 2756.56,
    "end": 2762.64,
    "text": "And remember, you are not alone.",
    "textdich": ""
  },
  {
    "start": 2760.319,
    "end": 2768.56,
    "text": "Many people around the world are just like you. They are learning English.",
    "textdich": ""
  },
  {
    "start": 2765.839,
    "end": 2779.119,
    "text": "They are reading slowly. They are making progress. They are growing. You are part of this big family. We are all walking",
    "textdich": ""
  },
  {
    "start": 2775.52,
    "end": 2783.04,
    "text": "together. We are all learning together.",
    "textdich": ""
  },
  {
    "start": 2779.119,
    "end": 2786.88,
    "text": "So when you feel tired, remember us.",
    "textdich": ""
  },
  {
    "start": 2783.04,
    "end": 2789.92,
    "text": "When you feel lost, remember this story.",
    "textdich": ""
  },
  {
    "start": 2786.88,
    "end": 2803.599,
    "text": "When you feel small, remember that you are growing. You are becoming more every day. Do not give up. Do not stop. You are doing something very special.",
    "textdich": ""
  },
  {
    "start": 2800.88,
    "end": 2817.04,
    "text": "Now before we finish, let me give you a list of small tips. One, read what you like. Two, read something easy. Three,",
    "textdich": ""
  },
  {
    "start": 2812.8,
    "end": 2831.28,
    "text": "read often even if it is short. Four, read with joy, not with stress. Five, read again and again. Repeating helps.",
    "textdich": ""
  },
  {
    "start": 2826.8,
    "end": 2832.8,
    "text": "Six, read out loud sometimes.",
    "textdich": ""
  },
  {
    "start": 2831.28,
    "end": 2840.0,
    "text": "Seven, read and listen together.",
    "textdich": ""
  },
  {
    "start": 2835.52,
    "end": 2841.52,
    "text": "Eight, don't worry if you forget.",
    "textdich": ""
  },
  {
    "start": 2840.0,
    "end": 2848.8,
    "text": "Nine, don't use the dictionary too much.",
    "textdich": ""
  },
  {
    "start": 2845.28,
    "end": 2851.839,
    "text": "10, believe in yourself.",
    "textdich": ""
  },
  {
    "start": 2848.8,
    "end": 2861.359,
    "text": "These 10 things will help you. These 10 things will guide you. And now I want to say thank you.",
    "textdich": ""
  },
  {
    "start": 2858.4,
    "end": 2871.68,
    "text": "Thank you for reading this story. Thank you for spending your time with me. I hope you feel happy. I hope you feel ready.",
    "textdich": ""
  },
  {
    "start": 2868.96,
    "end": 2875.92,
    "text": "This is not the end. This is the beginning.",
    "textdich": ""
  },
  {
    "start": 2873.28,
    "end": 2878.64,
    "text": "Your first book is waiting.",
    "textdich": ""
  },
  {
    "start": 2875.92,
    "end": 2882.079,
    "text": "Your first page is waiting.",
    "textdich": ""
  },
  {
    "start": 2878.64,
    "end": 2890.88,
    "text": "Your first new word is waiting. Go and find it. Go and read it. Go and enjoy it.",
    "textdich": ""
  },
  {
    "start": 2888.16,
    "end": 2894.319,
    "text": "You have the power. You have the heart.",
    "textdich": ""
  },
  {
    "start": 2890.88,
    "end": 2897.44,
    "text": "You have the mind. You have the dream.",
    "textdich": ""
  },
  {
    "start": 2894.319,
    "end": 2905.52,
    "text": "You can read. You will read. You are ready now. So go my friend, go and read.",
    "textdich": ""
  },
  {
    "start": 2902.079,
    "end": 2908.76,
    "text": "Happy reading and happy learning.",
    "textdich": ""
  },
  {
    "start": 2905.52,
    "end": 2908.76,
    "text": "The end.",
    "textdich": ""
  }
]