[
    {
        "start": 0.24,
        "end": 13.599,
        "text": "Hello my amazing people. First of all, happy new year to all of you. I hope this year brings you peace, strength, discipline, clarity, and the",
        "textdich": ""
    },
    {
        "start": 10.96,
        "end": 17.76,
        "text": "breakthrough you've been waiting for.",
        "textdich": ""
    },
    {
        "start": 13.599,
        "end": 20.56,
        "text": "Now listen, welcome to 2026.",
        "textdich": ""
    },
    {
        "start": 17.76,
        "end": 31.92,
        "text": "Not just a new year, a new chance, a blank page. And this video is your pen. You're not watching this to get a little motivation.",
        "textdich": ""
    },
    {
        "start": 30.16,
        "end": 40.96,
        "text": "You're watching this because something inside you is done with the old life and you're ready to create something better.",
        "textdich": ""
    },
    {
        "start": 38.559,
        "end": 54.239,
        "text": "In this video, you'll learn how to change your life step by step, not with fake hype, but with real, powerful, proven steps that actually work. And",
        "textdich": ""
    },
    {
        "start": 51.36,
        "end": 65.199,
        "text": "yes, this video will also help you improve your English because you'll not only listen and learn, you'll start thinking in English, too. So, if you're",
        "textdich": ""
    },
    {
        "start": 63.44,
        "end": 76.72,
        "text": "serious about changing your life and your language, subscribe now and let's start this year stronger than ever.",
        "textdich": ""
    },
    {
        "start": 72.32,
        "end": 84.96,
        "text": "Step one, let go of your past self. This step is not about forgetting. It's about freeing yourself. Most people enter a",
        "textdich": ""
    },
    {
        "start": 81.84,
        "end": 94.799,
        "text": "new year with the same pain, the same guilt, the same regrets, and they wonder why their life doesn't change. You can't",
        "textdich": ""
    },
    {
        "start": 91.52,
        "end": 97.759,
        "text": "create a new life with an old identity.",
        "textdich": ""
    },
    {
        "start": 94.799,
        "end": 109.119,
        "text": "You can't walk into 2026 like a winner if you're still carrying the failure of 2025 on your back, in your mind, and in your habits. Imagine",
        "textdich": ""
    },
    {
        "start": 107.04,
        "end": 119.92,
        "text": "trying to run a race while carrying a huge bag of garbage. You might take a few steps, but soon you'll get tired.",
        "textdich": ""
    },
    {
        "start": 117.119,
        "end": 125.84,
        "text": "Not because you're weak, but because you refused to drop what's slowing you down.",
        "textdich": ""
    },
    {
        "start": 123.119,
        "end": 135.68,
        "text": "That's your past. The lies you told yourself. The promises you broke. The people who hurt you. The goals you never",
        "textdich": ""
    },
    {
        "start": 131.84,
        "end": 144.879,
        "text": "started. the time you wasted, the habits you never changed. You don't need to carry that anymore. Because here's the",
        "textdich": ""
    },
    {
        "start": 141.28,
        "end": 153.36,
        "text": "truth. You are not your past. You are your potential. Here are five powerful ways to truly let go of your past self.",
        "textdich": ""
    },
    {
        "start": 150.72,
        "end": 165.2,
        "text": "One, write a goodbye letter to your old self. Sit in silence and write a letter to the version of me who wasted 2025.",
        "textdich": ""
    },
    {
        "start": 162.08,
        "end": 176.16,
        "text": "Say everything. I forgive you. I understand why you did it. But now I'm done. Why this works? Because the brain respects rituals. This is not just a",
        "textdich": ""
    },
    {
        "start": 173.599,
        "end": 185.519,
        "text": "trick. This is how the mind marks an ending. If you want a new chapter, you must first close the old one.",
        "textdich": ""
    },
    {
        "start": 182.08,
        "end": 195.76,
        "text": "Two, identify the top three habits that destroyed you last year. Was it overthinking? Was it scrolling late at night? Was it eating junk when stressed?",
        "textdich": ""
    },
    {
        "start": 194.08,
        "end": 209.28,
        "text": "Was it talking negatively about yourself? Write them down. Put them on paper, not in your mind, where they can hide. Bring them into the light. And",
        "textdich": ""
    },
    {
        "start": 206.64,
        "end": 212.64,
        "text": "then make this declaration.",
        "textdich": ""
    },
    {
        "start": 209.28,
        "end": 219.76,
        "text": "These three habits will not enter 2026 with me. Three, change your environment.",
        "textdich": ""
    },
    {
        "start": 217.28,
        "end": 231.76,
        "text": "Why? Because the same environment will trigger the same behavior. If your room looks like 2025, your mind will think like 2025.",
        "textdich": ""
    },
    {
        "start": 228.48,
        "end": 234.72,
        "text": "Clean your space. Rearrange your desk.",
        "textdich": ""
    },
    {
        "start": 231.76,
        "end": 243.68,
        "text": "Delete toxic apps. Put reminders on your walls. This is the year I change. Even one small shift in your environment can",
        "textdich": ""
    },
    {
        "start": 240.64,
        "end": 246.48,
        "text": "begin a huge shift in your identity.",
        "textdich": ""
    },
    {
        "start": 243.68,
        "end": 255.84,
        "text": "Four, stop calling yourself by your old name. Your brain listens to what you say. If you keep saying, \"I'm lazy. I'm",
        "textdich": ""
    },
    {
        "start": 253.04,
        "end": 268.88,
        "text": "always tired. I never finish what I start. I can't learn English. I'm not good enough.\" Guess what? Your brain will obey. So this year, speak like the",
        "textdich": ""
    },
    {
        "start": 265.84,
        "end": 278.32,
        "text": "person you want to become. I'm learning every day. I'm becoming stronger. I'm consistent now. I'm not who I used to",
        "textdich": ""
    },
    {
        "start": 275.12,
        "end": 284.56,
        "text": "be. Because when your language changes, your identity starts to catch up. Five.",
        "textdich": ""
    },
    {
        "start": 282.4,
        "end": 290.56,
        "text": "Visualize yourself free. Close your eyes. Now imagine you're holding a box.",
        "textdich": ""
    },
    {
        "start": 288.479,
        "end": 295.68,
        "text": "Inside the box is everything you hated about 2025.",
        "textdich": ""
    },
    {
        "start": 292.479,
        "end": 307.039,
        "text": "The laziness, the mistakes, the failure, the fear, the fake relationships, the wasted time. And now you drop the box.",
        "textdich": ""
    },
    {
        "start": 303.28,
        "end": 315.28,
        "text": "You turn around and you walk away. This is not just imagination. This is brain training. Your subconscious believes",
        "textdich": ""
    },
    {
        "start": 312.56,
        "end": 326.24,
        "text": "what you feel. You can't build a palace on a broken foundation. You must burn the past version of yourself. The version that was scared, lazy, weak,",
        "textdich": ""
    },
    {
        "start": 323.36,
        "end": 339.44,
        "text": "lost. Not to hate it, but to honor how far you've come. And to say, \"Thank you, but I'm not you anymore.\" Step two, change your mindset.",
        "textdich": ""
    },
    {
        "start": 336.08,
        "end": 351.919,
        "text": "You want to change your life in 2026, then start with this. Change your mindset because your thoughts are not just thoughts. They are instructions.",
        "textdich": ""
    },
    {
        "start": 347.919,
        "end": 353.84,
        "text": "Your brain listens. Your body follows.",
        "textdich": ""
    },
    {
        "start": 351.919,
        "end": 362.4,
        "text": "And your life is shaped by the thoughts you think every single day. Most people try to change their habits. They write",
        "textdich": ""
    },
    {
        "start": 359.36,
        "end": 365.6,
        "text": "down new goals. They buy a new planner.",
        "textdich": ""
    },
    {
        "start": 362.4,
        "end": 368.479,
        "text": "They feel excited in January.",
        "textdich": ""
    },
    {
        "start": 365.6,
        "end": 371.68,
        "text": "But nothing actually changes.",
        "textdich": ""
    },
    {
        "start": 368.479,
        "end": 384.16,
        "text": "Why? Because their mindset is still the same. They still think like the old version of themselves. And if you don't upgrade that mindset, you will keep",
        "textdich": ""
    },
    {
        "start": 379.44,
        "end": 390.72,
        "text": "repeating the same year again and again, even if the calendar says 2026.",
        "textdich": ""
    },
    {
        "start": 387.44,
        "end": 399.36,
        "text": "So what is mindset? Mindset is not just motivation. Mindset is not just positive thinking. Mindset is the lens through",
        "textdich": ""
    },
    {
        "start": 396.479,
        "end": 411.199,
        "text": "which you see your life. If that lens is full of fear, full of self-doubt, full of guilt and full of excuses, then everything you do in life will be",
        "textdich": ""
    },
    {
        "start": 408.16,
        "end": 418.72,
        "text": "affected. Even the best opportunities will look risky. Even your best talents will feel useless.",
        "textdich": ""
    },
    {
        "start": 416.639,
        "end": 425.599,
        "text": "Even your strongest dreams will feel impossible. Your mindset is the filter.",
        "textdich": ""
    },
    {
        "start": 422.479,
        "end": 435.039,
        "text": "If the filter is broken, the picture is never clear. What does a weak mindset sound like? I can't do this. What if I",
        "textdich": ""
    },
    {
        "start": 431.52,
        "end": 448.639,
        "text": "fail? I'm not good enough. I'm not ready yet. What will people think? I always give up. Maybe next time. I'm not like those successful people.",
        "textdich": ""
    },
    {
        "start": 446.16,
        "end": 454.479,
        "text": "That's not laziness. That's not stupidity. That's just programming.",
        "textdich": ""
    },
    {
        "start": 452.0,
        "end": 459.12,
        "text": "That's just a voice that got repeated so many times.",
        "textdich": ""
    },
    {
        "start": 456.319,
        "end": 471.36,
        "text": "It became your belief. But here's the truth. Your mindset is not fixed. It is flexible. It can be rebuilt. And when you rebuild it, your life follows.",
        "textdich": ""
    },
    {
        "start": 468.4,
        "end": 483.68,
        "text": "One, replace negative questions with power questions. Your brain is like a machine. It answers whatever question you ask it. Ask a bad question, get a",
        "textdich": ""
    },
    {
        "start": 480.8,
        "end": 497.36,
        "text": "bad answer. Ask a power question, get a power answer. Bad question, why am I like this? Answer: Because you're a failure. Power question, what's one",
        "textdich": ""
    },
    {
        "start": 493.68,
        "end": 507.28,
        "text": "small step I can take today? Answer: clean your room, go for a walk, record that video. Bad question, what if this",
        "textdich": ""
    },
    {
        "start": 503.84,
        "end": 517.68,
        "text": "doesn't work? Answer: Then you'll waste your time again. Power question, what if this works better than I imagined?",
        "textdich": ""
    },
    {
        "start": 513.839,
        "end": 522.64,
        "text": "Answer, then 2026 will be the best year of your life. You see the difference?",
        "textdich": ""
    },
    {
        "start": 521.039,
        "end": 533.519,
        "text": "You don't need to change your life in one day. You just need to ask better questions every day. Two, change your self-t talk.",
        "textdich": ""
    },
    {
        "start": 531.519,
        "end": 542.32,
        "text": "Your brain listens to your voice more than anyone else's. So if you keep telling yourself, I'm not good at this.",
        "textdich": ""
    },
    {
        "start": 539.2,
        "end": 551.76,
        "text": "I always mess things up. I'm not smart enough. I can't speak English well. Then your brain will believe you and prove",
        "textdich": ""
    },
    {
        "start": 549.279,
        "end": 564.16,
        "text": "you right. But if you start telling yourself, I'm getting better. I learn fast. I stay consistent now. I speak more clearly every day. Then your brain",
        "textdich": ""
    },
    {
        "start": 561.839,
        "end": 576.8,
        "text": "will adjust. It will follow. It will rewire. What you say, you become. So speak like someone you admire. Talk to yourself like someone you believe in.",
        "textdich": ""
    },
    {
        "start": 573.36,
        "end": 583.04,
        "text": "Even if it feels fake, keep doing it because the brain changes through repetition.",
        "textdich": ""
    },
    {
        "start": 580.0,
        "end": 594.32,
        "text": "Three, install new beliefs every morning. Every morning when you wake up, your mind is fresh. It's open. It's waiting for instructions.",
        "textdich": ""
    },
    {
        "start": 591.92,
        "end": 603.6,
        "text": "If the first thing you do is check your phone, compare yourself to others, or scroll social media, then you've already",
        "textdich": ""
    },
    {
        "start": 600.8,
        "end": 606.08,
        "text": "lost the battle for your mindset.",
        "textdich": ""
    },
    {
        "start": 603.6,
        "end": 619.279,
        "text": "Instead, use that moment to install power into your mind. Say this every morning. Today I think like my future self. Today I act like someone with",
        "textdich": ""
    },
    {
        "start": 614.959,
        "end": 625.6,
        "text": "purpose. Today I show discipline. Today I speak with confidence.",
        "textdich": ""
    },
    {
        "start": 621.68,
        "end": 628.16,
        "text": "Today I I do what I said I would do.",
        "textdich": ""
    },
    {
        "start": 625.6,
        "end": 636.56,
        "text": "These are not just affirmations. These are brain instructions. Say them, feel them, repeat them. Because mindset is",
        "textdich": ""
    },
    {
        "start": 633.6,
        "end": 639.92,
        "text": "not a one-time decision. It's a daily ritual.",
        "textdich": ""
    },
    {
        "start": 638.0,
        "end": 647.12,
        "text": "You don't rise to the level of your goals. You fall to the level of your mindset.",
        "textdich": ""
    },
    {
        "start": 644.16,
        "end": 657.44,
        "text": "If you want to rise higher, upgrade the way you think. Train your mind like a warrior. Talk to yourself like a leader.",
        "textdich": ""
    },
    {
        "start": 654.16,
        "end": 670.16,
        "text": "Challenge every weak thought. Replace it with something stronger. And 2026 will become the year your brain finally becomes your ally, not your enemy.",
        "textdich": ""
    },
    {
        "start": 666.72,
        "end": 674.959,
        "text": "Step three, learn one useful skill in 2026.",
        "textdich": ""
    },
    {
        "start": 672.16,
        "end": 683.76,
        "text": "One skill can make you valuable. One skill can give you freedom. One skill can help you escape financial stress.",
        "textdich": ""
    },
    {
        "start": 681.279,
        "end": 694.32,
        "text": "One skill can build confidence faster than any motivational quote. One skill can take you from invisible to unstoppable.",
        "textdich": ""
    },
    {
        "start": 691.44,
        "end": 702.079,
        "text": "So, in 2026, don't waste your energy trying to do everything.",
        "textdich": ""
    },
    {
        "start": 698.0,
        "end": 707.76,
        "text": "Choose one skill and go deep. Most people try to learn five things at once.",
        "textdich": ""
    },
    {
        "start": 705.04,
        "end": 717.6,
        "text": "A little English, a little writing, a little designing, a little coding, and guess what? They become average at all",
        "textdich": ""
    },
    {
        "start": 713.68,
        "end": 727.36,
        "text": "of them. Don't be that person. Be the person who goes allin on one thing and becomes world class at it. Think of it",
        "textdich": ""
    },
    {
        "start": 723.92,
        "end": 734.8,
        "text": "like this. Most people do 100 things at 1% level, but successful people do one thing at 100%.",
        "textdich": ""
    },
    {
        "start": 733.12,
        "end": 740.079,
        "text": "That's the difference between noise and mastery.",
        "textdich": ""
    },
    {
        "start": 736.32,
        "end": 748.16,
        "text": "One, communication skill. Learn how to speak clearly, how to express ideas, how to connect with people through words.",
        "textdich": ""
    },
    {
        "start": 746.399,
        "end": 760.56,
        "text": "Especially learn English if you haven't already because in today's world communication equals opportunity.",
        "textdich": ""
    },
    {
        "start": 757.44,
        "end": 773.04,
        "text": "If you can't express yourself, people won't trust you. But if you can speak with clarity, doors will open. Your voice is your",
        "textdich": ""
    },
    {
        "start": 769.12,
        "end": 784.32,
        "text": "power. Train it. Two, digital or technical skill. Learn how to work with technology. Video editing, graphic design, web development, SEO, social",
        "textdich": ""
    },
    {
        "start": 781.76,
        "end": 797.2,
        "text": "media marketing, automation, basic coding, podcast editing. These are real skills that help real people and get paid for it. And the best part, most of",
        "textdich": ""
    },
    {
        "start": 794.24,
        "end": 805.68,
        "text": "them are free to learn online. You don't need a college degree. You just need curiosity and consistency.",
        "textdich": ""
    },
    {
        "start": 802.32,
        "end": 818.32,
        "text": "Three, money skill. Learn how money works, how to save it, how to multiply it, how to manage it, how to invest it, because earning money is not enough",
        "textdich": ""
    },
    {
        "start": 815.2,
        "end": 827.12,
        "text": "anymore. If you don't understand money, you will always stay broke, no matter how hard you work. Learn the difference",
        "textdich": ""
    },
    {
        "start": 824.0,
        "end": 834.72,
        "text": "between income and assets. Learn about compounding. Learn how to build a small business or side income.",
        "textdich": ""
    },
    {
        "start": 832.0,
        "end": 843.6,
        "text": "These skills are not nice to have. They are essential. The three rule strategy to master any skill.",
        "textdich": ""
    },
    {
        "start": 840.24,
        "end": 854.0,
        "text": "One, focus on one skill for the next 90 days. No multitasking. No switching after two weeks. Pick one. Stick to it.",
        "textdich": ""
    },
    {
        "start": 850.399,
        "end": 856.24,
        "text": "Build momentum. Two. Learn in English.",
        "textdich": ""
    },
    {
        "start": 854.0,
        "end": 864.399,
        "text": "Choose English YouTube videos. Read English books or blogs. Take notes in English. Speak about what you learned.",
        "textdich": ""
    },
    {
        "start": 861.44,
        "end": 873.76,
        "text": "in English. That way you grow two skills at the same time. Your chosen skill plus your language fluency. This is called",
        "textdich": ""
    },
    {
        "start": 870.079,
        "end": 876.399,
        "text": "compound growth and it's powerful.",
        "textdich": ""
    },
    {
        "start": 873.76,
        "end": 880.56,
        "text": "Three, create something every week.",
        "textdich": ""
    },
    {
        "start": 876.399,
        "end": 883.92,
        "text": "Learning is not enough. You must create.",
        "textdich": ""
    },
    {
        "start": 880.56,
        "end": 894.56,
        "text": "Every week make something. A video, a design, a blog post, a voice recording, an app, a lesson, a mini product, a post on social media. Action creates",
        "textdich": ""
    },
    {
        "start": 892.079,
        "end": 903.6,
        "text": "confidence. Learning without creating equals nothing. Let's say you choose video editing. You spend 30 minutes a",
        "textdich": ""
    },
    {
        "start": 900.16,
        "end": 913.04,
        "text": "day learning on YouTube in English. You start editing reals, shorts, YouTube videos for practice. You make one new",
        "textdich": ""
    },
    {
        "start": 909.44,
        "end": 926.24,
        "text": "project every weekend. You improve. You take feedback. You join an online community. After 90 days, you can start freelancing. After 6 months, you're",
        "textdich": ""
    },
    {
        "start": 923.36,
        "end": 935.04,
        "text": "confident. By the end of the year, you can turn it into a business. And you didn't just learn a skill. You changed",
        "textdich": ""
    },
    {
        "start": 932.079,
        "end": 937.839,
        "text": "your income. You built your identity.",
        "textdich": ""
    },
    {
        "start": 935.04,
        "end": 948.48,
        "text": "You upgraded your brain. You transformed your life. That's the power of one useful skill. You don't need to do everything in 2026.",
        "textdich": ""
    },
    {
        "start": 945.68,
        "end": 954.399,
        "text": "You just need to do one thing really well. Choose your skill like a weapon.",
        "textdich": ""
    },
    {
        "start": 951.839,
        "end": 957.199,
        "text": "Sharpen it daily. Train with it.",
        "textdich": ""
    },
    {
        "start": 954.399,
        "end": 968.8,
        "text": "Practice with it. Create with it. And let it lead you into a future where you're no longer stuck, scared, or dependent. One skill, one decision, one",
        "textdich": ""
    },
    {
        "start": 965.759,
        "end": 972.88,
        "text": "year. This is your time.",
        "textdich": ""
    },
    {
        "start": 968.8,
        "end": 975.6,
        "text": "Step four, keep yourself happy in 2026.",
        "textdich": ""
    },
    {
        "start": 972.88,
        "end": 985.199,
        "text": "Don't just chase success, chase peace, chase balance. Chase the version of you that feels calm, centered, alive, not just busy, and tired.",
        "textdich": ""
    },
    {
        "start": 983.199,
        "end": 990.16,
        "text": "Because what's the point of reaching all your goals?",
        "textdich": ""
    },
    {
        "start": 986.959,
        "end": 996.639,
        "text": "If you lose yourself on the way, we live in a world where people are addicted to distraction.",
        "textdich": ""
    },
    {
        "start": 994.0,
        "end": 1008.399,
        "text": "They think happiness is in more money, more likes, more attention, more success. But real happiness is not found in the future. It is created in the",
        "textdich": ""
    },
    {
        "start": 1005.92,
        "end": 1021.759,
        "text": "present. So how do you keep yourself happy even when life gets tough? One, stop waiting for big reasons to feel happy. Most people say things like,",
        "textdich": ""
    },
    {
        "start": 1018.639,
        "end": 1027.12,
        "text": "\"I'll be happy when I earn more. I'll be happy when I lose weight.",
        "textdich": ""
    },
    {
        "start": 1024.0,
        "end": 1033.199,
        "text": "I'll be happy when I move out. I'll be happy when I finally succeed.",
        "textdich": ""
    },
    {
        "start": 1030.16,
        "end": 1040.24,
        "text": "That's a dangerous mindset because that means your happiness is always in the future. Always one achievement away.",
        "textdich": ""
    },
    {
        "start": 1038.48,
        "end": 1051.44,
        "text": "Always depending on things you don't fully control. Instead, say this. I will celebrate the small things every single",
        "textdich": ""
    },
    {
        "start": 1047.12,
        "end": 1053.919,
        "text": "day. You woke up today. That's a win.",
        "textdich": ""
    },
    {
        "start": 1051.44,
        "end": 1056.4,
        "text": "You ate something warm. That's a win.",
        "textdich": ""
    },
    {
        "start": 1053.919,
        "end": 1061.44,
        "text": "You studied for 30 minutes. That's a win. You helped someone. That's a win.",
        "textdich": ""
    },
    {
        "start": 1059.52,
        "end": 1073.76,
        "text": "Start treating small things like they matter because they do. Happiness is not a goal. It's a way of living. Two, build a simple joy routine.",
        "textdich": ""
    },
    {
        "start": 1071.36,
        "end": 1084.4,
        "text": "Every day, do one small thing that fills your heart. It could be listening to your favorite song, drinking tea in silence, walking without your phone,",
        "textdich": ""
    },
    {
        "start": 1082.0,
        "end": 1099.44,
        "text": "laughing with a friend, watching the sunrise, hugging your parent, reading a powerful quote, talking to God, dancing when no one's watching. The",
        "textdich": ""
    },
    {
        "start": 1096.88,
        "end": 1110.88,
        "text": "activity doesn't matter. What matters is that you do it every day. No guilt, no rush, no shame. just joy scheduled like a habit.",
        "textdich": ""
    },
    {
        "start": 1107.84,
        "end": 1121.2,
        "text": "Three, protect your energy from toxic sources. Happiness is also about what you avoid. Stay away from people who always complain, always judge, never",
        "textdich": ""
    },
    {
        "start": 1119.679,
        "end": 1124.0,
        "text": "appreciate.",
        "textdich": ""
    },
    {
        "start": 1121.2,
        "end": 1134.72,
        "text": "Only call when they need something. Make you feel small. Don't believe in your dreams. It doesn't matter if they're family, friends, or co-workers.",
        "textdich": ""
    },
    {
        "start": 1131.76,
        "end": 1137.919,
        "text": "Your peace is your responsibility.",
        "textdich": ""
    },
    {
        "start": 1134.72,
        "end": 1144.0,
        "text": "Set boundaries. Learn to say no. Your mental health is more important than their opinion. You're not responsible",
        "textdich": ""
    },
    {
        "start": 1141.76,
        "end": 1149.6,
        "text": "for fixing everyone. You're responsible for healing yourself.",
        "textdich": ""
    },
    {
        "start": 1146.32,
        "end": 1158.799,
        "text": "Four, don't be happy later. Be happy now. Even while you work, you don't have to choose between hustle and happiness.",
        "textdich": ""
    },
    {
        "start": 1156.0,
        "end": 1169.2,
        "text": "You can enjoy the process. You can enjoy progress. You can enjoy learning, growing, becoming. You can say, \"I'm not where I want to be, but I'm proud I",
        "textdich": ""
    },
    {
        "start": 1167.679,
        "end": 1171.679,
        "text": "started.",
        "textdich": ""
    },
    {
        "start": 1169.2,
        "end": 1184.72,
        "text": "I made mistakes, but at least I'm not quitting. Today was hard, but I'm stronger because of it. I didn't get results, but I showed up.\" This mindset",
        "textdich": ""
    },
    {
        "start": 1181.76,
        "end": 1195.44,
        "text": "creates emotional stability, and that stability becomes your secret weapon in life. Because when others break down, you'll stay grounded.",
        "textdich": ""
    },
    {
        "start": 1193.2,
        "end": 1205.919,
        "text": "Keeping yourself happy is not about being fake. It's not about smiling all the time. It's about taking control of your energy.",
        "textdich": ""
    },
    {
        "start": 1203.52,
        "end": 1216.4,
        "text": "It's about choosing joy even in small moments. It's about building a life you don't have to escape from. You don't need more stuff. You need more",
        "textdich": ""
    },
    {
        "start": 1212.799,
        "end": 1228.48,
        "text": "stillness. And in 2026, choose to create a life where peace becomes your power. Step five, be present. This moment, right now, is the",
        "textdich": ""
    },
    {
        "start": 1225.679,
        "end": 1237.6,
        "text": "only thing that truly exists. The past is gone. You can't change it. The future hasn't arrived yet. You can't touch it.",
        "textdich": ""
    },
    {
        "start": 1235.44,
        "end": 1248.48,
        "text": "But your mind, it's always somewhere else. You're eating but thinking about work. You're with family but thinking about your phone.",
        "textdich": ""
    },
    {
        "start": 1245.76,
        "end": 1252.88,
        "text": "You're working but thinking about your mistakes.",
        "textdich": ""
    },
    {
        "start": 1250.08,
        "end": 1258.159,
        "text": "You're resting but feeling guilty about not doing more.",
        "textdich": ""
    },
    {
        "start": 1255.039,
        "end": 1266.559,
        "text": "This is called mental time travel. And it's one of the biggest causes of stress, anxiety, fear, and regret.",
        "textdich": ""
    },
    {
        "start": 1264.48,
        "end": 1278.159,
        "text": "The secret to peace and productivity is simple. Learn to live fully in the present because presence gives you power. When you're fully in the moment,",
        "textdich": ""
    },
    {
        "start": 1275.36,
        "end": 1288.0,
        "text": "your mind becomes focused, your heart becomes calm, your energy becomes clean, and your actions become 10 times more effective.",
        "textdich": ""
    },
    {
        "start": 1285.36,
        "end": 1290.32,
        "text": "Imagine two people learning English.",
        "textdich": ""
    },
    {
        "start": 1288.0,
        "end": 1301.84,
        "text": "Person A is fully present, no distractions, mind 100% focused, no negative self-t talk. Person B is half present, thinking",
        "textdich": ""
    },
    {
        "start": 1299.039,
        "end": 1314.48,
        "text": "about mistakes, comparing with others, doubting their progress. After 30 minutes, who learned more? Who felt better? Who grew faster? The answer is",
        "textdich": ""
    },
    {
        "start": 1310.559,
        "end": 1318.32,
        "text": "obvious. Presence multiplies results.",
        "textdich": ""
    },
    {
        "start": 1314.48,
        "end": 1320.799,
        "text": "One, practice microresence.",
        "textdich": ""
    },
    {
        "start": 1318.32,
        "end": 1331.039,
        "text": "You don't need to become a monk. Just start with one minute presence exercises. When you brush your teeth, do it with full attention. When you drink",
        "textdich": ""
    },
    {
        "start": 1327.6,
        "end": 1339.039,
        "text": "water, feel it go down your throat. When you walk, feel your feet touch the ground. This trains your brain to focus.",
        "textdich": ""
    },
    {
        "start": 1336.48,
        "end": 1343.919,
        "text": "And over time, this focus becomes your superpower.",
        "textdich": ""
    },
    {
        "start": 1340.64,
        "end": 1346.96,
        "text": "Two, do one thing at a time.",
        "textdich": ""
    },
    {
        "start": 1343.919,
        "end": 1358.559,
        "text": "Multitasking is a lie. Your brain can only focus deeply on one thing. If you're talking and scrolling, working and texting, studying and watching",
        "textdich": ""
    },
    {
        "start": 1355.36,
        "end": 1369.679,
        "text": "YouTube, you're not present. You're scattered. Choose one task. Give it your full presence. Then move to the next.",
        "textdich": ""
    },
    {
        "start": 1366.4,
        "end": 1375.84,
        "text": "This is how high performers operate. And this is how you protect your peace.",
        "textdich": ""
    },
    {
        "start": 1372.64,
        "end": 1385.84,
        "text": "Three, name your feelings. Don't avoid them. When you feel angry, pause and say, \"I'm feeling angry.\" When you feel",
        "textdich": ""
    },
    {
        "start": 1382.24,
        "end": 1392.24,
        "text": "anxious, pause and say, \"I'm feeling anxious.\" When you feel happy, say it.",
        "textdich": ""
    },
    {
        "start": 1389.52,
        "end": 1403.36,
        "text": "Feel it. Breathe it in. This sounds simple, but it's powerful. Because naming your emotion brings you back to the now. It gives your brain clarity. I",
        "textdich": ""
    },
    {
        "start": 1399.84,
        "end": 1406.159,
        "text": "see it. I accept it. I control it.",
        "textdich": ""
    },
    {
        "start": 1403.36,
        "end": 1410.159,
        "text": "Ignoring emotions equals more stress.",
        "textdich": ""
    },
    {
        "start": 1406.159,
        "end": 1421.919,
        "text": "Facing them equals more peace. Four, put your phone down. This one is hard but essential. Your phone is a powerful tool, but also the biggest thief of",
        "textdich": ""
    },
    {
        "start": 1418.08,
        "end": 1425.919,
        "text": "presence. You check it 50 times a day.",
        "textdich": ""
    },
    {
        "start": 1421.919,
        "end": 1428.799,
        "text": "Most of the time for nothing. Try this.",
        "textdich": ""
    },
    {
        "start": 1425.919,
        "end": 1437.76,
        "text": "Turn off notifications. Set three check times per day. Leave your phone in another room when working. Walk without",
        "textdich": ""
    },
    {
        "start": 1434.0,
        "end": 1446.24,
        "text": "your phone. Eat without your phone. Talk to people while looking into their eyes, not at your screen. These small acts",
        "textdich": ""
    },
    {
        "start": 1442.72,
        "end": 1455.6,
        "text": "bring you back to life, to reality, to presence. Five. Create stillness every day. You don't need to meditate for 1",
        "textdich": ""
    },
    {
        "start": 1452.559,
        "end": 1458.72,
        "text": "hour. Just sit in silence for 5 minutes.",
        "textdich": ""
    },
    {
        "start": 1455.6,
        "end": 1468.32,
        "text": "No music, no noise, no scrolling. Just you, your breath, and your thoughts. Let your brain breathe. Let your soul speak.",
        "textdich": ""
    },
    {
        "start": 1466.159,
        "end": 1477.76,
        "text": "This stillness will reset your nervous system. It will clean the mental clutter and it will help you face life with more strength.",
        "textdich": ""
    },
    {
        "start": 1475.679,
        "end": 1486.88,
        "text": "Being present doesn't mean you ignore your goals. It means you stop living in imaginary stress. It means you stop",
        "textdich": ""
    },
    {
        "start": 1483.6,
        "end": 1497.52,
        "text": "wasting the only time you actually have, which is now. In 2026, master this simple truth. The present moment is your",
        "textdich": ""
    },
    {
        "start": 1493.679,
        "end": 1507.2,
        "text": "most powerful tool. Use it with respect, live it with attention, and build your future one focused moment at a time.",
        "textdich": ""
    },
    {
        "start": 1504.24,
        "end": 1519.279,
        "text": "Step six, take care of your body and mind in 2026. If you want to build something great, a new career, a new skill, a new version of yourself, you",
        "textdich": ""
    },
    {
        "start": 1516.32,
        "end": 1533.12,
        "text": "need two things working in harmony. your body, your mind. Not one, not later, both now. Because what's the point of dreaming big if you don't have the",
        "textdich": ""
    },
    {
        "start": 1530.4,
        "end": 1543.52,
        "text": "energy to chase those dreams? What's the point of learning, planning, or setting goals? If your brain is tired, your focus is broken, your emotions are",
        "textdich": ""
    },
    {
        "start": 1540.96,
        "end": 1554.559,
        "text": "crashing, your physical and mental health are the foundation of everything you will achieve this year. So let's build that foundation",
        "textdich": ""
    },
    {
        "start": 1550.559,
        "end": 1559.919,
        "text": "the right way. One, sleep like a warrior. This is where most people fail.",
        "textdich": ""
    },
    {
        "start": 1557.44,
        "end": 1570.48,
        "text": "They hustle, scroll, and sacrifice their sleep and then wonder why they feel tired, foggy, depressed, and unmotivated.",
        "textdich": ""
    },
    {
        "start": 1566.08,
        "end": 1573.36,
        "text": "Sleep is not a luxury. It's your fuel.",
        "textdich": ""
    },
    {
        "start": 1570.48,
        "end": 1584.159,
        "text": "Without 7 to 8 hours of deep sleep, your brain cannot focus. Your memory becomes weak. Your willpower goes down. Your emotions become unstable. Your",
        "textdich": ""
    },
    {
        "start": 1581.76,
        "end": 1587.36,
        "text": "creativity disappears.",
        "textdich": ""
    },
    {
        "start": 1584.159,
        "end": 1596.72,
        "text": "So in 2026, treat your sleep like your most important meeting of the day. Tips: No phone 30 to 60 minutes before bed.",
        "textdich": ""
    },
    {
        "start": 1594.48,
        "end": 1606.32,
        "text": "Sleep and wake at the same time every day. Make your room dark and cold. Use your bed only for sleep, not [clears throat] scrolling.",
        "textdich": ""
    },
    {
        "start": 1604.559,
        "end": 1612.159,
        "text": "Think of three things you're grateful for before sleeping.",
        "textdich": ""
    },
    {
        "start": 1608.559,
        "end": 1613.76,
        "text": "Great mornings begin with great nights.",
        "textdich": ""
    },
    {
        "start": 1612.159,
        "end": 1621.6,
        "text": "Two, eat with awareness, not emotion.",
        "textdich": ""
    },
    {
        "start": 1618.48,
        "end": 1632.159,
        "text": "Food is not just about taste. It's about fuel, focus, and function. In 2026, stop treating your body like a trash can. If",
        "textdich": ""
    },
    {
        "start": 1629.76,
        "end": 1639.84,
        "text": "you fill it with junk, you'll feel like junk. Sugary snacks kill your energy.",
        "textdich": ""
    },
    {
        "start": 1636.48,
        "end": 1642.799,
        "text": "Processed food makes your brain foggy.",
        "textdich": ""
    },
    {
        "start": 1639.84,
        "end": 1647.679,
        "text": "Overeating makes you lazy. Emotional eating leads to guilt and more stress.",
        "textdich": ""
    },
    {
        "start": 1645.84,
        "end": 1657.679,
        "text": "Eat like someone who respects their body. Simple rule. Eat food that was alive once, not manufactured in a lab.",
        "textdich": ""
    },
    {
        "start": 1655.039,
        "end": 1666.88,
        "text": "More real food, fruits, vegetables, clean protein, water. Less fake food, chips, soda, fried items, energy drinks.",
        "textdich": ""
    },
    {
        "start": 1664.4,
        "end": 1671.36,
        "text": "Also, drink more water. Your brain runs on it. Most people are not tired.",
        "textdich": ""
    },
    {
        "start": 1669.36,
        "end": 1674.96,
        "text": "They're dehydrated.",
        "textdich": ""
    },
    {
        "start": 1671.36,
        "end": 1677.84,
        "text": "Three, move every day, no matter what.",
        "textdich": ""
    },
    {
        "start": 1674.96,
        "end": 1686.96,
        "text": "Movement is medicine. If you don't move your body, your emotions get stuck. Your mind slows down. Your stress builds up.",
        "textdich": ""
    },
    {
        "start": 1684.48,
        "end": 1696.24,
        "text": "Your discipline disappears. You don't need a gym. You don't need to look like a model. You just need to move. Walk,",
        "textdich": ""
    },
    {
        "start": 1692.64,
        "end": 1707.679,
        "text": "stretch, do push-ups, dance, run, do yoga, do jumping jacks in your room, take stairs instead of elevators. Just do something every single day. Because",
        "textdich": ""
    },
    {
        "start": 1705.6,
        "end": 1720.559,
        "text": "when your body moves, your brain unlocks. And in 2026, your energy will decide how far you go. Four, protect your mental health. Your mind is like a",
        "textdich": ""
    },
    {
        "start": 1717.919,
        "end": 1730.48,
        "text": "garden. If you don't take care of it, weeds will grow. Stress, fear, overthinking, anxiety, negativity.",
        "textdich": ""
    },
    {
        "start": 1726.559,
        "end": 1733.44,
        "text": "Here's how to protect your mind in 2026.",
        "textdich": ""
    },
    {
        "start": 1730.48,
        "end": 1737.76,
        "text": "Limit social media. You don't need to see everything.",
        "textdich": ""
    },
    {
        "start": 1735.36,
        "end": 1746.399,
        "text": "Talk to someone you trust. Don't suffer in silence. Journal your thoughts. Let them out of your head. Do deep breathing",
        "textdich": ""
    },
    {
        "start": 1743.52,
        "end": 1756.159,
        "text": "for 5 minutes a day. Replace negative inputs with positive ones. Avoid overthinking by taking small action.",
        "textdich": ""
    },
    {
        "start": 1752.08,
        "end": 1762.64,
        "text": "Five. Read every day, even for 10 minutes. Reading is not just learning.",
        "textdich": ""
    },
    {
        "start": 1759.279,
        "end": 1772.08,
        "text": "It's healing. In a world full of noise, reading is silence. In a world full of opinions, reading is clarity. In a world",
        "textdich": ""
    },
    {
        "start": 1768.64,
        "end": 1775.12,
        "text": "full of distraction, reading is focus.",
        "textdich": ""
    },
    {
        "start": 1772.08,
        "end": 1784.399,
        "text": "When you read, your brain sharpens, your vocabulary grows, your thinking becomes deeper, your imagination becomes wider,",
        "textdich": ""
    },
    {
        "start": 1781.279,
        "end": 1787.2,
        "text": "and your emotional strength multiplies.",
        "textdich": ""
    },
    {
        "start": 1784.399,
        "end": 1796.88,
        "text": "You start understanding the world and yourself. Even 10 minutes of reading a day can reduce your stress, improve your",
        "textdich": ""
    },
    {
        "start": 1794.0,
        "end": 1806.24,
        "text": "English, teach you new perspectives, help you think critically, build your discipline, improve your speaking. Start",
        "textdich": ""
    },
    {
        "start": 1802.64,
        "end": 1815.44,
        "text": "small. Read one paragraph, one page, one chapter, one idea. Highlight what hits your heart. Underline what shakes your",
        "textdich": ""
    },
    {
        "start": 1811.36,
        "end": 1818.08,
        "text": "soul. Take notes. Reflect. Apply.",
        "textdich": ""
    },
    {
        "start": 1815.44,
        "end": 1827.279,
        "text": "Because one sentence from the right book can change the way you see your entire life. Make this a rule in 2026.",
        "textdich": ""
    },
    {
        "start": 1824.24,
        "end": 1836.88,
        "text": "I feed my body with food. I feed my mind with books. And remember, reading is not a race. It's not about how many books",
        "textdich": ""
    },
    {
        "start": 1834.24,
        "end": 1847.279,
        "text": "you finish. It's about how many ideas you live. So read like your life depends on it. Because in many ways it does. If",
        "textdich": ""
    },
    {
        "start": 1844.88,
        "end": 1856.88,
        "text": "you don't take care of your body, where will you live? If you don't take care of your mind, how will you think, speak,",
        "textdich": ""
    },
    {
        "start": 1853.279,
        "end": 1864.48,
        "text": "decide, or grow? This year, don't just focus on goals. Focus on the machine that helps you achieve them, your body",
        "textdich": ""
    },
    {
        "start": 1861.6,
        "end": 1874.799,
        "text": "and brain, because energy is the real wealth. And when you have it, everything becomes possible.",
        "textdich": ""
    },
    {
        "start": 1870.24,
        "end": 1878.159,
        "text": "Step seven, breathe and center yourself.",
        "textdich": ""
    },
    {
        "start": 1874.799,
        "end": 1880.159,
        "text": "In 2026, the world will keep rushing.",
        "textdich": ""
    },
    {
        "start": 1878.159,
        "end": 1888.799,
        "text": "People will keep shouting. Your phone will keep buzzing. Deadlines, notifications, opinions, expectations.",
        "textdich": ""
    },
    {
        "start": 1885.919,
        "end": 1900.24,
        "text": "But in the middle of all that noise, you have one superpower, your breath. It is free. It is always with you. and it is",
        "textdich": ""
    },
    {
        "start": 1896.88,
        "end": 1909.76,
        "text": "the key to staying calm, focused, and in control. One, your breath controls your state. Every emotion has a rhythm. When",
        "textdich": ""
    },
    {
        "start": 1907.6,
        "end": 1917.919,
        "text": "you're anxious, your breath is fast and shallow. When you're calm, your breath is slow and deep. So, if you want to",
        "textdich": ""
    },
    {
        "start": 1915.279,
        "end": 1930.32,
        "text": "control your emotion, start with your breath. Breathe deeply. Inhale slowly through your nose. Hold it for a few seconds. Exhale slowly through your",
        "textdich": ""
    },
    {
        "start": 1926.72,
        "end": 1939.039,
        "text": "mouth. Do this three times right now and feel the shift. You don't need motivation. You need oxygen. Two.",
        "textdich": ""
    },
    {
        "start": 1937.12,
        "end": 1947.679,
        "text": "Centering yourself equals returning to clarity. To center yourself means to come back to your balance point. Imagine",
        "textdich": ""
    },
    {
        "start": 1944.799,
        "end": 1957.039,
        "text": "you're on a boat in a storm. Waves are high. Wind is strong. But deep inside the ocean, it's calm.",
        "textdich": ""
    },
    {
        "start": 1954.0,
        "end": 1966.88,
        "text": "That's your center. When life feels overwhelming, your center brings you back. And the fastest way to reach it is through",
        "textdich": ""
    },
    {
        "start": 1963.2,
        "end": 1976.48,
        "text": "stillness and breath. Even 60 seconds of deep breathing can, lower your heart rate, reduce anxiety, improve focus,",
        "textdich": ""
    },
    {
        "start": 1973.919,
        "end": 1986.559,
        "text": "help you make better decisions, break the cycle of overthinking. Three, use the 33 rule. Whenever you feel stressed,",
        "textdich": ""
    },
    {
        "start": 1983.6,
        "end": 1997.36,
        "text": "anxious, or distracted, breathe in for 3 seconds. Hold for 3 seconds. Breathe out for 3 seconds. Repeat this three times.",
        "textdich": ""
    },
    {
        "start": 1994.64,
        "end": 2008.48,
        "text": "It takes 30 seconds, but resets your nervous system. Do it before a meeting, before studying, before making a hard decision, before speaking, before",
        "textdich": ""
    },
    {
        "start": 2005.679,
        "end": 2013.6,
        "text": "sleeping. This is not a trick. This is biology.",
        "textdich": ""
    },
    {
        "start": 2010.08,
        "end": 2018.96,
        "text": "Four. Meditation equals mental gym. Most people go to the gym to build muscle.",
        "textdich": ""
    },
    {
        "start": 2016.159,
        "end": 2027.12,
        "text": "But what about the mind? Your mind is constantly spinning. Memories, worries, ideas, fears, hopes.",
        "textdich": ""
    },
    {
        "start": 2025.519,
        "end": 2040.24,
        "text": "Meditation helps you observe your thoughts without being controlled by them. Start with 2 minutes a day. Just sit, close your eyes, breathe slowly,",
        "textdich": ""
    },
    {
        "start": 2037.2,
        "end": 2049.44,
        "text": "focus on your breath. When thoughts come, watch them like clouds. Let them pass. You don't need to stop thinking.",
        "textdich": ""
    },
    {
        "start": 2047.519,
        "end": 2060.96,
        "text": "You just need to stop chasing every thought. In a world full of chaos, the strongest person is the one who can stay calm. In 2026,",
        "textdich": ""
    },
    {
        "start": 2057.919,
        "end": 2065.599,
        "text": "make this your secret ritual. Breathe before reacting.",
        "textdich": ""
    },
    {
        "start": 2063.04,
        "end": 2068.48,
        "text": "Breathe before responding.",
        "textdich": ""
    },
    {
        "start": 2065.599,
        "end": 2075.28,
        "text": "Breathe before quitting. Breathe before speaking. Breathe before panicking.",
        "textdich": ""
    },
    {
        "start": 2072.24,
        "end": 2079.679,
        "text": "Your breath is your remote control. Use it to change the channel of your mind.",
        "textdich": ""
    },
    {
        "start": 2077.76,
        "end": 2089.2,
        "text": "And when life feels like it's spinning too fast, come back to the center. Come back to your breath.",
        "textdich": ""
    },
    {
        "start": 2085.52,
        "end": 2094.96,
        "text": "Because peace is not found. Peace is practiced.",
        "textdich": ""
    },
    {
        "start": 2090.8,
        "end": 2105.44,
        "text": "Step nine. Create your future self. The biggest mistake people make in January, they write down goals, they make resolutions,",
        "textdich": ""
    },
    {
        "start": 2102.24,
        "end": 2112.16,
        "text": "they buy planners and set deadlines, but they forget one thing. They never change their identity.",
        "textdich": ""
    },
    {
        "start": 2110.64,
        "end": 2119.28,
        "text": "Because until you see yourself as someone new, you'll keep repeating the old behavior.",
        "textdich": ""
    },
    {
        "start": 2117.359,
        "end": 2131.119,
        "text": "You can't act like your old self and expect a new life. You must create your future self. and then practice being them every day.",
        "textdich": ""
    },
    {
        "start": 2127.839,
        "end": 2135.599,
        "text": "One, understand that identity creates behavior.",
        "textdich": ""
    },
    {
        "start": 2132.64,
        "end": 2145.28,
        "text": "Most people try to change behavior. I want to wake up earlier. I want to eat healthier. I want to speak better English.",
        "textdich": ""
    },
    {
        "start": 2142.32,
        "end": 2148.72,
        "text": "I want to stop procrastinating.",
        "textdich": ""
    },
    {
        "start": 2145.28,
        "end": 2158.079,
        "text": "But these are surface level. Real change happens when you say, \"I am the kind of person who wakes up early. I am the kind",
        "textdich": ""
    },
    {
        "start": 2155.04,
        "end": 2162.48,
        "text": "of person who eats clean. I am the kind of person who speaks clearly.",
        "textdich": ""
    },
    {
        "start": 2160.64,
        "end": 2174.72,
        "text": "I am the kind of person who finishes what I start.\" See the difference? Don't chase habits. Build identity. When your self-image changes, your behavior",
        "textdich": ""
    },
    {
        "start": 2172.4,
        "end": 2178.72,
        "text": "changes naturally.",
        "textdich": ""
    },
    {
        "start": 2174.72,
        "end": 2180.8,
        "text": "Two, write a future self blueprint.",
        "textdich": ""
    },
    {
        "start": 2178.72,
        "end": 2192.72,
        "text": "Here's an exercise that will change your year. Take 30 minutes. Write a letter as if it's the end of 2026 from your future",
        "textdich": ""
    },
    {
        "start": 2188.56,
        "end": 2201.92,
        "text": "self. Start with, \"Dear your name, I'm so proud of us. We finally did it.\" Then write everything. How you feel, what",
        "textdich": ""
    },
    {
        "start": 2199.04,
        "end": 2212.16,
        "text": "you've built, what you've learned, who you became, what you let go of, what you started, what you no longer accept. Make",
        "textdich": ""
    },
    {
        "start": 2208.72,
        "end": 2217.44,
        "text": "it vivid. Make it real. Because the brain believes what it can visualize.",
        "textdich": ""
    },
    {
        "start": 2214.72,
        "end": 2227.599,
        "text": "You don't just need goals. You need a clear picture of the person who achieves them. Three, rehearse being your future",
        "textdich": ""
    },
    {
        "start": 2223.28,
        "end": 2230.56,
        "text": "self daily, every single day. Huh.",
        "textdich": ""
    },
    {
        "start": 2227.599,
        "end": 2242.72,
        "text": "Ask this question. What would my future self do in this moment? Would they scroll or study? Would they speak confidently or stay silent? Would they",
        "textdich": ""
    },
    {
        "start": 2238.64,
        "end": 2253.92,
        "text": "give up or try again? Then act like them even if it's hard, even if it's uncomfortable. This is called identity rehearsal. Actors do it for roles.",
        "textdich": ""
    },
    {
        "start": 2251.119,
        "end": 2262.88,
        "text": "Athletes do it for performance. You must do it for your transformation because repetition builds character.",
        "textdich": ""
    },
    {
        "start": 2259.359,
        "end": 2271.52,
        "text": "Four, dress, speak, and behave like the person you want to be. This is not about fake confidence. It's about real",
        "textdich": ""
    },
    {
        "start": 2267.92,
        "end": 2281.52,
        "text": "alignment. Speak clearly even if you're still learning. Dress neatly even if you don't have expensive clothes. Stand tall",
        "textdich": ""
    },
    {
        "start": 2278.72,
        "end": 2292.079,
        "text": "even if you feel afraid. Respect your time even if others don't. Organize your day even if it's messy at first. Show up",
        "textdich": ""
    },
    {
        "start": 2289.28,
        "end": 2300.56,
        "text": "even when motivation is gone. These are not small things. These are identity anchors. They tell your brain, \"This is",
        "textdich": ""
    },
    {
        "start": 2297.2,
        "end": 2312.24,
        "text": "who I am now.\" Five. Don't wait for results. Act as if you already have them. Most people wait for confidence, clarity, or support. But your future",
        "textdich": ""
    },
    {
        "start": 2308.64,
        "end": 2318.72,
        "text": "self doesn't wait. they act. So instead of waiting to feel ready, act ready.",
        "textdich": ""
    },
    {
        "start": 2316.079,
        "end": 2326.8,
        "text": "Instead of hoping for motivation, create momentum. Because the more you act like the person you want to be, the",
        "textdich": ""
    },
    {
        "start": 2323.76,
        "end": 2336.16,
        "text": "faster you become that person. You don't become your future self overnight. You become them through daily rehearsal,",
        "textdich": ""
    },
    {
        "start": 2332.32,
        "end": 2348.96,
        "text": "through one decision, one conversation, one step, one shift in posture. one refusal to quit. And each time you act like them, you get closer. In 2026,",
        "textdich": ""
    },
    {
        "start": 2346.72,
        "end": 2358.4,
        "text": "don't just set goals. Step into your future identity and live from that place until it becomes real. You're not just",
        "textdich": ""
    },
    {
        "start": 2354.8,
        "end": 2361.68,
        "text": "here to improve. You're here to evolve.",
        "textdich": ""
    },
    {
        "start": 2358.4,
        "end": 2366.079,
        "text": "Step 10. Be consistent to achieve your goals.",
        "textdich": ""
    },
    {
        "start": 2363.28,
        "end": 2368.72,
        "text": "Every person watching this has dreams.",
        "textdich": ""
    },
    {
        "start": 2366.079,
        "end": 2371.119,
        "text": "Maybe it's to speak fluent English.",
        "textdich": ""
    },
    {
        "start": 2368.72,
        "end": 2378.64,
        "text": "Maybe it's to start a business. Maybe it's to get fit, travel the world, or finally become confident.",
        "textdich": ""
    },
    {
        "start": 2376.079,
        "end": 2390.48,
        "text": "But here's the truth. No one wants to admit it's not talent that builds that life. It's not intelligence. It's not",
        "textdich": ""
    },
    {
        "start": 2385.2,
        "end": 2394.079,
        "text": "money. It's not luck. It's consistency.",
        "textdich": ""
    },
    {
        "start": 2390.48,
        "end": 2402.4,
        "text": "In 2026, if you do one small thing every day, you know, for 365 days, you'll become unrecognizable by the end of the",
        "textdich": ""
    },
    {
        "start": 2399.76,
        "end": 2414.0,
        "text": "year. But if you start strong and quit after 10 days, you'll stay exactly where you are. That's the brutal difference.",
        "textdich": ""
    },
    {
        "start": 2409.52,
        "end": 2423.44,
        "text": "One, why most people fail, the all or nothing trap. They go to the gym for 3 days, then stop. They study English for",
        "textdich": ""
    },
    {
        "start": 2420.079,
        "end": 2430.72,
        "text": "one week, then forget. They start waking up early, then one bad day ruins it all.",
        "textdich": ""
    },
    {
        "start": 2427.44,
        "end": 2433.44,
        "text": "They think, \"I missed one day. I failed.",
        "textdich": ""
    },
    {
        "start": 2430.72,
        "end": 2443.119,
        "text": "I'll start again next month.\" But the truth is, consistency is not about being perfect. It's about never quitting",
        "textdich": ""
    },
    {
        "start": 2439.359,
        "end": 2453.2,
        "text": "completely. If you fall seven times, get up eight. If you miss a day, come back the next. Never let one bad day become a",
        "textdich": ""
    },
    {
        "start": 2450.079,
        "end": 2463.839,
        "text": "bad week. Never let a slow week turn into a forgotten goal. Two, progress is boring. That's why it works.",
        "textdich": ""
    },
    {
        "start": 2461.28,
        "end": 2471.68,
        "text": "Real progress doesn't feel exciting. It feels like repeating the same thing again. Studying when no one is watching,",
        "textdich": ""
    },
    {
        "start": 2469.359,
        "end": 2482.72,
        "text": "showing up even when you're tired, not seeing instant results, choosing discipline over dopamine. But that's how winners are made. Anyone can be",
        "textdich": ""
    },
    {
        "start": 2479.839,
        "end": 2492.72,
        "text": "motivated for a day. Champions show up when no one claps for them. Consistency is silent. But its results are loud.",
        "textdich": ""
    },
    {
        "start": 2489.44,
        "end": 2504.319,
        "text": "Three. Use the 33 method to build unstoppable consistency. If you struggle to stay consistent, try this. First three days, build awareness. Just track",
        "textdich": ""
    },
    {
        "start": 2501.599,
        "end": 2514.4,
        "text": "what you do. What time do you sleep, eat, scroll, study, work? Don't change anything. Just notice. Awareness creates",
        "textdich": ""
    },
    {
        "start": 2510.16,
        "end": 2517.839,
        "text": "clarity. Next 3 weeks. Build discipline.",
        "textdich": ""
    },
    {
        "start": 2514.4,
        "end": 2527.2,
        "text": "Pick one habit. Just one. Do it every day. At the same time, no matter what, even if it's small, especially if it's",
        "textdich": ""
    },
    {
        "start": 2524.24,
        "end": 2534.64,
        "text": "small. Don't focus on results. Focus on the reps. Next 3 months, build identity.",
        "textdich": ""
    },
    {
        "start": 2532.24,
        "end": 2543.839,
        "text": "Now scale it. Make it part of your routine. Tell people this is who I am now. Not I'm trying to speak English.",
        "textdich": ""
    },
    {
        "start": 2541.68,
        "end": 2556.8,
        "text": "Say I'm someone who practices English every day. Not I want to learn. Say I'm a learner. That shift makes you unstoppable.",
        "textdich": ""
    },
    {
        "start": 2552.64,
        "end": 2565.92,
        "text": "Four. Track. Reward. Repeat. Use a habit tracker. Mark an X every time you complete your daily habit. Watch your",
        "textdich": ""
    },
    {
        "start": 2561.76,
        "end": 2576.24,
        "text": "chain grow. And if you break the chain, restart immediately. Don't cry. Don't quit. Just restart. Reward yourself",
        "textdich": ""
    },
    {
        "start": 2572.64,
        "end": 2586.56,
        "text": "weekly, not with junk, but with joy. A walk in nature, a short break, a motivational video, writing down how far you've come. Celebration builds",
        "textdich": ""
    },
    {
        "start": 2584.0,
        "end": 2591.839,
        "text": "repetition, and repetition builds excellence.",
        "textdich": ""
    },
    {
        "start": 2588.24,
        "end": 2593.92,
        "text": "Five. Protect your non-negotiables.",
        "textdich": ""
    },
    {
        "start": 2591.839,
        "end": 2606.56,
        "text": "Non-negotiables are habits you never skip. Even when life gets hard, choose three for 2026, 10 minutes of English, 30 minutes of",
        "textdich": ""
    },
    {
        "start": 2602.56,
        "end": 2618.0,
        "text": "reading, 15 minutes of walking, 5 minutes of breath work, one page of journaling, no phone for one hour after waking. Make these your pillars. When",
        "textdich": ""
    },
    {
        "start": 2615.44,
        "end": 2624.4,
        "text": "everything else falls apart, return to your non-negotiables.",
        "textdich": ""
    },
    {
        "start": 2620.0,
        "end": 2633.2,
        "text": "They will save you in 2026. Stop asking, \"How fast can I get there?\" Ask this, \"What can I do every day that guarantees",
        "textdich": ""
    },
    {
        "start": 2630.24,
        "end": 2642.96,
        "text": "I won't fail?\" Because you don't need to change your whole life in one day. You just need to keep showing up one small,",
        "textdich": ""
    },
    {
        "start": 2639.599,
        "end": 2646.96,
        "text": "strong step at a time. That's how you build momentum.",
        "textdich": ""
    },
    {
        "start": 2644.8,
        "end": 2656.96,
        "text": "That's how you crush self-doubt. That's how you win. Not by doing more, but by doing less consistently.",
        "textdich": ""
    },
    {
        "start": 2653.119,
        "end": 2659.599,
        "text": "Step 11. One tiny step at a time.",
        "textdich": ""
    },
    {
        "start": 2656.96,
        "end": 2666.16,
        "text": "Everyone says they want a big life. They want to be successful. They want to be fluent in English. They want to have",
        "textdich": ""
    },
    {
        "start": 2663.52,
        "end": 2675.76,
        "text": "financial freedom. They want to be fit, strong, peaceful, confident. But they forget one thing. None of that happens",
        "textdich": ""
    },
    {
        "start": 2672.24,
        "end": 2686.8,
        "text": "all at once. It happens one tiny step at a time. Not one leap, one step, not one breakthrough, one decision, one habit,",
        "textdich": ""
    },
    {
        "start": 2684.24,
        "end": 2696.079,
        "text": "one choice. Repeat it until it changes your life. Let's talk about how powerful your next small step can really be. One,",
        "textdich": ""
    },
    {
        "start": 2692.88,
        "end": 2699.44,
        "text": "stop overplanning. Start overstepping.",
        "textdich": ""
    },
    {
        "start": 2696.079,
        "end": 2709.599,
        "text": "Some people make giant plans. I'll study 5 hours a day. I'll wake up at 400 a.m. every day. I'll start a business this",
        "textdich": ""
    },
    {
        "start": 2706.48,
        "end": 2714.64,
        "text": "month. I'll speak English like a native in 30 days.",
        "textdich": ""
    },
    {
        "start": 2711.76,
        "end": 2716.96,
        "text": "They try to change everything at once.",
        "textdich": ""
    },
    {
        "start": 2714.64,
        "end": 2730.64,
        "text": "But here's what always happens. They get excited for 2 days, then get overwhelmed, then break the streak, then feel guilty, then quit. Sound familiar?",
        "textdich": ""
    },
    {
        "start": 2727.68,
        "end": 2738.64,
        "text": "Because their plan was never real. The secret is not to do everything now. The secret is to do one thing today and then",
        "textdich": ""
    },
    {
        "start": 2736.319,
        "end": 2747.76,
        "text": "one thing tomorrow and then one thing after that. That's how you win. Not fast but forever.",
        "textdich": ""
    },
    {
        "start": 2744.56,
        "end": 2758.56,
        "text": "Two, start with micro wins. Your brain loves small victories. Drinking a glass of water equals win. Making your bed equals win. Saying one sentence in",
        "textdich": ""
    },
    {
        "start": 2755.76,
        "end": 2771.68,
        "text": "English equals win. Studying for 10 minutes equals win. Waking up on time equals win. Turning off your phone equals win. Saying no to a bad habit",
        "textdich": ""
    },
    {
        "start": 2768.0,
        "end": 2777.28,
        "text": "equals win. Writing your to-do list equals win.",
        "textdich": ""
    },
    {
        "start": 2773.76,
        "end": 2785.28,
        "text": "Finishing that email equals win. Each time you finish a microtask, your brain releases dopamine, a reward chemical",
        "textdich": ""
    },
    {
        "start": 2782.24,
        "end": 2795.599,
        "text": "that motivates you to keep going. One win leads to another. and soon you'll have momentum.",
        "textdich": ""
    },
    {
        "start": 2790.24,
        "end": 2797.359,
        "text": "Three, stack tiny habits into routines.",
        "textdich": ""
    },
    {
        "start": 2795.599,
        "end": 2808.319,
        "text": "Let's say you want to build a morning routine. Don't start with 2 hours. Start with this one, wake up and drink a glass",
        "textdich": ""
    },
    {
        "start": 2803.359,
        "end": 2818.079,
        "text": "of water. Two, make your bed. Three, sit silently for 2 minutes. Four, speak one sentence in English out loud. Five,",
        "textdich": ""
    },
    {
        "start": 2814.96,
        "end": 2826.64,
        "text": "write one sentence about your goal. Six, read one paragraph of a book. Total time, less than 10 minutes. But the",
        "textdich": ""
    },
    {
        "start": 2823.28,
        "end": 2835.92,
        "text": "identity impact, massive. Because you've already hydrated, organized, practiced discipline, trained your mind, spoken",
        "textdich": ""
    },
    {
        "start": 2833.28,
        "end": 2845.28,
        "text": "English, thought about your goals, and read something positive. That's how tiny steps build a powerful life. No one",
        "textdich": ""
    },
    {
        "start": 2842.0,
        "end": 2847.599,
        "text": "becomes powerful by taking giant leaps.",
        "textdich": ""
    },
    {
        "start": 2845.28,
        "end": 2854.72,
        "text": "They become powerful by taking tiny steps and never stopping.",
        "textdich": ""
    },
    {
        "start": 2850.72,
        "end": 2857.28,
        "text": "So in 2026, don't try to be a superhero.",
        "textdich": ""
    },
    {
        "start": 2854.72,
        "end": 2869.28,
        "text": "Just be consistent, focused, and patient. Do one thing today, and when that's done, do one more. You'll look back in December and smile because",
        "textdich": ""
    },
    {
        "start": 2866.4,
        "end": 2878.16,
        "text": "you'll realize, I didn't change in one moment. I changed one tiny step at a time.",
        "textdich": ""
    },
    {
        "start": 2873.92,
        "end": 2886.96,
        "text": "Step 12. Trust God's plan. This final step is the most important one. Because no matter how many goals you write, how",
        "textdich": ""
    },
    {
        "start": 2883.92,
        "end": 2895.359,
        "text": "perfect your routine is, how powerful your vision becomes, there will still be times when life doesn't make sense. When your plans",
        "textdich": ""
    },
    {
        "start": 2893.2,
        "end": 2907.2,
        "text": "fail, when your progress feels invisible, when your hard work isn't rewarded, when everything feels slow, silent, or unfair.",
        "textdich": ""
    },
    {
        "start": 2904.079,
        "end": 2916.319,
        "text": "And in those moments, you must remember this. You are not alone and you are not forgotten. Your effort is seen. Your",
        "textdich": ""
    },
    {
        "start": 2913.92,
        "end": 2926.64,
        "text": "tears are recorded. Your growth is being built silently. Even when you don't feel it, you just have to trust the plan.",
        "textdich": ""
    },
    {
        "start": 2922.64,
        "end": 2929.119,
        "text": "One, let go of the illusion of control.",
        "textdich": ""
    },
    {
        "start": 2926.64,
        "end": 2941.839,
        "text": "You can control your actions, not the outcome. You can control your attitude, not the timing. You can control your work, not the reward.",
        "textdich": ""
    },
    {
        "start": 2938.319,
        "end": 2944.0,
        "text": "Some of you will give your 100%.",
        "textdich": ""
    },
    {
        "start": 2941.839,
        "end": 2948.0,
        "text": "And still not get the result you want immediately.",
        "textdich": ""
    },
    {
        "start": 2945.599,
        "end": 2949.839,
        "text": "That doesn't mean it's over.",
        "textdich": ""
    },
    {
        "start": 2948.0,
        "end": 2959.2,
        "text": "That means something bigger is being prepared. What feels like a delay is often divine protection. What feels like",
        "textdich": ""
    },
    {
        "start": 2955.599,
        "end": 2972.319,
        "text": "a no might be a not yet. Don't rush the blessing. Prepare for it. Two, keep working. Even in the silence. When a seed is planted, you don't see growth",
        "textdich": ""
    },
    {
        "start": 2969.76,
        "end": 2982.88,
        "text": "for weeks. But underground things are changing. The roots are forming. The structure is building. It's the same with your life. You might not see",
        "textdich": ""
    },
    {
        "start": 2979.76,
        "end": 2995.76,
        "text": "results yet, but something inside you is already changing. Your focus is stronger. Your mindset is sharper. Your discipline is growing. Your energy is",
        "textdich": ""
    },
    {
        "start": 2992.0,
        "end": 3006.319,
        "text": "improving. Your heart is healing. And when the time is right, the breakthrough comes, but only if you didn't quit during the silence. Three, pray, then",
        "textdich": ""
    },
    {
        "start": 3005.04,
        "end": 3008.24,
        "text": "move.",
        "textdich": ""
    },
    {
        "start": 3006.319,
        "end": 3010.88,
        "text": "Prayer is not the end of your action.",
        "textdich": ""
    },
    {
        "start": 3008.24,
        "end": 3018.24,
        "text": "It's the beginning. Don't just sit and hope. Pray for strength and then act.",
        "textdich": ""
    },
    {
        "start": 3014.8,
        "end": 3024.559,
        "text": "Pray for wisdom and then choose. Pray for direction and then move your feet.",
        "textdich": ""
    },
    {
        "start": 3021.76,
        "end": 3037.52,
        "text": "Faith without action is empty. But action without faith is exhausting. You need both. In 2026, let your strategy be backed by spirit.",
        "textdich": ""
    },
    {
        "start": 3033.68,
        "end": 3046.319,
        "text": "Let your work be guided by wisdom. Four, look for the signs. Sometimes the plan doesn't come in a voice. It comes in a",
        "textdich": ""
    },
    {
        "start": 3043.68,
        "end": 3057.359,
        "text": "person who inspires you, a book that changes your mindset, a video that speaks to your heart, a failure that redirects your life, a delay that",
        "textdich": ""
    },
    {
        "start": 3054.4,
        "end": 3070.64,
        "text": "humbles your ego, a small wind that builds your belief. God doesn't always shout, he whispers. And if you're present, patient, and humble, you'll",
        "textdich": ""
    },
    {
        "start": 3066.72,
        "end": 3073.76,
        "text": "hear it. Your story is not finished.",
        "textdich": ""
    },
    {
        "start": 3070.64,
        "end": 3076.4,
        "text": "Your future is not written by your past.",
        "textdich": ""
    },
    {
        "start": 3073.76,
        "end": 3078.88,
        "text": "Your life is not hopeless.",
        "textdich": ""
    },
    {
        "start": 3076.4,
        "end": 3084.0,
        "text": "Even if you've been through pain, you've made it this far, not by accident.",
        "textdich": ""
    },
    {
        "start": 3082.16,
        "end": 3094.319,
        "text": "You've survived things others never knew about. You've kept going when most would have quit. You've grown in silence. Now",
        "textdich": ""
    },
    {
        "start": 3090.24,
        "end": 3104.0,
        "text": "it's time to rise with faith. Work like it depends on you. Pray like it depends on something greater. And trust this.",
        "textdich": ""
    },
    {
        "start": 3100.72,
        "end": 3112.8,
        "text": "2026 will not be perfect. But it will be divinely timed. You do the planting. Let God handle the rain. This is your year.",
        "textdich": ""
    },
    {
        "start": 3110.96,
        "end": 3123.599,
        "text": "Not because it's easy, not because you're lucky, but because you've decided, \"This time I won't quit on myself.\" Not again, [clears throat] not",
        "textdich": ""
    },
    {
        "start": 3120.16,
        "end": 3133.2,
        "text": "this year. Now, take the first step. And remember, we're here to help you grow, learn, and improve your English, too. So,",
        "textdich": ""
    },
    {
        "start": 3130.559,
        "end": 3145.559,
        "text": "subscribe, share this video with someone who needs it, and let's make 2026 the most powerful year of your life together.",
        "textdich": ""
    },
    {
        "start": 3141.599,
        "end": 3145.559,
        "text": "See you in the next one.",
        "textdich": ""
    }
]