[
    {
        "start": 0.16,
        "end": 11.2,
        "text": "Welcome to my channel, The English Grammar Doctor. Let me ask you something. Have you ever felt like you're working hard but still stuck?",
        "textdich": ""
    },
    {
        "start": 9.04,
        "end": 19.68,
        "text": "Like others, keep moving ahead while you stay behind? It's not your fault. The truth is, success today is not about",
        "textdich": ""
    },
    {
        "start": 16.96,
        "end": 29.76,
        "text": "luck or talent. It's about one hidden skill, the ability to learn, grow, and stay focused. In this video, I will show",
        "textdich": ""
    },
    {
        "start": 26.32,
        "end": 38.48,
        "text": "you exactly how to do that step by step. in simple English. This is the secret of the top 1%.",
        "textdich": ""
    },
    {
        "start": 34.8,
        "end": 41.68,
        "text": "And the good news, you can learn it too.",
        "textdich": ""
    },
    {
        "start": 38.48,
        "end": 53.28,
        "text": "So stay with me till the end. This can change your life. Comment below. Have you ever felt like you're falling behind even though you try hard?",
        "textdich": ""
    },
    {
        "start": 50.0,
        "end": 60.559,
        "text": "Chapter 1. Why learning fast is your superpower. I used to believe that smart people were born different. That some",
        "textdich": ""
    },
    {
        "start": 58.399,
        "end": 70.479,
        "text": "people were just lucky. They could learn fast, speak well, understand everything, and win in life. I thought I was not one",
        "textdich": ""
    },
    {
        "start": 66.88,
        "end": 78.799,
        "text": "of them. I was slow. I forgot things. I felt stuck. But over time, I learned something that changed everything. I",
        "textdich": ""
    },
    {
        "start": 76.72,
        "end": 85.759,
        "text": "learned that the most powerful skill in the world is not talent. It's not luck.",
        "textdich": ""
    },
    {
        "start": 82.479,
        "end": 88.479,
        "text": "It's not money or beauty or connections.",
        "textdich": ""
    },
    {
        "start": 85.759,
        "end": 99.119,
        "text": "It is this the ability to learn quickly and keep learning every day. That is the secret of the top 1%. They are not superhuman. They are just super",
        "textdich": ""
    },
    {
        "start": 96.72,
        "end": 101.84,
        "text": "learners. And you can become one too.",
        "textdich": ""
    },
    {
        "start": 99.119,
        "end": 110.64,
        "text": "Even if you feel behind, even if English is hard for you, even if life feels slow right now, you can grow. You can",
        "textdich": ""
    },
    {
        "start": 107.6,
        "end": 120.64,
        "text": "improve. And the best part is you can start today. When I first started learning English, I struggled with everything. The words didn't stay in my",
        "textdich": ""
    },
    {
        "start": 117.36,
        "end": 128.72,
        "text": "mind. The sentences were confusing. When someone spoke quickly, I froze. I felt like I was drowning in a sea of strange",
        "textdich": ""
    },
    {
        "start": 125.759,
        "end": 136.879,
        "text": "sounds. I would listen to a podcast and forget everything 5 minutes later. I thought maybe my brain was not made for",
        "textdich": ""
    },
    {
        "start": 133.44,
        "end": 144.959,
        "text": "English. Maybe I was too old. Maybe it was too late. But deep inside, I had a little hope. I told myself, \"What if",
        "textdich": ""
    },
    {
        "start": 142.72,
        "end": 152.16,
        "text": "there's a better way to learn? What if it's not about being smart, but about being consistent? What if I can train my",
        "textdich": ""
    },
    {
        "start": 149.92,
        "end": 161.76,
        "text": "brain like a muscle?\" That's when I discovered something powerful. Learning is not magic. It is a skill. And like",
        "textdich": ""
    },
    {
        "start": 158.319,
        "end": 166.4,
        "text": "any skill, it can be built slowly, step by step.",
        "textdich": ""
    },
    {
        "start": 163.76,
        "end": 170.4,
        "text": "I started reading for 10 minutes a day.",
        "textdich": ""
    },
    {
        "start": 166.4,
        "end": 182.72,
        "text": "Not long, just 10 minutes. I chose easy books with small sentences. I read slowly. I read out loud. I didn't worry if I didn't understand everything. I",
        "textdich": ""
    },
    {
        "start": 179.2,
        "end": 193.519,
        "text": "just kept reading. After one week, I noticed a change. My brain started to remember the words. I could guess the meanings. After 2 weeks, I could speak",
        "textdich": ""
    },
    {
        "start": 190.72,
        "end": 198.879,
        "text": "short sentences. After a month, I was not afraid to speak in front of people.",
        "textdich": ""
    },
    {
        "start": 195.76,
        "end": 208.08,
        "text": "Not perfect, but better. That's when I realized the faster you learn, the more doors you open. The world changes for",
        "textdich": ""
    },
    {
        "start": 204.64,
        "end": 210.319,
        "text": "you. I saw my friends struggling too.",
        "textdich": ""
    },
    {
        "start": 208.08,
        "end": 216.56,
        "text": "They were smart, but they didn't learn every day. They waited for motivation.",
        "textdich": ""
    },
    {
        "start": 213.68,
        "end": 226.72,
        "text": "They waited for perfect time. But the learners who grow fast don't wait. They move. They act. They learn even when",
        "textdich": ""
    },
    {
        "start": 223.44,
        "end": 228.799,
        "text": "tired. They take small steps every day.",
        "textdich": ""
    },
    {
        "start": 226.72,
        "end": 239.28,
        "text": "And that's the difference. It's not about who is more talented. It's about who is more consistent. Who reads a little every day, who listens with",
        "textdich": ""
    },
    {
        "start": 235.92,
        "end": 241.84,
        "text": "focus, who speaks even with mistakes.",
        "textdich": ""
    },
    {
        "start": 239.28,
        "end": 253.04,
        "text": "That person wins. That person becomes the 1%. Now I want to give this message to you. If you are learning English or anything in life, remember this.",
        "textdich": ""
    },
    {
        "start": 250.0,
        "end": 260.639,
        "text": "Learning fast is not about rushing. It's about staying in the game every single day. It's about focusing when others are",
        "textdich": ""
    },
    {
        "start": 258.079,
        "end": 269.6,
        "text": "distracted. It's about saying, \"I will not give up. I will grow even if it's slow. Even if no one claps for me, even",
        "textdich": ""
    },
    {
        "start": 266.8,
        "end": 278.08,
        "text": "if no one sees me now. Because one day they will. One day people will say, \"Wow, how did you become so good?\" And",
        "textdich": ""
    },
    {
        "start": 275.52,
        "end": 284.4,
        "text": "you will smile because you will know the truth. You didn't wait for motivation.",
        "textdich": ""
    },
    {
        "start": 281.6,
        "end": 292.88,
        "text": "You created it. You didn't stop when it was hard. You stayed. And that is what makes you powerful. So if you feel like",
        "textdich": ""
    },
    {
        "start": 290.479,
        "end": 304.08,
        "text": "others are moving faster than you, don't give up. Don't compare. Just focus on learning one small thing today. A new",
        "textdich": ""
    },
    {
        "start": 298.72,
        "end": 317.039,
        "text": "word, a sentence, a story, a page, and tomorrow do it again and again. That is the secret. That is the way I believe in",
        "textdich": ""
    },
    {
        "start": 313.199,
        "end": 327.6,
        "text": "you. If I can do it, so can you. You don't need to be perfect. You just need to keep going. The power is in your hands. Now,",
        "textdich": ""
    },
    {
        "start": 324.479,
        "end": 331.84,
        "text": "chapter 2. The moment you stop learning, you start losing.",
        "textdich": ""
    },
    {
        "start": 329.84,
        "end": 340.16,
        "text": "I want to tell you something most people never hear. Something no one told me when I was younger. It is simple but",
        "textdich": ""
    },
    {
        "start": 336.56,
        "end": 345.52,
        "text": "powerful. The world moves fast. Every day things change. New words are used.",
        "textdich": ""
    },
    {
        "start": 342.88,
        "end": 354.0,
        "text": "New tools are created. New ideas are shared. But here is the hard truth. Many people stop learning. After school, they",
        "textdich": ""
    },
    {
        "start": 350.72,
        "end": 364.08,
        "text": "get a job. They follow the same routine and they live the same day again and again. At first, nothing seems wrong.",
        "textdich": ""
    },
    {
        "start": 360.72,
        "end": 375.44,
        "text": "They work. They eat. They sleep. But slowly the world around them moves ahead. The people who keep learning move forward and the ones who stop begin to",
        "textdich": ""
    },
    {
        "start": 373.44,
        "end": 378.479,
        "text": "fall behind.",
        "textdich": ""
    },
    {
        "start": 375.44,
        "end": 388.8,
        "text": "I saw this happen to someone I knew. He was smart, kind, and hardworking. He finished school, found a job, and stopped learning. He never read new",
        "textdich": ""
    },
    {
        "start": 386.08,
        "end": 400.88,
        "text": "books, never listened to new ideas, never tried to grow. At first he was doing okay but after some time things changed. The job required new skills,",
        "textdich": ""
    },
    {
        "start": 398.08,
        "end": 413.12,
        "text": "new tools, new language. He didn't understand them. He felt confused. He tried to catch up but it was hard. He got frustrated. He asked why is this so",
        "textdich": ""
    },
    {
        "start": 409.52,
        "end": 421.84,
        "text": "difficult now? The answer was simple. He had stopped learning and the world did not wait. I promised myself I would not",
        "textdich": ""
    },
    {
        "start": 419.36,
        "end": 431.199,
        "text": "make that mistake. I promised I would keep learning even if it was slow, even if no one asked me to, even if it was",
        "textdich": ""
    },
    {
        "start": 427.039,
        "end": 442.639,
        "text": "hard. Because now I know the moment you stop learning, you start losing. Not all at once, but slowly, quietly. The world doesn't shout when",
        "textdich": ""
    },
    {
        "start": 440.72,
        "end": 445.759,
        "text": "you fall behind.",
        "textdich": ""
    },
    {
        "start": 442.639,
        "end": 456.56,
        "text": "It just moves on without you. And one day you wake up and feel stuck, outdated, left out. That is a painful feeling. I never want to feel that",
        "textdich": ""
    },
    {
        "start": 453.84,
        "end": 464.96,
        "text": "again. And I don't want you to feel it either. Learning does not mean going to school again. It means staying curious.",
        "textdich": ""
    },
    {
        "start": 462.639,
        "end": 474.0,
        "text": "It means asking questions. It means reading one page a day, watching a short video, practicing five words, writing",
        "textdich": ""
    },
    {
        "start": 470.639,
        "end": 476.479,
        "text": "one paragraph, speaking one sentence.",
        "textdich": ""
    },
    {
        "start": 474.0,
        "end": 485.919,
        "text": "These are small things but they keep your mind alive. They keep your future open. When I started learning English",
        "textdich": ""
    },
    {
        "start": 482.08,
        "end": 496.24,
        "text": "every day, even for 15 minutes, my brain felt different. My mind became active. I started noticing more things. I listened",
        "textdich": ""
    },
    {
        "start": 492.8,
        "end": 504.56,
        "text": "better. I remembered more. I understood more. It was not a big change in one day, but it was a big change over time.",
        "textdich": ""
    },
    {
        "start": 502.24,
        "end": 515.919,
        "text": "People often ask how can I stay motivated and I tell them the best motivation is progress. When you see that you are better than yesterday even",
        "textdich": ""
    },
    {
        "start": 512.88,
        "end": 517.919,
        "text": "a little it makes you want to continue.",
        "textdich": ""
    },
    {
        "start": 515.919,
        "end": 529.519,
        "text": "When I understood my first English sentence without translating I felt so happy. That one moment pushed me to learn more. It was a small win but it",
        "textdich": ""
    },
    {
        "start": 526.56,
        "end": 537.519,
        "text": "felt big to me. That is how you stay in the game by seeing small wins and collecting them every day. There are two",
        "textdich": ""
    },
    {
        "start": 534.72,
        "end": 549.04,
        "text": "kinds of people in this world. One type says, \"I've finished learning. I'm done.\" The other type says, \"I will learn something new today.\" The first",
        "textdich": ""
    },
    {
        "start": 546.24,
        "end": 557.279,
        "text": "type becomes stuck. The second type becomes strong. You have to choose which one you want to be. The choice is in",
        "textdich": ""
    },
    {
        "start": 554.48,
        "end": 566.16,
        "text": "your hands. Not your teachers, not your bosses, yours. I still remember a day when I was tired and I didn't want to",
        "textdich": ""
    },
    {
        "start": 562.64,
        "end": 568.48,
        "text": "study. My brain said, \"Take a break.",
        "textdich": ""
    },
    {
        "start": 566.16,
        "end": 578.0,
        "text": "Skip it today.\" But then I remembered the pain of being left behind. I remembered the silence in class when I didn't understand anything. I remembered",
        "textdich": ""
    },
    {
        "start": 575.839,
        "end": 585.36,
        "text": "the moment I felt small because I couldn't speak up. That memory gave me strength.",
        "textdich": ""
    },
    {
        "start": 582.16,
        "end": 595.6,
        "text": "I opened my book. I played the video. I listened. I repeated. And that small choice, that small win, kept me moving forward.",
        "textdich": ""
    },
    {
        "start": 593.279,
        "end": 606.32,
        "text": "You don't have to be perfect. You don't need to learn everything at once. But you do need to keep learning, even slowly,",
        "textdich": ""
    },
    {
        "start": 602.72,
        "end": 616.16,
        "text": "even quietly, even alone. Because that is how you grow. That is how you stay ahead. Not in one jump.",
        "textdich": ""
    },
    {
        "start": 611.6,
        "end": 625.92,
        "text": "But step by step, word by word, day by day. And when others give up, you will still be growing.",
        "textdich": ""
    },
    {
        "start": 622.24,
        "end": 635.04,
        "text": "That is your power now. You have already made the decision to learn. You are watching this. You are reading. You are",
        "textdich": ""
    },
    {
        "start": 632.24,
        "end": 644.16,
        "text": "trying. That means you are already ahead of most people. So don't stop now. You are just getting started. Keep learning.",
        "textdich": ""
    },
    {
        "start": 641.36,
        "end": 654.0,
        "text": "Keep moving. Because when you do, the world opens up to you and you never have to feel stuck again.",
        "textdich": ""
    },
    {
        "start": 649.68,
        "end": 656.48,
        "text": "Chapter 3. The 1% secret.",
        "textdich": ""
    },
    {
        "start": 654.0,
        "end": 658.16,
        "text": "They learn when no one is watching.",
        "textdich": ""
    },
    {
        "start": 656.48,
        "end": 669.44,
        "text": "There is something most people don't see. Something powerful. Something quiet. And it happens when no one is looking. It's the secret of the people",
        "textdich": ""
    },
    {
        "start": 665.76,
        "end": 678.32,
        "text": "who grow fast, who stay strong, who never fall behind. They learn when no one is watching. They learn when there",
        "textdich": ""
    },
    {
        "start": 674.64,
        "end": 683.92,
        "text": "is no teacher, no class, no test, no one clapping for them, no one pushing them.",
        "textdich": ""
    },
    {
        "start": 681.12,
        "end": 694.399,
        "text": "They push themselves. They sit alone with a book. They listen to English when walking. They write a few sentences in the dark. They repeat words to",
        "textdich": ""
    },
    {
        "start": 691.44,
        "end": 705.279,
        "text": "themselves in the mirror. No one sees them. But that is where the magic happens. When I started learning English, I used to wait for someone to",
        "textdich": ""
    },
    {
        "start": 701.68,
        "end": 711.44,
        "text": "teach me. I thought I needed a class, a lesson, a teacher to improve.",
        "textdich": ""
    },
    {
        "start": 708.64,
        "end": 718.399,
        "text": "But then I noticed something. The best learners I knew, the ones who spoke well and grew fast, were doing something",
        "textdich": ""
    },
    {
        "start": 716.16,
        "end": 728.639,
        "text": "different. They were learning all the time in small ways, quiet ways on the bus, at lunch, at home before bed. I",
        "textdich": ""
    },
    {
        "start": 726.959,
        "end": 739.68,
        "text": "asked one of them, \"How do you speak so well?\" And she said, \"I practice when I'm alone every day.\" That answer changed my life. I started doing the",
        "textdich": ""
    },
    {
        "start": 736.8,
        "end": 749.279,
        "text": "same. I would walk and talk to myself in English. I would imagine little conversations in my mind. I would sit with a notebook and write down what I",
        "textdich": ""
    },
    {
        "start": 746.24,
        "end": 761.04,
        "text": "remembered. At first, it felt silly. I thought, why am I doing this? No one is watching. But then I realized that's the secret.",
        "textdich": ""
    },
    {
        "start": 757.839,
        "end": 763.36,
        "text": "That's what makes you part of the 1%.",
        "textdich": ""
    },
    {
        "start": 761.04,
        "end": 774.959,
        "text": "The people who grow without applause, the people who improve without being told, the people who are strong inside because they do the work in silence.",
        "textdich": ""
    },
    {
        "start": 772.24,
        "end": 785.04,
        "text": "Many people want to get better, but they wait. They wait for the right time, the right class, the right partner. They",
        "textdich": ""
    },
    {
        "start": 781.839,
        "end": 792.56,
        "text": "say, \"I'll practice when I have help.\" But the truth is, the best practice is the one you do alone. That's when your",
        "textdich": ""
    },
    {
        "start": 790.0,
        "end": 800.56,
        "text": "brain really grows. That's when your confidence is built. Not when someone is checking, but when it's just you and",
        "textdich": ""
    },
    {
        "start": 797.839,
        "end": 811.36,
        "text": "your decision. I remember one day I was sitting in my room. It was quiet. I had no class, no homework, no schedule, just",
        "textdich": ""
    },
    {
        "start": 808.959,
        "end": 826.48,
        "text": "time. I could have watched a show or gone to sleep, but something inside me whispered, read one page, just one. So I did. I read it out loud slowly. I",
        "textdich": ""
    },
    {
        "start": 823.519,
        "end": 840.24,
        "text": "listened to myself. I corrected one word, then another, and suddenly I was learning alone, in silence, in secret.",
        "textdich": ""
    },
    {
        "start": 836.959,
        "end": 850.32,
        "text": "That night I felt proud. No one knew I studied, but I knew that was enough. The 1%. The people who stay ahead, they",
        "textdich": ""
    },
    {
        "start": 847.68,
        "end": 858.079,
        "text": "don't do big things all the time. They do small things again and again. They read while others scroll. They listen",
        "textdich": ""
    },
    {
        "start": 855.36,
        "end": 866.959,
        "text": "while others sleep. They practice while others wait. That's why they grow. Not because they are lucky, not because they",
        "textdich": ""
    },
    {
        "start": 864.079,
        "end": 877.04,
        "text": "are special, but because they made a simple choice to learn when no one else will. You can make that choice, too.",
        "textdich": ""
    },
    {
        "start": 873.6,
        "end": 883.44,
        "text": "Right now, today, you can sit with one sentence and say it out loud. You can write one new word in your notebook. You",
        "textdich": ""
    },
    {
        "start": 881.36,
        "end": 897.44,
        "text": "can listen to a short story and shadow it. No one needs to see you. No one needs to cheer. Just you and that is enough. That is how champions are made.",
        "textdich": ""
    },
    {
        "start": 893.519,
        "end": 905.04,
        "text": "It may feel slow. It may feel small. But these quiet moments are powerful. They are the steps that lead to big change.",
        "textdich": ""
    },
    {
        "start": 902.959,
        "end": 912.959,
        "text": "You will look back one day and see how far you came. And you will realize that the most important lessons were learned",
        "textdich": ""
    },
    {
        "start": 910.32,
        "end": 922.16,
        "text": "when no one was looking. So, if you're studying alone, keep going. If no one notices your progress, don't stop. If it",
        "textdich": ""
    },
    {
        "start": 919.68,
        "end": 935.279,
        "text": "feels like no one understands, that's okay. You understand. And that is enough. Keep learning when no one is watching. That is the secret of the 1%.",
        "textdich": ""
    },
    {
        "start": 931.36,
        "end": 938.24,
        "text": "And now it can be your secret, too.",
        "textdich": ""
    },
    {
        "start": 935.279,
        "end": 947.519,
        "text": "Chapter 4. Build the daily learning habit. Even if you hate studying, I never liked studying. Not at all. When I",
        "textdich": ""
    },
    {
        "start": 945.44,
        "end": 954.959,
        "text": "was younger, the word study made me feel tired, bored, and scared. I thought studying meant sitting for hours with",
        "textdich": ""
    },
    {
        "start": 952.399,
        "end": 963.36,
        "text": "books that made no sense. I thought it meant doing hard things with no fun, no meaning, and no help. So, I avoided it.",
        "textdich": ""
    },
    {
        "start": 960.72,
        "end": 965.839,
        "text": "I always waited for motivation to come.",
        "textdich": ""
    },
    {
        "start": 963.36,
        "end": 974.8,
        "text": "But the truth is, motivation didn't come. Not on most days. I waited and waited, but nothing changed. That's when",
        "textdich": ""
    },
    {
        "start": 972.72,
        "end": 982.48,
        "text": "I learned a secret that changed my life forever. You don't need to love studying. You just need to make learning",
        "textdich": ""
    },
    {
        "start": 980.0,
        "end": 994.639,
        "text": "a small part of your day, just a little part. Not big, not perfect, just something. That's how real habits are born. That's how English gets easier.",
        "textdich": ""
    },
    {
        "start": 992.32,
        "end": 1004.8,
        "text": "When I started learning English, I decided to try something different. No pressure, no stress, just 10 minutes. I",
        "textdich": ""
    },
    {
        "start": 1002.079,
        "end": 1017.279,
        "text": "said, \"Today, I will listen to English for 10 minutes. That's all.\" I played a simple podcast. I didn't understand every word, but I listened. I stayed",
        "textdich": ""
    },
    {
        "start": 1013.839,
        "end": 1028.319,
        "text": "calm. I didn't pause it. I didn't check the dictionary. I just let the sounds come to me. After 10 minutes, I stopped.",
        "textdich": ""
    },
    {
        "start": 1024.079,
        "end": 1031.839,
        "text": "And that was it. No test, no notes.",
        "textdich": ""
    },
    {
        "start": 1028.319,
        "end": 1042.48,
        "text": "But something inside me felt good. I had done one small thing for my brain. One small win. The next day I repeated the",
        "textdich": ""
    },
    {
        "start": 1038.4,
        "end": 1051.52,
        "text": "same thing another 10 minutes. This time I understood a few more words. I heard the same phrase again. It started to",
        "textdich": ""
    },
    {
        "start": 1048.24,
        "end": 1059.76,
        "text": "stick. I didn't realize it at the time, but I was creating a habit. a small soft habit, something that didn't feel like",
        "textdich": ""
    },
    {
        "start": 1056.96,
        "end": 1070.4,
        "text": "studying. It felt like living, like listening to a story, like discovering something new. And slowly, this 10-minute habit changed everything. It",
        "textdich": ""
    },
    {
        "start": 1067.44,
        "end": 1081.6,
        "text": "gave me the courage to read, to write, to speak. Not all at once, just in small, simple steps. If you hate studying, I want you to know this. You",
        "textdich": ""
    },
    {
        "start": 1078.64,
        "end": 1091.12,
        "text": "are not lazy. You are not weak. You just need a new way to learn. A gentle way, a kind way, not the school way, not the",
        "textdich": ""
    },
    {
        "start": 1088.559,
        "end": 1099.039,
        "text": "stressful way. Your brain likes small things. Your brain likes stories. Your brain likes patterns. And most of all,",
        "textdich": ""
    },
    {
        "start": 1096.24,
        "end": 1108.799,
        "text": "your brain likes progress, even tiny progress. One sentence, one line, one word. That is how real growth begins.",
        "textdich": ""
    },
    {
        "start": 1106.24,
        "end": 1116.16,
        "text": "Maybe today you feel tired. Maybe your day was full of noise, work, family, or stress. That's okay. You don't need to",
        "textdich": ""
    },
    {
        "start": 1113.919,
        "end": 1125.12,
        "text": "study for one hour. You don't need to be perfect. You just need to do one small thing. Read one short paragraph, listen",
        "textdich": ""
    },
    {
        "start": 1121.679,
        "end": 1132.72,
        "text": "to one video, shadow one sentence, speak one thought out loud. That is enough, more than enough. Because when you do",
        "textdich": ""
    },
    {
        "start": 1129.679,
        "end": 1140.799,
        "text": "that every day, it becomes a habit. And that habit becomes your superpower. I found that the best time to learn is not",
        "textdich": ""
    },
    {
        "start": 1138.4,
        "end": 1149.44,
        "text": "when everything is perfect. It's when you are tired but still try. When you are bored but still listen. When you are",
        "textdich": ""
    },
    {
        "start": 1146.559,
        "end": 1159.2,
        "text": "scared but still speak. These small moments when you show up are the strongest. That is where confidence is built. That is where English becomes",
        "textdich": ""
    },
    {
        "start": 1156.08,
        "end": 1171.2,
        "text": "yours. So make a space in your day. a soft corner a few minutes after breakfast or five minutes before bed or while walking or during tea time. Choose",
        "textdich": ""
    },
    {
        "start": 1167.6,
        "end": 1181.039,
        "text": "a time that feels safe and calm. Keep it short. Keep it light. Don't worry about speed. Don't worry about being smart.",
        "textdich": ""
    },
    {
        "start": 1176.799,
        "end": 1190.4,
        "text": "Just build the habit day by day, word by word. You don't need pressure. You don't need a plan with a hundred things. You",
        "textdich": ""
    },
    {
        "start": 1186.88,
        "end": 1199.76,
        "text": "just need a moment, a choice, a voice inside you that says, \"Yes, I will grow today.\" Even a little. And that's what I",
        "textdich": ""
    },
    {
        "start": 1196.72,
        "end": 1208.24,
        "text": "want for you. A gentle, loving habit of learning. One that stays with you. One that makes you feel strong. One that",
        "textdich": ""
    },
    {
        "start": 1205.28,
        "end": 1213.039,
        "text": "brings peace and power to your heart.",
        "textdich": ""
    },
    {
        "start": 1208.24,
        "end": 1222.96,
        "text": "Chapter 5. Your mind is not fixed. It can grow every day. For a long time, I thought my brain was broken. I thought I was just not good at languages. I",
        "textdich": ""
    },
    {
        "start": 1221.28,
        "end": 1231.36,
        "text": "believed that other people were smart and I was just slow. No matter how hard I tried, I still forgot words. I still",
        "textdich": ""
    },
    {
        "start": 1229.2,
        "end": 1242.08,
        "text": "made mistakes. I still couldn't speak clearly. And every time I failed, I told myself, \"See, I can't do this.\" That one",
        "textdich": ""
    },
    {
        "start": 1238.48,
        "end": 1252.96,
        "text": "sentence lived in my mind for years. I can't do this. But then one day I read a different sentence, a small sentence",
        "textdich": ""
    },
    {
        "start": 1248.88,
        "end": 1259.6,
        "text": "that changed my life. It said, \"You can't do this.\" Yet.",
        "textdich": ""
    },
    {
        "start": 1256.4,
        "end": 1273.28,
        "text": "That one word yet gave me hope. It told me that my mind is not fixed. I can learn. I can grow. I can improve. One day at a time.",
        "textdich": ""
    },
    {
        "start": 1269.2,
        "end": 1283.36,
        "text": "Chapter 6. That idea was new to me. In school, people were labeled good student, bad student, smart, not smart, fast learner, slow learner. And I was",
        "textdich": ""
    },
    {
        "start": 1280.72,
        "end": 1290.72,
        "text": "always on the slow side. But I didn't know that the brain is like a plant. It can grow with water, sunlight, and time.",
        "textdich": ""
    },
    {
        "start": 1288.96,
        "end": 1299.36,
        "text": "I didn't know that when we practice something every day, the brain creates new paths, new connections. It becomes",
        "textdich": ""
    },
    {
        "start": 1296.4,
        "end": 1309.28,
        "text": "stronger. It becomes faster. It becomes better. not by magic but by action. And once I understood that, I stopped saying I'm",
        "textdich": ""
    },
    {
        "start": 1306.24,
        "end": 1320.88,
        "text": "not good at English. I started saying I'm learning English. That small change made a big difference. When you say I can't remember vocabulary,",
        "textdich": ""
    },
    {
        "start": 1317.44,
        "end": 1332.48,
        "text": "stop and say, \"I'm still learning to remember vocabulary.\" When you say, \"I'm afraid to speak,\" stop and say, \"I'm learning to speak",
        "textdich": ""
    },
    {
        "start": 1329.28,
        "end": 1337.28,
        "text": "with confidence.\" These small changes in your words will change your world.",
        "textdich": ""
    },
    {
        "start": 1335.6,
        "end": 1346.799,
        "text": "Because what you say to yourself every day becomes your truth. Your words are not just words. They are seeds. Plant",
        "textdich": ""
    },
    {
        "start": 1343.679,
        "end": 1358.72,
        "text": "them carefully. I remember one day I tried to read a story in English. It was a very easy story, but I still didn't understand half of it. I felt so",
        "textdich": ""
    },
    {
        "start": 1355.12,
        "end": 1367.919,
        "text": "frustrated. I wanted to give up, but I told myself, \"I don't understand this one yet.\" And then I read it again the",
        "textdich": ""
    },
    {
        "start": 1363.919,
        "end": 1370.48,
        "text": "next day and again the day after that.",
        "textdich": ""
    },
    {
        "start": 1367.919,
        "end": 1382.88,
        "text": "And by the fifth day, I understood it better. Not perfectly, but more than before. That small change, that little word yet gave me patience. It gave me",
        "textdich": ""
    },
    {
        "start": 1379.6,
        "end": 1395.52,
        "text": "power. It gave me peace. Your brain listens to you. It believes what you say. So be kind. Be patient. Speak to yourself like a friend. Instead of",
        "textdich": ""
    },
    {
        "start": 1392.24,
        "end": 1406.08,
        "text": "saying, \"I'm bad at listening,\" say, \"I'm learning to listen better every day.\" Instead of saying I can't pronounce words, say my pronunciation is",
        "textdich": ""
    },
    {
        "start": 1403.44,
        "end": 1413.6,
        "text": "growing. These gentle words will support your learning. They will hold you up when you feel weak. This is called a",
        "textdich": ""
    },
    {
        "start": 1410.96,
        "end": 1423.919,
        "text": "growth mindset. It means you believe you can grow not overnight, not without effort, but slowly, daily, honestly. A",
        "textdich": ""
    },
    {
        "start": 1420.64,
        "end": 1435.28,
        "text": "fixed mindset says this is who I am. I can't change. A growth mindset says this is where I am and I'm still moving forward. And that mindset is your",
        "textdich": ""
    },
    {
        "start": 1432.159,
        "end": 1443.28,
        "text": "superpower. It will help you keep going even when it's hard. So if you feel stuck right now, if you feel slow, if",
        "textdich": ""
    },
    {
        "start": 1440.96,
        "end": 1449.2,
        "text": "you feel like you're not getting better, please don't give up. You are not stuck.",
        "textdich": ""
    },
    {
        "start": 1446.64,
        "end": 1459.44,
        "text": "You are growing. You may not see it today, but it's happening. Every time you listen, every time you read, every time you try, you are changing your",
        "textdich": ""
    },
    {
        "start": 1457.279,
        "end": 1468.32,
        "text": "brain. You are becoming someone stronger, someone smarter, someone more confident. And this is the truth I want",
        "textdich": ""
    },
    {
        "start": 1464.96,
        "end": 1472.559,
        "text": "you to remember. Your mind is not fixed.",
        "textdich": ""
    },
    {
        "start": 1468.32,
        "end": 1474.88,
        "text": "You are not broken. You are not behind.",
        "textdich": ""
    },
    {
        "start": 1472.559,
        "end": 1476.96,
        "text": "You are just beginning.",
        "textdich": ""
    },
    {
        "start": 1474.88,
        "end": 1486.24,
        "text": "You are just getting started. And the road is long but beautiful. You are allowed to grow at your own pace and I'm",
        "textdich": ""
    },
    {
        "start": 1483.2,
        "end": 1494.159,
        "text": "proud of you for staying on the path. I still remember the first English book I ever finished. It was short. The words",
        "textdich": ""
    },
    {
        "start": 1491.6,
        "end": 1504.24,
        "text": "were easy. The story was about a little boy and his dog. Nothing special. But when I reached the last page, I felt",
        "textdich": ""
    },
    {
        "start": 1500.32,
        "end": 1512.24,
        "text": "something big. I had done it. I had read an English book. Me, the person who once thought English was impossible. The",
        "textdich": ""
    },
    {
        "start": 1510.799,
        "end": 1524.559,
        "text": "person who used to look at English letters like they were from another planet. Now I had read a full story. I smiled to myself that day. No one else",
        "textdich": ""
    },
    {
        "start": 1520.72,
        "end": 1534.0,
        "text": "saw it. No one else clapped. But in my heart I felt a new power. Something had changed. Not just in my mind, but in my",
        "textdich": ""
    },
    {
        "start": 1531.2,
        "end": 1543.039,
        "text": "life. Reading is not just about words on a page. It is about doors. Every book you read opens a new door. A door to new",
        "textdich": ""
    },
    {
        "start": 1540.24,
        "end": 1551.44,
        "text": "ideas, a door to new people, a door to new feelings. When I started reading in English, my brain started changing. I",
        "textdich": ""
    },
    {
        "start": 1548.4,
        "end": 1559.84,
        "text": "could feel it. At first, it was hard. My eyes moved slowly. My head hurt. I didn't understand every word, but I kept",
        "textdich": ""
    },
    {
        "start": 1556.799,
        "end": 1570.0,
        "text": "going. One sentence at a time, one page at a time. And little by little, I noticed something. The more I read, the easier it became.",
        "textdich": ""
    },
    {
        "start": 1567.919,
        "end": 1580.159,
        "text": "Books taught me more than school ever did. Books taught me new words, not just from lists, but from feelings. I learned",
        "textdich": ""
    },
    {
        "start": 1577.919,
        "end": 1587.84,
        "text": "what lonely meant by reading a story about a girl with no friends. I learned what brave meant by reading about a boy",
        "textdich": ""
    },
    {
        "start": 1584.88,
        "end": 1597.2,
        "text": "who stood up for his family. These words were not just vocabulary. They became real. I could feel them in my heart.",
        "textdich": ""
    },
    {
        "start": 1594.4,
        "end": 1606.559,
        "text": "That is the magic of reading. You don't just study English, you live it. If you are learning English, start with small",
        "textdich": ""
    },
    {
        "start": 1603.12,
        "end": 1608.72,
        "text": "books. Don't wait for a big hard novel.",
        "textdich": ""
    },
    {
        "start": 1606.559,
        "end": 1617.12,
        "text": "Start with children's stories. Start with picture books. Start with one page a day. It doesn't matter where you",
        "textdich": ""
    },
    {
        "start": 1613.36,
        "end": 1625.76,
        "text": "begin. What matters is that you begin. I started with just 5 minutes a day. And that small habit changed my brain. My",
        "textdich": ""
    },
    {
        "start": 1623.039,
        "end": 1633.6,
        "text": "eyes started seeing patterns. My brain started remembering words. My tongue started repeating phrases I had read.",
        "textdich": ""
    },
    {
        "start": 1630.64,
        "end": 1636.24,
        "text": "And my confidence started to grow.",
        "textdich": ""
    },
    {
        "start": 1633.6,
        "end": 1638.559,
        "text": "Reading also helped me with speaking.",
        "textdich": ""
    },
    {
        "start": 1636.24,
        "end": 1650.159,
        "text": "When I read a sentence many times, I started saying it out loud. I am happy today. Where are you going? It is a beautiful day. These are not complex",
        "textdich": ""
    },
    {
        "start": 1647.12,
        "end": 1655.6,
        "text": "sentences, but they are strong. They build the foundation of your fluency.",
        "textdich": ""
    },
    {
        "start": 1653.039,
        "end": 1664.08,
        "text": "And once they are inside you, speaking becomes easier. Reading fills your mind with readymade words and sentences. So",
        "textdich": ""
    },
    {
        "start": 1661.36,
        "end": 1670.799,
        "text": "when it's time to speak, your brain already knows what to say.",
        "textdich": ""
    },
    {
        "start": 1667.2,
        "end": 1683.679,
        "text": "Books also gave me peace. When I felt tired, sad, or confused, I opened a book. The words calmed me. The stories made me feel less alone.",
        "textdich": ""
    },
    {
        "start": 1680.559,
        "end": 1693.12,
        "text": "I saw characters who were also afraid, who also made mistakes, who also tried hard to change. And in their stories, I",
        "textdich": ""
    },
    {
        "start": 1690.0,
        "end": 1696.32,
        "text": "saw my own. That is the gift of reading.",
        "textdich": ""
    },
    {
        "start": 1693.12,
        "end": 1706.0,
        "text": "It connects hearts across countries, across languages, across time. One day, I realized something important. Reading",
        "textdich": ""
    },
    {
        "start": 1703.36,
        "end": 1715.2,
        "text": "was not just helping my English, it was helping my life. I was learning how to think, how to listen, how to feel",
        "textdich": ""
    },
    {
        "start": 1711.2,
        "end": 1718.799,
        "text": "deeply. I was learning patience, focus, imagination.",
        "textdich": ""
    },
    {
        "start": 1716.72,
        "end": 1724.48,
        "text": "And that is something no grammar book can give you. Only stories can do that.",
        "textdich": ""
    },
    {
        "start": 1722.0,
        "end": 1731.919,
        "text": "Only books can grow your inner world. So today I want to tell you reading can change your brain. It can change your",
        "textdich": ""
    },
    {
        "start": 1728.88,
        "end": 1740.32,
        "text": "future. It can change who you are. Don't worry about reading fast. Don't worry about understanding every word. Just",
        "textdich": ""
    },
    {
        "start": 1737.36,
        "end": 1747.76,
        "text": "begin with one small book, one small story, one small page. Read it slowly.",
        "textdich": ""
    },
    {
        "start": 1744.32,
        "end": 1757.76,
        "text": "Read it again. Let it sit in your heart and let your brain grow in silence. You are not just learning English. You are",
        "textdich": ""
    },
    {
        "start": 1753.52,
        "end": 1768.88,
        "text": "growing your world word by word, line by line, page by page. And the more you read, the more you rise. Chapter 7.",
        "textdich": ""
    },
    {
        "start": 1765.919,
        "end": 1773.2,
        "text": "Fiction and non-fiction. Two powerful ways to grow.",
        "textdich": ""
    },
    {
        "start": 1771.279,
        "end": 1780.64,
        "text": "When I first started reading in English, I didn't know there were two kinds of books. I just picked anything that",
        "textdich": ""
    },
    {
        "start": 1776.64,
        "end": 1784.64,
        "text": "looked easy. But as I read more, I saw a difference.",
        "textdich": ""
    },
    {
        "start": 1782.24,
        "end": 1792.96,
        "text": "Some books told stories about people, places, feelings. They made me feel things. They took me to other worlds.",
        "textdich": ""
    },
    {
        "start": 1790.64,
        "end": 1803.919,
        "text": "These were fiction books. Other books gave ideas, steps, or advice. They talked to my brain. They taught me something real. These were non-fiction",
        "textdich": ""
    },
    {
        "start": 1801.2,
        "end": 1812.72,
        "text": "books. And both of them helped me grow in different powerful ways. Fiction was my first love. I remember reading a",
        "textdich": ""
    },
    {
        "start": 1810.399,
        "end": 1822.88,
        "text": "simple story about a little boy lost in the forest. He was scared. He missed his mother. He tried to find his way home.",
        "textdich": ""
    },
    {
        "start": 1820.0,
        "end": 1836.32,
        "text": "As I read, I didn't just understand the words. I felt the boy's fear, his sadness, his small hope. I was with him in the forest. My heart followed him.",
        "textdich": ""
    },
    {
        "start": 1833.44,
        "end": 1849.2,
        "text": "And I realized this is what fiction does. It grows your heart. It grows your imagination. You feel the emotions of others. You live their lives even if",
        "textdich": ""
    },
    {
        "start": 1845.919,
        "end": 1853.679,
        "text": "just for a moment and that changes you slowly deeply.",
        "textdich": ""
    },
    {
        "start": 1851.76,
        "end": 1863.039,
        "text": "Fiction helped me speak better because it gave me real natural English. Not the kind from grammar books, but the kind",
        "textdich": ""
    },
    {
        "start": 1860.08,
        "end": 1874.559,
        "text": "from life. People in stories talk like real people. They say things like, \"I don't know, are you okay?\" or \"That's not fair.\" These are phrases we use",
        "textdich": ""
    },
    {
        "start": 1872.159,
        "end": 1884.799,
        "text": "every day. When you read fiction, you learn how people really speak and you remember it because it's part of a story, a moment, a feeling. That's why",
        "textdich": ""
    },
    {
        "start": 1882.24,
        "end": 1892.48,
        "text": "fiction is so powerful. It teaches with emotion. Then I discovered non-fiction.",
        "textdich": ""
    },
    {
        "start": 1889.6,
        "end": 1904.799,
        "text": "At first, it was hard. Non-fiction books don't always tell stories. They tell ideas. They explain things. They give advice. But I started with easy",
        "textdich": ""
    },
    {
        "start": 1900.72,
        "end": 1907.679,
        "text": "self-help books, just one page a day.",
        "textdich": ""
    },
    {
        "start": 1904.799,
        "end": 1912.399,
        "text": "And soon I began to see something amazing.",
        "textdich": ""
    },
    {
        "start": 1909.2,
        "end": 1921.6,
        "text": "Non-fiction gave me tools. It helped me learn how to learn. It taught me about discipline, focus, time, and motivation.",
        "textdich": ""
    },
    {
        "start": 1918.799,
        "end": 1928.0,
        "text": "It gave me new ways to think. And slowly, my actions began to change.",
        "textdich": ""
    },
    {
        "start": 1925.2,
        "end": 1936.72,
        "text": "Fiction grows your heart. Non-fiction grows your mind. Together they make you strong. You become someone who feels",
        "textdich": ""
    },
    {
        "start": 1933.84,
        "end": 1945.279,
        "text": "deeply and thinks clearly. You become someone who understands others and also understands yourself. That is the true",
        "textdich": ""
    },
    {
        "start": 1942.24,
        "end": 1955.279,
        "text": "power of reading both. So where do you start? If you feel tired or sad, choose fiction. Let a story hold your heart.",
        "textdich": ""
    },
    {
        "start": 1952.48,
        "end": 1963.12,
        "text": "Let it carry you to another place. If you feel curious or ready to change, choose non-fiction.",
        "textdich": ""
    },
    {
        "start": 1959.6,
        "end": 1974.559,
        "text": "Let it teach you. Let it guide you. Both are good. Both are needed. There is no wrong choice. For beginners, I suggest",
        "textdich": ""
    },
    {
        "start": 1971.2,
        "end": 1983.519,
        "text": "this. One small story plus one small idea. Read a short fiction story in the morning. Something simple. Then read one",
        "textdich": ""
    },
    {
        "start": 1980.88,
        "end": 1985.679,
        "text": "short non-fiction page in the evening.",
        "textdich": ""
    },
    {
        "start": 1983.519,
        "end": 1992.96,
        "text": "Maybe a tip about confidence or learning habits. This balance will help your English and your life. I remember one",
        "textdich": ""
    },
    {
        "start": 1990.64,
        "end": 2002.0,
        "text": "week I read a story about a lonely bird who couldn't fly. It made me cry. That was fiction. And on the same week I read",
        "textdich": ""
    },
    {
        "start": 1999.919,
        "end": 2009.84,
        "text": "a short chapter about the power of small habits. It made me think. That was non-fiction. I grew in two ways.",
        "textdich": ""
    },
    {
        "start": 2008.159,
        "end": 2021.44,
        "text": "Emotionally, mentally. That's why I still read both every week. You don't need to finish big books. Just read one small page. Feel",
        "textdich": ""
    },
    {
        "start": 2019.039,
        "end": 2030.88,
        "text": "it. Think about it. Let it change you even a little. That's how real growth begins. Quietly, gently, deeply.",
        "textdich": ""
    },
    {
        "start": 2027.919,
        "end": 2037.76,
        "text": "So now you know the secret. Two kinds of books, two ways to grow. Choose both.",
        "textdich": ""
    },
    {
        "start": 2035.279,
        "end": 2046.72,
        "text": "Let fiction grow your heart. Let non-fiction grow your mind. and let English grow your whole world.",
        "textdich": ""
    },
    {
        "start": 2043.6,
        "end": 2056.639,
        "text": "Chapter eight. Focus your new superpower in a distracted world. These days, it is easy to feel lost. Your phone rings, a",
        "textdich": ""
    },
    {
        "start": 2054.079,
        "end": 2066.079,
        "text": "message pops up, you open one app, then another, and before you know it, one hour is gone. You wanted to study English. You wanted to listen to a",
        "textdich": ""
    },
    {
        "start": 2063.52,
        "end": 2069.44,
        "text": "podcast or read a page from your book.",
        "textdich": ""
    },
    {
        "start": 2066.079,
        "end": 2080.56,
        "text": "But now it's too late. Your mind feels tired. Your heart feels heavy. You say to yourself, \"Why can't I focus and that's when guilt begins.",
        "textdich": ""
    },
    {
        "start": 2078.32,
        "end": 2089.76,
        "text": "I know this feeling well because I lived it for years. Every day I promised to study. And every day I let distractions",
        "textdich": ""
    },
    {
        "start": 2086.159,
        "end": 2099.68,
        "text": "win. Until one day, I realized something powerful. In a noisy world, focus is a superpower. I didn't have to be the smartest. I didn't have to be the",
        "textdich": ""
    },
    {
        "start": 2096.96,
        "end": 2106.32,
        "text": "fastest. But if I could focus even for 10 minutes, I could grow. I could learn.",
        "textdich": ""
    },
    {
        "start": 2103.2,
        "end": 2113.359,
        "text": "I could change. I stopped trying to be perfect. I started trying to be present.",
        "textdich": ""
    },
    {
        "start": 2109.44,
        "end": 2124.079,
        "text": "Just present. One page, one video, one sentence. That's all. And slowly my life began to shift. Not because I had more",
        "textdich": ""
    },
    {
        "start": 2121.44,
        "end": 2134.079,
        "text": "time, but because I protected a little time. I made space for learning. I built a small wall around my focus. That wall",
        "textdich": ""
    },
    {
        "start": 2131.04,
        "end": 2142.0,
        "text": "became my power. Distractions will always be there. That's the truth. There will always be another video, another",
        "textdich": ""
    },
    {
        "start": 2139.119,
        "end": 2153.52,
        "text": "scroll, another thing to check. So don't wait for the world to be quiet. Instead, create a small quiet space inside you.",
        "textdich": ""
    },
    {
        "start": 2149.44,
        "end": 2156.0,
        "text": "Start with just 5 minutes. Set a timer.",
        "textdich": ""
    },
    {
        "start": 2153.52,
        "end": 2163.68,
        "text": "Turn off everything else. Take your book or your audio or your flashc cards and give it your full attention. Five",
        "textdich": ""
    },
    {
        "start": 2161.44,
        "end": 2175.04,
        "text": "minutes of real focus is better than one hour of half focus. That small clear moment. That is where real learning begins.",
        "textdich": ""
    },
    {
        "start": 2171.68,
        "end": 2177.52,
        "text": "At first, I couldn't even do 5 minutes.",
        "textdich": ""
    },
    {
        "start": 2175.04,
        "end": 2190.4,
        "text": "My mind would wander. My hands would reach for my phone. But I didn't give up. I forgave myself. I tried again. I told myself, \"This is a skill. I can",
        "textdich": ""
    },
    {
        "start": 2188.32,
        "end": 2202.72,
        "text": "learn it.\" I treated focus like a muscle. Weak at first, but stronger every day. And slowly it worked. 10 minutes, then 15, then 20. Now when I",
        "textdich": ""
    },
    {
        "start": 2199.44,
        "end": 2215.92,
        "text": "study English, I feel calm. I feel strong because I am present. I am focused. And that feels good. You don't need to study for hours. You need to",
        "textdich": ""
    },
    {
        "start": 2212.88,
        "end": 2224.8,
        "text": "study without noise, without jumping between apps, without checking your phone every two minutes. The problem is",
        "textdich": ""
    },
    {
        "start": 2220.96,
        "end": 2233.2,
        "text": "not time. The problem is scattered time, broken time, time with no attention. Fix that and your learning will grow faster",
        "textdich": ""
    },
    {
        "start": 2230.88,
        "end": 2242.64,
        "text": "than you can imagine. That is the power of focus. It makes a small effort feel big. It makes short time feel deep.",
        "textdich": ""
    },
    {
        "start": 2239.839,
        "end": 2253.2,
        "text": "Sometimes I light a candle. I say to myself, \"This is my study time. I take a deep breath. I open my book. I don't",
        "textdich": ""
    },
    {
        "start": 2248.64,
        "end": 2261.92,
        "text": "rush. I don't chase. I just focus. And for those 10 or 15 minutes, I feel peaceful, alive.",
        "textdich": ""
    },
    {
        "start": 2259.04,
        "end": 2273.92,
        "text": "That feeling is beautiful. And I want you to feel it, too. If you live in a busy home, it's okay. If you work a long job, it's okay.",
        "textdich": ""
    },
    {
        "start": 2270.8,
        "end": 2279.599,
        "text": "You don't need silence outside. You just need a quiet promise inside.",
        "textdich": ""
    },
    {
        "start": 2276.88,
        "end": 2294.32,
        "text": "5 minutes in the morning, 10 minutes before sleep, one small session after lunch. That's enough. You can do more later. But begin with small focus.",
        "textdich": ""
    },
    {
        "start": 2290.48,
        "end": 2302.32,
        "text": "Pure focus, loving focus. You will see the difference in one week. You will remember more. You will feel stronger.",
        "textdich": ""
    },
    {
        "start": 2299.839,
        "end": 2310.72,
        "text": "You will enjoy your learning more. And maybe for the first time you will feel proud. Not because you did everything",
        "textdich": ""
    },
    {
        "start": 2308.16,
        "end": 2321.44,
        "text": "but because you did one thing with full heart and full mind. That is enough. So today I give you this gift. The gift of",
        "textdich": ""
    },
    {
        "start": 2318.16,
        "end": 2335.92,
        "text": "focus. It is already inside you. You just have to protect it, water it, train it, and then use it every day like your secret power. Chapter 9.",
        "textdich": ""
    },
    {
        "start": 2332.48,
        "end": 2338.079,
        "text": "Consistency is stronger than motivation.",
        "textdich": ""
    },
    {
        "start": 2335.92,
        "end": 2341.839,
        "text": "Let me tell you a small truth.",
        "textdich": ""
    },
    {
        "start": 2338.079,
        "end": 2350.56,
        "text": "Motivation is like the sun. It comes, it shines bright, it gives you energy, but then it goes away. You feel lost again.",
        "textdich": ""
    },
    {
        "start": 2348.0,
        "end": 2359.599,
        "text": "You say, \"I'll do it tomorrow.\" But tomorrow never comes. I used to wait for motivation every day. I waited to feel",
        "textdich": ""
    },
    {
        "start": 2356.24,
        "end": 2370.56,
        "text": "ready. I waited to feel inspired. Some days I felt strong. I would study English for 1 hour. I felt proud. But then the next day I felt tired. I",
        "textdich": ""
    },
    {
        "start": 2368.079,
        "end": 2380.4,
        "text": "skipped my learning. And that one skip day became three, then five, then a week. My progress stopped. My confidence",
        "textdich": ""
    },
    {
        "start": 2377.28,
        "end": 2391.44,
        "text": "broke. And I started again from zero again and again. Then one day I read something that changed my life. Don't",
        "textdich": ""
    },
    {
        "start": 2386.96,
        "end": 2394.56,
        "text": "wait for motivation, trust, consistency.",
        "textdich": ""
    },
    {
        "start": 2391.44,
        "end": 2397.599,
        "text": "I didn't understand it at first.",
        "textdich": ""
    },
    {
        "start": 2394.56,
        "end": 2404.96,
        "text": "But then I looked at my own life. The times I grew the most were not the days I felt excited. They were the days I",
        "textdich": ""
    },
    {
        "start": 2402.56,
        "end": 2413.92,
        "text": "showed up even when I didn't feel like it. The days I studied for just 10 minutes. The days I whispered English",
        "textdich": ""
    },
    {
        "start": 2410.72,
        "end": 2429.28,
        "text": "sentences while washing dishes. The days I read one page before bed even though my eyes were tired. Those days changed me quietly, gently but forever.",
        "textdich": ""
    },
    {
        "start": 2426.32,
        "end": 2432.56,
        "text": "You see, motivation is a feeling.",
        "textdich": ""
    },
    {
        "start": 2429.28,
        "end": 2442.8,
        "text": "Feelings go up and down. But consistency is a decision, a small daily promise, a habit, a rhythm. It doesn't need to be",
        "textdich": ""
    },
    {
        "start": 2439.52,
        "end": 2452.24,
        "text": "loud. It doesn't need to be perfect. It just needs to be real. That's how I became fluent. Not in big days, but in",
        "textdich": ""
    },
    {
        "start": 2449.04,
        "end": 2462.4,
        "text": "small, quiet ones. Maybe today you don't feel like learning. That's okay. Just do one thing, one sentence, one voice note,",
        "textdich": ""
    },
    {
        "start": 2459.119,
        "end": 2470.88,
        "text": "one flashcard. That small action keeps your learning alive. It keeps your brain moving. It keeps your heart connected to",
        "textdich": ""
    },
    {
        "start": 2468.4,
        "end": 2483.119,
        "text": "the dream. And when you repeat it tomorrow and the next day and the next, it becomes powerful. It becomes who you are. I remember one week where I felt",
        "textdich": ""
    },
    {
        "start": 2479.28,
        "end": 2492.4,
        "text": "very low. I had no energy. But I still played a short English video every day while I brushed my teeth. Just two",
        "textdich": ""
    },
    {
        "start": 2488.24,
        "end": 2501.92,
        "text": "minutes. That was all. But that tiny act saved me. It reminded me I am still a learner. I am still moving forward.",
        "textdich": ""
    },
    {
        "start": 2499.359,
        "end": 2512.8,
        "text": "That's the magic of consistency. It keeps your identity strong even when your energy is weak. We think growth comes from big moves. But it doesn't. It",
        "textdich": ""
    },
    {
        "start": 2510.4,
        "end": 2522.0,
        "text": "comes from steady steps. From showing up, from saying I'll do just 5 minutes and doing it every day. That is how",
        "textdich": ""
    },
    {
        "start": 2519.359,
        "end": 2530.56,
        "text": "fluency is built. That is how confidence is made. Not in noise, in quiet practice. So don't chase motivation.",
        "textdich": ""
    },
    {
        "start": 2527.52,
        "end": 2533.92,
        "text": "It's beautiful, but it's not loyal.",
        "textdich": ""
    },
    {
        "start": 2530.56,
        "end": 2537.04,
        "text": "Instead, become someone who shows up.",
        "textdich": ""
    },
    {
        "start": 2533.92,
        "end": 2548.079,
        "text": "Whether it rains or shines, whether you feel excited or tired, whether your voice is strong or small, show up again",
        "textdich": ""
    },
    {
        "start": 2544.079,
        "end": 2555.2,
        "text": "and again. Like a slow river, like a sunrise, like someone who believes.",
        "textdich": ""
    },
    {
        "start": 2552.48,
        "end": 2568.16,
        "text": "And slowly you will see. Consistency will take you further than motivation ever could. Because motivation burns fast, but consistency burns forever.",
        "textdich": ""
    },
    {
        "start": 2564.72,
        "end": 2577.119,
        "text": "Chapter 10. Self-discipline. The soft power that builds everything. When people hear the word discipline, they think of something hard, something",
        "textdich": ""
    },
    {
        "start": 2574.48,
        "end": 2585.92,
        "text": "painful, like rules, pressure, or punishment. I used to think the same. I thought discipline meant being strict,",
        "textdich": ""
    },
    {
        "start": 2582.64,
        "end": 2595.52,
        "text": "serious, or perfect all the time. But I was wrong. Real discipline, the kind that changes your life, is not loud or",
        "textdich": ""
    },
    {
        "start": 2591.68,
        "end": 2605.44,
        "text": "angry. It is soft. It is quiet. It is a gentle power. and it can grow inside you day by day like a small light. I learned",
        "textdich": ""
    },
    {
        "start": 2603.44,
        "end": 2614.56,
        "text": "this when I was trying to study English every day. At first I waited for motivation. Some days I felt excited.",
        "textdich": ""
    },
    {
        "start": 2611.599,
        "end": 2621.44,
        "text": "Other days I felt lazy. I didn't have a system. My emotions decided everything.",
        "textdich": ""
    },
    {
        "start": 2618.16,
        "end": 2631.28,
        "text": "And so I grew slowly. I took two steps forward and three steps back. Then one day I said to myself, what if I try a",
        "textdich": ""
    },
    {
        "start": 2627.359,
        "end": 2640.24,
        "text": "small routine? Not big, not perfect, just small every day. And that's when discipline began to grow inside me.",
        "textdich": ""
    },
    {
        "start": 2637.92,
        "end": 2649.52,
        "text": "Self-discipline is not about forcing yourself. It is about loving your goal enough to protect it. I loved the idea",
        "textdich": ""
    },
    {
        "start": 2646.4,
        "end": 2658.24,
        "text": "of speaking English freely. I wanted to talk with people, read books, and understand movies. That love became my",
        "textdich": ""
    },
    {
        "start": 2655.44,
        "end": 2660.16,
        "text": "reason. And my reason gave me strength.",
        "textdich": ""
    },
    {
        "start": 2658.24,
        "end": 2669.52,
        "text": "I began to show up even when I didn't feel like it. Not because I was strong, but because I was kind to my dream.",
        "textdich": ""
    },
    {
        "start": 2666.319,
        "end": 2674.48,
        "text": "That's what real discipline is. Kindness to your future self.",
        "textdich": ""
    },
    {
        "start": 2672.48,
        "end": 2683.2,
        "text": "Every night before sleep, I listened to one English story. Even if I was tired, even if I didn't understand every word,",
        "textdich": ""
    },
    {
        "start": 2679.76,
        "end": 2687.28,
        "text": "I pressed play. I listened. I repeated.",
        "textdich": ""
    },
    {
        "start": 2683.2,
        "end": 2698.24,
        "text": "It became my habit. It was small, but it was mine. That little routine gave me peace. It made me feel proud because I was showing up. I was keeping my",
        "textdich": ""
    },
    {
        "start": 2695.68,
        "end": 2711.599,
        "text": "promise. And every time I kept my promise, I felt stronger. You see, self-discipline is like water. It doesn't break you. It shapes you slowly, softly,",
        "textdich": ""
    },
    {
        "start": 2708.72,
        "end": 2717.68,
        "text": "beautifully. It turns confusion into confidence. It turns fear into strength.",
        "textdich": ""
    },
    {
        "start": 2715.2,
        "end": 2729.68,
        "text": "You don't need to study for hours. You just need to return every day. 5 minutes, 10 words, one page, that's enough. Because when you return again",
        "textdich": ""
    },
    {
        "start": 2726.079,
        "end": 2734.72,
        "text": "and again, you become someone new. You become someone who trusts themselves.",
        "textdich": ""
    },
    {
        "start": 2732.48,
        "end": 2748.88,
        "text": "Some people wait for the perfect day, the perfect time, but that day never comes. Discipline teaches you. Don't wait. Start now. Start small. Start",
        "textdich": ""
    },
    {
        "start": 2744.56,
        "end": 2751.76,
        "text": "broken, but start. That is your power.",
        "textdich": ""
    },
    {
        "start": 2748.88,
        "end": 2757.68,
        "text": "Not the size of your step, but the heart behind it. And here's a secret.",
        "textdich": ""
    },
    {
        "start": 2755.28,
        "end": 2767.44,
        "text": "Discipline feels hard in the beginning, but later it gives you peace. It removes stress. It removes guilt. It gives you",
        "textdich": ""
    },
    {
        "start": 2764.48,
        "end": 2775.599,
        "text": "control. You wake up and know what to do. You don't argue with yourself. You just begin. And that feeling of doing",
        "textdich": ""
    },
    {
        "start": 2772.96,
        "end": 2778.72,
        "text": "what matters without pain is beautiful.",
        "textdich": ""
    },
    {
        "start": 2775.599,
        "end": 2780.72,
        "text": "So if you feel weak, it's okay.",
        "textdich": ""
    },
    {
        "start": 2778.72,
        "end": 2789.68,
        "text": "Discipline is not something you are born with. It's something you grow. You build it like a soft house, one small brick at",
        "textdich": ""
    },
    {
        "start": 2786.72,
        "end": 2800.0,
        "text": "a time. And one day that house becomes your home, a safe place, a strong place, a place where you can learn, grow, and",
        "textdich": ""
    },
    {
        "start": 2796.88,
        "end": 2808.8,
        "text": "rest. You don't need to be perfect. You just need to show up with love, with patience, with faith. That is the soft",
        "textdich": ""
    },
    {
        "start": 2806.4,
        "end": 2821.28,
        "text": "power of self-discipline. It will build your confidence. It will build your English. and slowly it will build your new life.",
        "textdich": ""
    },
    {
        "start": 2817.28,
        "end": 2829.68,
        "text": "Chapter 11. Failures are lessons not the end. One day I stood up in my English class. My teacher asked me to read a",
        "textdich": ""
    },
    {
        "start": 2827.04,
        "end": 2832.8,
        "text": "short sentence. My hands were shaking.",
        "textdich": ""
    },
    {
        "start": 2829.68,
        "end": 2839.44,
        "text": "My voice was small. I tried to read but I said the words wrong. Everyone heard.",
        "textdich": ""
    },
    {
        "start": 2836.4,
        "end": 2852.0,
        "text": "I felt so embarrassed. I wanted to sit down and never speak again. I thought maybe I can't do this. Maybe I'm not smart enough. That day I felt like a",
        "textdich": ""
    },
    {
        "start": 2848.72,
        "end": 2860.64,
        "text": "failure. But now when I look back I see something different. That day was not the end. It was a beginning. A beginning",
        "textdich": ""
    },
    {
        "start": 2857.2,
        "end": 2872.8,
        "text": "of growth. A moment of courage. A step forward. We all fail. We all make mistakes. That is part of learning. If you never fail, it means you are not",
        "textdich": ""
    },
    {
        "start": 2869.839,
        "end": 2878.319,
        "text": "trying. If you never get it wrong, it means you are not growing.",
        "textdich": ""
    },
    {
        "start": 2875.68,
        "end": 2883.28,
        "text": "Mistakes are not bad. They are signs that you are learning something new.",
        "textdich": ""
    },
    {
        "start": 2880.8,
        "end": 2892.24,
        "text": "Every time you try, you become a little stronger. Every time you fail, your brain learns. Your heart grows. Your",
        "textdich": ""
    },
    {
        "start": 2889.68,
        "end": 2900.48,
        "text": "courage wakes up. But most people don't see it like that. They make one mistake and they stop. They feel ashamed. They",
        "textdich": ""
    },
    {
        "start": 2897.839,
        "end": 2908.48,
        "text": "feel weak. They think other people learn fast. I can't. But that is not true.",
        "textdich": ""
    },
    {
        "start": 2904.8,
        "end": 2916.72,
        "text": "Everyone fails. Even the best speakers, the smartest students, the strongest minds, they all fall down. What makes",
        "textdich": ""
    },
    {
        "start": 2914.319,
        "end": 2927.119,
        "text": "them special is this. They don't stay down. They stand up again. They try again and again and again. I made many",
        "textdich": ""
    },
    {
        "start": 2924.319,
        "end": 2929.599,
        "text": "mistakes in English. I said words wrong.",
        "textdich": ""
    },
    {
        "start": 2927.119,
        "end": 2941.44,
        "text": "I forgot grammar. I used the wrong tense. I didn't understand simple questions. I felt foolish. But I kept going. I told myself, \"This is normal.",
        "textdich": ""
    },
    {
        "start": 2938.88,
        "end": 2953.599,
        "text": "This is part of learning.\" I looked at every mistake and asked, \"What can I learn from this?\" And slowly, my fear became smaller. My shame turned into",
        "textdich": ""
    },
    {
        "start": 2951.2,
        "end": 2964.8,
        "text": "strength because I understood something powerful. Failure is not the opposite of success. Failure is the path to success.",
        "textdich": ""
    },
    {
        "start": 2962.24,
        "end": 2972.88,
        "text": "I want you to feel that too. I want you to be proud of your mistakes. They mean you are trying. They mean you are not",
        "textdich": ""
    },
    {
        "start": 2970.079,
        "end": 2983.76,
        "text": "giving up. They mean you are alive, growing, stretching, and becoming someone new. So don't hide your mistakes. Don't feel bad when you forget",
        "textdich": ""
    },
    {
        "start": 2980.559,
        "end": 2988.64,
        "text": "a word or say something wrong. Smile.",
        "textdich": ""
    },
    {
        "start": 2983.76,
        "end": 2997.76,
        "text": "Learn. Try again. Talk. Do we say stop walking? We cheer. We say try again. We help them. We believe in them. That's",
        "textdich": ""
    },
    {
        "start": 2995.599,
        "end": 3006.4,
        "text": "how you must treat yourself. Like a baby learning a new skill. With love, with patience, with support. Every mistake",
        "textdich": ""
    },
    {
        "start": 3003.52,
        "end": 3015.119,
        "text": "you make is a gift. It shows you what to work on. It shows you where to grow. And when you learn from it, you become more",
        "textdich": ""
    },
    {
        "start": 3011.92,
        "end": 3023.599,
        "text": "powerful. One mistake at a time, you build your future. One fall at a time, you rise higher. So if today you made a",
        "textdich": ""
    },
    {
        "start": 3021.04,
        "end": 3031.68,
        "text": "mistake in English, good. That means you're learning. That means you're doing the work. That means you are alive on",
        "textdich": ""
    },
    {
        "start": 3027.839,
        "end": 3041.119,
        "text": "the inside. Be proud. Don't quit. Keep learning. Keep falling. Keep rising because you are not a failure. You are a",
        "textdich": ""
    },
    {
        "start": 3038.16,
        "end": 3049.839,
        "text": "learner, a doer, a fighter, and this is just the beginning. Chapter 12. How to keep going when you want to quit. There",
        "textdich": ""
    },
    {
        "start": 3047.68,
        "end": 3052.559,
        "text": "were many days when I wanted to quit.",
        "textdich": ""
    },
    {
        "start": 3049.839,
        "end": 3062.079,
        "text": "Days when everything felt heavy. My mind was tired. My heart felt weak. I opened my English book, looked at the words,",
        "textdich": ""
    },
    {
        "start": 3058.72,
        "end": 3073.04,
        "text": "and closed it again. I thought, \"What's the point?\" I had been learning for weeks, months, and I still couldn't speak the way I wanted. I still made",
        "textdich": ""
    },
    {
        "start": 3070.16,
        "end": 3085.04,
        "text": "mistakes. I still felt small in front of native speakers. I looked at other people who spoke fluently and thought maybe this is not for me. I felt like",
        "textdich": ""
    },
    {
        "start": 3081.839,
        "end": 3087.359,
        "text": "giving up. Maybe you have felt this too.",
        "textdich": ""
    },
    {
        "start": 3085.04,
        "end": 3094.96,
        "text": "Maybe you are feeling it right now. That feeling when progress is slow. When you study but nothing sticks. When you",
        "textdich": ""
    },
    {
        "start": 3092.24,
        "end": 3102.88,
        "text": "listen but you don't understand. When you speak but no one gets you. You feel like you're failing. You feel like",
        "textdich": ""
    },
    {
        "start": 3100.079,
        "end": 3110.96,
        "text": "you're alone. And the voice in your head starts whispering, \"Quit! This is too hard. You're not good enough. But let me",
        "textdich": ""
    },
    {
        "start": 3108.96,
        "end": 3118.079,
        "text": "tell you something important. Something I wish someone had told me earlier.\" That voice is not telling the truth.",
        "textdich": ""
    },
    {
        "start": 3115.599,
        "end": 3128.96,
        "text": "That voice is fear. That voice is tiredness. That voice is just a passing cloud. And behind it, there is still hope. There is still power. There is",
        "textdich": ""
    },
    {
        "start": 3126.24,
        "end": 3137.28,
        "text": "still a strong you waiting, watching, ready to rise. Because the real truth is this. Wanting to quit is not a sign of",
        "textdich": ""
    },
    {
        "start": 3134.8,
        "end": 3145.119,
        "text": "weakness. It is a sign that you are doing something brave, something new, something difficult. Only people who try",
        "textdich": ""
    },
    {
        "start": 3142.72,
        "end": 3150.079,
        "text": "to grow ever feel like quitting. People who stay the same never feel this pain.",
        "textdich": ""
    },
    {
        "start": 3147.839,
        "end": 3158.48,
        "text": "So if you feel like quitting, it means you are trying. It means you care and that is beautiful. In those moments when",
        "textdich": ""
    },
    {
        "start": 3156.079,
        "end": 3168.4,
        "text": "I felt like giving up, I learned to ask myself one question. Can I do just one small thing today? Not an hour of study,",
        "textdich": ""
    },
    {
        "start": 3165.04,
        "end": 3171.76,
        "text": "not a long conversation, just one thing.",
        "textdich": ""
    },
    {
        "start": 3168.4,
        "end": 3182.559,
        "text": "One English sentence, one short video, one simple journal entry. And every time I said yes to that small thing, something magical happened. I kept",
        "textdich": ""
    },
    {
        "start": 3179.359,
        "end": 3194.319,
        "text": "going. I stayed on the path. I moved one step forward. That's the secret. When you feel lost, don't try to do everything. Just do one small thing.",
        "textdich": ""
    },
    {
        "start": 3191.76,
        "end": 3205.76,
        "text": "Even 5 minutes of learning is enough because 5 minutes today and 5 minutes tomorrow and five more the next day, that adds up. that becomes something",
        "textdich": ""
    },
    {
        "start": 3202.72,
        "end": 3214.4,
        "text": "strong, something real, something you can build your life on. There was a time I didn't want to touch English again. I",
        "textdich": ""
    },
    {
        "start": 3211.28,
        "end": 3216.72,
        "text": "was so discouraged. I had failed a test.",
        "textdich": ""
    },
    {
        "start": 3214.4,
        "end": 3225.839,
        "text": "I had spoken badly in a group. I felt ashamed. But then someone I loved said something simple to me. They said,",
        "textdich": ""
    },
    {
        "start": 3222.72,
        "end": 3233.839,
        "text": "\"Don't stop. You've come so far. Even if it's slow, you're still moving forward.\" That moment stayed in my heart. I",
        "textdich": ""
    },
    {
        "start": 3231.2,
        "end": 3244.48,
        "text": "realized I had already started. I had already done so much. And to stop now would mean losing all that. So I didn't",
        "textdich": ""
    },
    {
        "start": 3239.04,
        "end": 3254.16,
        "text": "stop. I paused. I cried. I rested. But I didn't stop. Rest is okay. Breaks are okay. But quitting, quitting is not what",
        "textdich": ""
    },
    {
        "start": 3251.76,
        "end": 3261.599,
        "text": "you want. You don't want to give up your dream. You don't want to stay stuck. You want to speak well. You want to",
        "textdich": ""
    },
    {
        "start": 3259.68,
        "end": 3271.119,
        "text": "understand movies, talk to people, and grow your confidence. So, take a breath, drink some water, wipe your tears, and",
        "textdich": ""
    },
    {
        "start": 3267.52,
        "end": 3280.079,
        "text": "do one small thing today. That is how you keep going. And remember this, no one else can give you your dream. No one",
        "textdich": ""
    },
    {
        "start": 3277.52,
        "end": 3288.64,
        "text": "else can build your English. You must do it. And you can do it. You are strong enough. You are brave enough. Even if",
        "textdich": ""
    },
    {
        "start": 3285.839,
        "end": 3297.44,
        "text": "you are scared, even if you are tired, you can still rise. Every person you admire, every fluent speaker you look up",
        "textdich": ""
    },
    {
        "start": 3294.48,
        "end": 3304.88,
        "text": "to, they all had this moment. A moment when they felt like quitting and they didn't. That's why they succeeded. Not",
        "textdich": ""
    },
    {
        "start": 3302.96,
        "end": 3315.04,
        "text": "because they were perfect, not because they never struggled, but because they stayed. They chose to keep going. And so",
        "textdich": ""
    },
    {
        "start": 3310.88,
        "end": 3324.16,
        "text": "can you. Today may feel hard. Tomorrow may feel hard, too. But one day, you will look back and see how far you've",
        "textdich": ""
    },
    {
        "start": 3320.72,
        "end": 3334.4,
        "text": "come. You will say, \"I almost quit, but I didn't.\" And that will be your proudest moment because you didn't give up on yourself. You didn't give up on",
        "textdich": ""
    },
    {
        "start": 3330.96,
        "end": 3336.72,
        "text": "your voice. And that changes everything.",
        "textdich": ""
    },
    {
        "start": 3334.4,
        "end": 3349.839,
        "text": "You are still here. You are still learning. That means your story is not over. So please keep going even when you don't feel like it, especially then.",
        "textdich": ""
    },
    {
        "start": 3345.92,
        "end": 3355.04,
        "text": "That is when your real power grows.",
        "textdich": ""
    },
    {
        "start": 3349.839,
        "end": 3364.079,
        "text": "Chapter 13. The 1% rule. Get just 1% better every day. There is a secret to growing in life. It's not a big secret.",
        "textdich": ""
    },
    {
        "start": 3361.2,
        "end": 3373.44,
        "text": "In fact, it's very small. But that's why most people miss it. They think success is big. They think change is loud and",
        "textdich": ""
    },
    {
        "start": 3369.839,
        "end": 3385.839,
        "text": "fast. But real change, deep change, begins small, quiet, and slow like a seed in the ground, like water dripping on a stone, like one page of a book or",
        "textdich": ""
    },
    {
        "start": 3382.319,
        "end": 3394.96,
        "text": "one new word in English. This secret is called the 1% rule. It means you don't have to be great today. You just have to",
        "textdich": ""
    },
    {
        "start": 3391.44,
        "end": 3408.24,
        "text": "get 1% better. When I first heard about this idea, I didn't believe it. I thought 1% that's nothing. But I was wrong. 1% every day means 37 times",
        "textdich": ""
    },
    {
        "start": 3405.2,
        "end": 3416.48,
        "text": "better after 1 year. That's the power of daily action. That's the power of not giving up. Small steps become big",
        "textdich": ""
    },
    {
        "start": 3413.68,
        "end": 3426.16,
        "text": "results if you keep walking. Think about this. If you read just one page of English every day in one year, you'll",
        "textdich": ""
    },
    {
        "start": 3422.24,
        "end": 3437.599,
        "text": "finish 365 pages. That's a whole book, maybe two. If you learn just one new word each day, in one year you'll know over 300 new words. That's enough to",
        "textdich": ""
    },
    {
        "start": 3434.88,
        "end": 3446.319,
        "text": "speak, to write, to understand so much more than before. And if you speak just one English sentence aloud every day,",
        "textdich": ""
    },
    {
        "start": 3442.799,
        "end": 3455.52,
        "text": "you'll speak 365 times more than the person who waits for the perfect time to practice. Most people never start because they think small is not enough.",
        "textdich": ""
    },
    {
        "start": 3453.119,
        "end": 3462.48,
        "text": "They wait for big moments, big energy, big plans. But those people stay stuck.",
        "textdich": ""
    },
    {
        "start": 3458.799,
        "end": 3471.52,
        "text": "They plan. They think, they dream, but they don't act. And the people who do small things every day, they grow. They",
        "textdich": ""
    },
    {
        "start": 3468.48,
        "end": 3477.599,
        "text": "change. They move forward quietly but powerfully. They follow the 1% rule.",
        "textdich": ""
    },
    {
        "start": 3475.119,
        "end": 3486.559,
        "text": "When I was learning English, I had many days when I didn't feel strong. I didn't study for hours. I didn't finish full",
        "textdich": ""
    },
    {
        "start": 3483.119,
        "end": 3498.079,
        "text": "lessons, but I did one small thing. I listened to one short video. I copied one sentence from a book. I said one word out loud. And slowly those small",
        "textdich": ""
    },
    {
        "start": 3494.96,
        "end": 3500.72,
        "text": "things added up. They gave me power.",
        "textdich": ""
    },
    {
        "start": 3498.079,
        "end": 3511.92,
        "text": "They gave me belief. And they gave me results. You don't need to do big things. You need to do real things, consistent things, and repeatable",
        "textdich": ""
    },
    {
        "start": 3508.64,
        "end": 3514.96,
        "text": "things. That's how you build skills.",
        "textdich": ""
    },
    {
        "start": 3511.92,
        "end": 3524.64,
        "text": "That's how you build a new life. Imagine a brick wall. Each brick is one small habit. Every day you add a brick. Some",
        "textdich": ""
    },
    {
        "start": 3521.839,
        "end": 3534.559,
        "text": "days it feels boring. Some days it feels slow. But one day you look up and see a strong wall. A wall that protects you. A",
        "textdich": ""
    },
    {
        "start": 3531.52,
        "end": 3543.28,
        "text": "wall that shows how far you've come. The 1% rule also helps you feel safe because it removes pressure. You don't need to",
        "textdich": ""
    },
    {
        "start": 3540.72,
        "end": 3549.839,
        "text": "be fluent today. You don't need to be perfect. You just need to grow a little.",
        "textdich": ""
    },
    {
        "start": 3546.559,
        "end": 3559.04,
        "text": "You just need to do your 1%. That's enough. That's more than enough. Let's say today you read for five minutes. You",
        "textdich": ""
    },
    {
        "start": 3556.16,
        "end": 3568.72,
        "text": "learn one new phrase. You say one new sentence. Great. You did your part. You are better than yesterday. And tomorrow",
        "textdich": ""
    },
    {
        "start": 3565.28,
        "end": 3577.68,
        "text": "you'll do one more thing. Slowly your English brain will open. Your confidence will rise. And one day without even",
        "textdich": ""
    },
    {
        "start": 3574.24,
        "end": 3586.16,
        "text": "knowing it, you will speak with ease. I remember a friend of mine who started learning English late in life. She felt",
        "textdich": ""
    },
    {
        "start": 3582.4,
        "end": 3594.72,
        "text": "shy. She felt behind. But she followed the 1% rule. She said, \"I can't learn everything, but I can learn something.\"",
        "textdich": ""
    },
    {
        "start": 3592.88,
        "end": 3604.88,
        "text": "Every day, she did a little, and she didn't stop. 2 years later, she was giving speeches, writing emails, teaching others. Not because she was",
        "textdich": ""
    },
    {
        "start": 3601.599,
        "end": 3607.44,
        "text": "fast, but because she was consistent.",
        "textdich": ""
    },
    {
        "start": 3604.88,
        "end": 3616.16,
        "text": "You can do this, too. Even if you are busy, even if you are tired, even if you think I'm too slow, you are not too",
        "textdich": ""
    },
    {
        "start": 3613.44,
        "end": 3625.599,
        "text": "slow. You are growing. You are on the path. And every step counts. You can start today, right now. Say one English",
        "textdich": ""
    },
    {
        "start": 3622.16,
        "end": 3628.079,
        "text": "sentence out loud. Write one short note.",
        "textdich": ""
    },
    {
        "start": 3625.599,
        "end": 3640.24,
        "text": "Watch one short video. Read one paragraph. That's your 1%. Do it again tomorrow and again the next day. That's how real learners grow. Quietly,",
        "textdich": ""
    },
    {
        "start": 3637.119,
        "end": 3653.2,
        "text": "strongly, one step at a time. So, promise me this. When you feel weak, do one small thing. When you feel strong, do one small thing. No matter what, do",
        "textdich": ""
    },
    {
        "start": 3650.24,
        "end": 3662.4,
        "text": "one thing. That's your power. That's your path. You don't need to change your life in a day. You just need to keep",
        "textdich": ""
    },
    {
        "start": 3658.16,
        "end": 3670.96,
        "text": "walking slowly, gently, daily, 1% better every day. Chapter 14. Build your own learning system. No more confusion.",
        "textdich": ""
    },
    {
        "start": 3669.04,
        "end": 3679.839,
        "text": "There was a time when I didn't know what to do. I wanted to learn English. I was ready to work hard, but I was confused.",
        "textdich": ""
    },
    {
        "start": 3677.04,
        "end": 3687.359,
        "text": "Every day I saw different advice. One video said to memorize grammar. Another said to just listen. One teacher said to",
        "textdich": ""
    },
    {
        "start": 3684.88,
        "end": 3692.559,
        "text": "write every day. Another said speaking is more important.",
        "textdich": ""
    },
    {
        "start": 3689.76,
        "end": 3701.92,
        "text": "My mind was full of noise. I didn't have a plan. I didn't have a system. I just jumped from one thing to another and I",
        "textdich": ""
    },
    {
        "start": 3698.319,
        "end": 3713.52,
        "text": "felt lost. I was doing a lot. But I was not going anywhere. It felt like running in circles. That's when I realized something important. If I wanted to",
        "textdich": ""
    },
    {
        "start": 3709.52,
        "end": 3723.92,
        "text": "grow, I needed a simple plan. I needed a system that worked for me. A learning system is not something big or complicated. It's just a daily routine",
        "textdich": ""
    },
    {
        "start": 3720.799,
        "end": 3734.559,
        "text": "that helps you learn step by step. It's like a road map for your brain. Without it, you get confused. You forget. You",
        "textdich": ""
    },
    {
        "start": 3730.64,
        "end": 3745.28,
        "text": "stop. But with it, you feel clear. You feel calm. You know what to do every day. That makes learning easier. It gives you peace. It gives you power. It",
        "textdich": ""
    },
    {
        "start": 3743.359,
        "end": 3748.24,
        "text": "gives you progress.",
        "textdich": ""
    },
    {
        "start": 3745.28,
        "end": 3755.92,
        "text": "I started with a very simple system. In the morning, I listened to English for 10 minutes. Sometimes it was a podcast.",
        "textdich": ""
    },
    {
        "start": 3753.119,
        "end": 3763.44,
        "text": "Sometimes it was a story. But I listened every morning while brushing my teeth or eating breakfast. This helped my ears",
        "textdich": ""
    },
    {
        "start": 3760.799,
        "end": 3771.68,
        "text": "wake up to English. I didn't try to understand everything. I just listened and let the sounds become familiar. In",
        "textdich": ""
    },
    {
        "start": 3769.359,
        "end": 3779.839,
        "text": "the afternoon, I read a short paragraph, just a few sentences, easy words. I used my finger to follow the lines.",
        "textdich": ""
    },
    {
        "start": 3777.92,
        "end": 3789.76,
        "text": "If I didn't know a word, I wrote it down. I didn't stop reading. I just kept going. Then in the evening, I spoke one",
        "textdich": ""
    },
    {
        "start": 3786.88,
        "end": 3799.2,
        "text": "sentence aloud. I looked in the mirror and said something like, \"Today was a good day.\" Or, \"I ate rice for lunch. It",
        "textdich": ""
    },
    {
        "start": 3796.079,
        "end": 3805.359,
        "text": "was simple, but it was mine.\" This system was not perfect, but it was mine.",
        "textdich": ""
    },
    {
        "start": 3802.319,
        "end": 3811.52,
        "text": "It was my routine. And because it was small and easy, I could do it every day.",
        "textdich": ""
    },
    {
        "start": 3808.88,
        "end": 3821.92,
        "text": "Even when I was busy, even when I was tired. That's the power of a good system. It doesn't make you feel overwhelmed. It makes you feel safe.",
        "textdich": ""
    },
    {
        "start": 3820.16,
        "end": 3833.2,
        "text": "Many people try to learn without a system. They watch one video today. They read a hard book tomorrow. They try grammar for one week. Then they stop.",
        "textdich": ""
    },
    {
        "start": 3830.96,
        "end": 3840.559,
        "text": "They don't know what to do next. So they feel tired and frustrated and then they give up. But when you have your own",
        "textdich": ""
    },
    {
        "start": 3838.48,
        "end": 3851.599,
        "text": "learning system, everything becomes simple. You don't waste time thinking what should I do today? You already know. You just follow your steps and",
        "textdich": ""
    },
    {
        "start": 3848.48,
        "end": 3855.92,
        "text": "step by step. You grow stronger. Your system doesn't have to look like mine.",
        "textdich": ""
    },
    {
        "start": 3854.0,
        "end": 3860.72,
        "text": "Maybe you work in the morning. Maybe your best time to study is at night.",
        "textdich": ""
    },
    {
        "start": 3858.319,
        "end": 3868.72,
        "text": "That's okay. The system should fit your life, not someone else's. You can create your own. You can write it on paper.",
        "textdich": ""
    },
    {
        "start": 3866.079,
        "end": 3881.52,
        "text": "Make it clear and simple. For example, one, listen for 10 minutes. Two, read one paragraph. Three, speak one sentence. That's it. That's enough. You",
        "textdich": ""
    },
    {
        "start": 3878.72,
        "end": 3890.72,
        "text": "can also choose your tools. If you like stories, use story videos. If you like music, use English songs. If you like",
        "textdich": ""
    },
    {
        "start": 3887.599,
        "end": 3898.64,
        "text": "apps, use an easy English app. But don't use too many things at once. Choose one or two. Use them again and again.",
        "textdich": ""
    },
    {
        "start": 3896.4,
        "end": 3906.0,
        "text": "Repetition is part of your system. It makes your brain stronger. You don't need new tools every day. You just need",
        "textdich": ""
    },
    {
        "start": 3903.039,
        "end": 3911.68,
        "text": "to use the same tools better. Another important part of your system is review.",
        "textdich": ""
    },
    {
        "start": 3909.359,
        "end": 3914.16,
        "text": "Learning something once is not enough.",
        "textdich": ""
    },
    {
        "start": 3911.68,
        "end": 3916.64,
        "text": "You need to see it again and again.",
        "textdich": ""
    },
    {
        "start": 3914.16,
        "end": 3927.599,
        "text": "That's how your memory grows. So each week review old words, repeat old sentences, go back to videos you watched before. You will understand more. You",
        "textdich": ""
    },
    {
        "start": 3925.359,
        "end": 3937.68,
        "text": "will feel proud. That's how review becomes your friend. Also track your learning. You don't need a fancy notebook. Just use a small calendar or",
        "textdich": ""
    },
    {
        "start": 3935.28,
        "end": 3947.359,
        "text": "journal. Every day mark a check when you do your practice, a small star, a smiley face, anything. This gives you joy. You",
        "textdich": ""
    },
    {
        "start": 3944.079,
        "end": 3955.44,
        "text": "can see your progress. You can say yes, I did it today. That feeling gives you energy. Your system is not about being",
        "textdich": ""
    },
    {
        "start": 3952.64,
        "end": 3963.44,
        "text": "perfect. It's about being steady. It's okay if you miss a day. It's okay if you feel lazy sometimes. But always come",
        "textdich": ""
    },
    {
        "start": 3960.799,
        "end": 3965.44,
        "text": "back. Your system will wait for you.",
        "textdich": ""
    },
    {
        "start": 3963.44,
        "end": 3974.319,
        "text": "Like a soft light in the dark, it will guide you again. Remember, you are the driver of your learning. Your system is",
        "textdich": ""
    },
    {
        "start": 3970.96,
        "end": 3976.72,
        "text": "the road. Your goal is the destination.",
        "textdich": ""
    },
    {
        "start": 3974.319,
        "end": 3984.96,
        "text": "And every small step you take moves you forward. You don't need to rush. You don't need to compete. You just need to",
        "textdich": ""
    },
    {
        "start": 3981.839,
        "end": 3991.92,
        "text": "follow your own map slowly, gently, daily. That's how real change happens.",
        "textdich": ""
    },
    {
        "start": 3988.72,
        "end": 4000.319,
        "text": "So today, ask yourself, what is my learning system? Do I have one? If not, it's okay. Now is the perfect time to",
        "textdich": ""
    },
    {
        "start": 3997.52,
        "end": 4009.68,
        "text": "build one. Start small, make it simple, and follow it every day. Even 10 minutes can change your life. I promise your",
        "textdich": ""
    },
    {
        "start": 4005.44,
        "end": 4011.839,
        "text": "future self will thank you. Chapter 15.",
        "textdich": ""
    },
    {
        "start": 4009.68,
        "end": 4021.52,
        "text": "Become the person who never falls behind again. I used to feel like I was always behind. Behind in school, behind in",
        "textdich": ""
    },
    {
        "start": 4018.16,
        "end": 4028.96,
        "text": "English, behind in life. I saw other people learning fast, speaking well, getting better. And I felt stuck. It was",
        "textdich": ""
    },
    {
        "start": 4027.2,
        "end": 4038.24,
        "text": "like standing on a road while everyone else was running ahead. I tried to catch up. I tried to copy them. But the more I",
        "textdich": ""
    },
    {
        "start": 4035.28,
        "end": 4049.119,
        "text": "chased others, the more I got tired. I felt small. I felt slow. And I thought, maybe I'm just not good enough. Maybe",
        "textdich": ""
    },
    {
        "start": 4046.0,
        "end": 4060.48,
        "text": "I'll always be behind. Maybe success is not for people like me. But then something changed. I stopped chasing others. I started looking at myself. I",
        "textdich": ""
    },
    {
        "start": 4057.599,
        "end": 4069.76,
        "text": "asked one question. What can I do today to grow? Not what others are doing, not how far they are, just me, just today.",
        "textdich": ""
    },
    {
        "start": 4067.28,
        "end": 4081.2,
        "text": "That question changed everything. It gave me power. It gave me peace. I realized that falling behind is not about being slow. It's about stopping.",
        "textdich": ""
    },
    {
        "start": 4078.72,
        "end": 4091.92,
        "text": "It's about giving up. But if I keep going, even slowly, I am not behind. I am growing. I am moving forward. That is",
        "textdich": ""
    },
    {
        "start": 4088.48,
        "end": 4100.319,
        "text": "enough. You don't become unstoppable by being perfect. You become unstoppable by continuing even when it's hard, even",
        "textdich": ""
    },
    {
        "start": 4097.759,
        "end": 4111.679,
        "text": "when you feel tired, even when no one claps for you. The person who never falls behind is not the fastest. They are the one who doesn't stop walking.",
        "textdich": ""
    },
    {
        "start": 4109.359,
        "end": 4123.04,
        "text": "They learn a little every day. They speak even when afraid. They read even when sleepy. They listen even when confused. They show up for themselves.",
        "textdich": ""
    },
    {
        "start": 4120.88,
        "end": 4131.52,
        "text": "Every day is a chance to become that person. The person who learns one new word. The person who finishes one small",
        "textdich": ""
    },
    {
        "start": 4128.319,
        "end": 4144.239,
        "text": "task. The person who says, \"I will not give up today.\" That kind of person becomes strong. Not suddenly, not loudly, but slowly, quietly, deeply.",
        "textdich": ""
    },
    {
        "start": 4142.08,
        "end": 4153.12,
        "text": "They build a kind of power that doesn't break. I remember a boy from my old class. He was not the smartest. He made",
        "textdich": ""
    },
    {
        "start": 4150.56,
        "end": 4165.12,
        "text": "many mistakes. People laughed at his accent, but he smiled. He listened. He asked questions. He studied one hour every night. He never missed a day.",
        "textdich": ""
    },
    {
        "start": 4162.319,
        "end": 4168.0,
        "text": "Others laughed. Others skipped practice.",
        "textdich": ""
    },
    {
        "start": 4165.12,
        "end": 4179.279,
        "text": "But he showed up again and again. 3 years later, he was giving speeches in English. People clapped. They said, \"Wow, you speak so well, but they didn't",
        "textdich": ""
    },
    {
        "start": 4176.4,
        "end": 4188.64,
        "text": "see the small steps. They didn't see the quiet work.\" That's the kind of person who never falls behind. You can become",
        "textdich": ""
    },
    {
        "start": 4184.719,
        "end": 4190.48,
        "text": "that person, too. You don't need magic.",
        "textdich": ""
    },
    {
        "start": 4188.64,
        "end": 4199.76,
        "text": "You don't need to learn everything in one day. You just need to keep learning every single day. One small step, one",
        "textdich": ""
    },
    {
        "start": 4196.88,
        "end": 4205.44,
        "text": "small win. That is your path. That is your power. Many learners get tired.",
        "textdich": ""
    },
    {
        "start": 4202.719,
        "end": 4210.8,
        "text": "They feel stuck. They ask, \"Why am I not fluent yet?\" But fluency is not a race.",
        "textdich": ""
    },
    {
        "start": 4208.48,
        "end": 4220.239,
        "text": "It's a path you walk. Some days are easy. Some are slow. But if you don't stop walking, you are not behind. You are ahead of the person who did nothing",
        "textdich": ""
    },
    {
        "start": 4217.84,
        "end": 4225.76,
        "text": "today. You are ahead of the person who gave up. You are ahead of your old self.",
        "textdich": ""
    },
    {
        "start": 4223.199,
        "end": 4234.08,
        "text": "That is success. So how do you become that kind of learner? First, believe in small actions. Reading one paragraph,",
        "textdich": ""
    },
    {
        "start": 4231.679,
        "end": 4239.84,
        "text": "saying one sentence, listening for 10 minutes. These things build your brain.",
        "textdich": ""
    },
    {
        "start": 4236.8,
        "end": 4248.8,
        "text": "They build your belief. Second, forgive yourself when you miss a day. Don't quit. Just come back. Start again.",
        "textdich": ""
    },
    {
        "start": 4245.6,
        "end": 4258.32,
        "text": "Third, stop comparing. Your path is yours. Your speed is yours. Walk it with pride. Also, write down your progress.",
        "textdich": ""
    },
    {
        "start": 4255.52,
        "end": 4260.8,
        "text": "It helps you see how far you've come.",
        "textdich": ""
    },
    {
        "start": 4258.32,
        "end": 4270.56,
        "text": "Maybe you write, \"Today I understood a video.\" Or, \"Today I said my first English sentence out loud.\" These small winds are gold. They keep you strong.",
        "textdich": ""
    },
    {
        "start": 4268.96,
        "end": 4282.8,
        "text": "They remind you that you are not failing. You are growing. And most importantly, build your learning identity. Say to yourself, I am a",
        "textdich": ""
    },
    {
        "start": 4278.48,
        "end": 4296.88,
        "text": "learner. Not I'm trying. Not maybe I can. Say, this is who I am now. I am someone who grows. I am someone who learns every day for life. That belief",
        "textdich": ""
    },
    {
        "start": 4294.48,
        "end": 4306.64,
        "text": "will carry you on days when motivation is low. That belief will hold your hand when everything feels hard. You are not",
        "textdich": ""
    },
    {
        "start": 4303.04,
        "end": 4312.56,
        "text": "behind. You are becoming. You are not stuck. You are moving. You are not late.",
        "textdich": ""
    },
    {
        "start": 4310.239,
        "end": 4315.12,
        "text": "You are right on time.",
        "textdich": ""
    },
    {
        "start": 4312.56,
        "end": 4326.48,
        "text": "You just need to keep going slowly, honestly, gently. From today, stop thinking of yourself as someone trying to learn. Start thinking of yourself as",
        "textdich": ""
    },
    {
        "start": 4323.6,
        "end": 4328.88,
        "text": "someone who never stops learning.",
        "textdich": ""
    },
    {
        "start": 4326.48,
        "end": 4339.84,
        "text": "That is your power. That is your new name. The person who never falls behind again. Chapter 16. The forever student.",
        "textdich": ""
    },
    {
        "start": 4336.64,
        "end": 4348.0,
        "text": "Stay ahead for life. Now you are at the end of this journey but also at the beginning of something new. You have",
        "textdich": ""
    },
    {
        "start": 4345.04,
        "end": 4355.76,
        "text": "come so far. You have listened, learned, and opened your heart to grow. You are no longer the same person who started",
        "textdich": ""
    },
    {
        "start": 4352.8,
        "end": 4364.32,
        "text": "this video. Something inside you has changed. You are not just learning English. You are learning how to learn.",
        "textdich": ""
    },
    {
        "start": 4361.84,
        "end": 4373.44,
        "text": "You are learning how to grow step by step. And this is the biggest skill in life. the one that will help you stay",
        "textdich": ""
    },
    {
        "start": 4369.52,
        "end": 4383.04,
        "text": "ahead no matter what. Many people stop learning when school ends. They think now I know enough. But the world does",
        "textdich": ""
    },
    {
        "start": 4379.6,
        "end": 4395.92,
        "text": "not stop. It keeps moving. New things come, new problems appear. And those who stop learning fall behind slowly, quietly, they start feeling lost. But",
        "textdich": ""
    },
    {
        "start": 4393.44,
        "end": 4406.159,
        "text": "the people who keep learning, they stay strong. They stay sharp and they stay free. That is why I say be a forever",
        "textdich": ""
    },
    {
        "start": 4403.12,
        "end": 4415.679,
        "text": "student. Not just in school, not just for exams, but for life. Being a forever student means being curious every day.",
        "textdich": ""
    },
    {
        "start": 4412.96,
        "end": 4425.36,
        "text": "It means waking up and asking, \"What can I learn today?\" It means reading, listening, thinking, and practicing even when no one tells you to. It means",
        "textdich": ""
    },
    {
        "start": 4423.12,
        "end": 4436.08,
        "text": "learning for yourself, not just for grades. It is not always easy. Some days you will feel tired. Some days you will not feel like studying. But if you",
        "textdich": ""
    },
    {
        "start": 4434.08,
        "end": 4446.32,
        "text": "remember your purpose, you will continue. When you choose to be a forever student, you are choosing to grow for the rest of your life. This is",
        "textdich": ""
    },
    {
        "start": 4443.04,
        "end": 4455.36,
        "text": "not a small thing. It is a gift. It means you will always find new doors to open, new places to explore, new words",
        "textdich": ""
    },
    {
        "start": 4452.32,
        "end": 4466.96,
        "text": "to understand. It means you will never feel stuck. You will never feel too old because learning keeps your heart young and your mind alive.",
        "textdich": ""
    },
    {
        "start": 4463.76,
        "end": 4475.84,
        "text": "I still learn every day. Even after many years of speaking English, I still read new books, listen to new people, and",
        "textdich": ""
    },
    {
        "start": 4472.88,
        "end": 4486.4,
        "text": "watch new lessons. I know I will never know everything, and that's okay. I don't need to be perfect. I just need to keep going. That is what makes me",
        "textdich": ""
    },
    {
        "start": 4483.92,
        "end": 4493.04,
        "text": "strong. That is what will make you strong too. Maybe you feel afraid sometimes.",
        "textdich": ""
    },
    {
        "start": 4491.04,
        "end": 4503.12,
        "text": "Maybe you worry that you are not smart enough, not fast enough and not good enough. But I want you to remember this.",
        "textdich": ""
    },
    {
        "start": 4499.6,
        "end": 4514.719,
        "text": "You are enough just as you are. You are learning. You are growing. You are showing up. And that is powerful. From today, wear the name forever student",
        "textdich": ""
    },
    {
        "start": 4511.679,
        "end": 4527.52,
        "text": "with pride. Let it become part of your identity. Let it guide you when you feel lost. Let it remind you to ask questions, to try again, to keep moving.",
        "textdich": ""
    },
    {
        "start": 4525.44,
        "end": 4536.0,
        "text": "The forever student is not afraid of mistakes. The forever student is not afraid of slow days. The forever student",
        "textdich": ""
    },
    {
        "start": 4533.199,
        "end": 4546.8,
        "text": "knows that learning is a journey, not a race. Maybe one day you will help someone else learn. Maybe you will tell your story the way I told mine. Maybe",
        "textdich": ""
    },
    {
        "start": 4544.64,
        "end": 4557.12,
        "text": "your journey will inspire another person who feels like giving up. That is what happens when you keep learning. You don't just grow yourself, you give",
        "textdich": ""
    },
    {
        "start": 4554.32,
        "end": 4568.48,
        "text": "others the courage to grow too. So wherever you are, whatever your age, whatever your background, choose to stay a student, choose to learn something",
        "textdich": ""
    },
    {
        "start": 4565.199,
        "end": 4579.199,
        "text": "today. Choose to keep moving. That is how you stay ahead in life. Not by knowing everything but by never stopping your growth. I am proud of you. I am",
        "textdich": ""
    },
    {
        "start": 4577.12,
        "end": 4591.52,
        "text": "proud of every small step you have taken. I am proud that you stayed till the end. You are not behind. You are not too late. You are ready.",
        "textdich": ""
    },
    {
        "start": 4589.04,
        "end": 4600.48,
        "text": "This is your new beginning. The world is open to you now. Go explore it. Go learn it. Go live it. And if this video helped",
        "textdich": ""
    },
    {
        "start": 4597.92,
        "end": 4609.04,
        "text": "you, if you felt something change inside you, then please like this video, subscribe to this channel, and leave a",
        "textdich": ""
    },
    {
        "start": 4605.76,
        "end": 4616.56,
        "text": "comment below. Tell me, are you ready to be a forever student? Let's grow together every single day. Thank you for",
        "textdich": ""
    },
    {
        "start": 4614.32,
        "end": 4621.28,
        "text": "being here. Thank you for learning with me. Your journey is just beginning.",
        "textdich": ""
    }
]