[
    {
        "start": 0.16,
        "end": 12.08,
        "text": "Welcome to my channel, The English Grammar Doctor. Have you ever wanted to speak English without stopping to translate in your head? You try to talk,",
        "textdich": ""
    },
    {
        "start": 9.28,
        "end": 20.32,
        "text": "but your mind goes blank. Words don't come. You know the words, but they hide when you need them. You feel slow, shy,",
        "textdich": ""
    },
    {
        "start": 17.92,
        "end": 28.56,
        "text": "or lost. That's because you're still thinking in your own language. But what if I told you you can think in English",
        "textdich": ""
    },
    {
        "start": 25.6,
        "end": 30.96,
        "text": "naturally, even if you are a beginner?",
        "textdich": ""
    },
    {
        "start": 28.56,
        "end": 39.76,
        "text": "And when you can think in English, you can speak it. This video will show you exactly how. I will guide you step by",
        "textdich": ""
    },
    {
        "start": 36.64,
        "end": 48.32,
        "text": "step just like I learned. You don't need to be perfect. You just need to begin below. Do you have this problem too?",
        "textdich": ""
    },
    {
        "start": 45.2,
        "end": 53.28,
        "text": "Comment yes below. Let's learn together now. Let's start.",
        "textdich": ""
    },
    {
        "start": 51.2,
        "end": 55.44,
        "text": "Chapter 1.",
        "textdich": ""
    },
    {
        "start": 53.28,
        "end": 65.6,
        "text": "The real reason you can't think in English yet. I know this feeling. You know many English words. You watch videos. You read books. You write",
        "textdich": ""
    },
    {
        "start": 62.559,
        "end": 75.68,
        "text": "sometimes. But when it's time to speak, your mind becomes empty. You try to say something but the words do not come. You",
        "textdich": ""
    },
    {
        "start": 72.96,
        "end": 85.6,
        "text": "feel slow. You feel blocked and you wonder why can't I think in English? I had the same problem. I studied English.",
        "textdich": ""
    },
    {
        "start": 82.72,
        "end": 94.079,
        "text": "I knew grammar. I could write small essays in school. But still when someone asked me a question in English, I stayed",
        "textdich": ""
    },
    {
        "start": 91.68,
        "end": 105.2,
        "text": "silent. I tried to understand their words. Then I tried to translate my answer. I thought in my language. Then I searched for English words. But by the",
        "textdich": ""
    },
    {
        "start": 102.479,
        "end": 113.04,
        "text": "time I found the right word, the moment was gone. I felt stupid. I felt ashamed.",
        "textdich": ""
    },
    {
        "start": 110.0,
        "end": 116.24,
        "text": "I thought maybe I was not smart enough.",
        "textdich": ""
    },
    {
        "start": 113.04,
        "end": 128.239,
        "text": "Maybe English was too hard for me. But that was not true. The real problem was not me and it's not you. The real problem is habit. You have a strong",
        "textdich": ""
    },
    {
        "start": 126.479,
        "end": 137.2,
        "text": "habit of thinking in your first language. This habit is not bad. It's normal. Your brain wants to feel safe.",
        "textdich": ""
    },
    {
        "start": 134.16,
        "end": 139.04,
        "text": "So it uses the language it knows best.",
        "textdich": ""
    },
    {
        "start": 137.2,
        "end": 148.319,
        "text": "That's why you think in your language first and then try to translate into English. But translation is slow. It is",
        "textdich": ""
    },
    {
        "start": 145.04,
        "end": 155.599,
        "text": "not natural. It breaks your fluency. It steals your confidence. So if you want to speak English easily, you must build",
        "textdich": ""
    },
    {
        "start": 153.04,
        "end": 165.92,
        "text": "a new habit. The habit of thinking in English. This is the truth no one told me. I thought I had to learn more grammar. I thought I needed 10,000 more",
        "textdich": ""
    },
    {
        "start": 162.48,
        "end": 175.28,
        "text": "words. But no, I needed to train my brain to stay in English even with just a few words, even with short thoughts.",
        "textdich": ""
    },
    {
        "start": 172.319,
        "end": 183.92,
        "text": "Let me take you back to one day. I was sitting in class. The teacher asked me a question in English. It was easy, just",
        "textdich": ""
    },
    {
        "start": 180.56,
        "end": 195.68,
        "text": "one line. But I could not answer. My heart was beating fast. I looked down. I wanted to disappear. After class, I cried. I told myself, \"You know the",
        "textdich": ""
    },
    {
        "start": 192.48,
        "end": 205.599,
        "text": "answer, but you couldn't say it. Why?\" That evening, I sat alone. I closed my eyes. I asked myself again, why can't I",
        "textdich": ""
    },
    {
        "start": 202.08,
        "end": 211.12,
        "text": "speak? And then I realized, I never think in English. I only study English.",
        "textdich": ""
    },
    {
        "start": 208.48,
        "end": 219.76,
        "text": "I only read English. I never live with it. I never talk to myself in English. I never make small thoughts in English.",
        "textdich": ""
    },
    {
        "start": 216.799,
        "end": 233.12,
        "text": "That night, I decided to try something new. I looked at my table. I said, \"This is a table.\" I looked at the wall. I",
        "textdich": ""
    },
    {
        "start": 228.56,
        "end": 239.2,
        "text": "said that is a wall. I saw my hand. I said my hand is cold. It felt strange.",
        "textdich": ""
    },
    {
        "start": 236.48,
        "end": 242.64,
        "text": "It felt funny. But I kept doing it.",
        "textdich": ""
    },
    {
        "start": 239.2,
        "end": 252.799,
        "text": "Every day I said 10 small sentences only in my mind. No writing, no speaking, just thinking. And something changed.",
        "textdich": ""
    },
    {
        "start": 249.439,
        "end": 260.799,
        "text": "After one week, my mind was faster. I could say easy things quickly. After a month, I was thinking in English before",
        "textdich": ""
    },
    {
        "start": 258.16,
        "end": 272.16,
        "text": "I knew it. I saw a dog and thought, \"It's cute.\" I felt hungry and thought, \"I want food.\" These were not big thoughts, but they were mine in English.",
        "textdich": ""
    },
    {
        "start": 269.84,
        "end": 281.68,
        "text": "That is the real way. You don't need perfect grammar. You don't need 10,000 words. You need small real thoughts in",
        "textdich": ""
    },
    {
        "start": 278.4,
        "end": 292.56,
        "text": "English. This is how you start. This is how you become free. I will guide you step by step. You will learn how to think in English slowly, softly, with",
        "textdich": ""
    },
    {
        "start": 290.08,
        "end": 303.199,
        "text": "love. It's not your memory. It's not your intelligence. It's your habit. And we are going to change that habit together.",
        "textdich": ""
    },
    {
        "start": 300.56,
        "end": 310.8,
        "text": "Now, let's go to chapter 2. You will learn how to use your brain's secret power, pictures, instead of words, and",
        "textdich": ""
    },
    {
        "start": 308.4,
        "end": 316.08,
        "text": "your thinking will become faster without translation.",
        "textdich": ""
    },
    {
        "start": 312.479,
        "end": 324.56,
        "text": "Chapter 2. Think in pictures, not in words. When I was a child, I learned to speak my first language without a book.",
        "textdich": ""
    },
    {
        "start": 321.919,
        "end": 333.68,
        "text": "I did not learn grammar rules. I did not study vocabulary lists. I saw things. I felt things. I wanted things. And slowly",
        "textdich": ""
    },
    {
        "start": 331.039,
        "end": 344.32,
        "text": "I started saying words. I saw my mother and said mama. I saw a ball and said ball. My brain used pictures. And from",
        "textdich": ""
    },
    {
        "start": 340.479,
        "end": 346.639,
        "text": "pictures came words, not the other way.",
        "textdich": ""
    },
    {
        "start": 344.32,
        "end": 358.32,
        "text": "But when I started learning English, everything was different. I saw a word like apple. The teacher said apple means seb. So my brain made a connection",
        "textdich": ""
    },
    {
        "start": 355.68,
        "end": 361.84,
        "text": "English word to native word to picture.",
        "textdich": ""
    },
    {
        "start": 358.32,
        "end": 365.68,
        "text": "It was slow. It was extra work. And it made thinking in English very hard.",
        "textdich": ""
    },
    {
        "start": 364.4,
        "end": 376.56,
        "text": "That's when I learned something powerful. Your brain doesn't need translation. It needs connection. It needs pictures. The brain is very smart,",
        "textdich": ""
    },
    {
        "start": 373.759,
        "end": 385.28,
        "text": "but it's also very simple. It loves images. It remembers faces, colors, and shapes more than rules. So, if you want",
        "textdich": ""
    },
    {
        "start": 382.639,
        "end": 394.88,
        "text": "to think in English faster, you must stop translating into your language. You must go straight from English to picture. Let me give you an example.",
        "textdich": ""
    },
    {
        "start": 392.16,
        "end": 404.16,
        "text": "Look at your hand. Do you say hot first then hand? No, you just say hand. The picture is already there. Now look at",
        "textdich": ""
    },
    {
        "start": 400.319,
        "end": 412.08,
        "text": "the door. Just say door. Don't think of the word in your language. Just look.",
        "textdich": ""
    },
    {
        "start": 407.759,
        "end": 421.919,
        "text": "Just feel. Just say it in English. I use this trick every day. I picked five things in my room. A book, a pen, a",
        "textdich": ""
    },
    {
        "start": 417.759,
        "end": 435.44,
        "text": "chair, a fan, a bottle. I looked at each one and I said the English word slowly, softly, like I was a baby again. book, pen, chair, fan, bottle. No",
        "textdich": ""
    },
    {
        "start": 432.0,
        "end": 439.039,
        "text": "translation, only picture to English.",
        "textdich": ""
    },
    {
        "start": 435.44,
        "end": 445.759,
        "text": "After one week, I added more. Red book, blue pen, big chair. I added feelings.",
        "textdich": ""
    },
    {
        "start": 443.039,
        "end": 451.759,
        "text": "Cold fan, empty bottle. My brain started to love it. It felt light. It felt easy.",
        "textdich": ""
    },
    {
        "start": 449.599,
        "end": 454.72,
        "text": "Because I stopped using my old language.",
        "textdich": ""
    },
    {
        "start": 451.759,
        "end": 460.0,
        "text": "I was building a new road in my mind. A road of English. You can do this too.",
        "textdich": ""
    },
    {
        "start": 457.919,
        "end": 469.599,
        "text": "Right now, look around you. Pick one object. Say it in English. Then close your eyes. See the object in your mind.",
        "textdich": ""
    },
    {
        "start": 466.72,
        "end": 482.08,
        "text": "Say the word again. Do this again and again. Your brain will listen. Your brain will change. And when you hear someone say apple, your brain will see",
        "textdich": ""
    },
    {
        "start": 478.24,
        "end": 490.879,
        "text": "an apple, not the word CB. This is freedom. This is fluency. This is the beginning of thinking in English.",
        "textdich": ""
    },
    {
        "start": 487.759,
        "end": 500.479,
        "text": "Sometimes I used pictures on my phone. I downloaded apps with flashcards. They showed me photos with English words. No",
        "textdich": ""
    },
    {
        "start": 496.56,
        "end": 505.039,
        "text": "translation, just image and English.",
        "textdich": ""
    },
    {
        "start": 500.479,
        "end": 517.039,
        "text": "Tree, river, mountain, laugh, cry. It helped me think faster. I stopped needing to remember two languages. I started living in one. And one day I was",
        "textdich": ""
    },
    {
        "start": 513.12,
        "end": 528.399,
        "text": "walking outside. I saw a flower. I didn't think of the word in my first language. I just smiled and thought, \"Beautiful flower.\" That moment made me",
        "textdich": ""
    },
    {
        "start": 524.8,
        "end": 536.48,
        "text": "proud. It was small, but to me it was big. It meant my brain had changed. It meant English was becoming natural. You",
        "textdich": ""
    },
    {
        "start": 534.32,
        "end": 546.32,
        "text": "don't need to be perfect. You don't need to remember every word. Just practice this every day. Look, feel, say, picture",
        "textdich": ""
    },
    {
        "start": 542.56,
        "end": 548.8,
        "text": "to English. No translation, no stress.",
        "textdich": ""
    },
    {
        "start": 546.32,
        "end": 559.04,
        "text": "You are building a new home inside your mind. A home where English lives. A home where thoughts are light, simple, and",
        "textdich": ""
    },
    {
        "start": 555.6,
        "end": 568.56,
        "text": "true. Now, in the next chapter, I will show you how to start thinking in English with tiny sentences. This step will help you move from just words to",
        "textdich": ""
    },
    {
        "start": 566.08,
        "end": 576.08,
        "text": "real thoughts. Thoughts that stay in your brain. Thoughts that become speech.",
        "textdich": ""
    },
    {
        "start": 571.519,
        "end": 579.279,
        "text": "Let's keep going. You are doing great.",
        "textdich": ""
    },
    {
        "start": 576.08,
        "end": 584.0,
        "text": "Chapter 3. Start thinking in English with tiny sentences.",
        "textdich": ""
    },
    {
        "start": 581.519,
        "end": 595.12,
        "text": "After I learned to think in pictures, something was still missing. I could say words like pen, book, table. But I couldn't think in full ideas. My",
        "textdich": ""
    },
    {
        "start": 592.56,
        "end": 604.399,
        "text": "thoughts were broken. I wanted to say more, but I didn't know how. That's when I realized I needed to make tiny English",
        "textdich": ""
    },
    {
        "start": 600.48,
        "end": 614.72,
        "text": "sentences. Not long, not hard, just small, simple, honest sentences from my mind. I remember my first one. It was",
        "textdich": ""
    },
    {
        "start": 610.56,
        "end": 622.88,
        "text": "this. I am tired. It was a normal day. I came home from school. My body was heavy. I wanted to sleep. And suddenly,",
        "textdich": ""
    },
    {
        "start": 620.72,
        "end": 636.56,
        "text": "instead of saying it in my language, I whispered, \"I am tired.\" I felt something new. It was not just a sentence. It was my feeling in English.",
        "textdich": ""
    },
    {
        "start": 632.399,
        "end": 644.399,
        "text": "After that, I tried more. It is hot. I am hungry. This is my book. These were baby sentences, but to me, they were",
        "textdich": ""
    },
    {
        "start": 642.24,
        "end": 653.44,
        "text": "magic because they were real thoughts in English. Not grammar rules, not test answers, just me thinking in a new way.",
        "textdich": ""
    },
    {
        "start": 649.92,
        "end": 664.0,
        "text": "So, I made a small plan. Every day I told myself I would think five tiny English sentences. That's all. Just five. I didn't write them. I didn't say",
        "textdich": ""
    },
    {
        "start": 661.519,
        "end": 673.92,
        "text": "them out loud. I just thought them while walking, while eating, while brushing my teeth. Here are some of my early ones. I",
        "textdich": ""
    },
    {
        "start": 670.079,
        "end": 681.76,
        "text": "see a bird. My hands are cold. She is talking. The sky is blue. I want water.",
        "textdich": ""
    },
    {
        "start": 678.399,
        "end": 684.48,
        "text": "These were small, but they were true.",
        "textdich": ""
    },
    {
        "start": 681.76,
        "end": 686.88,
        "text": "They helped me feel closer to English.",
        "textdich": ""
    },
    {
        "start": 684.48,
        "end": 696.24,
        "text": "Like English was not outside me, it was inside me. And when I made mistakes, I didn't stop. Sometimes I said, \"He are",
        "textdich": ""
    },
    {
        "start": 693.6,
        "end": 699.76,
        "text": "walking.\" Then I caught it and changed.",
        "textdich": ""
    },
    {
        "start": 696.24,
        "end": 712.8,
        "text": "He is walking. That little correction helped me remember. My brain was learning by itself, not by a book, not by a test, but by thinking real life in",
        "textdich": ""
    },
    {
        "start": 709.12,
        "end": 716.079,
        "text": "English. You can do this too right now.",
        "textdich": ""
    },
    {
        "start": 712.8,
        "end": 718.959,
        "text": "Look around. Say something in your mind.",
        "textdich": ""
    },
    {
        "start": 716.079,
        "end": 726.8,
        "text": "This is my phone. I like tea. My shoes are black. These thoughts are seeds. If you plant them every day, they will",
        "textdich": ""
    },
    {
        "start": 724.32,
        "end": 735.36,
        "text": "grow. And soon your English will grow, too. Sometimes I even made a game. I would walk around my room and describe",
        "textdich": ""
    },
    {
        "start": 732.16,
        "end": 741.36,
        "text": "everything I saw. This is a chair. The chair is brown. The brown chair is soft.",
        "textdich": ""
    },
    {
        "start": 739.12,
        "end": 751.68,
        "text": "I kept building the sentence little by little from three words to four, from four to five. It was fun. It was real.",
        "textdich": ""
    },
    {
        "start": 748.8,
        "end": 761.6,
        "text": "These tiny sentences gave me power. I didn't need big grammar. I didn't need difficult words. I just needed truth in",
        "textdich": ""
    },
    {
        "start": 757.12,
        "end": 764.56,
        "text": "simple form. And that's what fluency is.",
        "textdich": ""
    },
    {
        "start": 761.6,
        "end": 773.6,
        "text": "Not speaking fast, not sounding perfect, but saying what you feel, what you see, what you want to yourself in English.",
        "textdich": ""
    },
    {
        "start": 770.56,
        "end": 787.279,
        "text": "Some days I felt lazy. Some days my brain didn't want to in English. That's okay. I still tried one sentence, just one. Even that helped. One is better",
        "textdich": ""
    },
    {
        "start": 784.079,
        "end": 796.24,
        "text": "than zero. I told this to myself often and I want you to remember it too. Maybe today your sentence is I don't know much",
        "textdich": ""
    },
    {
        "start": 792.8,
        "end": 804.48,
        "text": "English. That's okay. Tomorrow it will be I am learning English. One day it will be I can speak English now. All",
        "textdich": ""
    },
    {
        "start": 801.92,
        "end": 807.519,
        "text": "because you started with tiny thoughts.",
        "textdich": ""
    },
    {
        "start": 804.48,
        "end": 814.88,
        "text": "Now in the next chapter I will share my favorite method of all. How I talk to myself in my brain like I was speaking",
        "textdich": ""
    },
    {
        "start": 812.0,
        "end": 823.839,
        "text": "to a real person. It's a secret that helped me when I had no one to practice English with. You don't want to miss it.",
        "textdich": ""
    },
    {
        "start": 821.12,
        "end": 830.16,
        "text": "Let's move forward together. You are doing better than you think. Chapter 4.",
        "textdich": ""
    },
    {
        "start": 828.16,
        "end": 838.079,
        "text": "Talk in your brain like it's a real person. I was alone in my room. I had no one to practice English with. My friends",
        "textdich": ""
    },
    {
        "start": 835.6,
        "end": 846.959,
        "text": "were busy. My parents didn't speak English. I felt stuck. I had all these words in my head, but no one to talk to.",
        "textdich": ""
    },
    {
        "start": 844.24,
        "end": 848.8,
        "text": "I wanted to speak, but who would listen?",
        "textdich": ""
    },
    {
        "start": 846.959,
        "end": 857.12,
        "text": "That's when I discovered something that changed my life. I started talking to myself in English, not out loud, not for",
        "textdich": ""
    },
    {
        "start": 854.56,
        "end": 866.8,
        "text": "anyone else, just in my brain, like a little conversation was happening inside me. At first, it felt strange. I asked",
        "textdich": ""
    },
    {
        "start": 862.959,
        "end": 869.68,
        "text": "myself a question. Then I answered.",
        "textdich": ""
    },
    {
        "start": 866.8,
        "end": 878.959,
        "text": "It was quiet. It was simple, but it worked. I would say things like, \"How are you?\" \"I'm fine.\" \"Just tired.\" What",
        "textdich": ""
    },
    {
        "start": 876.079,
        "end": 885.279,
        "text": "did you eat? I ate rice and chicken. Did you like it? Yes, it was very good.",
        "textdich": ""
    },
    {
        "start": 882.8,
        "end": 891.04,
        "text": "These were not perfect sentences, but they were mine and they were in English.",
        "textdich": ""
    },
    {
        "start": 888.0,
        "end": 899.68,
        "text": "It became a habit. When I was walking, I asked myself, \"Where am I going?\" I answered, \"To the shop.\" Then I asked,",
        "textdich": ""
    },
    {
        "start": 896.88,
        "end": 907.12,
        "text": "\"What will I buy?\" And I said, \"Some bread and milk.\" This simple brain talk made English feel close to me. I wasn't",
        "textdich": ""
    },
    {
        "start": 904.88,
        "end": 920.32,
        "text": "waiting for someone else. I was my own practice partner. My mind became my classroom. My thoughts became my teacher. You can do this too. You don't",
        "textdich": ""
    },
    {
        "start": 916.48,
        "end": 923.04,
        "text": "need books. You don't need internet.",
        "textdich": ""
    },
    {
        "start": 920.32,
        "end": 925.76,
        "text": "You just need one thing, your mind.",
        "textdich": ""
    },
    {
        "start": 923.04,
        "end": 927.92,
        "text": "Start asking yourself easy questions.",
        "textdich": ""
    },
    {
        "start": 925.76,
        "end": 932.8,
        "text": "Answer with easy words. Don't worry about grammar. Don't try to be fast.",
        "textdich": ""
    },
    {
        "start": 930.32,
        "end": 937.76,
        "text": "Just talk to yourself like a friend. If you don't know what to say, try this.",
        "textdich": ""
    },
    {
        "start": 935.199,
        "end": 946.72,
        "text": "Ask, \"What time is it?\" Answer, \"It's 8:00.\" Ask, \"What's the weather?\" Answer, \"It's hot and sunny.\" Ask, \"How",
        "textdich": ""
    },
    {
        "start": 943.199,
        "end": 950.639,
        "text": "do I feel?\" Answer, \"I feel happy.\" Now, you are not just thinking in English.",
        "textdich": ""
    },
    {
        "start": 948.639,
        "end": 960.16,
        "text": "You are talking in English inside your brain. That's powerful. That's how fluency starts. Sometimes I even use this brain talk to tell stories. I would",
        "textdich": ""
    },
    {
        "start": 958.48,
        "end": 970.0,
        "text": "imagine I was talking to someone about my day. Today I went to the market. I saw a dog. It was barking. I bought",
        "textdich": ""
    },
    {
        "start": 966.399,
        "end": 978.48,
        "text": "bananas. They were yellow and sweet. My brain was telling little stories in English. I was building my fluency without a partner. One day I was on a",
        "textdich": ""
    },
    {
        "start": 976.079,
        "end": 987.36,
        "text": "bus. I looked outside and said in my mind, \"There is a man walking. He has a red shirt. He looks tired.\" No one heard",
        "textdich": ""
    },
    {
        "start": 984.88,
        "end": 995.839,
        "text": "me, but I smiled because I was speaking English in my brain without fear. This kind of practice helped me in real",
        "textdich": ""
    },
    {
        "start": 993.199,
        "end": 1003.36,
        "text": "conversations because when someone spoke to me, my brain was ready. I had already practiced many small answers. I had",
        "textdich": ""
    },
    {
        "start": 1001.12,
        "end": 1005.759,
        "text": "already played with simple questions.",
        "textdich": ""
    },
    {
        "start": 1003.36,
        "end": 1014.8,
        "text": "So, I didn't freeze. I could respond slowly but clearly. You don't need to be shy when you talk to yourself. No one",
        "textdich": ""
    },
    {
        "start": 1011.68,
        "end": 1023.6,
        "text": "will laugh. No one will correct you. You are safe. You are learning. You are growing. This is your private practice.",
        "textdich": ""
    },
    {
        "start": 1020.16,
        "end": 1034.4,
        "text": "and it works. So tonight when you are brushing your teeth, try it. Ask yourself, did I do well today?",
        "textdich": ""
    },
    {
        "start": 1030.799,
        "end": 1042.64,
        "text": "Answer, yes, I learned English. I practiced. That one small conversation is the beginning of fluency.",
        "textdich": ""
    },
    {
        "start": 1039.76,
        "end": 1052.32,
        "text": "Now, in the next chapter, I'll show you how I slowly started to replace my native words with English words step by step. This helped my brain stay in",
        "textdich": ""
    },
    {
        "start": 1050.08,
        "end": 1065.2,
        "text": "English longer. It made me feel like English was part of my real life. Let's keep walking this path together. One thought at a time. Chapter 5. Replace",
        "textdich": ""
    },
    {
        "start": 1061.84,
        "end": 1067.919,
        "text": "your native words with English words.",
        "textdich": ""
    },
    {
        "start": 1065.2,
        "end": 1076.24,
        "text": "Slowly. I remember one day I was in the kitchen. My mom asked me to pass the salt. In my mind, I said the word in my",
        "textdich": ""
    },
    {
        "start": 1073.44,
        "end": 1081.6,
        "text": "language. Then I thought, wait, what's salt in English?",
        "textdich": ""
    },
    {
        "start": 1078.08,
        "end": 1090.24,
        "text": "It took me a few seconds. Then I said, \"Salt.\" That was the moment I realized something important. I was still thinking in my",
        "textdich": ""
    },
    {
        "start": 1087.84,
        "end": 1099.919,
        "text": "native language first, then trying to find the English word. This was slowing me down. It was making my brain work too",
        "textdich": ""
    },
    {
        "start": 1096.16,
        "end": 1103.12,
        "text": "hard. I had to stop the translation.",
        "textdich": ""
    },
    {
        "start": 1099.919,
        "end": 1115.6,
        "text": "But how? Not by force. Not at all at once. I didn't try to change my brain in one day. That would be too hard. I started slowly, one word at a time. I",
        "textdich": ""
    },
    {
        "start": 1112.4,
        "end": 1125.919,
        "text": "picked easy words I used every day, like book, water, pen, bag. Every time I saw them, I said the word in English in my",
        "textdich": ""
    },
    {
        "start": 1122.799,
        "end": 1134.96,
        "text": "mind. I replaced the word in my language with the English word. When I saw water, I didn't think pawnie. I trained my",
        "textdich": ""
    },
    {
        "start": 1132.16,
        "end": 1142.96,
        "text": "brain to just say water. When I looked at the door, I said door, not darwaza, just door. It felt strange at first. My",
        "textdich": ""
    },
    {
        "start": 1140.559,
        "end": 1152.64,
        "text": "brain wanted to go back to my old words, but I was gentle. I didn't fight. I just repeated again and again. And slowly,",
        "textdich": ""
    },
    {
        "start": 1150.08,
        "end": 1167.2,
        "text": "the English words became normal. They became mine. Afterwards, I moved to small actions. I started using English for things I do every day, like I open",
        "textdich": ""
    },
    {
        "start": 1162.799,
        "end": 1175.12,
        "text": "the door. I eat rice. I wear my shoes. I wash my hands. Every time I did these things, I said them in English.",
        "textdich": ""
    },
    {
        "start": 1172.799,
        "end": 1181.28,
        "text": "Sometimes out loud, sometimes in my mind. I didn't care if anyone heard.",
        "textdich": ""
    },
    {
        "start": 1178.72,
        "end": 1193.679,
        "text": "This was my training. Then came feelings. Feelings are deep. They stay in the heart. But I wanted to feel them in English, too. So, I started small. I",
        "textdich": ""
    },
    {
        "start": 1189.52,
        "end": 1196.08,
        "text": "am tired. I am happy. I feel cold.",
        "textdich": ""
    },
    {
        "start": 1193.679,
        "end": 1198.08,
        "text": "I miss my friend.",
        "textdich": ""
    },
    {
        "start": 1196.08,
        "end": 1205.76,
        "text": "These thoughts became part of me and I stopped needing my old language for them. They lived in English now. Some",
        "textdich": ""
    },
    {
        "start": 1203.2,
        "end": 1217.52,
        "text": "days my brain forgot. It used my native words again. That's okay. I smiled and corrected myself. No, not that word. Use",
        "textdich": ""
    },
    {
        "start": 1214.32,
        "end": 1225.919,
        "text": "the English one. No anger, no pressure, just a quiet reminder like teaching a child with love. You can do this too.",
        "textdich": ""
    },
    {
        "start": 1223.12,
        "end": 1234.64,
        "text": "Start today. Choose five simple things around you. Say them in English every time you see them. Don't worry if you",
        "textdich": ""
    },
    {
        "start": 1230.799,
        "end": 1241.44,
        "text": "forget. Just try again. Over time, your brain will build a new habit, a new system, a new way of thinking. Here's a",
        "textdich": ""
    },
    {
        "start": 1238.88,
        "end": 1250.4,
        "text": "trick I used. I made little paper tags and wrote English words on them. I put them on objects in my room. On the wall,",
        "textdich": ""
    },
    {
        "start": 1247.28,
        "end": 1256.88,
        "text": "I wrote wall. On the mirror, I wrote mirror. On the clock, I wrote clock.",
        "textdich": ""
    },
    {
        "start": 1254.08,
        "end": 1265.039,
        "text": "Every time I looked, I saw the English word. And slowly, I stopped needing the translation.",
        "textdich": ""
    },
    {
        "start": 1262.24,
        "end": 1278.72,
        "text": "Fluency is not about speaking fast. It's about thinking directly in English. That starts with small replacements. One word, then one sentence, then one",
        "textdich": ""
    },
    {
        "start": 1275.36,
        "end": 1285.44,
        "text": "feeling. And one day you'll realize your brain didn't use your first language at all. You'll say a full sentence in",
        "textdich": ""
    },
    {
        "start": 1282.88,
        "end": 1295.2,
        "text": "English and you won't even remember the old words. That's when you know your mind is changing. You are becoming fluent.",
        "textdich": ""
    },
    {
        "start": 1293.039,
        "end": 1307.52,
        "text": "In the next chapter, I'll share how I used my daily life to think more and more in English. You'll see how every moment, brushing, walking, eating, can",
        "textdich": ""
    },
    {
        "start": 1303.919,
        "end": 1314.4,
        "text": "help you grow. Let's keep going step by step, word by word.",
        "textdich": ""
    },
    {
        "start": 1310.64,
        "end": 1318.96,
        "text": "Chapter 6. How I used my daily life to think in English.",
        "textdich": ""
    },
    {
        "start": 1316.48,
        "end": 1326.559,
        "text": "One morning I was brushing my teeth. I looked in the mirror and a thought came to me in English. I am brushing my",
        "textdich": ""
    },
    {
        "start": 1322.96,
        "end": 1336.4,
        "text": "teeth. It was a simple sentence, but I smiled because that thought used to come in my own language. That day it came in",
        "textdich": ""
    },
    {
        "start": 1333.12,
        "end": 1345.12,
        "text": "English. That moment gave me hope. It showed me that even small daily actions could help me learn. After that, I made",
        "textdich": ""
    },
    {
        "start": 1341.84,
        "end": 1354.64,
        "text": "a decision. I would use my daily life to think in English. Not just study time, not just class time. Every moment of the",
        "textdich": ""
    },
    {
        "start": 1352.08,
        "end": 1363.28,
        "text": "day could be a chance to think. When I woke up, I said in my mind, I am waking up now. When I looked out the window, I",
        "textdich": ""
    },
    {
        "start": 1360.08,
        "end": 1377.36,
        "text": "said, the sky is blue. When I drank tea, I said, \"I like this tea. It is warm.\" These were my real thoughts, real feelings, not grammar practice, not",
        "textdich": ""
    },
    {
        "start": 1374.0,
        "end": 1382.4,
        "text": "vocabulary lists, just me living in English. It started to become a game.",
        "textdich": ""
    },
    {
        "start": 1380.72,
        "end": 1396.0,
        "text": "When I walked to school, I would describe what I saw. A red car, a boy with a bag, a tree with no leaves. These were small observations, but they made",
        "textdich": ""
    },
    {
        "start": 1392.88,
        "end": 1406.799,
        "text": "my brain active. English became part of my walk. When I stood in line, I used that waiting time. I looked around and made sentences in my head. She is",
        "textdich": ""
    },
    {
        "start": 1404.24,
        "end": 1419.36,
        "text": "talking on the phone. That child is crying. I think he is tired. Sometimes I guessed what people were thinking. He looks worried. Maybe she is going to",
        "textdich": ""
    },
    {
        "start": 1416.24,
        "end": 1430.96,
        "text": "work. It was fun and it trained my thinking. When I cooked with my mom, I said the steps in English. I cut the onions. I put oil in the pan. Now I stir",
        "textdich": ""
    },
    {
        "start": 1428.559,
        "end": 1439.76,
        "text": "the rice. The smells and the actions helped the words stick in my brain. I didn't even need to memorize them. I was",
        "textdich": ""
    },
    {
        "start": 1436.72,
        "end": 1450.32,
        "text": "living them. At night, I did the same. I am lying down now. I feel sleepy. Today was a long day. These were my bedtime",
        "textdich": ""
    },
    {
        "start": 1446.559,
        "end": 1458.96,
        "text": "thoughts in English. Slowly, my brain started to prefer English for small things. I didn't push it. I didn't force",
        "textdich": ""
    },
    {
        "start": 1455.52,
        "end": 1468.48,
        "text": "it. I just opened the door. An English walked in. You can do this, too. Don't wait for the perfect moment. Use your",
        "textdich": ""
    },
    {
        "start": 1465.12,
        "end": 1474.88,
        "text": "real life, your toothbrush, your food, your shoes, your steps, your feelings.",
        "textdich": ""
    },
    {
        "start": 1472.08,
        "end": 1483.279,
        "text": "They are all English practice. Here's something I did that helped a lot. I set one hour each day as English time.",
        "textdich": ""
    },
    {
        "start": 1480.64,
        "end": 1489.039,
        "text": "During that hour, I told myself no thinking in my language, only English.",
        "textdich": ""
    },
    {
        "start": 1485.6,
        "end": 1500.0,
        "text": "If I made mistakes, it was okay. If I forgot a word, I skipped it. I just tried to stay inside English, even for small thoughts. At first, it was hard.",
        "textdich": ""
    },
    {
        "start": 1497.76,
        "end": 1508.0,
        "text": "My brain wanted to run back to my old language, but I kept trying. And every day it got a little easier. You don't",
        "textdich": ""
    },
    {
        "start": 1505.679,
        "end": 1516.72,
        "text": "need books for this. You don't need a teacher. Your daily life is your teacher. Your actions are your lessons.",
        "textdich": ""
    },
    {
        "start": 1514.0,
        "end": 1526.0,
        "text": "Your thoughts are your homework. Even if you're doing something boring, washing dishes, folding clothes, walking alone.",
        "textdich": ""
    },
    {
        "start": 1522.32,
        "end": 1539.039,
        "text": "Use it. Think in English. Say something small. This plate is dirty. I fold the shirt. I am walking fast. These tiny moments are powerful. One day I was",
        "textdich": ""
    },
    {
        "start": 1537.279,
        "end": 1551.12,
        "text": "helping my younger brother tie his shoes. He asked me something in our language and without thinking I replied in English. Wait, let me help you. He",
        "textdich": ""
    },
    {
        "start": 1548.0,
        "end": 1554.0,
        "text": "looked surprised. I was surprised too.",
        "textdich": ""
    },
    {
        "start": 1551.12,
        "end": 1565.6,
        "text": "But it made me proud. My mind was now thinking English first. This is how fluency grows. Not in books, not in tests, but in life, in dishes, in",
        "textdich": ""
    },
    {
        "start": 1562.159,
        "end": 1573.039,
        "text": "traffic, in laughter, in quiet. Every moment is a seed. Plant it in English.",
        "textdich": ""
    },
    {
        "start": 1569.6,
        "end": 1580.96,
        "text": "Watch it grow. In the next chapter, I will tell you about one method that changed everything. Shadowing. It's how",
        "textdich": ""
    },
    {
        "start": 1578.159,
        "end": 1591.679,
        "text": "I copied native speakers and trained my brain to think and speak fast. You will love it. So, let's keep going. You are",
        "textdich": ""
    },
    {
        "start": 1587.679,
        "end": 1600.72,
        "text": "doing something amazing. Chapter 7. The secret power of shadowing to train the brain. I remember the first time I heard",
        "textdich": ""
    },
    {
        "start": 1597.84,
        "end": 1608.159,
        "text": "the word shadowing. I didn't understand what it meant. I thought, is it about shadows?",
        "textdich": ""
    },
    {
        "start": 1605.6,
        "end": 1616.88,
        "text": "But then I learned the truth and it changed my life. Shadowing is when you listen to a native speaker and then copy",
        "textdich": ""
    },
    {
        "start": 1613.76,
        "end": 1631.44,
        "text": "them out loud right away like an echo, like a shadow. At first, it felt strange. I played a short video. The speaker said, \"Hi, how are you?\" I",
        "textdich": ""
    },
    {
        "start": 1626.559,
        "end": 1644.96,
        "text": "paused, then I said, \"Hi, how are you?\" I tried to match their voice, their speed, even their emotion. It was hard, but it felt exciting. It felt real",
        "textdich": ""
    },
    {
        "start": 1640.96,
        "end": 1648.48,
        "text": "that day. I found something powerful.",
        "textdich": ""
    },
    {
        "start": 1644.96,
        "end": 1650.799,
        "text": "Shadowing was not just repeating words.",
        "textdich": ""
    },
    {
        "start": 1648.48,
        "end": 1656.799,
        "text": "It was training my brain to think in English. It helped me stop translating.",
        "textdich": ""
    },
    {
        "start": 1653.84,
        "end": 1670.0,
        "text": "It helped me speak faster. It helped me feel the rhythm of real English. I started small, just 5 minutes a day. I played a short video with slow, clear",
        "textdich": ""
    },
    {
        "start": 1665.44,
        "end": 1681.44,
        "text": "voices. I watched one line. I paused. I repeated. Automatic. You stopped thinking in your language. You just speak. I remember one morning I shadowed",
        "textdich": ""
    },
    {
        "start": 1677.84,
        "end": 1693.919,
        "text": "a short story. The speaker said, \"It was a sunny day.\" I said, \"It was a sunny day.\" Then they said, \"The birds were singing.\" I said, \"The birds were",
        "textdich": ""
    },
    {
        "start": 1690.64,
        "end": 1705.279,
        "text": "singing.\" My mouth felt slow at first, but with each sentence, I got faster and I smiled because I was speaking real English. Later that day, I walked",
        "textdich": ""
    },
    {
        "start": 1701.76,
        "end": 1714.799,
        "text": "outside. I saw the sun and in my mind, the sentence came, \"It's a sunny day.\" It came without thinking. That's the",
        "textdich": ""
    },
    {
        "start": 1711.52,
        "end": 1724.0,
        "text": "power of shadowing. It plants English in your brain deeply. Sometimes I walked around my room and shadowed. I listened",
        "textdich": ""
    },
    {
        "start": 1720.88,
        "end": 1726.399,
        "text": "to a podcast and I repeated the words.",
        "textdich": ""
    },
    {
        "start": 1724.0,
        "end": 1737.12,
        "text": "My voice followed their voice. My thoughts followed their thoughts. I didn't stop to understand every word. I didn't worry about grammar. I just",
        "textdich": ""
    },
    {
        "start": 1733.36,
        "end": 1740.399,
        "text": "copied like a child learning to speak.",
        "textdich": ""
    },
    {
        "start": 1737.12,
        "end": 1746.799,
        "text": "And guess what? One day, I didn't need the video. The words came by themselves.",
        "textdich": ""
    },
    {
        "start": 1744.08,
        "end": 1755.2,
        "text": "My brain remembered the phrases. My mouth knew the rhythm. I was thinking in English without trying. You can do this",
        "textdich": ""
    },
    {
        "start": 1752.159,
        "end": 1765.679,
        "text": "too. Start with a short clip, maybe 1 minute. Choose something easy. Maybe a cartoon. Maybe a story. Maybe a daily",
        "textdich": ""
    },
    {
        "start": 1761.6,
        "end": 1776.72,
        "text": "conversation. Listen, pause, repeat. Do it again. Feel the sound. Feel the sentence. Be the shadow. If you do this every day, even for 5 minutes, your",
        "textdich": ""
    },
    {
        "start": 1773.919,
        "end": 1784.559,
        "text": "fluency will grow. You will sound more natural. You will think faster. You will stop translating.",
        "textdich": ""
    },
    {
        "start": 1782.24,
        "end": 1794.559,
        "text": "Shadowing helped me feel like English was inside me. Not just a subject, not just a skill, but part of my voice, part",
        "textdich": ""
    },
    {
        "start": 1791.12,
        "end": 1803.76,
        "text": "of my life. Here's a tip. Don't only shadow words, shadow feelings. If the speaker is happy, you smile and speak",
        "textdich": ""
    },
    {
        "start": 1800.399,
        "end": 1813.84,
        "text": "with joy. If they are serious, you speak calmly. Match their tone. match their music. English is not only words, it's",
        "textdich": ""
    },
    {
        "start": 1810.559,
        "end": 1821.919,
        "text": "also emotion. Now, in the next chapter, I will tell you how I use listening to train my brain even more. I'll show you",
        "textdich": ""
    },
    {
        "start": 1819.2,
        "end": 1832.32,
        "text": "how not all listening is equal and how I used focused emotional listening to change the way I think. Let's keep going. Your voice is growing. Your",
        "textdich": ""
    },
    {
        "start": 1829.919,
        "end": 1835.039,
        "text": "English is coming alive.",
        "textdich": ""
    },
    {
        "start": 1832.32,
        "end": 1843.52,
        "text": "Chapter 8. listening that trains your brain to think in English. For a long time, I thought listening was easy. I",
        "textdich": ""
    },
    {
        "start": 1840.32,
        "end": 1846.72,
        "text": "played English songs. I watched movies.",
        "textdich": ""
    },
    {
        "start": 1843.52,
        "end": 1858.72,
        "text": "I heard words. But still, I couldn't speak. I couldn't think in English. I asked myself, why is my listening not working? Then I understood something",
        "textdich": ""
    },
    {
        "start": 1855.2,
        "end": 1870.08,
        "text": "important. Not all listening helps. Some listening goes in your ears and disappears. But some listening stays in your brain. It trains your thoughts.",
        "textdich": ""
    },
    {
        "start": 1866.96,
        "end": 1872.159,
        "text": "That is the kind of listening I needed.",
        "textdich": ""
    },
    {
        "start": 1870.08,
        "end": 1884.399,
        "text": "The first step was to listen with purpose. Before I listened just for fun, but now I listen to learn. I chose content that was slow, clear, and close",
        "textdich": ""
    },
    {
        "start": 1881.679,
        "end": 1893.6,
        "text": "to my level. I didn't try to understand everything. I just focused on how words were used. I listened again and again.",
        "textdich": ""
    },
    {
        "start": 1891.36,
        "end": 1906.799,
        "text": "One day I listened to a simple English podcast. The speaker said, \"Today I will go to the store.\" I paused. I repeated it in my mind. Then",
        "textdich": ""
    },
    {
        "start": 1904.64,
        "end": 1910.559,
        "text": "I played it again.",
        "textdich": ""
    },
    {
        "start": 1906.799,
        "end": 1919.76,
        "text": "This time I noticed the rhythm. Today I will go to the store. I copied the sound in my brain and slowly that sentence",
        "textdich": ""
    },
    {
        "start": 1916.88,
        "end": 1928.72,
        "text": "became mine. That night when I thought about my plans, the sentence came, \"Tomorrow I will go to school.\" It came",
        "textdich": ""
    },
    {
        "start": 1925.679,
        "end": 1936.799,
        "text": "naturally, not because I memorized it, but because I heard it many times. It entered my thoughts. This is the power",
        "textdich": ""
    },
    {
        "start": 1934.08,
        "end": 1948.0,
        "text": "of good listening. You don't just hear English, you feel it. You don't just understand, you remember. And most of all, you start to think in English. I",
        "textdich": ""
    },
    {
        "start": 1945.84,
        "end": 1956.96,
        "text": "made a habit. Every morning, I listened to one short English clip. I closed my eyes. I didn't read subtitles. I focused",
        "textdich": ""
    },
    {
        "start": 1953.919,
        "end": 1968.559,
        "text": "only on the voice. I tried to guess the meaning. I imagined the situation. I pictured the words. This kind of deep listening helped me think faster.",
        "textdich": ""
    },
    {
        "start": 1966.64,
        "end": 1980.48,
        "text": "In the evening, I played the same clip again. This time I spoke with it. I whispered the words with the speaker. I am going to cook dinner. I said it",
        "textdich": ""
    },
    {
        "start": 1977.039,
        "end": 1986.0,
        "text": "softly. I like to walk in the park. I said it with feeling. It was like music.",
        "textdich": ""
    },
    {
        "start": 1983.44,
        "end": 1996.159,
        "text": "My brain loved it. I learned a big secret. Repeating the same listening again and again is more powerful than always listening to something new. One",
        "textdich": ""
    },
    {
        "start": 1994.08,
        "end": 2007.44,
        "text": "clip five times is better than five clips one time. Repetition makes the sentence stay. And when it stays, you can think it, you can say it. Another",
        "textdich": ""
    },
    {
        "start": 2004.48,
        "end": 2017.12,
        "text": "secret, listen to what you love. If you love stories, listen to stories. If you love travel, find travel videos. If you",
        "textdich": ""
    },
    {
        "start": 2014.0,
        "end": 2019.039,
        "text": "like cooking, find recipes in English.",
        "textdich": ""
    },
    {
        "start": 2017.12,
        "end": 2029.519,
        "text": "Listening becomes stronger when your heart is interested because then your brain listens more deeply. Sometimes I didn't understand every word. That's",
        "textdich": ""
    },
    {
        "start": 2026.96,
        "end": 2043.279,
        "text": "okay. I focused on what I did understand. I felt the meaning. I followed the voice and slowly my understanding grew. One day I was",
        "textdich": ""
    },
    {
        "start": 2040.32,
        "end": 2046.64,
        "text": "walking and a phrase came into my mind.",
        "textdich": ""
    },
    {
        "start": 2043.279,
        "end": 2049.119,
        "text": "It's a beautiful day. I didn't plan it.",
        "textdich": ""
    },
    {
        "start": 2046.64,
        "end": 2058.159,
        "text": "I didn't study it. I had just heard it many times in songs, in shows, in videos. It lived inside me. Now, that's",
        "textdich": ""
    },
    {
        "start": 2055.76,
        "end": 2068.96,
        "text": "when I knew my listening was changing my brain. You can do this, too. Choose one voice, one video, one story. Listen",
        "textdich": ""
    },
    {
        "start": 2065.52,
        "end": 2083.679,
        "text": "every day, not with stress, but with love, with interest, with joy. Close your eyes, feel the rhythm, feel the words. Let them enter your thoughts. Now",
        "textdich": ""
    },
    {
        "start": 2081.2,
        "end": 2091.44,
        "text": "in the next chapter I will tell you how I stopped being afraid of speaking mistakes. This fear used to stop me from",
        "textdich": ""
    },
    {
        "start": 2089.04,
        "end": 2105.599,
        "text": "thinking in English. But once I beat that fear everything changed. Let's keep going. Your ears are ready. Your thoughts are stronger. English is",
        "textdich": ""
    },
    {
        "start": 2101.119,
        "end": 2111.119,
        "text": "becoming your voice. Chapter nine. How I stopped being afraid of speaking mistakes.",
        "textdich": ""
    },
    {
        "start": 2108.88,
        "end": 2118.88,
        "text": "In the beginning, I was always scared to speak, not because I didn't know the words, but because I was afraid of",
        "textdich": ""
    },
    {
        "start": 2115.28,
        "end": 2126.32,
        "text": "saying something wrong. I thought, what if they laugh at me? What if I make a mistake?",
        "textdich": ""
    },
    {
        "start": 2123.04,
        "end": 2136.96,
        "text": "So, I stayed quiet. I kept the words inside my head. Even when I wanted to speak, my mouth stayed shut. I listened.",
        "textdich": ""
    },
    {
        "start": 2133.359,
        "end": 2146.8,
        "text": "I nodded. I smiled. But inside, I was screaming. I wanted to talk. I wanted to be part of the group. But fear stopped",
        "textdich": ""
    },
    {
        "start": 2142.56,
        "end": 2156.64,
        "text": "me. Then one day something small changed my life. I was in class. The teacher asked a question. I knew the answer. I",
        "textdich": ""
    },
    {
        "start": 2153.44,
        "end": 2166.64,
        "text": "wanted to raise my hand. But again, fear came. My heart beat fast. My hands felt cold. But I didn't want to live like",
        "textdich": ""
    },
    {
        "start": 2163.04,
        "end": 2175.92,
        "text": "this anymore. So I said the sentence. I made a mistake, a small one. I said, \"He go to school instead of he goes to",
        "textdich": ""
    },
    {
        "start": 2172.72,
        "end": 2186.64,
        "text": "school.\" The class was quiet. Then the teacher smiled and said gently, almost correct, \"Try again.\" I tried again. He",
        "textdich": ""
    },
    {
        "start": 2182.72,
        "end": 2199.76,
        "text": "goes to school. She nodded, \"Good.\" And that was it. No one laughed, no one pointed, nothing bad happened. But inside me, something amazing happened.",
        "textdich": ""
    },
    {
        "start": 2195.92,
        "end": 2210.96,
        "text": "The fear got smaller. I felt proud. I had spoken even with a mistake and that gave me power. After that I allowed myself to speak more. I made many",
        "textdich": ""
    },
    {
        "start": 2208.32,
        "end": 2220.8,
        "text": "mistakes. I said the wrong tense. I forgot words. I used the wrong word. But I also learned. I listened to myself. I",
        "textdich": ""
    },
    {
        "start": 2218.079,
        "end": 2228.96,
        "text": "corrected myself. And the more I spoke, the more my fear disappeared. I realized something big.",
        "textdich": ""
    },
    {
        "start": 2225.599,
        "end": 2238.0,
        "text": "Mistakes are not the enemy. Fear is the enemy. And the only way to fight fear is to take small steps. I made a rule for",
        "textdich": ""
    },
    {
        "start": 2234.88,
        "end": 2249.52,
        "text": "myself. I said one mistake a day keeps the fear away. Every day I tried to say one sentence out loud. If I made a mistake, I smiled and corrected it. I",
        "textdich": ""
    },
    {
        "start": 2247.44,
        "end": 2258.4,
        "text": "treated it like a game, like a baby learning to walk. When a baby falls, no one laughs. They cheer. So I started to",
        "textdich": ""
    },
    {
        "start": 2255.04,
        "end": 2273.44,
        "text": "cheer for myself. I told myself, \"Good job. You tried. You spoke. That's success.\" And slowly my mind changed. I stopped thinking. What if I say it",
        "textdich": ""
    },
    {
        "start": 2269.2,
        "end": 2283.92,
        "text": "wrong? Instead, I started thinking, \"Let me try. Let me speak. Let me learn.\" You can do this, too. Don't hide from",
        "textdich": ""
    },
    {
        "start": 2280.4,
        "end": 2285.92,
        "text": "mistakes. Welcome them. Learn from them.",
        "textdich": ""
    },
    {
        "start": 2283.92,
        "end": 2295.2,
        "text": "They are your teachers. They show you where to grow. The more mistakes you make, the faster you learn. Speak to yourself. Speak to a friend. Speak to",
        "textdich": ""
    },
    {
        "start": 2292.96,
        "end": 2301.68,
        "text": "your phone. Speak in the mirror. It doesn't matter. What matters is this.",
        "textdich": ""
    },
    {
        "start": 2297.92,
        "end": 2310.64,
        "text": "You speak even if it's not perfect, especially when it's not perfect because perfection comes later. But courage must",
        "textdich": ""
    },
    {
        "start": 2307.44,
        "end": 2318.8,
        "text": "come now. In the next chapter, I will show you how I learned to think faster with fewer words. You don't need to say",
        "textdich": ""
    },
    {
        "start": 2316.0,
        "end": 2324.88,
        "text": "long sentences to be fluent. You just need to think clearly and speak simply.",
        "textdich": ""
    },
    {
        "start": 2322.16,
        "end": 2331.599,
        "text": "That's how real fluency begins. Keep going. You're doing so well.",
        "textdich": ""
    },
    {
        "start": 2328.32,
        "end": 2335.599,
        "text": "Chapter 10. How to think faster with fewer words.",
        "textdich": ""
    },
    {
        "start": 2334.0,
        "end": 2345.119,
        "text": "When I first started thinking in English, I thought I needed big words. I thought long sentences would make me sound smart. But that idea made",
        "textdich": ""
    },
    {
        "start": 2342.4,
        "end": 2357.04,
        "text": "everything harder. I waited too long to speak. I searched for difficult vocabulary. I tried to remember grammar rules. And in that waiting, I lost my",
        "textdich": ""
    },
    {
        "start": 2353.76,
        "end": 2370.64,
        "text": "chance. The moment to speak would pass and I stayed silent again. It made me feel slow and sad. But slowly I began to understand the truth.",
        "textdich": ""
    },
    {
        "start": 2366.88,
        "end": 2377.2,
        "text": "Fluency is not about saying more. It's about saying what you need clearly and simply.",
        "textdich": ""
    },
    {
        "start": 2374.96,
        "end": 2379.76,
        "text": "One day I was talking to a new friend.",
        "textdich": ""
    },
    {
        "start": 2377.2,
        "end": 2390.0,
        "text": "She was also learning English, but she spoke fast, not with big words, but with simple ones. She said things like, \"I",
        "textdich": ""
    },
    {
        "start": 2385.76,
        "end": 2399.359,
        "text": "like this. Let's go. It's okay.\" I was surprised. She didn't know many words, but she sounded confident. Her voice was",
        "textdich": ""
    },
    {
        "start": 2395.839,
        "end": 2404.16,
        "text": "soft. Her sentence is short, but I could feel her meaning.",
        "textdich": ""
    },
    {
        "start": 2401.52,
        "end": 2414.72,
        "text": "That day, I realized something important. You don't need big words to think fast. You need small words used often.",
        "textdich": ""
    },
    {
        "start": 2411.52,
        "end": 2420.4,
        "text": "I started to train my mind. I stopped trying to make perfect sentences.",
        "textdich": ""
    },
    {
        "start": 2417.44,
        "end": 2429.839,
        "text": "Instead, I made short ones. I said what I felt in three or four words. I don't know. This is good. I need help. These",
        "textdich": ""
    },
    {
        "start": 2427.52,
        "end": 2440.72,
        "text": "were not special words, but they were powerful. They helped me speak without fear. They helped me think fast and speak fast. The more I did this, the",
        "textdich": ""
    },
    {
        "start": 2437.52,
        "end": 2443.52,
        "text": "more natural it felt. I stopped waiting.",
        "textdich": ""
    },
    {
        "start": 2440.72,
        "end": 2455.28,
        "text": "I started talking. At night, I made a list of simple sentences. I read them again and again. What's this? Are you okay? That's fine. Thank you so much.",
        "textdich": ""
    },
    {
        "start": 2453.68,
        "end": 2462.72,
        "text": "These were my tools. These were my weapons against fear. I didn't need to memorize a hundred rules. I just needed",
        "textdich": ""
    },
    {
        "start": 2459.839,
        "end": 2471.359,
        "text": "to build my own English voice with few words said with meaning. I also began to watch how native speakers talked. I",
        "textdich": ""
    },
    {
        "start": 2468.88,
        "end": 2479.92,
        "text": "noticed something strange. They didn't always speak in full grammar. They used short forms. They said, \"Got to go. Want",
        "textdich": ""
    },
    {
        "start": 2476.8,
        "end": 2490.079,
        "text": "to eat?\" I don't know. It wasn't textbook English, but it was real. It was fast and it worked. I started to copy that style. I allowed myself to be",
        "textdich": ""
    },
    {
        "start": 2487.76,
        "end": 2501.92,
        "text": "natural. I let go of the fear of sounding wrong. I focused on being clear. One time I met a tourist who needed help. She asked me which way to",
        "textdich": ""
    },
    {
        "start": 2500.079,
        "end": 2504.88,
        "text": "the station.",
        "textdich": ""
    },
    {
        "start": 2501.92,
        "end": 2508.16,
        "text": "My heart beat fast, but I didn't freeze.",
        "textdich": ""
    },
    {
        "start": 2504.88,
        "end": 2511.76,
        "text": "I just said, \"Go straight, then right.",
        "textdich": ""
    },
    {
        "start": 2508.16,
        "end": 2522.079,
        "text": "That's all.\" She smiled and said, \"Thank you.\" In that moment, I felt proud. I didn't use fancy words. I didn't speak a",
        "textdich": ""
    },
    {
        "start": 2518.8,
        "end": 2526.24,
        "text": "long sentence, but I helped her. I used English, and that's what matters.",
        "textdich": ""
    },
    {
        "start": 2524.24,
        "end": 2533.68,
        "text": "Thinking fast doesn't mean speaking fast. It means your brain doesn't get stuck. It means your thoughts come in",
        "textdich": ""
    },
    {
        "start": 2530.8,
        "end": 2544.4,
        "text": "simple English without translation. That happens when you use fewer words but use them more often like yes, no, I think,",
        "textdich": ""
    },
    {
        "start": 2540.48,
        "end": 2553.04,
        "text": "maybe, I feel, I want. Let's go, come here. These are small tools that build your fluency every day. So now I invite",
        "textdich": ""
    },
    {
        "start": 2550.319,
        "end": 2561.92,
        "text": "you to speak simply. Talk to yourself with easy phrases. Let your mind think clearly. Don't wait for the perfect",
        "textdich": ""
    },
    {
        "start": 2558.079,
        "end": 2565.119,
        "text": "word. Use the word you know. Keep going.",
        "textdich": ""
    },
    {
        "start": 2561.92,
        "end": 2567.28,
        "text": "Keep speaking. Keep trusting yourself.",
        "textdich": ""
    },
    {
        "start": 2565.119,
        "end": 2575.52,
        "text": "In the next chapter, I'll show you how I created a special tool inside my brain, a mind map of English that helped me",
        "textdich": ""
    },
    {
        "start": 2572.88,
        "end": 2582.319,
        "text": "connect all these little words and build something strong. You'll love it.",
        "textdich": ""
    },
    {
        "start": 2578.96,
        "end": 2591.2,
        "text": "Chapter 11. Create a mind map of English inside you. When I started learning English, I felt like every word was",
        "textdich": ""
    },
    {
        "start": 2587.68,
        "end": 2599.52,
        "text": "alone. I learned one word today, another tomorrow, and another the next week. But they didn't connect. I knew apple, I",
        "textdich": ""
    },
    {
        "start": 2596.88,
        "end": 2606.64,
        "text": "knew eat, I knew morning, but I didn't know how to bring them together. It was like I had many puzzle pieces, but no",
        "textdich": ""
    },
    {
        "start": 2604.0,
        "end": 2612.24,
        "text": "picture to follow. That's when I decided to build something powerful in my mind.",
        "textdich": ""
    },
    {
        "start": 2608.96,
        "end": 2618.0,
        "text": "A map, a mind map, a place where English words were not strangers, but friends.",
        "textdich": ""
    },
    {
        "start": 2615.119,
        "end": 2630.319,
        "text": "At first, I started small. I picked one word I used every day. Apple. Then I asked myself, \"What can I say about this?\" I wrote, \"I eat an apple.\" Then",
        "textdich": ""
    },
    {
        "start": 2626.48,
        "end": 2632.24,
        "text": "the apple is red. Then I like apples.",
        "textdich": ""
    },
    {
        "start": 2630.319,
        "end": 2641.119,
        "text": "Just three little sentences. But they built a small area in my brain where the word apple lived with other useful words",
        "textdich": ""
    },
    {
        "start": 2636.88,
        "end": 2649.839,
        "text": "like eat, like read. This was the beginning of my mind map. The next day, I chose the word book. I said this is a",
        "textdich": ""
    },
    {
        "start": 2646.88,
        "end": 2651.92,
        "text": "book. I read the book. The book is new.",
        "textdich": ""
    },
    {
        "start": 2649.839,
        "end": 2663.119,
        "text": "Then I noticed something. I was using the word is again and the word the and I. These words were showing up again and",
        "textdich": ""
    },
    {
        "start": 2659.76,
        "end": 2668.0,
        "text": "again. They were bridges. They connected everything.",
        "textdich": ""
    },
    {
        "start": 2664.88,
        "end": 2670.16,
        "text": "Slowly I started to see the connections.",
        "textdich": ""
    },
    {
        "start": 2668.0,
        "end": 2680.64,
        "text": "My brain was not holding single words anymore. It was holding ideas, phrases, groups of meaning. I kept going one word",
        "textdich": ""
    },
    {
        "start": 2677.04,
        "end": 2691.28,
        "text": "at a time, one area at a time. I made small groups, food, clothes, feelings, places, actions. For example, under",
        "textdich": ""
    },
    {
        "start": 2687.2,
        "end": 2694.319,
        "text": "feelings, I put, \"I am happy. He is sad.",
        "textdich": ""
    },
    {
        "start": 2691.28,
        "end": 2703.2,
        "text": "She feels cold.\" Each sentence helped me remember not just the words, but how they fit together. I didn't memorize",
        "textdich": ""
    },
    {
        "start": 2699.28,
        "end": 2712.72,
        "text": "them. I lived them. I imagined myself saying them in real life. I could feel them inside me. After one month, I had",
        "textdich": ""
    },
    {
        "start": 2709.599,
        "end": 2721.92,
        "text": "many little areas in my brain. They were not messy. They were organized like a small city. Each word had neighbors.",
        "textdich": ""
    },
    {
        "start": 2719.2,
        "end": 2728.96,
        "text": "Each idea had a home. When I wanted to say something, I didn't feel lost. I just walked to that part of the map in",
        "textdich": ""
    },
    {
        "start": 2726.319,
        "end": 2738.96,
        "text": "my mind. I needed to say something about time. I went to the time street. Today is Tuesday. It's 5:00. I am late. It",
        "textdich": ""
    },
    {
        "start": 2736.16,
        "end": 2748.4,
        "text": "felt smooth. I didn't have to translate anymore. Sometimes I drew the map on paper, not like a real map, but like a",
        "textdich": ""
    },
    {
        "start": 2744.0,
        "end": 2751.44,
        "text": "web. In the middle, I put a word school.",
        "textdich": ""
    },
    {
        "start": 2748.4,
        "end": 2765.52,
        "text": "Then I made lines. One line said classroom, another teacher, another students, and another bag. Then more lines. I go to school. My teacher is",
        "textdich": ""
    },
    {
        "start": 2761.599,
        "end": 2774.64,
        "text": "nice. The classroom is big. I said the sentences. I saw the picture. I felt the meaning. This helped me think in English",
        "textdich": ""
    },
    {
        "start": 2771.839,
        "end": 2781.839,
        "text": "faster than ever before. You can make your own map. You don't need to write it down, but it helps. You can also close",
        "textdich": ""
    },
    {
        "start": 2779.28,
        "end": 2793.839,
        "text": "your eyes and imagine it. Think of one word, then ask, \"What can I say with this?\" Build small sentences. Find connecting words. Say them out loud. Say",
        "textdich": ""
    },
    {
        "start": 2790.88,
        "end": 2803.2,
        "text": "them in your mind. Then move to another word. Soon your brain will feel full, but not heavy. Full of living English.",
        "textdich": ""
    },
    {
        "start": 2800.4,
        "end": 2811.68,
        "text": "This map is your power. It's not a grammar book. It's not a test. It's your personal way of speaking and thinking.",
        "textdich": ""
    },
    {
        "start": 2809.119,
        "end": 2820.319,
        "text": "You are not just learning English. You are building it inside your mind word by word, sentence by sentence, emotion by",
        "textdich": ""
    },
    {
        "start": 2818.079,
        "end": 2829.119,
        "text": "emotion. And that is something to be proud of. In the next chapter, I'll show you how I use this map not just to",
        "textdich": ""
    },
    {
        "start": 2825.68,
        "end": 2836.8,
        "text": "think, but to feel in English. I'll tell you how I started using English when I was happy, sad, scared, or excited, and",
        "textdich": ""
    },
    {
        "start": 2834.56,
        "end": 2849.119,
        "text": "how those emotions made my English stronger. You are so close now. Keep going. Your mind is ready. Chapter 12.",
        "textdich": ""
    },
    {
        "start": 2845.04,
        "end": 2857.04,
        "text": "Use English to feel emotions. At first, English was just a subject for me. Just something I studied at school. I read",
        "textdich": ""
    },
    {
        "start": 2854.24,
        "end": 2871.119,
        "text": "books. I wrote answers. I tried to pass tests. But I never felt anything. The words were dry, cold. They didn't touch my heart. But one day, everything",
        "textdich": ""
    },
    {
        "start": 2867.359,
        "end": 2880.56,
        "text": "changed. I was walking home and I saw a little girl crying. I wanted to help her. In my own language, I thought she's",
        "textdich": ""
    },
    {
        "start": 2876.88,
        "end": 2892.88,
        "text": "sad. Then in English, something soft whispered inside me. She is sad. And for the first time, I felt emotion in",
        "textdich": ""
    },
    {
        "start": 2888.0,
        "end": 2901.839,
        "text": "English. It was real. It was alive. That moment taught me something big. English is not just rules and words. It's a",
        "textdich": ""
    },
    {
        "start": 2899.04,
        "end": 2910.4,
        "text": "language of feelings. And if I want to think in English deeply, I have to feel in English too. So I began practicing",
        "textdich": ""
    },
    {
        "start": 2907.119,
        "end": 2918.96,
        "text": "this every day. When I was happy, I said in my mind, I am happy. When I was tired, I whispered, \"I feel tired.\" When",
        "textdich": ""
    },
    {
        "start": 2916.64,
        "end": 2928.079,
        "text": "I was angry, I told myself, \"I am angry now.\" These words were simple, but they helped me connect English with real",
        "textdich": ""
    },
    {
        "start": 2923.839,
        "end": 2936.0,
        "text": "life. real thoughts, real heart. I also started watching English movies and shows, not just to learn words, but to",
        "textdich": ""
    },
    {
        "start": 2933.119,
        "end": 2946.96,
        "text": "see how people expressed emotions. When someone in a show said, \"I miss you,\" I didn't just hear it. I felt it. I imagined saying it to someone I love.",
        "textdich": ""
    },
    {
        "start": 2944.96,
        "end": 2954.8,
        "text": "When a character said, \"I'm so scared,\" I imagined myself in their place. My brain started to match English sentences",
        "textdich": ""
    },
    {
        "start": 2952.079,
        "end": 2966.079,
        "text": "with my own feelings and slowly my thoughts changed too. I didn't just think I am sad. I felt it in English.",
        "textdich": ""
    },
    {
        "start": 2962.48,
        "end": 2969.44,
        "text": "The emotion and the sentence became one.",
        "textdich": ""
    },
    {
        "start": 2966.079,
        "end": 2978.64,
        "text": "Music helped me too. I listened to slow English songs. Songs about love, loss, hope, dreams.",
        "textdich": ""
    },
    {
        "start": 2975.92,
        "end": 2988.079,
        "text": "I didn't always understand every word, but I felt the emotions and that was enough. I sang with the words. I closed",
        "textdich": ""
    },
    {
        "start": 2984.48,
        "end": 2995.119,
        "text": "my eyes. I imagined the meaning. One line made me cry. You are not alone.",
        "textdich": ""
    },
    {
        "start": 2992.16,
        "end": 3004.24,
        "text": "That simple sentence stayed with me. I wrote it down. I whispered it to myself on hard days. It became part of me. I",
        "textdich": ""
    },
    {
        "start": 3001.599,
        "end": 3016.319,
        "text": "started writing a small diary but not a diary of what I did, a diary of how I felt. Today I felt nervous. I am grateful. I want peace. These were my",
        "textdich": ""
    },
    {
        "start": 3014.0,
        "end": 3025.68,
        "text": "real feelings and I expressed them in English. Some days I only wrote one sentence, but it was honest. And every time I wrote how I felt in English, my",
        "textdich": ""
    },
    {
        "start": 3023.92,
        "end": 3037.2,
        "text": "heart grew stronger and so did my fluency. I learned that when you use English only with your brain, it stays outside you. But when you use English",
        "textdich": ""
    },
    {
        "start": 3033.92,
        "end": 3048.0,
        "text": "with your heart, it comes inside. It becomes part of your voice, your inner world. That is when fluency becomes real. That is when thinking in English",
        "textdich": ""
    },
    {
        "start": 3045.359,
        "end": 3057.52,
        "text": "becomes easy because it's no longer just about words. It's about you. So I invite you to feel in English. When you laugh,",
        "textdich": ""
    },
    {
        "start": 3054.64,
        "end": 3066.16,
        "text": "say, \"This is funny.\" When you feel peace, say, \"I feel calm.\" When you cry, say, \"I'm sad, but it's okay.\" Be gentle",
        "textdich": ""
    },
    {
        "start": 3063.92,
        "end": 3077.119,
        "text": "with your English. Let it hold your emotions. Let it walk with you in your happy and sad moments. That is how you build a deep connection. In the next",
        "textdich": ""
    },
    {
        "start": 3075.04,
        "end": 3084.559,
        "text": "chapter, I will show you how I use these thoughts and feelings to create a daily habit of writing my mind in simple",
        "textdich": ""
    },
    {
        "start": 3081.76,
        "end": 3095.52,
        "text": "English. This habit helped me think more clearly, more slowly, and with more power. You're almost there. Let's keep going together.",
        "textdich": ""
    },
    {
        "start": 3092.48,
        "end": 3108.079,
        "text": "Chapter 13. Write simple English thoughts every day. One evening, I was feeling confused. I had learned so many words. I had listened. I had spoken. I",
        "textdich": ""
    },
    {
        "start": 3106.079,
        "end": 3116.319,
        "text": "had thought in English. But still my mind felt heavy like there were too many thoughts inside all fighting for space.",
        "textdich": ""
    },
    {
        "start": 3113.28,
        "end": 3118.64,
        "text": "So I picked up a notebook. I opened it.",
        "textdich": ""
    },
    {
        "start": 3116.319,
        "end": 3128.4,
        "text": "I didn't plan anything. I just wrote one small sentence. I am tired. Then I looked at it. It was simple but it felt",
        "textdich": ""
    },
    {
        "start": 3124.559,
        "end": 3131.04,
        "text": "good. It felt real. So I wrote another.",
        "textdich": ""
    },
    {
        "start": 3128.4,
        "end": 3140.559,
        "text": "But I am learning. And then another. I want to keep going. That was the day I discovered the power of writing my thoughts in English. After that, I",
        "textdich": ""
    },
    {
        "start": 3138.4,
        "end": 3147.76,
        "text": "started writing every night, just one page, sometimes only two or three lines.",
        "textdich": ""
    },
    {
        "start": 3144.16,
        "end": 3150.4,
        "text": "But they were honest. Today, I felt shy.",
        "textdich": ""
    },
    {
        "start": 3147.76,
        "end": 3160.4,
        "text": "I talked to my teacher. It was hard to speak, but I tried. These small sentences were not for anyone else. They were just for me. A quiet space to",
        "textdich": ""
    },
    {
        "start": 3158.0,
        "end": 3169.68,
        "text": "practice my English. A place to listen to my mind. a place to feel my growth. I didn't care about grammar. I didn't care",
        "textdich": ""
    },
    {
        "start": 3167.119,
        "end": 3181.04,
        "text": "about spelling. I didn't try to be perfect. I just wrote what I really felt. I miss my friend. I laughed a lot today. I want to speak better. My",
        "textdich": ""
    },
    {
        "start": 3179.04,
        "end": 3191.119,
        "text": "English was not always right, but my feelings were true. And that truth helped my brain remember the words because those words were part of me now.",
        "textdich": ""
    },
    {
        "start": 3188.88,
        "end": 3195.28,
        "text": "Some nights I wrote about small things.",
        "textdich": ""
    },
    {
        "start": 3191.119,
        "end": 3205.599,
        "text": "It rained today. I saw a yellow bird. I ate too much rice. And from those small things, I built new ideas. I like rainy",
        "textdich": ""
    },
    {
        "start": 3201.839,
        "end": 3216.079,
        "text": "weather. Birds make me smile. Food makes me happy. These thoughts were like little windows. They helped me see the world in English. They helped me see",
        "textdich": ""
    },
    {
        "start": 3213.28,
        "end": 3220.079,
        "text": "myself in English. Writing gave me peace.",
        "textdich": ""
    },
    {
        "start": 3217.599,
        "end": 3229.68,
        "text": "When I wrote my thoughts in English, I felt lighter. I felt stronger. I felt more in control of my language. It was",
        "textdich": ""
    },
    {
        "start": 3226.64,
        "end": 3239.119,
        "text": "like speaking but slower, like thinking but clearer. And when I looked back at my old pages, I saw my progress. In the",
        "textdich": ""
    },
    {
        "start": 3236.64,
        "end": 3241.359,
        "text": "beginning, my sentences were short.",
        "textdich": ""
    },
    {
        "start": 3239.119,
        "end": 3249.119,
        "text": "Later, they grew longer. I added details. I used better words. I didn't even notice how much I had learned until",
        "textdich": ""
    },
    {
        "start": 3246.24,
        "end": 3260.64,
        "text": "I read it again. Sometimes I didn't know what to write. So I started with a question. How was my day? Or what do I want tomorrow? And the answer came",
        "textdich": ""
    },
    {
        "start": 3257.599,
        "end": 3266.96,
        "text": "slowly. Today was good. I finished my work. Tomorrow I want to practice more.",
        "textdich": ""
    },
    {
        "start": 3264.24,
        "end": 3274.96,
        "text": "It was like talking to a kind friend. A friend who always listened. A friend who helped me grow. You can start this habit",
        "textdich": ""
    },
    {
        "start": 3271.839,
        "end": 3277.359,
        "text": "too. You don't need a special notebook.",
        "textdich": ""
    },
    {
        "start": 3274.96,
        "end": 3287.52,
        "text": "You don't need perfect grammar. Just take two minutes, write one or two thoughts. I feel happy. I am learning English. I am doing my best. That's",
        "textdich": ""
    },
    {
        "start": 3284.88,
        "end": 3289.52,
        "text": "enough. That's powerful.",
        "textdich": ""
    },
    {
        "start": 3287.52,
        "end": 3299.76,
        "text": "That is the beginning of deep thinking in English. Some days I only wrote one line. Some days I wrote a whole page.",
        "textdich": ""
    },
    {
        "start": 3297.44,
        "end": 3310.16,
        "text": "But every time I wrote, I felt more connected. I felt my English becoming part of my daily life. Not something I",
        "textdich": ""
    },
    {
        "start": 3306.079,
        "end": 3318.96,
        "text": "study but something I live. And that is the goal. Not just to learn English, but to live in English. In the next chapter,",
        "textdich": ""
    },
    {
        "start": 3316.72,
        "end": 3328.559,
        "text": "I'll show you how I started speaking my written thoughts first in my mind, then with my voice. That final step helped me",
        "textdich": ""
    },
    {
        "start": 3325.76,
        "end": 3338.0,
        "text": "move from silent thinking to confident speaking. You're doing so well. Let's keep going. Your English is becoming",
        "textdich": ""
    },
    {
        "start": 3334.88,
        "end": 3347.359,
        "text": "your voice. I'll show you how I started speaking my written thoughts. First in my mind, then with my voice. That final",
        "textdich": ""
    },
    {
        "start": 3344.48,
        "end": 3358.0,
        "text": "step helped me move from silent thinking to confident speaking. You're doing so well. Let's keep going. Your English is",
        "textdich": ""
    },
    {
        "start": 3353.599,
        "end": 3365.76,
        "text": "becoming your voice. Chapter 14. Speak English in your mind first, then your mouth. I used to think speaking English",
        "textdich": ""
    },
    {
        "start": 3363.2,
        "end": 3374.16,
        "text": "meant talking out loud right away. But every time I tried, my mouth would freeze. My brain went blank. The words",
        "textdich": ""
    },
    {
        "start": 3370.48,
        "end": 3376.96,
        "text": "didn't come. I felt afraid. I felt slow.",
        "textdich": ""
    },
    {
        "start": 3374.16,
        "end": 3387.839,
        "text": "I felt like I didn't know anything. But deep inside, I knew I had learned. I had listened. I had thought in English. So",
        "textdich": ""
    },
    {
        "start": 3385.04,
        "end": 3395.76,
        "text": "why couldn't I speak? Then I found the missing piece. I realized that speaking doesn't start with the mouth. It starts",
        "textdich": ""
    },
    {
        "start": 3393.2,
        "end": 3407.76,
        "text": "with the mind. Before you can speak clearly out loud, you must speak inside your head. Quietly, calmly, slowly.",
        "textdich": ""
    },
    {
        "start": 3404.319,
        "end": 3416.799,
        "text": "Your brain needs time. Your thoughts need space. You don't have to rush. So I started practicing this every day. When",
        "textdich": ""
    },
    {
        "start": 3413.599,
        "end": 3419.359,
        "text": "I was walking alone, I spoke in my mind.",
        "textdich": ""
    },
    {
        "start": 3416.799,
        "end": 3428.0,
        "text": "I am going to the shop. The sun is bright today. I feel sleepy now. No one could hear me, but I was speaking. I was",
        "textdich": ""
    },
    {
        "start": 3425.119,
        "end": 3431.52,
        "text": "forming sentences. I was choosing words.",
        "textdich": ""
    },
    {
        "start": 3428.0,
        "end": 3442.88,
        "text": "I was building fluency silently. At home, I read my diary entries in my mind. I want to learn more. Today, I felt nervous in class. I'm proud of",
        "textdich": ""
    },
    {
        "start": 3440.0,
        "end": 3451.28,
        "text": "myself. I read them with feeling like I was speaking to someone. And over time, these silent sentences became strong.",
        "textdich": ""
    },
    {
        "start": 3448.4,
        "end": 3455.839,
        "text": "They lived in my brain. They were ready to come out.",
        "textdich": ""
    },
    {
        "start": 3453.52,
        "end": 3468.4,
        "text": "One day, I looked in the mirror and whispered one sentence I had thought many times before. I said, \"I can do this.\" My voice was soft, but it was",
        "textdich": ""
    },
    {
        "start": 3464.96,
        "end": 3476.64,
        "text": "real. I had spoken and it felt amazing because the sentence was not forced. It was already alive inside me. I had",
        "textdich": ""
    },
    {
        "start": 3473.76,
        "end": 3479.52,
        "text": "practiced it silently many times before.",
        "textdich": ""
    },
    {
        "start": 3476.64,
        "end": 3490.799,
        "text": "Now it just came out. This is what I want you to know. You don't need to speak out loud from day one. You can speak first in your mind. Talk to",
        "textdich": ""
    },
    {
        "start": 3487.44,
        "end": 3493.839,
        "text": "yourself silently. Narrate your actions.",
        "textdich": ""
    },
    {
        "start": 3490.799,
        "end": 3500.0,
        "text": "Describe your feelings. Build your English voice inside.",
        "textdich": ""
    },
    {
        "start": 3497.2,
        "end": 3509.359,
        "text": "When your thoughts become smooth, your mouth will follow. And don't worry about making mistakes. In your mind, you can",
        "textdich": ""
    },
    {
        "start": 3506.16,
        "end": 3515.599,
        "text": "pause. You can repeat your words. You can fix your words. You are safe there.",
        "textdich": ""
    },
    {
        "start": 3512.72,
        "end": 3526.64,
        "text": "Your brain becomes your classroom. Your mind becomes your teacher. And when you're ready, just let the words come out. I also used this method when I",
        "textdich": ""
    },
    {
        "start": 3523.599,
        "end": 3536.24,
        "text": "watched English videos. I heard a phrase like let's take a break. I repeated it in my head, let's take a break. I",
        "textdich": ""
    },
    {
        "start": 3533.119,
        "end": 3545.68,
        "text": "imagined myself saying it to someone. I practiced it again silently. Then one day when I was tired while studying, I",
        "textdich": ""
    },
    {
        "start": 3542.559,
        "end": 3556.559,
        "text": "smiled and said it out loud. Let's take a break. It felt natural. It felt easy because I had already spoken it a hundred times in my mind. Some people",
        "textdich": ""
    },
    {
        "start": 3554.0,
        "end": 3567.359,
        "text": "say if you don't speak out loud, you'll never be fluent. But I don't believe that. I believe that real speaking begins inside. It begins when your",
        "textdich": ""
    },
    {
        "start": 3564.559,
        "end": 3574.4,
        "text": "thoughts feel safe in English. It begins when your voice in your mind feels calm and strong.",
        "textdich": ""
    },
    {
        "start": 3572.0,
        "end": 3576.079,
        "text": "That's when your real speaking starts.",
        "textdich": ""
    },
    {
        "start": 3574.4,
        "end": 3588.64,
        "text": "And when it's time to speak with someone, your voice will be ready. So tonight, before you sleep, close your eyes. Speak one small sentence to",
        "textdich": ""
    },
    {
        "start": 3585.04,
        "end": 3598.24,
        "text": "yourself. I did well today. I am learning English. I will try again tomorrow. Feel the words. Hear them inside.",
        "textdich": ""
    },
    {
        "start": 3595.52,
        "end": 3604.96,
        "text": "Let your brain hold them. Then when you're ready, say them softly.",
        "textdich": ""
    },
    {
        "start": 3601.52,
        "end": 3607.28,
        "text": "Say them out loud. Let your voice rise.",
        "textdich": ""
    },
    {
        "start": 3604.96,
        "end": 3613.119,
        "text": "In the next chapter, I'll tell you how I stayed patient during this slow process.",
        "textdich": ""
    },
    {
        "start": 3610.319,
        "end": 3622.24,
        "text": "Some days I felt stuck. Some days my brain was quiet. But I learned to trust the journey. And that trust helped me",
        "textdich": ""
    },
    {
        "start": 3618.799,
        "end": 3630.559,
        "text": "keep going. You're almost there. Your voice is growing. Let's move forward one step at a time.",
        "textdich": ""
    },
    {
        "start": 3628.079,
        "end": 3635.119,
        "text": "Chapter 15.",
        "textdich": ""
    },
    {
        "start": 3630.559,
        "end": 3636.799,
        "text": "How to stay patient when you feel slow.",
        "textdich": ""
    },
    {
        "start": 3635.119,
        "end": 3646.88,
        "text": "There were many days when I felt like nothing was working. I read English. I listened. I thought, I even spoke to myself.",
        "textdich": ""
    },
    {
        "start": 3643.359,
        "end": 3659.2,
        "text": "But still, I felt slow, too slow. I watched others speak fluently. And I wondered, why can't I speak like that? I felt small. I felt behind. I thought",
        "textdich": ""
    },
    {
        "start": 3656.559,
        "end": 3665.68,
        "text": "maybe I wasn't smart enough. Maybe English was not for me. But I was wrong.",
        "textdich": ""
    },
    {
        "start": 3662.64,
        "end": 3676.16,
        "text": "What I needed was not more speed. What I needed was patience. Fluency is not fast. It's not loud. It's not perfect",
        "textdich": ""
    },
    {
        "start": 3671.44,
        "end": 3683.28,
        "text": "grammar. Fluency is trust. It is soft, slow learning that grows every day, quietly.",
        "textdich": ""
    },
    {
        "start": 3680.64,
        "end": 3692.0,
        "text": "I didn't understand that at first, so I tried to rush. I forced myself to speak quickly. I pushed myself to remember",
        "textdich": ""
    },
    {
        "start": 3689.119,
        "end": 3704.319,
        "text": "everything. But the more I pushed, the more I forgot. The more I rushed, the more I froze. My brain needed time. My heart needed space. One day, I sat",
        "textdich": ""
    },
    {
        "start": 3701.52,
        "end": 3717.04,
        "text": "alone. I had tried shadowing, but my mouth felt tired. I had listened to a story, but I didn't understand some words. I felt like giving up. But then I",
        "textdich": ""
    },
    {
        "start": 3714.24,
        "end": 3725.92,
        "text": "opened my notebook. I read the first sentence I had written many weeks ago. I am trying. That small sentence made me",
        "textdich": ""
    },
    {
        "start": 3723.04,
        "end": 3740.16,
        "text": "cry because it was still true. I was still trying. I was still here. I had not given up. And that was enough. So I made a promise to myself that day. I",
        "textdich": ""
    },
    {
        "start": 3736.72,
        "end": 3752.24,
        "text": "said, \"No matter how slow it feels, I will keep going.\" I stopped counting how many words I learned. I stopped asking how long until",
        "textdich": ""
    },
    {
        "start": 3747.599,
        "end": 3762.48,
        "text": "I'm fluent. I started saying, \"Today I will learn one thing. That's enough.\" And when I did that, something changed",
        "textdich": ""
    },
    {
        "start": 3758.88,
        "end": 3768.319,
        "text": "inside me. The pressure went away. The fear became smaller. I felt light again.",
        "textdich": ""
    },
    {
        "start": 3765.92,
        "end": 3774.88,
        "text": "I began to enjoy the little moments. A sentence I understood in a movie. A word I remembered during a walk. A small",
        "textdich": ""
    },
    {
        "start": 3773.04,
        "end": 3778.96,
        "text": "thought in English that came without translation.",
        "textdich": ""
    },
    {
        "start": 3776.4,
        "end": 3788.0,
        "text": "These were my wins. And when I celebrated them, I felt proud. Even when progress was slow, I knew I was growing.",
        "textdich": ""
    },
    {
        "start": 3785.92,
        "end": 3796.559,
        "text": "Just like a tree grows under the soil before we see the leaves, my English was growing inside. Even when I couldn't see",
        "textdich": ""
    },
    {
        "start": 3793.599,
        "end": 3801.44,
        "text": "it, some days my mind was tired. I didn't feel like practicing.",
        "textdich": ""
    },
    {
        "start": 3798.799,
        "end": 3813.76,
        "text": "On those days, I took a break. I listened to soft English music or I watched a cartoon or I simply whispered to myself, \"I will try again tomorrow.\"",
        "textdich": ""
    },
    {
        "start": 3810.72,
        "end": 3822.96,
        "text": "And that was okay. Patience means not fighting with yourself. It means being kind. It means trusting the slow days,",
        "textdich": ""
    },
    {
        "start": 3819.44,
        "end": 3837.68,
        "text": "too. I also reminded myself of how I learned to walk. No one learns to walk in one day. We fall. We cry. We try again. Slowly, step by step, we move",
        "textdich": ""
    },
    {
        "start": 3834.24,
        "end": 3843.52,
        "text": "forward. English is the same. You may fall in speaking. You may forget words.",
        "textdich": ""
    },
    {
        "start": 3840.72,
        "end": 3856.64,
        "text": "You may feel stuck. But if you keep standing up, you are still winning. So if you ever feel slow, don't stop. Don't give up. Look back and see how far",
        "textdich": ""
    },
    {
        "start": 3853.359,
        "end": 3864.72,
        "text": "you've come. The first word you learned, the first sentence you spoke, the first thought you had in English. These",
        "textdich": ""
    },
    {
        "start": 3861.68,
        "end": 3873.2,
        "text": "moments matter. These are proof that you are not stuck. You are becoming. In the next and final chapter, I'll help you",
        "textdich": ""
    },
    {
        "start": 3870.799,
        "end": 3884.0,
        "text": "bring everything together. All your thoughts, all your speaking, all your small wins. I'll show you how to trust your English voice, speak freely, and",
        "textdich": ""
    },
    {
        "start": 3881.119,
        "end": 3887.28,
        "text": "enjoy the language you've built inside.",
        "textdich": ""
    },
    {
        "start": 3884.0,
        "end": 3894.64,
        "text": "You're almost there. One more step, one more chapter. Let's finish strong.",
        "textdich": ""
    },
    {
        "start": 3890.96,
        "end": 3896.96,
        "text": "Chapter 16. Now you think in English.",
        "textdich": ""
    },
    {
        "start": 3894.64,
        "end": 3898.64,
        "text": "Let's speak freely.",
        "textdich": ""
    },
    {
        "start": 3896.96,
        "end": 3909.2,
        "text": "I remember the first time I thought a full sentence in English without even trying. It was early morning. I opened my eyes, looked out the window, and",
        "textdich": ""
    },
    {
        "start": 3905.68,
        "end": 3922.0,
        "text": "quietly in my head, I said, \"The sky is beautiful today. I didn't plan it. I didn't force it. It just came soft, natural.\" And in that moment, I smiled",
        "textdich": ""
    },
    {
        "start": 3918.88,
        "end": 3930.24,
        "text": "because I knew something had changed. I was not just learning English anymore. I was living it. This journey was not",
        "textdich": ""
    },
    {
        "start": 3927.359,
        "end": 3942.4,
        "text": "fast. It was not perfect. There were slow days. There were moments of fear, but I stayed with it. I thought in pictures. I used small sentences. I",
        "textdich": ""
    },
    {
        "start": 3940.0,
        "end": 3951.359,
        "text": "talked to myself in my brain. I replaced my native words. I used daily life to practice. I shadowed. I listened. I felt",
        "textdich": ""
    },
    {
        "start": 3948.72,
        "end": 3964.0,
        "text": "emotions. I wrote my thoughts. I spoke in silence. I stayed patient. And now here I am. Not afraid, not silent, but",
        "textdich": ""
    },
    {
        "start": 3960.72,
        "end": 3972.88,
        "text": "ready to speak freely. Speaking freely doesn't mean speaking fast. It doesn't mean using big words. It means speaking",
        "textdich": ""
    },
    {
        "start": 3969.839,
        "end": 3981.44,
        "text": "with confidence, with honesty, with your true voice. Your English may still be simple. That's okay. Simple is powerful.",
        "textdich": ""
    },
    {
        "start": 3979.2,
        "end": 3989.44,
        "text": "Simple is clear. You don't need to impress anyone. You only need to express yourself.",
        "textdich": ""
    },
    {
        "start": 3985.68,
        "end": 3992.72,
        "text": "And now you can.",
        "textdich": ""
    },
    {
        "start": 3989.44,
        "end": 3995.76,
        "text": "Today when I walk, I don't translate.",
        "textdich": ""
    },
    {
        "start": 3992.72,
        "end": 4005.44,
        "text": "When I speak, I don't freeze. When I make a mistake, I don't feel small. I feel human. Because this is what fluency",
        "textdich": ""
    },
    {
        "start": 4002.24,
        "end": 4013.68,
        "text": "is. It's not about being perfect. It's about being present. It's about feeling calm when you speak. It's about trusting",
        "textdich": ""
    },
    {
        "start": 4011.119,
        "end": 4028.88,
        "text": "your English mind. You have built something strong. Inside is a small English world. A place full of words, feelings, images, stories. It is alive.",
        "textdich": ""
    },
    {
        "start": 4025.2,
        "end": 4038.96,
        "text": "It is growing. And now you are ready to open the door and let it out. Speak your thoughts. Speak your feelings. Speak",
        "textdich": ""
    },
    {
        "start": 4035.2,
        "end": 4047.92,
        "text": "your story. Start with your day. I woke up early. I ate breakfast. I went to the market. Then share your heart. I feel",
        "textdich": ""
    },
    {
        "start": 4045.119,
        "end": 4056.799,
        "text": "happy. I miss my friend. I want to learn more. Let your words come from inside you. Don't worry if they're short. Let",
        "textdich": ""
    },
    {
        "start": 4054.0,
        "end": 4066.16,
        "text": "them be real. You can now speak freely to yourself in your room, on your walk, before sleep. You can speak freely with",
        "textdich": ""
    },
    {
        "start": 4063.359,
        "end": 4068.319,
        "text": "friends, with new people, with anyone.",
        "textdich": ""
    },
    {
        "start": 4066.16,
        "end": 4077.039,
        "text": "You don't have to wait. You don't have to hide. You have everything you need inside your thoughts. This is not the",
        "textdich": ""
    },
    {
        "start": 4074.559,
        "end": 4085.28,
        "text": "end of your English journey. It is the beginning of your freedom. You will grow more. You will learn more. But now you",
        "textdich": ""
    },
    {
        "start": 4082.799,
        "end": 4092.96,
        "text": "have the most important gift, your voice. And your voice matters. Use it.",
        "textdich": ""
    },
    {
        "start": 4089.68,
        "end": 4108.0,
        "text": "Share it. Enjoy it. Now take a deep breath. Close your eyes. Say one sentence in English. Just one. Let it come from your heart. Maybe it's I can",
        "textdich": ""
    },
    {
        "start": 4102.96,
        "end": 4117.199,
        "text": "speak now or I'm proud of myself or even this is my first step. Whatever it is, say it, feel it. That sentence is yours.",
        "textdich": ""
    },
    {
        "start": 4114.4,
        "end": 4127.44,
        "text": "That voice is yours. That freedom is yours. If this journey helped you, even one chapter, one sentence, one moment,",
        "textdich": ""
    },
    {
        "start": 4123.92,
        "end": 4135.52,
        "text": "please tell me. Comment below. I want to hear your voice. What did you feel? What changed inside you? If you're ready to",
        "textdich": ""
    },
    {
        "start": 4133.12,
        "end": 4142.88,
        "text": "speak English with courage, please like this video, subscribe to this channel, and share it with someone who is also",
        "textdich": ""
    },
    {
        "start": 4140.319,
        "end": 4151.839,
        "text": "learning. Help them feel what you feel now. You are no longer just learning English. You are thinking in English.",
        "textdich": ""
    },
    {
        "start": 4148.08,
        "end": 4151.839,
        "text": "And now you are ready to speak.",
        "textdich": ""
    }
]