[
    {
        "start": 0.24,
        "end": 16.56,
        "text": "My name is Susan. I am 24 years old. I work as a waitress in a restaurant. My life is very hard. I need money every",
        "textdich": ""
    },
    {
        "start": 12.48,
        "end": 25.279,
        "text": "day. My mother is sick. She needs a big operation. The doctor says it costs $50,000.",
        "textdich": ""
    },
    {
        "start": 22.4,
        "end": 38.96,
        "text": "I do not have this money. I work many hours, but I cannot save enough. I am very scared. Every day I go to work. I smile at customers.",
        "textdich": ""
    },
    {
        "start": 35.52,
        "end": 50.0,
        "text": "I bring them food and drinks. Sometimes my boss shouts at me. He says I am too slow. He says I make mistakes.",
        "textdich": ""
    },
    {
        "start": 46.16,
        "end": 53.76,
        "text": "I do not cry. I just say sorry and work harder.",
        "textdich": ""
    },
    {
        "start": 51.6,
        "end": 67.439,
        "text": "An old man comes to the restaurant often. His name is Bradley. He is 80 years old. He is very rich. People say he owns many buildings. People say he is",
        "textdich": ""
    },
    {
        "start": 63.68,
        "end": 70.72,
        "text": "cold and mean, but his eyes are sharp.",
        "textdich": ""
    },
    {
        "start": 67.439,
        "end": 82.4,
        "text": "He sees everything. Bradley always sits alone. He orders simple food. He watches me work. He sees my boss shout at me. I",
        "textdich": ""
    },
    {
        "start": 79.36,
        "end": 85.2,
        "text": "do not know why he looks at me so much.",
        "textdich": ""
    },
    {
        "start": 82.4,
        "end": 96.159,
        "text": "One day, I get a phone call. It is the hospital. My mother needs the operation now. She will die without it. I need the",
        "textdich": ""
    },
    {
        "start": 91.68,
        "end": 105.84,
        "text": "money this week. I sit down and cry. I do not know what to do. Bradley walks to my table. He sits down next to me. He",
        "textdich": ""
    },
    {
        "start": 102.64,
        "end": 113.92,
        "text": "asks me what is wrong. I tell him about my mother. I tell him about the money.",
        "textdich": ""
    },
    {
        "start": 109.6,
        "end": 126.079,
        "text": "He listens and does not speak. Then he says something strange. He says he wants to marry me. I look at him. I think he is joking.",
        "textdich": ""
    },
    {
        "start": 122.479,
        "end": 135.44,
        "text": "But his face is serious. He explains his offer to me. He will pay all the money for my mother. He will give me a good",
        "textdich": ""
    },
    {
        "start": 132.0,
        "end": 142.56,
        "text": "life. I will have nice clothes and a big house. But I must marry him for 5 years.",
        "textdich": ""
    },
    {
        "start": 139.44,
        "end": 153.76,
        "text": "I must take care of him. I must live with him. His children want to put him in a nursing home. He does not want that. He needs a young wife to stop",
        "textdich": ""
    },
    {
        "start": 150.319,
        "end": 160.239,
        "text": "them. I cannot believe his words. He is 80 years old. I am 24.",
        "textdich": ""
    },
    {
        "start": 157.599,
        "end": 171.2,
        "text": "He could be my grandfather. People will laugh at us. People will say bad things about me. But my mother will die without",
        "textdich": ""
    },
    {
        "start": 166.72,
        "end": 174.239,
        "text": "the operation. I have no other choice.",
        "textdich": ""
    },
    {
        "start": 171.2,
        "end": 185.84,
        "text": "I need this money now. I look at Bradley. Tears fall from my eyes. I say yes. I agree to marry him. I feel like I",
        "textdich": ""
    },
    {
        "start": 182.879,
        "end": 197.12,
        "text": "am selling myself. I am giving my young life to a very old man. But I must save my mother. This is the only way.",
        "textdich": ""
    },
    {
        "start": 192.64,
        "end": 207.68,
        "text": "Bradley nods. He shakes my hand. The deal is done. My life changes in one moment. I am going to be the wife of a",
        "textdich": ""
    },
    {
        "start": 203.2,
        "end": 213.76,
        "text": "billionaire. But I do not feel happy. I feel afraid.",
        "textdich": ""
    },
    {
        "start": 209.599,
        "end": 220.159,
        "text": "The wedding happens 3 days later. We go to city hall. There are no flowers.",
        "textdich": ""
    },
    {
        "start": 217.44,
        "end": 228.08,
        "text": "There is no music. The room is small and gray. The woman at the desk looks at us.",
        "textdich": ""
    },
    {
        "start": 224.319,
        "end": 239.2,
        "text": "She looks confused. She asks if Bradley is my grandfather. I say no. I say he is my husband. She stares at me. Then she",
        "textdich": ""
    },
    {
        "start": 236.0,
        "end": 251.12,
        "text": "gives us the papers to sign. I sign my name. My hand shakes. Bradley signs his name too. His hand is very old and slow.",
        "textdich": ""
    },
    {
        "start": 247.04,
        "end": 264.639,
        "text": "We are married now. Nobody claps. Nobody smiles. We just leave. People in the hall see us. They point at us. They laugh. I hear them talk. They say we",
        "textdich": ""
    },
    {
        "start": 261.28,
        "end": 267.68,
        "text": "look like a joke. I want to run away.",
        "textdich": ""
    },
    {
        "start": 264.639,
        "end": 274.8,
        "text": "But I walk next to Bradley. This is my life now. Bradley takes me to his house.",
        "textdich": ""
    },
    {
        "start": 271.44,
        "end": 277.759,
        "text": "It is very big. It is like a palace.",
        "textdich": ""
    },
    {
        "start": 274.8,
        "end": 289.04,
        "text": "There are many rooms. Everything is expensive and beautiful. But the house feels cold. It feels empty.",
        "textdich": ""
    },
    {
        "start": 284.4,
        "end": 293.44,
        "text": "A woman shows me my bedroom. It is huge.",
        "textdich": ""
    },
    {
        "start": 289.04,
        "end": 296.479,
        "text": "The bed is soft, but I sleep alone.",
        "textdich": ""
    },
    {
        "start": 293.44,
        "end": 304.639,
        "text": "Bradley sleeps in a different room. We are married, but we live like strangers.",
        "textdich": ""
    },
    {
        "start": 300.08,
        "end": 307.6,
        "text": "I have nice clothes now. I have jewelry.",
        "textdich": ""
    },
    {
        "start": 304.639,
        "end": 310.639,
        "text": "I have everything I need.",
        "textdich": ""
    },
    {
        "start": 307.6,
        "end": 322.8,
        "text": "But I feel sad. This house is like a prison made of gold. One week later, we go to a restaurant. It is our first time in public together.",
        "textdich": ""
    },
    {
        "start": 319.759,
        "end": 332.32,
        "text": "People see us walk in. They stop talking. They stare at us. I hear them whisper.",
        "textdich": ""
    },
    {
        "start": 328.32,
        "end": 341.919,
        "text": "They say mean things. One woman says, \"I look like his granddaughter.\" Another man says, \"I am waiting for Bradley to die.\"",
        "textdich": ""
    },
    {
        "start": 338.8,
        "end": 350.0,
        "text": "He says, \"I just want his money.\" I feel my face get hot. I feel so ashamed.",
        "textdich": ""
    },
    {
        "start": 346.96,
        "end": 361.199,
        "text": "Bradley hears them, too. He reaches for my hand. His hand is old and shakes, but he holds my hand tight. He wants people",
        "textdich": ""
    },
    {
        "start": 357.52,
        "end": 373.44,
        "text": "to see. He wants them to know I am his wife. We sit down and eat, but I cannot enjoy the food. Everyone watches us.",
        "textdich": ""
    },
    {
        "start": 368.8,
        "end": 383.919,
        "text": "Everyone judges us. I am now rich. I have a big house. I have beautiful things. But nobody respects me anymore.",
        "textdich": ""
    },
    {
        "start": 380.639,
        "end": 394.08,
        "text": "People think I am a bad person. They think I sold myself for money. And maybe they are right. Maybe I did. I look at",
        "textdich": ""
    },
    {
        "start": 390.479,
        "end": 404.88,
        "text": "Bradley. Heeds slowly. He does not care what people think. But I care. I lost something important. I lost my dignity",
        "textdich": ""
    },
    {
        "start": 402.16,
        "end": 411.919,
        "text": "and I cannot buy it back. Two weeks later, Bradley's children come to visit.",
        "textdich": ""
    },
    {
        "start": 408.0,
        "end": 422.72,
        "text": "Their names are Lucas and Sarah. Lucas is 55 years old. Sarah is 52. They are both much older than me. They arrive in",
        "textdich": ""
    },
    {
        "start": 419.44,
        "end": 425.919,
        "text": "the afternoon. They do not smile at me.",
        "textdich": ""
    },
    {
        "start": 422.72,
        "end": 435.039,
        "text": "They do not say hello. They look at me with cold eyes. I feel very uncomfortable. We sit down for dinner.",
        "textdich": ""
    },
    {
        "start": 432.56,
        "end": 438.479,
        "text": "The table is long.",
        "textdich": ""
    },
    {
        "start": 435.039,
        "end": 449.44,
        "text": "I sit next to Bradley. Lucas and Sarah sit across from us. Nobody talks. The silence is heavy. Then Sarah speaks. She",
        "textdich": ""
    },
    {
        "start": 446.08,
        "end": 462.16,
        "text": "asks Bradley why he married me. She says, \"I am too young.\" She says, \"I do not love him.\" Her voice is full of anger. Lucas speaks too. He says bad",
        "textdich": ""
    },
    {
        "start": 459.759,
        "end": 473.68,
        "text": "things about me. He calls me a dirty name. He says I only want Bradley's money. He says I will take everything when Bradley dies. I feel my eyes fill",
        "textdich": ""
    },
    {
        "start": 471.84,
        "end": 477.68,
        "text": "with tears.",
        "textdich": ""
    },
    {
        "start": 473.68,
        "end": 480.4,
        "text": "I want to leave, but I stay in my chair.",
        "textdich": ""
    },
    {
        "start": 477.68,
        "end": 482.639,
        "text": "I do not say anything.",
        "textdich": ""
    },
    {
        "start": 480.4,
        "end": 486.8,
        "text": "Sarah talks again.",
        "textdich": ""
    },
    {
        "start": 482.639,
        "end": 489.84,
        "text": "She says they will stop this marriage.",
        "textdich": ""
    },
    {
        "start": 486.8,
        "end": 497.919,
        "text": "She says they will find a lawyer. She says they will make the marriage illegal. She says I will get nothing.",
        "textdich": ""
    },
    {
        "start": 495.199,
        "end": 501.039,
        "text": "They talk about me like I am not there.",
        "textdich": ""
    },
    {
        "start": 497.919,
        "end": 504.479,
        "text": "They talk about me like I am an object.",
        "textdich": ""
    },
    {
        "start": 501.039,
        "end": 512.56,
        "text": "I feel so small. I look at Bradley. I wait for him to say something.",
        "textdich": ""
    },
    {
        "start": 507.36,
        "end": 517.44,
        "text": "He sits very still. His face is red. His hands shake.",
        "textdich": ""
    },
    {
        "start": 514.56,
        "end": 530.88,
        "text": "Then suddenly Bradley hits the table hard. The sound is very loud. Everyone stops talking. The glasses shake. I jump",
        "textdich": ""
    },
    {
        "start": 526.32,
        "end": 544.32,
        "text": "in my seat. Bradley stands up. He is old and weak, but he looks strong now. He points at his children. His voice is loud and clear.",
        "textdich": ""
    },
    {
        "start": 539.68,
        "end": 554.0,
        "text": "He says I am his wife. He says they must respect me. He tells them to get out if they cannot be nice.",
        "textdich": ""
    },
    {
        "start": 550.16,
        "end": 563.76,
        "text": "His words are simple but powerful. Lucas and Sarah look shocked. They stare at their father. They do not move. Bradley",
        "textdich": ""
    },
    {
        "start": 560.24,
        "end": 566.64,
        "text": "says it again. He tells them to leave.",
        "textdich": ""
    },
    {
        "start": 563.76,
        "end": 570.0,
        "text": "He says he does not want to see them.",
        "textdich": ""
    },
    {
        "start": 566.64,
        "end": 582.399,
        "text": "Not today. Not until they apologize to me. Sarah starts to cry. Lucas gets angry, but they both stand up. They walk",
        "textdich": ""
    },
    {
        "start": 579.12,
        "end": 595.76,
        "text": "to the door. They leave the house. The door slams shut. Bradley sits down again. He looks very tired now. His hands shake more than before. He",
        "textdich": ""
    },
    {
        "start": 591.839,
        "end": 602.0,
        "text": "breathes hard. I look at him. I see something new. He is not just my boss.",
        "textdich": ""
    },
    {
        "start": 599.12,
        "end": 611.36,
        "text": "He is not just an old rich man. He is lonely. His own children hate him. They only want his money. They do not love",
        "textdich": ""
    },
    {
        "start": 608.56,
        "end": 623.12,
        "text": "him. For the first time, I feel sorry for Bradley. He defended me. Nobody ever defended me before. He is old and sick,",
        "textdich": ""
    },
    {
        "start": 619.92,
        "end": 626.959,
        "text": "but he protected me from his own family.",
        "textdich": ""
    },
    {
        "start": 623.12,
        "end": 630.32,
        "text": "Maybe he is not as cold as people say.",
        "textdich": ""
    },
    {
        "start": 626.959,
        "end": 638.8,
        "text": "Maybe he has a heart after all. One night, I cannot sleep. I lie in my bed.",
        "textdich": ""
    },
    {
        "start": 635.44,
        "end": 642.959,
        "text": "The house is quiet. Then I hear music.",
        "textdich": ""
    },
    {
        "start": 638.8,
        "end": 655.519,
        "text": "It is piano music. It sounds very sad. I get up. I walk down the hall. The music comes from the living room. I open the door slowly. I see Bradley.",
        "textdich": ""
    },
    {
        "start": 652.399,
        "end": 668.64,
        "text": "He sits at a big black piano. His fingers move on the keys. The music is beautiful but sad. The light shines on his face.",
        "textdich": ""
    },
    {
        "start": 664.32,
        "end": 671.76,
        "text": "He looks very old. He looks very tired.",
        "textdich": ""
    },
    {
        "start": 668.64,
        "end": 682.56,
        "text": "He looks like he might break. I stand and watch him. He does not see me. He just plays. Tears run down his face. The",
        "textdich": ""
    },
    {
        "start": 678.56,
        "end": 692.079,
        "text": "music stops. Bradley sits still. I walk into the room. He looks up. He sees me.",
        "textdich": ""
    },
    {
        "start": 687.44,
        "end": 705.279,
        "text": "I ask if he wants some tea. He nods. I go to the kitchen. I make hot tea. I bring it back to him. Bradley drinks the tea. He thanks me.",
        "textdich": ""
    },
    {
        "start": 701.68,
        "end": 719.6,
        "text": "Then he starts to talk. He tells me about his first wife. Her name was Elizabeth. She died 40 years ago. He loved her very much. He says he was",
        "textdich": ""
    },
    {
        "start": 715.04,
        "end": 726.639,
        "text": "always busy with work. He worked all day and all night. He wanted to make money.",
        "textdich": ""
    },
    {
        "start": 723.36,
        "end": 735.519,
        "text": "He wanted to be rich. But he forgot about his family. He did not spend time with Elizabeth. He did not play with his",
        "textdich": ""
    },
    {
        "start": 732.399,
        "end": 739.76,
        "text": "children. They grew up without him.",
        "textdich": ""
    },
    {
        "start": 735.519,
        "end": 749.92,
        "text": "Elizabeth got sick. She died alone. He was at work. After she died, he worked even more. He gave his children money,",
        "textdich": ""
    },
    {
        "start": 746.24,
        "end": 759.519,
        "text": "but not love. Now they only care about money. They do not care about him. This is his fault. He made them this way.",
        "textdich": ""
    },
    {
        "start": 756.72,
        "end": 772.079,
        "text": "Bradley cries again. He says he is sorry. He says he wasted his life. He says money cannot buy love. I feel my heart hurt.",
        "textdich": ""
    },
    {
        "start": 768.16,
        "end": 775.36,
        "text": "I sit next to him. I hold his old hand.",
        "textdich": ""
    },
    {
        "start": 772.079,
        "end": 784.639,
        "text": "I tell him it is okay. I tell him I understand. From that night, everything changes. I start to care about Bradley.",
        "textdich": ""
    },
    {
        "start": 781.839,
        "end": 793.76,
        "text": "Not because of our deal, not because of money. I care because he is a person. He is lonely. He is sad.",
        "textdich": ""
    },
    {
        "start": 791.6,
        "end": 798.16,
        "text": "He needs someone.",
        "textdich": ""
    },
    {
        "start": 793.76,
        "end": 809.04,
        "text": "I cook soup for him everyday. soft soup because his teeth are weak. I read books to him. His eyes get tired easily. We",
        "textdich": ""
    },
    {
        "start": 805.36,
        "end": 812.079,
        "text": "talk about life. We talk about dreams.",
        "textdich": ""
    },
    {
        "start": 809.04,
        "end": 821.839,
        "text": "We talk about sadness and hope. The age difference does not matter anymore. We are just two people, two lonely souls.",
        "textdich": ""
    },
    {
        "start": 818.88,
        "end": 832.079,
        "text": "We understand each other. And slowly something grows between us. Something real, something true. 3 months pass.",
        "textdich": ""
    },
    {
        "start": 828.8,
        "end": 844.639,
        "text": "Bradley and I are happy. We talk every day. We laugh together. I take care of him. He takes care of me. Then one morning, something terrible happens. I",
        "textdich": ""
    },
    {
        "start": 841.68,
        "end": 848.56,
        "text": "bring Bradley his breakfast.",
        "textdich": ""
    },
    {
        "start": 844.639,
        "end": 857.92,
        "text": "He sits in his chair. I put the food on the table. Suddenly, Bradley makes a strange sound. His face looks wrong. One",
        "textdich": ""
    },
    {
        "start": 854.88,
        "end": 868.0,
        "text": "side drops down. His cup falls from his hand. He tries to speak, but no words come out. I scream. I call for help. I",
        "textdich": ""
    },
    {
        "start": 864.959,
        "end": 875.36,
        "text": "call the hospital. The ambulance comes very fast. They put Bradley on a bed.",
        "textdich": ""
    },
    {
        "start": 871.6,
        "end": 882.48,
        "text": "They take him away. I go with him. At the hospital, doctors run everywhere.",
        "textdich": ""
    },
    {
        "start": 879.6,
        "end": 894.24,
        "text": "They take Bradley into a room. They tell me to wait outside. I sit in the hall. I pray. I cry.",
        "textdich": ""
    },
    {
        "start": 889.92,
        "end": 901.36,
        "text": "Hours pass. A doctor comes out. He says Bradley had a stroke. A very bad stroke.",
        "textdich": ""
    },
    {
        "start": 898.16,
        "end": 904.48,
        "text": "Bradley is alive, but he is in a coma.",
        "textdich": ""
    },
    {
        "start": 901.36,
        "end": 914.48,
        "text": "He cannot wake up. The doctor does not know if he will live. I stay at the hospital. I do not leave. I sit next to",
        "textdich": ""
    },
    {
        "start": 910.72,
        "end": 925.279,
        "text": "Bradley's bed. I hold his hand. I talk to him. I tell him to wake up. But he does not move. On the second day, Lucas",
        "textdich": ""
    },
    {
        "start": 921.6,
        "end": 934.959,
        "text": "comes. He walks into the room. He looks at his father. He does not look sad. He looks angry. Lucas tells me to leave. He",
        "textdich": ""
    },
    {
        "start": 931.76,
        "end": 945.6,
        "text": "says, \"I do not belong here. I say I am Bradley's wife. I say I will stay.\" Lucas laughs. He says Bradley is dying.",
        "textdich": ""
    },
    {
        "start": 942.16,
        "end": 955.68,
        "text": "He says, \"I have no value now.\" Lucas calls security. Two big men come. They make me leave the hospital. I cry and",
        "textdich": ""
    },
    {
        "start": 952.399,
        "end": 966.48,
        "text": "scream, but they push me out. I go back to the house. I want to get my things, but the locks are different. I cannot open the door.",
        "textdich": ""
    },
    {
        "start": 963.759,
        "end": 968.72,
        "text": "I knock and knock.",
        "textdich": ""
    },
    {
        "start": 966.48,
        "end": 971.68,
        "text": "Nobody answers.",
        "textdich": ""
    },
    {
        "start": 968.72,
        "end": 978.639,
        "text": "Then I see my clothes. They are in the yard. Someone threw them out the window.",
        "textdich": ""
    },
    {
        "start": 975.44,
        "end": 991.04,
        "text": "My dresses lie in the dirt. My shoes are broken. Everything is ruined. Lucas opens the door. He smiles at me. He says, \"The old man is dying.\" He says,",
        "textdich": ""
    },
    {
        "start": 988.32,
        "end": 1003.12,
        "text": "\"I do not live here anymore.\" He says, \"I get nothing.\" Then he closes the door. I stand in the yard. I do not know what to do. I have",
        "textdich": ""
    },
    {
        "start": 999.92,
        "end": 1013.6,
        "text": "no home. I have no money. But I do not care about these things. I only care about Bradley. I need to know if he is",
        "textdich": ""
    },
    {
        "start": 1009.36,
        "end": 1018.72,
        "text": "okay. I need to be near him. I get in my old car.",
        "textdich": ""
    },
    {
        "start": 1015.519,
        "end": 1026.799,
        "text": "I drive back to the hospital. I park outside. I cannot go in, but I can stay close.",
        "textdich": ""
    },
    {
        "start": 1024.079,
        "end": 1038.16,
        "text": "I sleep in my car that night and the next night and the night after that. 3 days pass. I eat nothing. I just wait. I",
        "textdich": ""
    },
    {
        "start": 1034.959,
        "end": 1041.199,
        "text": "just hope. I pray Bradley will wake up.",
        "textdich": ""
    },
    {
        "start": 1038.16,
        "end": 1053.84,
        "text": "On the fourth day, a nurse finds me. She says Bradley woke up. I run into the hospital. I run to his room, but security stops me at the door. They say",
        "textdich": ""
    },
    {
        "start": 1050.559,
        "end": 1063.919,
        "text": "I cannot go in. Lucas is inside with doctors and lawyers. They are having a meeting. I push past the security men. I",
        "textdich": ""
    },
    {
        "start": 1061.039,
        "end": 1072.16,
        "text": "open the door. Everyone turns to look at me. I look dirty.",
        "textdich": ""
    },
    {
        "start": 1067.44,
        "end": 1086.799,
        "text": "My hair is messy. My clothes are old, but I do not care. I see Bradley. He is awake, but he looks different. One side of his face does not move.",
        "textdich": ""
    },
    {
        "start": 1083.039,
        "end": 1092.72,
        "text": "One arm lies still on the bed. He tries to talk, but the words sound strange.",
        "textdich": ""
    },
    {
        "start": 1089.679,
        "end": 1105.12,
        "text": "Lucas stands next to the bed. Sarah is there, too. Three men in suits stand with them. They are lawyers. Lucas sees",
        "textdich": ""
    },
    {
        "start": 1099.6,
        "end": 1114.48,
        "text": "me. He yells at me to get out. He says, \"I have no right to be here. The lawyers look at me. They look disgusted. One",
        "textdich": ""
    },
    {
        "start": 1111.44,
        "end": 1123.6,
        "text": "lawyer speaks. He says they are moving Bradley to a nursing home, a special place far away.",
        "textdich": ""
    },
    {
        "start": 1120.0,
        "end": 1130.4,
        "text": "Bradley will live there. Lucas and Sarah will run the company. Everything is decided.",
        "textdich": ""
    },
    {
        "start": 1128.08,
        "end": 1133.84,
        "text": "I look at Bradley.",
        "textdich": ""
    },
    {
        "start": 1130.4,
        "end": 1147.52,
        "text": "His good eye looks at me. He tries to speak, but nobody listens to him. I walk forward. I stand in front of the lawyers. These men are twice my age.",
        "textdich": ""
    },
    {
        "start": 1143.6,
        "end": 1155.12,
        "text": "They are powerful. They are rich. But I am not scared. I say I am Bradley's legal wife.",
        "textdich": ""
    },
    {
        "start": 1152.559,
        "end": 1158.32,
        "text": "The law says so.",
        "textdich": ""
    },
    {
        "start": 1155.12,
        "end": 1168.64,
        "text": "I say I will take him home. I will care for him myself. He does not need a nursing home. Lucas laughs. He says I",
        "textdich": ""
    },
    {
        "start": 1165.12,
        "end": 1180.16,
        "text": "cannot take care of anyone. He says I am just a waitress. He says I am nobody. I do not listen to him. I look at Bradley.",
        "textdich": ""
    },
    {
        "start": 1176.16,
        "end": 1190.48,
        "text": "I say I will take him home today. I say he will be safe with me. I promise him this. The lawyers talk. They say I have",
        "textdich": ""
    },
    {
        "start": 1186.72,
        "end": 1198.48,
        "text": "no money. They say I have no house. They say I cannot do this. But I am his wife.",
        "textdich": ""
    },
    {
        "start": 1194.72,
        "end": 1201.919,
        "text": "The papers say so. They cannot stop me.",
        "textdich": ""
    },
    {
        "start": 1198.48,
        "end": 1216.72,
        "text": "Bradley makes a sound. Everyone looks at him. Tears run down his face. He lifts his good hand. He points at me. He tries to say my name. I understand.",
        "textdich": ""
    },
    {
        "start": 1213.52,
        "end": 1219.52,
        "text": "He wants to go with me. He trusts me.",
        "textdich": ""
    },
    {
        "start": 1216.72,
        "end": 1222.72,
        "text": "His own children want to hide him away.",
        "textdich": ""
    },
    {
        "start": 1219.52,
        "end": 1233.44,
        "text": "They want to forget about him. They just want his money and his company. But I want to protect him. I want to give him dignity.",
        "textdich": ""
    },
    {
        "start": 1230.64,
        "end": 1240.32,
        "text": "I want to give him love. The lawyers talk to each other. They look at papers.",
        "textdich": ""
    },
    {
        "start": 1237.6,
        "end": 1249.6,
        "text": "Finally, they say, \"I can take him because I am his wife.\" The law is on my side.",
        "textdich": ""
    },
    {
        "start": 1246.48,
        "end": 1256.32,
        "text": "Lucas and Sarah scream, but there is nothing they can do.",
        "textdich": ""
    },
    {
        "start": 1251.919,
        "end": 1267.84,
        "text": "I won. Bradley is coming home with me. I take Bradley to a small house. We cannot live in the mansion. Lucas took it. This house is tiny,",
        "textdich": ""
    },
    {
        "start": 1265.6,
        "end": 1270.0,
        "text": "but it is warm.",
        "textdich": ""
    },
    {
        "start": 1267.84,
        "end": 1274.4,
        "text": "It is ours.",
        "textdich": ""
    },
    {
        "start": 1270.0,
        "end": 1285.2,
        "text": "Every day I take care of Bradley. I wake up early. I help him get out of bed. He cannot move his left side. I am his",
        "textdich": ""
    },
    {
        "start": 1280.799,
        "end": 1296.88,
        "text": "hands. I am his feet. I help him wash. I help him get dressed. I feed him breakfast. Soft porridge because he cannot chew well. I give him his",
        "textdich": ""
    },
    {
        "start": 1293.36,
        "end": 1300.0,
        "text": "medicine. I do this every single day.",
        "textdich": ""
    },
    {
        "start": 1296.88,
        "end": 1313.12,
        "text": "Sometimes Bradley needs diapers. I change them. I clean him. This is hard work, but I do it with gentle hands. I treat him with respect. He is still a",
        "textdich": ""
    },
    {
        "start": 1309.44,
        "end": 1324.4,
        "text": "person. He deserves dignity. Three times a day, we do exercises. I help Bradley move his weak arm. I help him try to",
        "textdich": ""
    },
    {
        "start": 1319.84,
        "end": 1327.52,
        "text": "walk. He falls many times. I catch him.",
        "textdich": ""
    },
    {
        "start": 1324.4,
        "end": 1337.12,
        "text": "We try again. I do not wear pretty dresses anymore. I wear old clothes. My hands become rough.",
        "textdich": ""
    },
    {
        "start": 1334.32,
        "end": 1340.96,
        "text": "My face looks tired.",
        "textdich": ""
    },
    {
        "start": 1337.12,
        "end": 1347.919,
        "text": "I look older now. I am only 25, but I look 30. I have no time for myself.",
        "textdich": ""
    },
    {
        "start": 1345.28,
        "end": 1352.64,
        "text": "I have no friends.",
        "textdich": ""
    },
    {
        "start": 1347.919,
        "end": 1362.48,
        "text": "I have no life outside this house, but I do not complain. This is my choice. One night, I help Bradley to bed. He looks",
        "textdich": ""
    },
    {
        "start": 1358.88,
        "end": 1372.0,
        "text": "at me. His good eye is wet. He tries to talk. His words come out slow and broken. He says he bought me with money.",
        "textdich": ""
    },
    {
        "start": 1368.88,
        "end": 1383.44,
        "text": "He says I paid him back with my life. He says he is sorry. He says he kept me here. He says it is selfish. I sit on",
        "textdich": ""
    },
    {
        "start": 1379.12,
        "end": 1395.12,
        "text": "the bed next to him. I hold his hand. I look into his eyes. I tell him the truth. I say he did not keep me here. I",
        "textdich": ""
    },
    {
        "start": 1391.12,
        "end": 1405.12,
        "text": "chose to stay. I want to be here. I want to take care of him. He cries. I cry, too. We sit together in the dark.",
        "textdich": ""
    },
    {
        "start": 1401.76,
        "end": 1410.4,
        "text": "Bradley is old. He is sick. His body does not work.",
        "textdich": ""
    },
    {
        "start": 1407.12,
        "end": 1418.96,
        "text": "But I do not find him ugly. I do not hate his body. I see a beautiful soul inside.",
        "textdich": ""
    },
    {
        "start": 1415.36,
        "end": 1422.08,
        "text": "He was alone for so many years.",
        "textdich": ""
    },
    {
        "start": 1418.96,
        "end": 1433.84,
        "text": "His family left him. Everyone wanted his money. Nobody wanted him. But I want him. Not his money, not his house, just",
        "textdich": ""
    },
    {
        "start": 1429.52,
        "end": 1438.88,
        "text": "him. The person inside this broken body.",
        "textdich": ""
    },
    {
        "start": 1433.84,
        "end": 1442.32,
        "text": "I love him now. Real love. Pure love.",
        "textdich": ""
    },
    {
        "start": 1438.88,
        "end": 1457.44,
        "text": "Love that asks for nothing back. And I know he loves me, too. He shows it every day. In his eyes, in his smile, in the way he holds my hand. We are",
        "textdich": ""
    },
    {
        "start": 1454.0,
        "end": 1460.4,
        "text": "happy. We have each other.",
        "textdich": ""
    },
    {
        "start": 1457.44,
        "end": 1464.72,
        "text": "And that is enough.",
        "textdich": ""
    },
    {
        "start": 1460.4,
        "end": 1467.76,
        "text": "6 months pass. We live quietly.",
        "textdich": ""
    },
    {
        "start": 1464.72,
        "end": 1471.039,
        "text": "Then Lucas starts a new attack.",
        "textdich": ""
    },
    {
        "start": 1467.76,
        "end": 1484.24,
        "text": "He tells lies about me. He says I have a boyfriend. He says I poison Bradley slowly. He says I want Bradley to be fast. He wants people to think I am",
        "textdich": ""
    },
    {
        "start": 1479.84,
        "end": 1487.52,
        "text": "evil. The lies spread everywhere.",
        "textdich": ""
    },
    {
        "start": 1484.24,
        "end": 1496.08,
        "text": "People believe Lucas. They say terrible things about me. They say I am a murderer.",
        "textdich": ""
    },
    {
        "start": 1493.2,
        "end": 1506.72,
        "text": "Lucas goes to court. He wants to take Bradley away from me. He says I am a bad guardian. He says I hurt Bradley.",
        "textdich": ""
    },
    {
        "start": 1503.279,
        "end": 1513.76,
        "text": "He wants the law to stop me. I get a letter. I must go to a family meeting.",
        "textdich": ""
    },
    {
        "start": 1510.24,
        "end": 1521.84,
        "text": "Lawyers will be there. Lucas and Sarah will be there. They will decide if I can keep Bradley.",
        "textdich": ""
    },
    {
        "start": 1518.32,
        "end": 1532.72,
        "text": "I am very scared. But Bradley is not scared. He has a plan. Everyday Bradley works hard. He practices speaking. The",
        "textdich": ""
    },
    {
        "start": 1529.36,
        "end": 1538.48,
        "text": "words are hard for him, but he tries and tries.",
        "textdich": ""
    },
    {
        "start": 1534.32,
        "end": 1542.08,
        "text": "I help him say each word clearly.",
        "textdich": ""
    },
    {
        "start": 1538.48,
        "end": 1555.12,
        "text": "He practices walking, too. He holds my arm. He takes small steps. He falls. He gets up. He tries again. I do not know",
        "textdich": ""
    },
    {
        "start": 1550.72,
        "end": 1557.84,
        "text": "why he works so hard, but I help him.",
        "textdich": ""
    },
    {
        "start": 1555.12,
        "end": 1569.84,
        "text": "The day of the meeting comes. I go alone. Bradley stays home. I think he is too weak to come. I walk into the big room.",
        "textdich": ""
    },
    {
        "start": 1566.159,
        "end": 1576.559,
        "text": "Lucas sits at a table. Sarah sits next to him. Five lawyers sit around them.",
        "textdich": ""
    },
    {
        "start": 1573.279,
        "end": 1579.84,
        "text": "They all look at me with cold eyes.",
        "textdich": ""
    },
    {
        "start": 1576.559,
        "end": 1593.679,
        "text": "Lucas speaks first. He says, \"I am killing Bradley.\" He says, \"I want the money.\" He shows fake papers. He tells more lies. I try to defend myself, but",
        "textdich": ""
    },
    {
        "start": 1591.12,
        "end": 1600.559,
        "text": "nobody listens. They treat me like garbage. They say I am young and stupid.",
        "textdich": ""
    },
    {
        "start": 1597.6,
        "end": 1607.44,
        "text": "They say I am a criminal. I start to cry. I cannot fight these people alone.",
        "textdich": ""
    },
    {
        "start": 1604.799,
        "end": 1610.88,
        "text": "They are too powerful.",
        "textdich": ""
    },
    {
        "start": 1607.44,
        "end": 1620.4,
        "text": "Then the door opens. Everyone turns to look. Bradley comes in. He sits in a wheelchair.",
        "textdich": ""
    },
    {
        "start": 1616.64,
        "end": 1633.679,
        "text": "A nurse pushes him. Everyone looks shocked. Bradley tells the nurse to stop. He puts his hands on the chair arms. He pushes hard.",
        "textdich": ""
    },
    {
        "start": 1628.96,
        "end": 1636.96,
        "text": "He stands up. His legs shake, but he stands.",
        "textdich": ""
    },
    {
        "start": 1635.44,
        "end": 1645.84,
        "text": "Everyone is silent. Nobody moves. Bradley speaks.",
        "textdich": ""
    },
    {
        "start": 1641.76,
        "end": 1656.64,
        "text": "His words are slow but clear. He says he will give away most of his money. 80% goes to charity. The rest goes to me.",
        "textdich": ""
    },
    {
        "start": 1652.799,
        "end": 1659.84,
        "text": "Lucas and Sarah get nothing. Zero.",
        "textdich": ""
    },
    {
        "start": 1656.64,
        "end": 1671.919,
        "text": "Because they are bad children. Lucas jumps up. He screams. Sarah cries. The lawyers look confused. Bradley sits back down.",
        "textdich": ""
    },
    {
        "start": 1669.84,
        "end": 1683.44,
        "text": "He looks tired, but he looks happy. He defended me one more time. The meeting ends. Lucas lost.",
        "textdich": ""
    },
    {
        "start": 1679.76,
        "end": 1685.76,
        "text": "I won. Bradley and I go home together.",
        "textdich": ""
    },
    {
        "start": 1683.44,
        "end": 1698.08,
        "text": "That night, Bradley and I sit in the living room. He looks serious. He opens a drawer. He takes out our marriage contract, the paper we signed 5 years",
        "textdich": ""
    },
    {
        "start": 1695.039,
        "end": 1711.6,
        "text": "ago. He looks at the paper for a long time. Then he tears it. He rips it into small pieces. The pieces fall on the floor.",
        "textdich": ""
    },
    {
        "start": 1706.72,
        "end": 1723.919,
        "text": "I stare at him. I do not understand. Why did he do that? Bradley takes out a check. He writes numbers on it. Very big numbers.",
        "textdich": ""
    },
    {
        "start": 1719.6,
        "end": 1735.279,
        "text": "He gives it to me. His hand shakes. He speaks slowly. He says, \"I am free now.\" He says I am only 25 years old. He is",
        "textdich": ""
    },
    {
        "start": 1731.12,
        "end": 1744.159,
        "text": "81. He says I am too young. He says I should go. I should find a young man. I should have a real life. I should not",
        "textdich": ""
    },
    {
        "start": 1740.96,
        "end": 1753.44,
        "text": "bury my youth with a dying old man. I look at the check. It is more money than I can imagine. This money can change my",
        "textdich": ""
    },
    {
        "start": 1749.76,
        "end": 1762.88,
        "text": "life. I can do anything I want. But I do not want money. I do not want freedom from Bradley. I tear up the check. I rip",
        "textdich": ""
    },
    {
        "start": 1760.159,
        "end": 1772.399,
        "text": "it just like he ripped the contract. The pieces fall next to his pieces on the floor. Bradley looks shocked. He asks me",
        "textdich": ""
    },
    {
        "start": 1768.96,
        "end": 1784.399,
        "text": "why. He says, \"I can be free. I can be happy.\" I tell him the truth. I say, \"True love is special.\" True love is when someone sees your",
        "textdich": ""
    },
    {
        "start": 1779.919,
        "end": 1794.96,
        "text": "soul, not your face, not your body, your soul. Bradley, see my soul. He knows who I really am. And I see his soul, too. I",
        "textdich": ""
    },
    {
        "start": 1792.399,
        "end": 1806.799,
        "text": "say I will stay with him. I will stay until his last day. This is my choice. I choose him. Bradley cries.",
        "textdich": ""
    },
    {
        "start": 1802.48,
        "end": 1817.36,
        "text": "I cry, too. We hold each other. He is old and weak. I am young and strong. But in this moment, we are the same. We are",
        "textdich": ""
    },
    {
        "start": 1813.36,
        "end": 1820.96,
        "text": "two lonely souls. We found each other.",
        "textdich": ""
    },
    {
        "start": 1817.36,
        "end": 1824.32,
        "text": "We love each other. Age does not matter.",
        "textdich": ""
    },
    {
        "start": 1820.96,
        "end": 1833.2,
        "text": "Money does not matter. The world does not matter. Only this matters. Only us.",
        "textdich": ""
    },
    {
        "start": 1829.12,
        "end": 1836.799,
        "text": "Only love. Bradley holds me tight.",
        "textdich": ""
    },
    {
        "start": 1833.2,
        "end": 1846.159,
        "text": "I hold him tight. We sit together in the quiet room. The torn papers lie on the floor. The old contract, the useless",
        "textdich": ""
    },
    {
        "start": 1842.96,
        "end": 1856.48,
        "text": "check. We do not need them anymore. We are not bound by a contract now. We are bound by love. Real love. Pure love. The",
        "textdich": ""
    },
    {
        "start": 1853.76,
        "end": 1867.2,
        "text": "kind of love that asks for nothing. The kind of love that gives everything. I am his. He is mine forever.",
        "textdich": ""
    },
    {
        "start": 1863.679,
        "end": 1877.279,
        "text": "3 years pass. Bradley and I live in a small house in the country. We sold the big mansion. We do not need it. This",
        "textdich": ""
    },
    {
        "start": 1874.0,
        "end": 1886.88,
        "text": "little house is perfect for us. Bradley lives longer than the doctors said. They said he would die soon, but he does not",
        "textdich": ""
    },
    {
        "start": 1883.279,
        "end": 1892.0,
        "text": "die. Love keeps him alive. Love makes him strong.",
        "textdich": ""
    },
    {
        "start": 1888.799,
        "end": 1904.64,
        "text": "We have a simple life. We plant flowers in the garden. Red roses, yellow sunflowers, white daisies. Bradley tells me where to",
        "textdich": ""
    },
    {
        "start": 1900.96,
        "end": 1911.039,
        "text": "plant them. I dig the holes. We work together.",
        "textdich": ""
    },
    {
        "start": 1906.32,
        "end": 1914.159,
        "text": "We have two dogs now. They are old dogs.",
        "textdich": ""
    },
    {
        "start": 1911.039,
        "end": 1916.96,
        "text": "Nobody wanted them. We took them home.",
        "textdich": ""
    },
    {
        "start": 1914.159,
        "end": 1922.0,
        "text": "They sleep near Bradley's feet. They make him happy.",
        "textdich": ""
    },
    {
        "start": 1919.039,
        "end": 1937.76,
        "text": "Every afternoon I push Bradley in his wheelchair. We go for walks. We look at the trees. We watch the birds. We talk about small things. We are happy.",
        "textdich": ""
    },
    {
        "start": 1933.279,
        "end": 1946.32,
        "text": "Bradley gets weaker each day, but he smiles more. He laughs more. He says these are his best years.",
        "textdich": ""
    },
    {
        "start": 1943.519,
        "end": 1958.08,
        "text": "He says I gave him a gift, the gift of love. One morning, Bradley does not wake up. I sit next to him. I hold his hand.",
        "textdich": ""
    },
    {
        "start": 1955.519,
        "end": 1962.559,
        "text": "He opens his eyes.",
        "textdich": ""
    },
    {
        "start": 1958.08,
        "end": 1969.039,
        "text": "He looks at me. He smiles. He tries to speak. I tell him to rest.",
        "textdich": ""
    },
    {
        "start": 1966.399,
        "end": 1981.76,
        "text": "But he wants to talk. He says he loves me. He says, \"Thank you.\" Then he closes his eyes. He stops breathing. He dies in",
        "textdich": ""
    },
    {
        "start": 1976.559,
        "end": 1994.159,
        "text": "my arms, peaceful, quiet. He is 84 years old. I find a letter on his desk. He wrote it for me. The words say, \"Thank you for giving me a second most",
        "textdich": ""
    },
    {
        "start": 1990.08,
        "end": 2010.559,
        "text": "brilliant life. I cry for many days. But I do not feel sad forever. I feel grateful. I had something special, something rare, true love.",
        "textdich": ""
    },
    {
        "start": 2005.039,
        "end": 2022.88,
        "text": "Now I stand at his grave. I am 28 years old. I look different now. I am stronger. I am wiser. Life changed me. I",
        "textdich": ""
    },
    {
        "start": 2018.88,
        "end": 2030.88,
        "text": "put flowers on the grave. Red roses. His favorite. People say I wasted my youth.",
        "textdich": ""
    },
    {
        "start": 2026.96,
        "end": 2033.44,
        "text": "They say I married an old man for money.",
        "textdich": ""
    },
    {
        "start": 2030.88,
        "end": 2036.08,
        "text": "They do not understand.",
        "textdich": ""
    },
    {
        "start": 2033.44,
        "end": 2043.6,
        "text": "They never will. I do not regret anything. I loved Bradley. He loved me.",
        "textdich": ""
    },
    {
        "start": 2041.039,
        "end": 2055.2,
        "text": "We had something beautiful, something pure. Money cannot buy this. Fame cannot buy this. Only two souls can create",
        "textdich": ""
    },
    {
        "start": 2051.2,
        "end": 2065.76,
        "text": "this. I smile at his grave. I kept my promise. I stayed until the last day. I gave him love. He gave me love. And that",
        "textdich": ""
    },
    {
        "start": 2062.56,
        "end": 2076.56,
        "text": "is enough. That is everything. I walk away from the grave. The sun shines on my face. I am free now. But I carry Bradley in my heart forever.",
        "textdich": ""
    }
]