[
    {
        "start": 0.16,
        "end": 16.52,
        "text": "My name is Lisa. I am 26 years old. I live in a small town in the US. When I was young, I wanted a happy life. I wanted to get married. I wanted",
        "textdich": ""
    },
    {
        "start": 15.04,
        "end": 30.519,
        "text": "one or two children. I wanted a small house and a good man. I thought love was easy. But I was wrong. I met Mark when I was 22.",
        "textdich": ""
    },
    {
        "start": 29.199,
        "end": 45.28,
        "text": "He was 25. He was tall. He had brown hair and blue eyes. He was funny. He smiled a lot. He liked to talk. We met at a",
        "textdich": ""
    },
    {
        "start": 42.399,
        "end": 58.079,
        "text": "friend's party. He asked for my phone number. I gave it to him. The next day, he sent me a message. He asked, \"Do you want to meet for",
        "textdich": ""
    },
    {
        "start": 55.079,
        "end": 73.439,
        "text": "coffee?\" I said, \"Yes.\" We met in town. We talked for a long time. I liked him. After that, we saw each other many times. He made me",
        "textdich": ""
    },
    {
        "start": 69.72,
        "end": 90.4,
        "text": "laugh. He gave me flowers. He called me every night. After 3 months, I told him, \"I love you.\" He said, \"I love you, too.\" I believed him.",
        "textdich": ""
    },
    {
        "start": 87.28,
        "end": 98.2,
        "text": "We were together for one year. I worked at a grocery store. Mark worked at a car repair shop.",
        "textdich": ""
    },
    {
        "start": 95.6,
        "end": 114.24,
        "text": "We didn't have much money, but I was happy. Then something changed. One day I felt sick in the morning. I thought I had a cold, but the",
        "textdich": ""
    },
    {
        "start": 111.04,
        "end": 117.6,
        "text": "next day I felt sick again.",
        "textdich": ""
    },
    {
        "start": 114.24,
        "end": 131.92,
        "text": "My best friend Sarah said, \"Maybe you are pregnant.\" I said, \"No, I don't think so.\" But I was not sure. I bought a test. I",
        "textdich": ""
    },
    {
        "start": 128.44,
        "end": 137.959,
        "text": "waited. The test showed I was pregnant.",
        "textdich": ""
    },
    {
        "start": 131.92,
        "end": 149.04,
        "text": "I was shaking. I looked at it. I was pregnant. That night, I went to Mark's apartment. I looked at him and said, \"I have",
        "textdich": ""
    },
    {
        "start": 145.64,
        "end": 168.8,
        "text": "news.\" He looked at me and asked, \"What is it?\" I said, \"I am going to have a baby.\" He was quiet. He looked at the floor. He did not speak for a long",
        "textdich": ""
    },
    {
        "start": 163.48,
        "end": 181.319,
        "text": "time. Then he said, \"Are you sure?\" I said yes I did a test I am sure. He stood up.",
        "textdich": ""
    },
    {
        "start": 178.08,
        "end": 196.64,
        "text": "He went to the window. He looked outside. He did not look at me. This is not a good time. He said I am not ready to be a",
        "textdich": ""
    },
    {
        "start": 191.319,
        "end": 197.72,
        "text": "father. I felt cold. I felt sick.",
        "textdich": ""
    },
    {
        "start": 196.64,
        "end": 219.239,
        "text": "I said, \"But we love each other.\" He said nothing. He just said, \"I need time to think.\" That night, he did not hold me or kiss me. I could not",
        "textdich": ""
    },
    {
        "start": 215.239,
        "end": 228.319,
        "text": "sleep. In the morning, he left early. He said, \"See you later.\" But I knew something was wrong.",
        "textdich": ""
    },
    {
        "start": 225.12,
        "end": 242.92,
        "text": "After that, everything changed. He stopped calling me. He stopped answering my messages. He didn't want to see me. One day, I went to his",
        "textdich": ""
    },
    {
        "start": 240.28,
        "end": 255.12,
        "text": "apartment. I knocked on the door. He did not open it. I sent him one last message. He replied, \"I can't do this.",
        "textdich": ""
    },
    {
        "start": 252.64,
        "end": 257.88,
        "text": "I'm sorry.",
        "textdich": ""
    },
    {
        "start": 255.12,
        "end": 269.639,
        "text": "That was the last time I heard from Mark. I sat on my bed and cried. I cried for hours. I could not believe it. I was",
        "textdich": ""
    },
    {
        "start": 266.08,
        "end": 285.16,
        "text": "pregnant and alone. I told my mom and dad. My mom cried with me. My dad said nothing. Then he said, \"We are here for you, Lisa.\"",
        "textdich": ""
    },
    {
        "start": 282.72,
        "end": 302.639,
        "text": "I moved back to my parents' house. I felt like a child, but I was not. I was going to be a mother. Every day, I felt more tired. My belly grew",
        "textdich": ""
    },
    {
        "start": 299.24,
        "end": 314.24,
        "text": "bigger. I went to the doctor. I saw my baby on the screen. I heard her heartbeat. I smiled and cried at the same time.",
        "textdich": ""
    },
    {
        "start": 312.0,
        "end": 321.24,
        "text": "I worked at the grocery store until the baby was born. I bought small clothes in a crib.",
        "textdich": ""
    },
    {
        "start": 319.44,
        "end": 338.56,
        "text": "I wanted to be ready. One night, I had strong pain. My mom took me to the hospital. The nurse said, \"You were going to have the baby",
        "textdich": ""
    },
    {
        "start": 335.56,
        "end": 340.6,
        "text": "tonight. I was scared.",
        "textdich": ""
    },
    {
        "start": 338.56,
        "end": 359.639,
        "text": "The pain was very strong. I held my mom's hand. After many hours, I heard a small cry. The nurse said, \"It's a girl.\" They gave her to me. She was",
        "textdich": ""
    },
    {
        "start": 356.199,
        "end": 376.08,
        "text": "small. She was soft and warm. I looked at her and smiled. I said, \"Hello, baby. I am your mom. I named her Emma. She was",
        "textdich": ""
    },
    {
        "start": 373.4,
        "end": 389.639,
        "text": "beautiful. I stayed in the hospital for two days. Then I went home. My mom helped me with Emma, but at night it was just me and my baby. Emma cried a",
        "textdich": ""
    },
    {
        "start": 387.16,
        "end": 397.24,
        "text": "lot. I was very tired. I did not sleep much. I changed her diapers.",
        "textdich": ""
    },
    {
        "start": 396.08,
        "end": 413.72,
        "text": "I fed her. I held her when she cried. Sometimes I sat on the bed and cried, too. I was very tired, but I looked at her small",
        "textdich": ""
    },
    {
        "start": 410.6,
        "end": 429.039,
        "text": "face. I kissed her head and said, \"I love you.\" Mark never came. He never called. He did not ask about Emma.",
        "textdich": ""
    },
    {
        "start": 425.44,
        "end": 441.96,
        "text": "One day I saw him in town. He walked past me. He looked at me then looked away. He said nothing. I wanted to shout. I wanted to",
        "textdich": ""
    },
    {
        "start": 438.919,
        "end": 455.759,
        "text": "ask, \"How can you leave your baby?\" But I said nothing. I just looked down at Emma in her stroller. When Emma was 5 months old, I",
        "textdich": ""
    },
    {
        "start": 452.56,
        "end": 470.759,
        "text": "went back to work. My mom watched her when I was working. I missed Emma every minute, but I needed the money. At work, I smiled and said hello to",
        "textdich": ""
    },
    {
        "start": 467.24,
        "end": 485.8,
        "text": "customers. I carried boxes. I stood on my feet for hours. When I got home, I was tired, but Emma needed me. I cooked dinner. I cleaned the house.",
        "textdich": ""
    },
    {
        "start": 484.479,
        "end": 506.479,
        "text": "I fed Emma. I bathed her. I put her to sleep. I never stopped. One night, Emma was sleeping. I sat in the kitchen and drank cold",
        "textdich": ""
    },
    {
        "start": 501.879,
        "end": 515.56,
        "text": "tea. I looked at the wall. I felt tired but strong. I told myself, \"You are tired, Lisa.",
        "textdich": ""
    },
    {
        "start": 513.519,
        "end": 531.72,
        "text": "But you are doing okay. I smiled because I was now a mother. Emma grew fast. She smiled more each day. When she was 6 months old, she sat by",
        "textdich": ""
    },
    {
        "start": 528.68,
        "end": 540.72,
        "text": "herself. She played with her toys. I watched her and smiled.",
        "textdich": ""
    },
    {
        "start": 537.08,
        "end": 555.959,
        "text": "Sometimes I cried too. I was proud of her. I was also tired. Every day was busy. I worked, cleaned, and cared for Emma. But she gave me",
        "textdich": ""
    },
    {
        "start": 552.68,
        "end": 571.519,
        "text": "strength. I did not have many friends. My old friends did not visit much. They had busy lives. They went out at night. They posted happy pictures",
        "textdich": ""
    },
    {
        "start": 568.2,
        "end": 575.08,
        "text": "online. I stayed at home.",
        "textdich": ""
    },
    {
        "start": 571.519,
        "end": 594.36,
        "text": "I watched cartoons with Emma. I sang to her when she cried. I told her, \"You are not alone. I am here.\" Before I tell you more, I want to",
        "textdich": ""
    },
    {
        "start": 591.0,
        "end": 610.12,
        "text": "ask, where are you listening from? Sometimes I wonder if someone out there hears me. someone who understands my feelings. It makes me strong to know I",
        "textdich": ""
    },
    {
        "start": 605.76,
        "end": 623.2,
        "text": "am not alone. Please tell me in the comments. My mom helped me a lot. She held Emma when I took a shower. She made dinner when I was",
        "textdich": ""
    },
    {
        "start": 619.56,
        "end": 629.72,
        "text": "tired. My dad did not talk much, but he played with Emma. He made her laugh.",
        "textdich": ""
    },
    {
        "start": 627.44,
        "end": 647.56,
        "text": "I was thankful for my parents. Without them, life would be harder. Sometimes I saw Mark in town. He never said hello. He just walked",
        "textdich": ""
    },
    {
        "start": 643.399,
        "end": 657.64,
        "text": "past. One day, Emma was in my arms. Mark looked at us. He looked for a second, then walked away.",
        "textdich": ""
    },
    {
        "start": 655.76,
        "end": 674.24,
        "text": "I held Emma closer. I kissed her head. I told myself, \"You don't need him. I will give you everything.\" Money was a big",
        "textdich": ""
    },
    {
        "start": 671.24,
        "end": 686.839,
        "text": "problem. My job at the grocery store did not pay much. I bought only what we needed. Baby food, diapers, warm clothes. I did not buy clothes for",
        "textdich": ""
    },
    {
        "start": 683.279,
        "end": 700.88,
        "text": "myself. I wore old jeans and simple shirts. I did not care about how I looked. I only cared about Emma. At work, I was quiet. I did my",
        "textdich": ""
    },
    {
        "start": 697.0,
        "end": 709.48,
        "text": "job. I smiled at customers. But inside, I was tired. My feet hurt. My back hurt.",
        "textdich": ""
    },
    {
        "start": 705.92,
        "end": 718.0,
        "text": "But I always said, \"I am okay.\" When Emma was sick, I stayed home.",
        "textdich": ""
    },
    {
        "start": 714.0,
        "end": 734.68,
        "text": "My boss was not happy. He said, \"You can't miss so many days.\" I said, \"My baby needs me.\" He said, \"Be careful. You need this job.\" I felt",
        "textdich": ""
    },
    {
        "start": 731.48,
        "end": 745.88,
        "text": "scared. I did not want to lose my job. I needed it for Emma. At home, Emma started to stand.",
        "textdich": ""
    },
    {
        "start": 742.959,
        "end": 763.72,
        "text": "She held the side of the sofa and smiled. She looked proud. I clapped and said, \"Good job.\" She laughed. Her laugh made me",
        "textdich": ""
    },
    {
        "start": 759.88,
        "end": 772.76,
        "text": "happy. Her laugh made the house warm. One evening, Emma had a fever. Her head was hot.",
        "textdich": ""
    },
    {
        "start": 770.079,
        "end": 790.12,
        "text": "She cried and would not eat. I called the doctor. He said, \"It may be a virus. Keep her cool and give her water.\" I held her all",
        "textdich": ""
    },
    {
        "start": 785.88,
        "end": 806.279,
        "text": "night. I did not sleep. I was afraid. I sang soft songs and said, \"Please get better.\" In the morning, she still had a",
        "textdich": ""
    },
    {
        "start": 801.56,
        "end": 825.36,
        "text": "fever. My mom said, \"Let's go to the clinic. We went.\" The nurse gave Emma medicine. She said she will be okay. I felt better. I kissed Emma's warm",
        "textdich": ""
    },
    {
        "start": 821.88,
        "end": 831.24,
        "text": "cheek. Emma got stronger. She started walking at 13 months.",
        "textdich": ""
    },
    {
        "start": 828.399,
        "end": 849.399,
        "text": "She fell many times but got up again. I clapped for her. She smiled with all her teeth. My heart was full. I said, \"You are so brave.\" Time went",
        "textdich": ""
    },
    {
        "start": 846.6,
        "end": 866.8,
        "text": "by. Emma turned two. She started to talk more. She said, \"Mama ball.\" and milk. She liked to dance. She liked to play with socks and shoes. I laughed",
        "textdich": ""
    },
    {
        "start": 864.72,
        "end": 880.04,
        "text": "when she put her tiny foot in my big shoe. She looked serious. One Sunday, I took her to the park. She ran on the grass. She saw other",
        "textdich": ""
    },
    {
        "start": 877.72,
        "end": 889.079,
        "text": "children. She waved at them. One boy gave her a toy car. She smiled.",
        "textdich": ""
    },
    {
        "start": 886.48,
        "end": 907.32,
        "text": "I sat on a bench and watched her. The sun was warm. I felt peaceful. Then I saw Mark again. He was at the other end of the park. He was with another",
        "textdich": ""
    },
    {
        "start": 904.36,
        "end": 917.0,
        "text": "woman. She had red hair. They held hands. I looked away.",
        "textdich": ""
    },
    {
        "start": 914.16,
        "end": 934.56,
        "text": "I did not want Emma to see him. She did not know him. He was her father, but he was not in her life. That night, I thought about that moment. I did not",
        "textdich": ""
    },
    {
        "start": 931.72,
        "end": 945.8,
        "text": "cry. I just looked at the wall and sat on the bed. I thought he chose to walk away. I will not wait for him.",
        "textdich": ""
    },
    {
        "start": 943.04,
        "end": 966.759,
        "text": "I will not beg. I looked at Emma. She was asleep. She looked safe and happy. I whispered, \"You have me and that is enough.\" A few days later, I got a",
        "textdich": ""
    },
    {
        "start": 964.88,
        "end": 980.04,
        "text": "letter from the housing office. They said I could get a small apartment. It was not big. But it was mine. I felt excited. I packed our",
        "textdich": ""
    },
    {
        "start": 977.56,
        "end": 995.16,
        "text": "things. My mom helped me. We put Emma's toys in a box. We folded her clothes. My dad drove us to the new apartment. The apartment had one",
        "textdich": ""
    },
    {
        "start": 992.16,
        "end": 1008.12,
        "text": "bedroom, one bathroom, and a small kitchen. The walls were white. The floor was clean. I put Emma's bed near mine. I put a photo of us on the",
        "textdich": ""
    },
    {
        "start": 1005.32,
        "end": 1023.839,
        "text": "table. We ate dinner on the floor that night. We had toast and tea. Emma laughed and dropped a spoon. I picked it up and",
        "textdich": ""
    },
    {
        "start": 1017.079,
        "end": 1037.039,
        "text": "smiled. I said, \"This is our home now.\" In the new apartment, life was quiet but hard. I worked. I took care of Emma. I",
        "textdich": ""
    },
    {
        "start": 1033.199,
        "end": 1044.199,
        "text": "paid rent. I cooked simple meals. I read bedtime stories. Emma liked books with animals.",
        "textdich": ""
    },
    {
        "start": 1041.919,
        "end": 1057.6,
        "text": "She liked the one with the blue bear. She said, \"Bar is funny.\" I kissed her and said, \"You are funny, too.",
        "textdich": ""
    },
    {
        "start": 1054.799,
        "end": 1069.48,
        "text": "Some nights I felt lonely. I missed talking to someone. I missed hugs, but I never missed Mark. I did not want someone who left. I wanted peace. I",
        "textdich": ""
    },
    {
        "start": 1067.44,
        "end": 1083.64,
        "text": "wanted love that stayed. One day at work, a woman came to my checkout. She had a baby in a stroller. She looked tired like me.",
        "textdich": ""
    },
    {
        "start": 1080.08,
        "end": 1097.48,
        "text": "She smiled and said, \"It's hard, isn't it?\" I smiled and said, \"Yes, but they are worth it.\" She said, \"You're doing a good",
        "textdich": ""
    },
    {
        "start": 1094.36,
        "end": 1113.16,
        "text": "job.\" Her words made me feel good. That night, I told Emma, \"You are my sunshine.\" She smiled and hugged me. I was still tired. I was still",
        "textdich": ""
    },
    {
        "start": 1110.52,
        "end": 1129.32,
        "text": "poor, but I was not broken. I was strong. I was a mother. Emma was now 3 years old. She could talk more. She asked many",
        "textdich": ""
    },
    {
        "start": 1124.52,
        "end": 1142.28,
        "text": "questions. She asked, \"Why is the sky blue? Where do birds sleep?\" I smiled and answered simply. She was smart. She liked to",
        "textdich": ""
    },
    {
        "start": 1139.16,
        "end": 1149.28,
        "text": "learn. She liked to sing and dance. Her laugh was my favorite sound.",
        "textdich": ""
    },
    {
        "start": 1145.919,
        "end": 1162.32,
        "text": "We had a simple life. We lived in our small apartment. We had a routine. I woke up early. I made breakfast. Emma ate",
        "textdich": ""
    },
    {
        "start": 1159.559,
        "end": 1176.76,
        "text": "slowly. She always wanted one more spoon of yogurt. I took her to daycare near our home. Then I went to work. Every day was the same. But I did not",
        "textdich": ""
    },
    {
        "start": 1174.44,
        "end": 1194.96,
        "text": "mind. I had peace. I had my child. I had a reason to wake up. At night, Emma sat on my lap. I read her stories. She always asked for the same",
        "textdich": ""
    },
    {
        "start": 1191.44,
        "end": 1198.52,
        "text": "book about the red bus.",
        "textdich": ""
    },
    {
        "start": 1194.96,
        "end": 1211.12,
        "text": "She said, \"The bus goes beep beep.\" I laughed. I kissed her and said, \"Sleep now, baby.\" She closed her eyes and held my",
        "textdich": ""
    },
    {
        "start": 1208.28,
        "end": 1225.32,
        "text": "hand. Sometimes I looked at her face in the dark. I thought about the past. I thought about the pain. I also thought about the love.",
        "textdich": ""
    },
    {
        "start": 1223.039,
        "end": 1238.2,
        "text": "My life was not easy, but I was proud. One day, I got a letter from Emma's daycare.",
        "textdich": ""
    },
    {
        "start": 1234.24,
        "end": 1247.44,
        "text": "It said, \"Emma is ready for school next year.\" My eyes filled with tears.",
        "textdich": ""
    },
    {
        "start": 1243.559,
        "end": 1260.88,
        "text": "\"School? My baby is growing up. She is not a baby anymore.\" I told her the news. She clapped and said, \"School, I want a pink",
        "textdich": ""
    },
    {
        "start": 1257.0,
        "end": 1270.96,
        "text": "bag.\" I smiled. \"You will get a pink bag and new shoes.\" I said, \"That weekend, we went shopping.",
        "textdich": ""
    },
    {
        "start": 1267.76,
        "end": 1285.08,
        "text": "We looked at school bags. Emma touched each one. She said, \"Too big, too small.\" Then she saw a pink one with stars.",
        "textdich": ""
    },
    {
        "start": 1282.32,
        "end": 1300.159,
        "text": "She held it and smiled. We went home. Emma wore the bag inside the house. She walked around like a little student. I",
        "textdich": ""
    },
    {
        "start": 1296.28,
        "end": 1315.28,
        "text": "laughed. I felt happy and sad. I was proud of her. But I also felt scared. She was growing so fast. Time went by.",
        "textdich": ""
    },
    {
        "start": 1311.28,
        "end": 1332.84,
        "text": "Emma turned four. She was taller. Her hair was longer. She made friends. She said, \"Mom, my friend is Lucy. She has a dog.\" I said, \"That's",
        "textdich": ""
    },
    {
        "start": 1329.0,
        "end": 1348.96,
        "text": "nice.\" She asked, \"Can we get a dog?\" I said, \"Maybe one day.\" I worked more hours now. My boss gave me extra shifts. I said yes to everyone. I",
        "textdich": ""
    },
    {
        "start": 1345.76,
        "end": 1363.72,
        "text": "needed more money. I wanted Emma to have more. Sometimes I felt tired, but I always told myself, \"You can do this, Lisa.\" One Friday, I came home",
        "textdich": ""
    },
    {
        "start": 1361.32,
        "end": 1368.919,
        "text": "late. My mom was there. She watched Emma that evening.",
        "textdich": ""
    },
    {
        "start": 1367.44,
        "end": 1386.4,
        "text": "I took off my shoes. Emma ran to me. She said, \"Mommy, you're home.\" I hugged her tight. My mom smiled and said she missed",
        "textdich": ""
    },
    {
        "start": 1383.559,
        "end": 1397.48,
        "text": "you. I looked at my daughter and felt something deep inside. After my mom left, I made tea. Emma played with her doll.",
        "textdich": ""
    },
    {
        "start": 1395.52,
        "end": 1415.2,
        "text": "Then she looked at me and asked, \"Mom, do I have a dad?\" My hand froze. I looked at her. I sat next to her. Why do you ask? I",
        "textdich": ""
    },
    {
        "start": 1411.4,
        "end": 1427.52,
        "text": "said. She said, \"At school, my friend said her dad picks her up. Do I have a dad, too?\" I felt a little pain in my chest.",
        "textdich": ""
    },
    {
        "start": 1423.039,
        "end": 1442.64,
        "text": "I held her hand. I said, \"Yes, you have a dad.\" \"But he does not live with us,\" she asked. \"Why not?\" I said, \"He made a",
        "textdich": ""
    },
    {
        "start": 1439.48,
        "end": 1455.32,
        "text": "choice. He did not want to stay.\" She looked at me with soft eyes. She said, \"But I have you.\" I smiled and kissed her head.",
        "textdich": ""
    },
    {
        "start": 1453.52,
        "end": 1469.4,
        "text": "Yes, I said. You have me and I will never leave. That night I cried a little in the kitchen. I cried quietly. I did not want her to hear. I",
        "textdich": ""
    },
    {
        "start": 1467.76,
        "end": 1483.76,
        "text": "just needed to let it out. One evening, a woman from Emma's school came to talk to me. She said, \"I'm Emma's teacher. She is doing well.",
        "textdich": ""
    },
    {
        "start": 1480.559,
        "end": 1488.08,
        "text": "She is kind and curious.",
        "textdich": ""
    },
    {
        "start": 1483.76,
        "end": 1505.039,
        "text": "I smiled. The teacher said, \"You are doing a good job. She is a happy girl.\" Her words stayed in my heart. I was trying my best. Maybe my best was",
        "textdich": ""
    },
    {
        "start": 1501.08,
        "end": 1506.679,
        "text": "enough. Emma started school that year.",
        "textdich": ""
    },
    {
        "start": 1505.039,
        "end": 1514.44,
        "text": "She wore a new uniform. She held my hand tightly on her first day.",
        "textdich": ""
    },
    {
        "start": 1511.36,
        "end": 1529.4,
        "text": "I said, \"You are brave. You will do great.\" She asked, \"Will you wait for me?\" I said, \"Yes, I will always wait for you.\" She went into",
        "textdich": ""
    },
    {
        "start": 1526.48,
        "end": 1540.96,
        "text": "the classroom. She looked back and waved. I smiled and waved back. Then I sat on a bench outside.",
        "textdich": ""
    },
    {
        "start": 1536.72,
        "end": 1552.559,
        "text": "I cried again, not because I was sad, but because I was proud. Our life was still simple. I still worked long hours. I",
        "textdich": ""
    },
    {
        "start": 1549.279,
        "end": 1564.96,
        "text": "still counted every coin, but I had a little girl who smiled at me every morning. She said, \"Good morning, Mom.\" With joy, that was more than",
        "textdich": ""
    },
    {
        "start": 1562.4,
        "end": 1578.84,
        "text": "enough. One Sunday, Emma and I went to the park. She ran and played. I sat on a bench and watched her. A man sat next to me. He said, \"Is",
        "textdich": ""
    },
    {
        "start": 1575.36,
        "end": 1597.96,
        "text": "she your daughter?\" I said, \"Yes.\" He said, \"She looks happy.\" I smiled. I said, \"She is.\" He said, \"That's all that matters.\" I looked at",
        "textdich": ""
    },
    {
        "start": 1595.48,
        "end": 1618.48,
        "text": "Emma. I thought about everything. The tears, the nights alone, the fear. Then I looked at her bright smile, her strong little legs, her big",
        "textdich": ""
    },
    {
        "start": 1612.6,
        "end": 1633.96,
        "text": "eyes. Yes, I thought she is happy. And I did it all alone. If you liked my story, please like, comment, and share. More simple and emotional stories",
        "textdich": ""
    },
    {
        "start": 1630.4,
        "end": 1633.96,
        "text": "are coming soon.",
        "textdich": ""
    }
]