[
    {
        "start": 0.32,
        "end": 13.28,
        "text": "My name is Ariel. Today we will talk about 50 daily routine sentences for work. Many people know English words,",
        "textdich": ""
    },
    {
        "start": 10.32,
        "end": 23.039,
        "text": "but they cannot make simple sentences at work. If this happens to you, you are not alone. Today I will help you. We",
        "textdich": ""
    },
    {
        "start": 19.92,
        "end": 29.92,
        "text": "will follow one workday. We will use easy words. We will use short sentences.",
        "textdich": ""
    },
    {
        "start": 27.119,
        "end": 39.68,
        "text": "You can speak them every day. You can repeat them and you can feel more confident. Now imagine your morning. You",
        "textdich": ""
    },
    {
        "start": 35.76,
        "end": 51.84,
        "text": "wake up, you say. I wake up early. I get out of bed. I make my bed. I wash my face. I brush my teeth. I take a shower.",
        "textdich": ""
    },
    {
        "start": 48.16,
        "end": 63.52,
        "text": "I get dressed. I wear my work clothes. I comb my hair. I check the time. I feel ready. Then you go to the kitchen. You",
        "textdich": ""
    },
    {
        "start": 58.8,
        "end": 76.4,
        "text": "say I make breakfast. I eat breakfast. I drink tea. I drink coffee. I drink water. I take my lunchbox. I pack my bag. I check my phone. I take my keys.",
        "textdich": ""
    },
    {
        "start": 73.36,
        "end": 86.08,
        "text": "Then you leave home. You say, \"I leave the house. I lock the door. I walk to the bus stop. I take the bus. I take the",
        "textdich": ""
    },
    {
        "start": 82.799,
        "end": 97.36,
        "text": "train. I drive to work. I reach the office. I arrive on time. I enter the building. I say good morning. I greet my",
        "textdich": ""
    },
    {
        "start": 93.119,
        "end": 100.0,
        "text": "co-workers. I smile. I sit at my desk.",
        "textdich": ""
    },
    {
        "start": 97.36,
        "end": 102.0,
        "text": "Then work starts.",
        "textdich": ""
    },
    {
        "start": 100.0,
        "end": 105.6,
        "text": "You say.",
        "textdich": ""
    },
    {
        "start": 102.0,
        "end": 109.119,
        "text": "I turn on my computer. I open my email.",
        "textdich": ""
    },
    {
        "start": 105.6,
        "end": 120.24,
        "text": "I check messages. I reply to emails. I make a to-do list. I start my tasks. I work on my project. I focus on my work.",
        "textdich": ""
    },
    {
        "start": 116.479,
        "end": 128.08,
        "text": "I make a phone call. I answer a call. I attend a meeting. I listen carefully.",
        "textdich": ""
    },
    {
        "start": 124.079,
        "end": 139.599,
        "text": "I take notes. I ask a question. I share an update. I finish one task. I start another task. I solve a problem. I ask",
        "textdich": ""
    },
    {
        "start": 135.92,
        "end": 149.599,
        "text": "for help. I follow instructions. I check my work. I fix mistakes. I send the file. I meet a deadline. Then you take a",
        "textdich": ""
    },
    {
        "start": 146.16,
        "end": 163.92,
        "text": "break, you say. I take a short break. I drink water. I stretch my body. I rest my eyes. I go back to work. Then lunchtime comes, you say. I take my",
        "textdich": ""
    },
    {
        "start": 159.519,
        "end": 167.44,
        "text": "lunch break. I eat lunch. I sit quietly.",
        "textdich": ""
    },
    {
        "start": 163.92,
        "end": 171.36,
        "text": "I talk a little. I feel relaxed.",
        "textdich": ""
    },
    {
        "start": 167.44,
        "end": 182.879,
        "text": "Then you return to work. You say. I continue working. I complete my tasks. I update my manager. I plan for tomorrow.",
        "textdich": ""
    },
    {
        "start": 179.04,
        "end": 194.8,
        "text": "Then the day ends, you say. I save my work. I shut down my computer. I clean my desk. I pack my bag. I say goodbye. I",
        "textdich": ""
    },
    {
        "start": 191.04,
        "end": 206.08,
        "text": "leave the office. I go back home. I feel tired. I feel proud. I rest at home. I have dinner. I go to bed.",
        "textdich": ""
    },
    {
        "start": 203.2,
        "end": 217.68,
        "text": "Now you have a full day in simple English. Please speak these sentences every day. Say them with your mouth. Say them slowly. Repeat them again and",
        "textdich": ""
    },
    {
        "start": 216.08,
        "end": 221.12,
        "text": "again.",
        "textdich": ""
    },
    {
        "start": 217.68,
        "end": 225.28,
        "text": "This is how your English becomes strong.",
        "textdich": ""
    },
    {
        "start": 221.12,
        "end": 227.84,
        "text": "Do you want the next 1,000 words?",
        "textdich": ""
    },
    {
        "start": 225.28,
        "end": 237.519,
        "text": "I continue this workday calmly and slowly. I arrive at my desk again. I sit comfortably.",
        "textdich": ""
    },
    {
        "start": 234.159,
        "end": 249.519,
        "text": "I take a deep breath. I feel ready to work. I open my notebook. I check my schedule. I see my tasks. I set my priorities.",
        "textdich": ""
    },
    {
        "start": 246.239,
        "end": 261.519,
        "text": "I start with the first task. I read the instructions. I understand the goal. I begin my work. I type carefully. I check",
        "textdich": ""
    },
    {
        "start": 257.759,
        "end": 273.36,
        "text": "my spelling. I save my file. I review my work. I make small changes. I feel focused. I feel calm. I do not rush. I",
        "textdich": ""
    },
    {
        "start": 269.36,
        "end": 286.56,
        "text": "work step by step. I stay organized. I keep my desk clean. I keep my files in order. I label my documents. I avoid confusion. I stay professional. I",
        "textdich": ""
    },
    {
        "start": 283.12,
        "end": 300.08,
        "text": "respect my time. I respect my work. I receive an email. I read it slowly. I understand the message. I reply politely. I use simple words. I keep my",
        "textdich": ""
    },
    {
        "start": 296.639,
        "end": 311.199,
        "text": "message clear. I send the email. I wait for a reply. I continue my work. I get a phone call. I answer the call. I listen",
        "textdich": ""
    },
    {
        "start": 307.28,
        "end": 325.52,
        "text": "carefully. I speak clearly. I explain my point. I confirm the details. I end the call. I write a note. I remember the task. I follow up later. I attend",
        "textdich": ""
    },
    {
        "start": 321.84,
        "end": 335.759,
        "text": "another meeting. I join on time. I greet everyone. I listen to the discussion. I share my opinion. I stay respectful. I",
        "textdich": ""
    },
    {
        "start": 331.84,
        "end": 343.36,
        "text": "stay calm. I take notes again. I understand my role. I leave the meeting.",
        "textdich": ""
    },
    {
        "start": 339.84,
        "end": 358.08,
        "text": "I return to my desk. I apply what I learned. I continue my tasks. I work with patience. I handle pressure. I manage my time. I avoid distractions. I",
        "textdich": ""
    },
    {
        "start": 354.0,
        "end": 361.199,
        "text": "stay focused on work. I ignore my phone.",
        "textdich": ""
    },
    {
        "start": 358.08,
        "end": 368.24,
        "text": "I check messages later. I keep my attention strong. I feel productive.",
        "textdich": ""
    },
    {
        "start": 365.199,
        "end": 384.16,
        "text": "I complete one more task. I mark it done. I move to the next task. I repeat the process. I read. I work. I check. I fix. I finish.",
        "textdich": ""
    },
    {
        "start": 380.319,
        "end": 395.52,
        "text": "I feel progress. I feel confident. I face a small problem. I do not panic. I think calmly. I try a solution. I test",
        "textdich": ""
    },
    {
        "start": 391.84,
        "end": 409.44,
        "text": "it carefully. I see the result. I adjust my work. I solve the problem. I feel relief. I learn something new. I gain experience. I become better.",
        "textdich": ""
    },
    {
        "start": 405.759,
        "end": 423.599,
        "text": "I take another short break. I stand up slowly. I stretch my arms. I relax my shoulders. I breathe deeply. I feel refreshed.",
        "textdich": ""
    },
    {
        "start": 419.199,
        "end": 426.8,
        "text": "I return to my desk. I drink some water.",
        "textdich": ""
    },
    {
        "start": 423.599,
        "end": 439.039,
        "text": "I continue working again. I finish more tasks. I keep my pace steady. I stay positive. I stay patient. I check the",
        "textdich": ""
    },
    {
        "start": 434.88,
        "end": 453.199,
        "text": "time. I see the day moving forward. I feel slightly tired. I keep going. I remind myself to stay focused. I complete important work first. I leave",
        "textdich": ""
    },
    {
        "start": 449.68,
        "end": 463.12,
        "text": "small tasks for later. I stay organized until the end. I receive feedback. I read it carefully. I accept suggestions.",
        "textdich": ""
    },
    {
        "start": 461.039,
        "end": 465.919,
        "text": "I make improvements.",
        "textdich": ""
    },
    {
        "start": 463.12,
        "end": 479.199,
        "text": "I update my work. I send the final version. I wait for approval. I feel satisfied. I prepare for the end of the day. I review what I did. I note",
        "textdich": ""
    },
    {
        "start": 475.199,
        "end": 493.28,
        "text": "unfinished tasks. I plan for tomorrow. I write reminders. I set goals. I feel prepared. I save all files. I close programs. I shut down my computer. I",
        "textdich": ""
    },
    {
        "start": 489.919,
        "end": 497.36,
        "text": "clean my desk again. I arrange my chair.",
        "textdich": ""
    },
    {
        "start": 493.28,
        "end": 508.24,
        "text": "I pack my bag. I check my belongings. I stand up. I say goodbye politely. I thank my co-workers. I leave the office",
        "textdich": ""
    },
    {
        "start": 504.0,
        "end": 523.919,
        "text": "calmly. I walk outside. I feel the air change. I relax my mind. I go home slowly. I think about my day. I feel proud of my effort. I know I did my",
        "textdich": ""
    },
    {
        "start": 519.2,
        "end": 537.2,
        "text": "best. I reach home. I remove my shoes. I wash my hands. I sit down. I rest my body. I feel peace. I reflect quietly.",
        "textdich": ""
    },
    {
        "start": 533.6,
        "end": 541.68,
        "text": "I prepare for the next day. I sleep with a calm mind.",
        "textdich": ""
    },
    {
        "start": 539.36,
        "end": 553.2,
        "text": "I begin another workday with the same calm routine. I wake up early. I open my eyes slowly. I stretch my body. I sit on",
        "textdich": ""
    },
    {
        "start": 549.68,
        "end": 564.32,
        "text": "the bed. I take a deep breath. I feel ready for the day. I stand up. I walk to the bathroom. I wash my face. I brush my",
        "textdich": ""
    },
    {
        "start": 560.959,
        "end": 576.959,
        "text": "teeth. I look in the mirror. I feel awake. I take a shower. I dry my hair. I get dressed for work. I choose clean",
        "textdich": ""
    },
    {
        "start": 572.8,
        "end": 588.64,
        "text": "clothes. I feel comfortable. I leave the bedroom. I go to the kitchen. I prepare breakfast. I eat quietly. I drink tea. I",
        "textdich": ""
    },
    {
        "start": 584.959,
        "end": 592.399,
        "text": "drink water. I feel energized.",
        "textdich": ""
    },
    {
        "start": 588.64,
        "end": 605.76,
        "text": "I clean the table. I wash the dishes. I pack my bag. I check my wallet. I check my phone. I check the time. I leave the",
        "textdich": ""
    },
    {
        "start": 600.56,
        "end": 609.68,
        "text": "house. I lock the door. I walk outside.",
        "textdich": ""
    },
    {
        "start": 605.76,
        "end": 622.0,
        "text": "I feel the morning air. I go to work. I walk to the stop. I wait calmly. I take the bus. I find a seat. I sit quietly.",
        "textdich": ""
    },
    {
        "start": 618.959,
        "end": 638.0,
        "text": "I think about my tasks. I arrive at work. I enter the building. I greet people politely. I smile softly. I go to my desk. I sit down. I organize my",
        "textdich": ""
    },
    {
        "start": 633.92,
        "end": 641.68,
        "text": "space. I turn on the computer. I log in.",
        "textdich": ""
    },
    {
        "start": 638.0,
        "end": 652.64,
        "text": "I open my email. I read new messages. I reply clearly. I stay polite. I open my work files. I review yesterday's work. I",
        "textdich": ""
    },
    {
        "start": 649.76,
        "end": 668.959,
        "text": "understand what to do next. I write a task list. I start my first task. I focus fully. I work slowly. I avoid mistakes. I save my progress. I check my",
        "textdich": ""
    },
    {
        "start": 664.8,
        "end": 676.16,
        "text": "work again. I feel confident. I continue working. I receive instructions.",
        "textdich": ""
    },
    {
        "start": 672.16,
        "end": 680.32,
        "text": "I listen carefully. I follow directions.",
        "textdich": ""
    },
    {
        "start": 676.16,
        "end": 683.44,
        "text": "I ask questions if needed. I take notes.",
        "textdich": ""
    },
    {
        "start": 680.32,
        "end": 696.0,
        "text": "I stay attentive. I attend a short meeting. I sit quietly. I listen to others. I speak when needed. I stay respectful.",
        "textdich": ""
    },
    {
        "start": 692.959,
        "end": 712.64,
        "text": "I leave the meeting. I return to my desk. I apply new information. I update my work. I feel productive. I make steady progress. I check deadlines.",
        "textdich": ""
    },
    {
        "start": 708.399,
        "end": 724.16,
        "text": "I manage my time. I work efficiently. I avoid rushing. I take care of details. I handle emails again. I send updates. I",
        "textdich": ""
    },
    {
        "start": 720.24,
        "end": 737.04,
        "text": "confirm tasks. I wait for replies. I continue working. I face a challenge. I stay calm. I think clearly. I try a",
        "textdich": ""
    },
    {
        "start": 731.68,
        "end": 741.04,
        "text": "solution. I test my idea. I see results.",
        "textdich": ""
    },
    {
        "start": 737.04,
        "end": 754.639,
        "text": "I fix errors. I improve my work. I feel proud. I learn from mistakes. I gain confidence. I take a short break. I stand up. I stretch lightly. I drink",
        "textdich": ""
    },
    {
        "start": 751.04,
        "end": 769.12,
        "text": "water. I relax my eyes. I breathe slowly. I return to work. I sit down again. I refocus my mind. I complete another task. I mark it done. I move",
        "textdich": ""
    },
    {
        "start": 765.839,
        "end": 782.8,
        "text": "forward. I stay consistent. I keep working quietly. I receive feedback. I read it carefully. I understand suggestions. I make changes. I improve",
        "textdich": ""
    },
    {
        "start": 778.959,
        "end": 796.0,
        "text": "quality. I send the updated work. I wait patiently. I continue other tasks. I check the time again. I notice the afternoon passing. I feel slightly",
        "textdich": ""
    },
    {
        "start": 792.24,
        "end": 807.76,
        "text": "tired. I stay motivated. I remind myself of my goals. I keep working steadily. I prepare reports. I review data. I check",
        "textdich": ""
    },
    {
        "start": 803.92,
        "end": 815.92,
        "text": "accuracy. I finalize documents. I organize files. I keep everything clear.",
        "textdich": ""
    },
    {
        "start": 811.519,
        "end": 829.519,
        "text": "I help a c-orker. I explain calmly. I share information. I feel helpful. I return to my tasks. I finish important work. I feel satisfied. I prepare for",
        "textdich": ""
    },
    {
        "start": 826.56,
        "end": 842.959,
        "text": "the end of the day. I review my task list. I note what is complete. I note what remains. I plan for tomorrow. I write reminders. I save all files. I",
        "textdich": ""
    },
    {
        "start": 840.079,
        "end": 857.68,
        "text": "close applications. I shut down the computer. I clean my desk. I arrange items neatly. I pack my bag. I stand up slowly. I say goodbye.",
        "textdich": ""
    },
    {
        "start": 854.8,
        "end": 865.04,
        "text": "I thank my co-workers. I leave the office. I walk outside.",
        "textdich": ""
    },
    {
        "start": 860.959,
        "end": 867.44,
        "text": "I feel relief. I go home.",
        "textdich": ""
    },
    {
        "start": 865.04,
        "end": 869.6,
        "text": "I think about the day.",
        "textdich": ""
    },
    {
        "start": 867.44,
        "end": 873.519,
        "text": "I feel grateful.",
        "textdich": ""
    },
    {
        "start": 869.6,
        "end": 877.76,
        "text": "I reach home. I relax.",
        "textdich": ""
    },
    {
        "start": 873.519,
        "end": 881.199,
        "text": "I eat dinner. I rest quietly.",
        "textdich": ""
    },
    {
        "start": 877.76,
        "end": 885.6,
        "text": "I prepare for sleep. I end the day peacefully.",
        "textdich": ""
    },
    {
        "start": 882.959,
        "end": 897.68,
        "text": "I continue with another calm working day. And I keep my focus steady. I wake up with purpose. I sit up slowly. I",
        "textdich": ""
    },
    {
        "start": 893.279,
        "end": 903.199,
        "text": "breathe deeply. I clear my mind. I stand up carefully.",
        "textdich": ""
    },
    {
        "start": 899.6,
        "end": 918.72,
        "text": "I walk to the bathroom. I wash my face gently. I brush my teeth slowly. I look at myself. I feel awake. I take a shower. I feel fresh. I dry myself. I",
        "textdich": ""
    },
    {
        "start": 915.76,
        "end": 930.88,
        "text": "get dressed neatly. I choose simple clothes. I feel comfortable. I leave the room. I go to the kitchen. I prepare my",
        "textdich": ""
    },
    {
        "start": 926.56,
        "end": 935.36,
        "text": "breakfast. I eat slowly. I drink water.",
        "textdich": ""
    },
    {
        "start": 930.88,
        "end": 947.839,
        "text": "I drink tea. I feel energized. I clean the table. I wash the dishes. I pack my lunch. I pack my bag. I check my phone.",
        "textdich": ""
    },
    {
        "start": 943.68,
        "end": 959.279,
        "text": "I check the time. I take my keys. I leave the house. I lock the door. I walk outside calmly. I feel the morning air.",
        "textdich": ""
    },
    {
        "start": 955.279,
        "end": 963.279,
        "text": "I start my commute. I walk to the stop.",
        "textdich": ""
    },
    {
        "start": 959.279,
        "end": 968.8,
        "text": "I wait patiently. I take the bus. I find a seat. I sit quietly.",
        "textdich": ""
    },
    {
        "start": 966.8,
        "end": 971.199,
        "text": "I look outside.",
        "textdich": ""
    },
    {
        "start": 968.8,
        "end": 974.0,
        "text": "I think about work.",
        "textdich": ""
    },
    {
        "start": 971.199,
        "end": 987.04,
        "text": "I arrive at the office area. I get off the bus. I walk to the building. I enter the office. I greet everyone politely.",
        "textdich": ""
    },
    {
        "start": 982.399,
        "end": 991.12,
        "text": "I say good morning. I smile lightly.",
        "textdich": ""
    },
    {
        "start": 987.04,
        "end": 995.12,
        "text": "I walk to my desk. I place my bag down.",
        "textdich": ""
    },
    {
        "start": 991.12,
        "end": 1002.399,
        "text": "I sit properly. I organize my desk. I turn on my computer. I log in carefully.",
        "textdich": ""
    },
    {
        "start": 998.72,
        "end": 1014.72,
        "text": "I open my email. I read messages one by one. I understand each message. I reply clearly. I stay polite. I keep sentences",
        "textdich": ""
    },
    {
        "start": 1010.48,
        "end": 1027.039,
        "text": "simple. I send emails. I open my work folder. I review my tasks. I write my task list. I set priorities. I begin my",
        "textdich": ""
    },
    {
        "start": 1023.04,
        "end": 1040.559,
        "text": "first task. I read instructions again. I focus on details. I start working slowly. I type carefully. I check my work. I correct small errors. I save my",
        "textdich": ""
    },
    {
        "start": 1037.28,
        "end": 1054.799,
        "text": "progress. I continue working. I stay calm. I stay focused. I ignore distractions. I manage my time well. I receive a call. I answer politely. I",
        "textdich": ""
    },
    {
        "start": 1051.039,
        "end": 1065.919,
        "text": "listen closely. I speak clearly. I confirm details. I thank the caller. I end the call. I write notes. I remember",
        "textdich": ""
    },
    {
        "start": 1062.0,
        "end": 1074.72,
        "text": "the task. I continue working. I attend a meeting. I join on time. I sit quietly.",
        "textdich": ""
    },
    {
        "start": 1070.96,
        "end": 1089.2,
        "text": "I listen carefully. I take notes. I share my update. I speak briefly. I stay respectful. I leave the meeting. I return to my desk. I apply new",
        "textdich": ""
    },
    {
        "start": 1085.28,
        "end": 1103.84,
        "text": "instructions. I update my work. I feel productive. I work steadily. I avoid rushing. I focus on quality. I complete a task. I mark it done. I feel",
        "textdich": ""
    },
    {
        "start": 1100.08,
        "end": 1116.64,
        "text": "satisfied. I move to the next task. I repeat the process. I read. I work. I check. I fix. I save. I feel progress. I",
        "textdich": ""
    },
    {
        "start": 1113.36,
        "end": 1127.84,
        "text": "face a small issue. I stay calm. I think logically. I test a solution. I review the result. I adjust my work. I solve",
        "textdich": ""
    },
    {
        "start": 1124.08,
        "end": 1140.16,
        "text": "the problem. I feel confident. I learn something new. I improve my skills. I take a short break. I stand up slowly. I",
        "textdich": ""
    },
    {
        "start": 1136.24,
        "end": 1151.679,
        "text": "stretch my arms. I relax my neck. I drink water. I breathe deeply. I return to my desk. I sit down again. I refocus",
        "textdich": ""
    },
    {
        "start": 1148.08,
        "end": 1165.76,
        "text": "my mind. I continue working. I answer emails again. I send updates. I confirm tasks. I stay organized. I check deadlines. I manage my workload. I stay",
        "textdich": ""
    },
    {
        "start": 1162.4,
        "end": 1176.08,
        "text": "consistent. I keep my energy steady. I help a co-worker. I explain clearly. I listen patiently. I share information. I",
        "textdich": ""
    },
    {
        "start": 1172.799,
        "end": 1189.28,
        "text": "return to my tasks. I complete important work. I review documents. I check accuracy. I finalize files. I save everything properly. I feel proud of my",
        "textdich": ""
    },
    {
        "start": 1185.84,
        "end": 1200.08,
        "text": "effort. I check the time. I see the day moving forward. I feel a little tired. I stay motivated. I remind myself to stay",
        "textdich": ""
    },
    {
        "start": 1196.32,
        "end": 1210.96,
        "text": "calm. I finish remaining tasks. I prepare for tomorrow. I write notes. I plan ahead. I organize my files. I clean",
        "textdich": ""
    },
    {
        "start": 1207.12,
        "end": 1224.4,
        "text": "my workspace. I close programs. I shut down the computer. I pack my bag carefully. I stand up. I say goodbye politely. I thank my co-workers. I leave",
        "textdich": ""
    },
    {
        "start": 1220.32,
        "end": 1235.2,
        "text": "the office quietly. I walk outside. I feel relaxed. I breathe fresh air. I go home calmly.",
        "textdich": ""
    },
    {
        "start": 1231.36,
        "end": 1238.96,
        "text": "I think about my day. I feel satisfied.",
        "textdich": ""
    },
    {
        "start": 1235.2,
        "end": 1251.039,
        "text": "I reach home. I remove my shoes. I wash my hands. I sit down. I rest my body. I eat dinner slowly. I relax my mind. I",
        "textdich": ""
    },
    {
        "start": 1247.36,
        "end": 1264.72,
        "text": "prepare for sleep. I feel peaceful. I end the day with calm thoughts. I move into another steady workday. And I keep my routine simple and clear.",
        "textdich": ""
    },
    {
        "start": 1260.64,
        "end": 1268.559,
        "text": "I wake up early. I open my eyes calmly.",
        "textdich": ""
    },
    {
        "start": 1264.72,
        "end": 1279.28,
        "text": "I stretch my arms. I stretch my legs. I sit on the bed. I take a slow breath. I feel ready.",
        "textdich": ""
    },
    {
        "start": 1274.799,
        "end": 1291.12,
        "text": "I stand up. I walk to the bathroom. I wash my face. I brush my teeth. I rinse my mouth. I look in the mirror. I feel",
        "textdich": ""
    },
    {
        "start": 1287.28,
        "end": 1306.88,
        "text": "awake. I take a short shower. I feel fresh. I dry myself. I choose my clothes. I put them on neatly. I feel comfortable. I leave the room. I walk to",
        "textdich": ""
    },
    {
        "start": 1303.28,
        "end": 1318.48,
        "text": "the kitchen. I prepare breakfast. I eat slowly. I drink water. I drink tea. I feel energized. I clean the table. I",
        "textdich": ""
    },
    {
        "start": 1315.039,
        "end": 1330.32,
        "text": "wash the dishes. I pack my lunch. I pack my bag. I check my phone. I check the time. I take my keys. I leave the house.",
        "textdich": ""
    },
    {
        "start": 1326.48,
        "end": 1333.12,
        "text": "I lock the door. I walk outside.",
        "textdich": ""
    },
    {
        "start": 1330.32,
        "end": 1349.12,
        "text": "I feel the morning air. I start my commute. I walk to the stop. I wait quietly. I take the bus. I sit down. I look outside. I think about my tasks. I",
        "textdich": ""
    },
    {
        "start": 1345.919,
        "end": 1362.88,
        "text": "arrive near work. I get off the bus. I walk to the building. I enter the office. I greet my co-workers. I say good morning. I smile politely.",
        "textdich": ""
    },
    {
        "start": 1358.799,
        "end": 1374.4,
        "text": "I walk to my desk. I put my bag down. I sit comfortably. I organize my desk. I turn on my computer. I log in. I open my",
        "textdich": ""
    },
    {
        "start": 1370.64,
        "end": 1386.64,
        "text": "email. I read messages carefully. I reply clearly. I keep my words simple. I stay polite. I send replies. I open my",
        "textdich": ""
    },
    {
        "start": 1382.72,
        "end": 1397.76,
        "text": "work files. I review my tasks. I make a task list. I set priorities. I begin my first task. I read the instructions. I",
        "textdich": ""
    },
    {
        "start": 1394.4,
        "end": 1408.96,
        "text": "understand the goal. I start working. I type slowly. I check my spelling. I save my work. I review what I wrote. I fix",
        "textdich": ""
    },
    {
        "start": 1405.12,
        "end": 1424.08,
        "text": "small mistakes. I continue working. I stay focused. I avoid distractions. I manage my time. I work step by step. I receive a message. I read it. I",
        "textdich": ""
    },
    {
        "start": 1420.159,
        "end": 1439.12,
        "text": "understand it. I respond calmly. I continue my task. I get a phone call. I answer politely. I listen carefully. I speak clearly. I confirm details. I",
        "textdich": ""
    },
    {
        "start": 1435.76,
        "end": 1450.4,
        "text": "thank the caller. I end the call. I write notes. I remember the task. I continue working. I attend a meeting and",
        "textdich": ""
    },
    {
        "start": 1445.919,
        "end": 1463.2,
        "text": "I join on time. I listen quietly. I take notes. I share a short update. I stay respectful. I leave the meeting. I return to my desk. I apply new",
        "textdich": ""
    },
    {
        "start": 1459.6,
        "end": 1475.2,
        "text": "instructions. I update my work. I feel productive. I complete a task. I mark it done. I move to the next task. I repeat",
        "textdich": ""
    },
    {
        "start": 1470.72,
        "end": 1491.36,
        "text": "the process. I read. I work. I check. I fix. I save. I feel progress. I face a challenge. I stay calm. I think carefully. I try a solution. I test it.",
        "textdich": ""
    },
    {
        "start": 1487.52,
        "end": 1501.36,
        "text": "I review the result. I adjust my work. I solve the problem. I feel confident. I learn something new. I gain experience.",
        "textdich": ""
    },
    {
        "start": 1498.0,
        "end": 1513.12,
        "text": "I take a short break. I stand up. I stretch my back. I relax my shoulders. I drink water. I breathe deeply. I return",
        "textdich": ""
    },
    {
        "start": 1509.279,
        "end": 1524.88,
        "text": "to my desk. I sit down again. I refocus my mind. I continue working. I answer emails. I send updates. I confirm tasks.",
        "textdich": ""
    },
    {
        "start": 1521.2,
        "end": 1535.36,
        "text": "I stay organized. I check deadlines. I manage my workload. I work steadily. I help a c-orker. I listen patiently. I",
        "textdich": ""
    },
    {
        "start": 1531.76,
        "end": 1542.159,
        "text": "explain clearly. I share information. I return to my tasks. I prepare a report.",
        "textdich": ""
    },
    {
        "start": 1538.64,
        "end": 1549.6,
        "text": "I review data. I check accuracy. I correct errors. I finalize the document.",
        "textdich": ""
    },
    {
        "start": 1545.84,
        "end": 1564.08,
        "text": "I save the file. I send it. I wait for feedback. I continue other tasks. I check the time. I see the afternoon moving on. I feel a little tired. I stay",
        "textdich": ""
    },
    {
        "start": 1559.679,
        "end": 1576.96,
        "text": "focused. I remind myself to stay calm. I complete important work. I review my task list. I note what is finished. I note what is pending. I plan for",
        "textdich": ""
    },
    {
        "start": 1573.36,
        "end": 1592.88,
        "text": "tomorrow. I write reminders. I organize my files. I clean my desk. I close programs. I shut down the computer. I pack my bag. I stand up slowly. I say",
        "textdich": ""
    },
    {
        "start": 1588.799,
        "end": 1598.0,
        "text": "goodbye. I thank my co-workers. I leave the office. I walk outside.",
        "textdich": ""
    },
    {
        "start": 1595.919,
        "end": 1603.2,
        "text": "I feel relief.",
        "textdich": ""
    },
    {
        "start": 1598.0,
        "end": 1615.76,
        "text": "I breathe fresh air. I go home calmly. I think about my day. I feel satisfied. I reach home. I remove my shoes. I wash my",
        "textdich": ""
    },
    {
        "start": 1610.799,
        "end": 1627.6,
        "text": "hands. I sit down. I rest my body. I eat dinner. I relax quietly. I prepare for sleep. I feel peaceful. I end the day",
        "textdich": ""
    },
    {
        "start": 1624.32,
        "end": 1639.039,
        "text": "with calm thoughts. I move into another steady workday. And I keep my routine simple and clear. I wake up early. I",
        "textdich": ""
    },
    {
        "start": 1634.88,
        "end": 1643.12,
        "text": "open my eyes calmly. I stretch my arms.",
        "textdich": ""
    },
    {
        "start": 1639.039,
        "end": 1654.72,
        "text": "I stretch my legs. I sit on the bed. I take a slow breath. I feel ready. I stand up. I walk to the bathroom. I wash",
        "textdich": ""
    },
    {
        "start": 1650.96,
        "end": 1669.76,
        "text": "my face. I brush my teeth. I rinse my mouth. I look in the mirror. I feel awake. I take a short shower. I feel fresh. I dry myself. I choose my",
        "textdich": ""
    },
    {
        "start": 1666.08,
        "end": 1681.76,
        "text": "clothes. I put them on neatly. I feel comfortable. I leave the room. I walk to the kitchen. I prepare breakfast. I eat",
        "textdich": ""
    },
    {
        "start": 1676.72,
        "end": 1687.52,
        "text": "slowly. I drink water. I drink tea. I feel energized.",
        "textdich": ""
    },
    {
        "start": 1683.679,
        "end": 1699.2,
        "text": "I clean the table. I wash the dishes. I pack my lunch. I pack my bag. I check my phone. I check the time. I take my keys.",
        "textdich": ""
    },
    {
        "start": 1696.0,
        "end": 1710.64,
        "text": "I leave the house. I lock the door. I walk outside. I feel the morning air. I start my commute. I walk to the stop. I",
        "textdich": ""
    },
    {
        "start": 1706.72,
        "end": 1722.32,
        "text": "wait quietly. I take the bus. I sit down. I look outside. I think about my tasks. I arrive near work. I get off the",
        "textdich": ""
    },
    {
        "start": 1718.559,
        "end": 1733.52,
        "text": "bus. I walk to the building. I enter the office. I greet my co-workers. I say good morning. I smile politely. I walk",
        "textdich": ""
    },
    {
        "start": 1729.76,
        "end": 1747.44,
        "text": "to my desk. I put my bag down. I sit comfortably. I organize my desk. I turn on my computer. I log in. I open my email. I read messages carefully. I",
        "textdich": ""
    },
    {
        "start": 1743.76,
        "end": 1758.96,
        "text": "reply clearly. I keep my words simple. I stay polite. I send replies. I open my work files. I review my tasks. I make a",
        "textdich": ""
    },
    {
        "start": 1754.96,
        "end": 1769.44,
        "text": "task list. I set priorities. I begin my first task. I read the instructions. I understand the goal. I start working. I",
        "textdich": ""
    },
    {
        "start": 1765.76,
        "end": 1780.72,
        "text": "type slowly. I check my spelling. I save my work. I review what I wrote. I fix small mistakes. I continue working. I",
        "textdich": ""
    },
    {
        "start": 1776.88,
        "end": 1796.32,
        "text": "stay focused. I avoid distractions. I manage my time. I work step by step. I receive a message. I read it. I understand it. I respond calmly. I",
        "textdich": ""
    },
    {
        "start": 1792.159,
        "end": 1812.799,
        "text": "continue my task. I get a phone call. I answer politely. I listen carefully. I speak clearly. I confirm details. I thank the caller. I end the call. I",
        "textdich": ""
    },
    {
        "start": 1808.399,
        "end": 1825.44,
        "text": "write notes. I remember the task. I continue working. I attend a meeting. I join on time. I listen quietly. I take",
        "textdich": ""
    },
    {
        "start": 1821.36,
        "end": 1830.08,
        "text": "notes. I share a short update. I stay respectful.",
        "textdich": ""
    },
    {
        "start": 1826.96,
        "end": 1842.24,
        "text": "I leave the meeting. I return to my desk. I apply new instructions. I update my work. I feel productive.",
        "textdich": ""
    },
    {
        "start": 1838.399,
        "end": 1845.44,
        "text": "I complete a task. I mark it done.",
        "textdich": ""
    },
    {
        "start": 1842.24,
        "end": 1855.2,
        "text": "I move to the next task. I repeat the process. I read. I work. I check. I fix.",
        "textdich": ""
    },
    {
        "start": 1851.039,
        "end": 1864.24,
        "text": "I save. I feel progress. I face a challenge. I stay calm. I think carefully.",
        "textdich": ""
    },
    {
        "start": 1860.24,
        "end": 1874.72,
        "text": "I try a solution. I test it. I review the result. I adjust my work. I solve the problem. I feel confident. I learn",
        "textdich": ""
    },
    {
        "start": 1871.2,
        "end": 1885.2,
        "text": "something new. I gain experience. I take a short break. I stand up. I stretch my back. I relax my shoulders. I drink",
        "textdich": ""
    },
    {
        "start": 1881.679,
        "end": 1896.559,
        "text": "water. I breathe deeply. I return to my desk. I sit down again. I refocus my mind. I continue working. I answer",
        "textdich": ""
    },
    {
        "start": 1892.0,
        "end": 1900.48,
        "text": "emails. I send updates. I confirm tasks.",
        "textdich": ""
    },
    {
        "start": 1896.559,
        "end": 1911.679,
        "text": "I stay organized. I check deadlines. I manage my workload. I work steadily. I help a c-orker. I listen patiently. I",
        "textdich": ""
    },
    {
        "start": 1907.679,
        "end": 1919.6,
        "text": "explain clearly. I share information. I return to my tasks. I prepare a report.",
        "textdich": ""
    },
    {
        "start": 1915.84,
        "end": 1927.039,
        "text": "I review data. I check accuracy. I correct errors. I finalize the document.",
        "textdich": ""
    },
    {
        "start": 1923.039,
        "end": 1942.08,
        "text": "I save the file. I send it. I wait for feedback. I continue other tasks. I check the time. I see the afternoon moving on. I feel a little tired. I stay",
        "textdich": ""
    },
    {
        "start": 1937.36,
        "end": 1945.679,
        "text": "focused. I remind myself to stay calm.",
        "textdich": ""
    },
    {
        "start": 1942.08,
        "end": 1959.2,
        "text": "I complete important work. I review my task list. I note what is finished. I note what is pending. I plan for tomorrow. I write reminders. I organize",
        "textdich": ""
    },
    {
        "start": 1955.6,
        "end": 1973.36,
        "text": "my files. I clean my desk. I close programs. I shut down the computer. I pack my bag. I stand up slowly. I say goodbye. I thank my co-workers. I leave",
        "textdich": ""
    },
    {
        "start": 1969.84,
        "end": 1983.279,
        "text": "the office. I walk outside. I feel relief. I breathe fresh air. I go home calmly.",
        "textdich": ""
    },
    {
        "start": 1979.36,
        "end": 1987.279,
        "text": "I think about my day. I feel satisfied.",
        "textdich": ""
    },
    {
        "start": 1983.279,
        "end": 2000.0,
        "text": "I reach home. I remove my shoes. I wash my hands. I sit down. I rest my body. I eat dinner. I relax quietly. I prepare",
        "textdich": ""
    },
    {
        "start": 1995.919,
        "end": 2014.0,
        "text": "for sleep. I feel peaceful. I end the day with calm thoughts. I begin another work routine with a calm and steady mind. I wake up early. I open my eyes",
        "textdich": ""
    },
    {
        "start": 2010.08,
        "end": 2028.159,
        "text": "slowly. I sit on the bed. I stretch my arms. I stretch my legs. I breathe deeply. I feel awake. I stand up carefully. I walk to the bathroom. I",
        "textdich": ""
    },
    {
        "start": 2025.2,
        "end": 2042.88,
        "text": "wash my face with water. I brush my teeth slowly. I rinse my mouth. I look in the mirror. I feel ready. I take a shower. I feel fresh and clean. I dry",
        "textdich": ""
    },
    {
        "start": 2039.2,
        "end": 2045.519,
        "text": "myself. I choose simple clothes.",
        "textdich": ""
    },
    {
        "start": 2042.88,
        "end": 2060.079,
        "text": "I wear my work clothes. I feel comfortable. I leave the room. I go to the kitchen. I prepare breakfast. I eat breakfast calmly. I drink water. I drink",
        "textdich": ""
    },
    {
        "start": 2055.919,
        "end": 2070.24,
        "text": "tea. I feel energized. I clean the table. I wash the dishes. I pack my lunch. I pack my bag. I check my phone.",
        "textdich": ""
    },
    {
        "start": 2066.879,
        "end": 2080.96,
        "text": "I check the time. I take my keys. I leave the house. I lock the door. I walk outside. I feel the morning air. I start",
        "textdich": ""
    },
    {
        "start": 2077.359,
        "end": 2087.2,
        "text": "my commute. I walk to the stop. I wait patiently.",
        "textdich": ""
    },
    {
        "start": 2082.48,
        "end": 2091.919,
        "text": "I take the bus. I find a seat. I sit quietly.",
        "textdich": ""
    },
    {
        "start": 2088.96,
        "end": 2095.76,
        "text": "I look outside the window.",
        "textdich": ""
    },
    {
        "start": 2091.919,
        "end": 2099.839,
        "text": "I think about my work. I arrive near the office.",
        "textdich": ""
    },
    {
        "start": 2097.28,
        "end": 2102.96,
        "text": "I get off the bus.",
        "textdich": ""
    },
    {
        "start": 2099.839,
        "end": 2107.28,
        "text": "I walk to the building. I enter the office.",
        "textdich": ""
    },
    {
        "start": 2104.48,
        "end": 2110.88,
        "text": "I greet my co-workers.",
        "textdich": ""
    },
    {
        "start": 2107.28,
        "end": 2122.24,
        "text": "I say good morning politely. I smile gently. I walk to my desk. I put my bag down. I sit comfortably. I organize my",
        "textdich": ""
    },
    {
        "start": 2118.72,
        "end": 2136.72,
        "text": "desk. I turn on the computer. I log in carefully. I open my email. I read messages slowly. I understand the messages. I reply clearly. I keep my",
        "textdich": ""
    },
    {
        "start": 2133.04,
        "end": 2149.52,
        "text": "words simple. I stay polite. I send my replies. I open my work folder. I review my tasks. I write a task list. I set priorities.",
        "textdich": ""
    },
    {
        "start": 2146.32,
        "end": 2163.2,
        "text": "I begin my first task. I read the instructions again. I understand the goal. I start working slowly. I type carefully. I check my spelling. I save",
        "textdich": ""
    },
    {
        "start": 2159.44,
        "end": 2174.16,
        "text": "my work. I review my work. I fix small mistakes. I continue working. I stay focused. I avoid distractions. I manage",
        "textdich": ""
    },
    {
        "start": 2170.24,
        "end": 2189.2,
        "text": "my time well. I work step by step. I receive a message. I read it calmly. I understand it. I reply clearly. I continue my task. I get a phone call. I",
        "textdich": ""
    },
    {
        "start": 2185.52,
        "end": 2203.359,
        "text": "answer politely. I listen carefully. I speak clearly. I confirm the details. I thank the caller. I end the call. I write notes. I remember the task. I",
        "textdich": ""
    },
    {
        "start": 2199.839,
        "end": 2215.839,
        "text": "continue working. I attend a meeting. I join on time. I sit quietly. I listen carefully. I take notes. I share a short",
        "textdich": ""
    },
    {
        "start": 2211.599,
        "end": 2227.28,
        "text": "update. I stay respectful. I leave the meeting. I return to my desk. I apply new instructions. I update my work. I",
        "textdich": ""
    },
    {
        "start": 2223.599,
        "end": 2235.44,
        "text": "feel productive. I complete a task. I mark it done. I move to the next task. I repeat the process.",
        "textdich": ""
    },
    {
        "start": 2233.52,
        "end": 2237.28,
        "text": "I read.",
        "textdich": ""
    },
    {
        "start": 2235.44,
        "end": 2239.52,
        "text": "I work.",
        "textdich": ""
    },
    {
        "start": 2237.28,
        "end": 2241.839,
        "text": "I check.",
        "textdich": ""
    },
    {
        "start": 2239.52,
        "end": 2244.32,
        "text": "I fix.",
        "textdich": ""
    },
    {
        "start": 2241.839,
        "end": 2247.44,
        "text": "I save.",
        "textdich": ""
    },
    {
        "start": 2244.32,
        "end": 2252.0,
        "text": "I feel progress.",
        "textdich": ""
    },
    {
        "start": 2247.44,
        "end": 2265.52,
        "text": "I face a small challenge. I stay calm. I think carefully. I try a solution. I test it slowly. I review the result. I",
        "textdich": ""
    },
    {
        "start": 2260.88,
        "end": 2276.96,
        "text": "adjust my work. I solve the problem. I feel confident. I learn something new. I gain experience. I take a short break. I",
        "textdich": ""
    },
    {
        "start": 2273.2,
        "end": 2292.48,
        "text": "stand up slowly. I stretch my back. I relax my shoulders. I drink water. I breathe deeply. I return to my desk. I sit down again. I refocus my mind. I",
        "textdich": ""
    },
    {
        "start": 2288.88,
        "end": 2296.48,
        "text": "continue working. I answer emails again.",
        "textdich": ""
    },
    {
        "start": 2292.48,
        "end": 2308.079,
        "text": "I send updates. I confirm tasks. I stay organized. I check deadlines. I manage my workload. I work steadily. I help a",
        "textdich": ""
    },
    {
        "start": 2303.839,
        "end": 2319.76,
        "text": "coworker. I listen patiently. I explain clearly. I share information. I return to my tasks. I prepare a report. I",
        "textdich": ""
    },
    {
        "start": 2315.76,
        "end": 2331.52,
        "text": "review data. I check accuracy. I correct errors. I finalize the document. I save the file. I send the file. I wait for",
        "textdich": ""
    },
    {
        "start": 2327.839,
        "end": 2344.72,
        "text": "feedback. I continue other tasks. I check the time. I see the afternoon passing. I feel a little tired. I stay focused. I remind myself to stay calm. I",
        "textdich": ""
    },
    {
        "start": 2341.92,
        "end": 2356.64,
        "text": "complete important work. I review my task list. I note finished tasks. I note pending tasks. I plan for tomorrow. I",
        "textdich": ""
    },
    {
        "start": 2352.96,
        "end": 2368.32,
        "text": "write reminders. I organize my files. I clean my desk. I close programs. I shut down the computer. I pack my bag. I",
        "textdich": ""
    },
    {
        "start": 2363.92,
        "end": 2371.44,
        "text": "stand up slowly. I say goodbye politely.",
        "textdich": ""
    },
    {
        "start": 2368.32,
        "end": 2387.2,
        "text": "I thank my co-workers. I leave the office calmly. I walk outside. I feel relief. I breathe fresh air. I go home quietly. I think about my day. I feel",
        "textdich": ""
    },
    {
        "start": 2383.52,
        "end": 2403.599,
        "text": "satisfied. I reach home. I remove my shoes. I wash my hands. I sit down. I rest my body. I eat dinner slowly. I relax my mind. I prepare for sleep. I",
        "textdich": ""
    },
    {
        "start": 2399.68,
        "end": 2418.48,
        "text": "feel peaceful. I end the day with calm thoughts. I continue with the same steady routine and I keep my English simple and clear. I wake up early again.",
        "textdich": ""
    },
    {
        "start": 2413.44,
        "end": 2422.96,
        "text": "I open my eyes slowly. I breathe deeply.",
        "textdich": ""
    },
    {
        "start": 2418.48,
        "end": 2434.64,
        "text": "I sit on the bed. I stretch my arms. I stretch my legs. I feel calm. I stand up carefully. I walk to the bathroom. I",
        "textdich": ""
    },
    {
        "start": 2430.8,
        "end": 2446.079,
        "text": "wash my face. I brush my teeth. I rinse my mouth. I look in the mirror. I feel ready. I take a shower. I feel fresh. I",
        "textdich": ""
    },
    {
        "start": 2442.48,
        "end": 2453.52,
        "text": "dry myself. I choose my clothes. I put on my work clothes. I feel comfortable.",
        "textdich": ""
    },
    {
        "start": 2449.92,
        "end": 2465.359,
        "text": "I leave the room. I go to the kitchen. I prepare breakfast. I eat slowly. I drink water. I drink tea. I feel energized.",
        "textdich": ""
    },
    {
        "start": 2462.079,
        "end": 2477.28,
        "text": "I clean the table. I wash the dishes. I pack my lunch. I pack my bag. I check my phone. I check the time. I take my keys.",
        "textdich": ""
    },
    {
        "start": 2473.599,
        "end": 2488.64,
        "text": "I leave the house. I lock the door. I walk outside. I feel the cool air. I start my commute. I walk to the stop. I",
        "textdich": ""
    },
    {
        "start": 2484.88,
        "end": 2500.16,
        "text": "wait patiently. I take the bus. I find a seat. I sit quietly. I look outside. I think about my tasks. I arrive near",
        "textdich": ""
    },
    {
        "start": 2496.8,
        "end": 2510.8,
        "text": "work. I get off the bus. I walk to the building. I enter the office. I greet my co-workers. I say good morning. I smile",
        "textdich": ""
    },
    {
        "start": 2506.96,
        "end": 2522.16,
        "text": "politely. I walk to my desk. I put my bag down. I sit comfortably. I organize my desk. I turn on my computer. I log",
        "textdich": ""
    },
    {
        "start": 2518.319,
        "end": 2538.0,
        "text": "in. I open my email. I read messages carefully. I reply clearly. I keep my words simple. I stay polite. I send replies. I open my work files. I review",
        "textdich": ""
    },
    {
        "start": 2533.839,
        "end": 2542.96,
        "text": "my tasks. I make a task list. I set priorities.",
        "textdich": ""
    },
    {
        "start": 2539.599,
        "end": 2554.56,
        "text": "I begin my first task. I read the instructions. I understand the goal. I start working slowly. I type carefully.",
        "textdich": ""
    },
    {
        "start": 2550.88,
        "end": 2568.96,
        "text": "I check my spelling. I save my work. I review what I wrote. I fix small mistakes. I continue working. I stay focused. I avoid distractions. I manage",
        "textdich": ""
    },
    {
        "start": 2564.8,
        "end": 2583.76,
        "text": "my time well. I work step by step. I receive a message. I read it calmly. I understand it. I reply clearly. I continue my task. I get a phone call. I",
        "textdich": ""
    },
    {
        "start": 2579.92,
        "end": 2597.44,
        "text": "answer politely. I listen carefully. I speak clearly. I confirm details. I thank the caller. I end the call. I write notes. I remember the task. I",
        "textdich": ""
    },
    {
        "start": 2594.24,
        "end": 2609.359,
        "text": "continue working. I attend a meeting. I join on time. I sit quietly. I listen carefully. I take notes. I share a short",
        "textdich": ""
    },
    {
        "start": 2605.599,
        "end": 2621.04,
        "text": "update. I stay respectful. I leave the meeting. I return to my desk. I apply new instructions. I update my work. I",
        "textdich": ""
    },
    {
        "start": 2617.44,
        "end": 2635.68,
        "text": "feel productive. I complete a task. I mark it done. I move to the next task. I repeat the process. I read. I work. I",
        "textdich": ""
    },
    {
        "start": 2629.68,
        "end": 2646.8,
        "text": "check. I fix. I save. I feel progress. I face a challenge. I stay calm. I think carefully.",
        "textdich": ""
    },
    {
        "start": 2642.079,
        "end": 2659.04,
        "text": "I try a solution. I test it slowly. I review the result. I adjust my work. I solve the problem. I feel confident. I",
        "textdich": ""
    },
    {
        "start": 2654.96,
        "end": 2662.88,
        "text": "learn something new. I gain experience.",
        "textdich": ""
    },
    {
        "start": 2659.04,
        "end": 2666.4,
        "text": "I take a short break. I stand up slowly.",
        "textdich": ""
    },
    {
        "start": 2662.88,
        "end": 2670.4,
        "text": "I stretch my back. I relax my shoulders.",
        "textdich": ""
    },
    {
        "start": 2666.4,
        "end": 2686.0,
        "text": "I drink water. I breathe deeply. I return to my desk. I sit down again. I refocus my mind. I continue working. I answer emails again. I send updates. I",
        "textdich": ""
    },
    {
        "start": 2682.319,
        "end": 2696.56,
        "text": "confirm tasks. I stay organized. I check deadlines. I manage my workload. I work steadily. I help a co-worker. I listen",
        "textdich": ""
    },
    {
        "start": 2692.96,
        "end": 2707.76,
        "text": "patiently. I explain clearly. I share information. I return to my tasks. I prepare a report. I review data. I check",
        "textdich": ""
    },
    {
        "start": 2703.92,
        "end": 2721.52,
        "text": "accuracy. I correct errors. I finalize the document. I save the file. I send the file. I wait for feedback. I continue other tasks. I check the time.",
        "textdich": ""
    },
    {
        "start": 2718.079,
        "end": 2727.359,
        "text": "I see the afternoon moving forward. I feel a little tired.",
        "textdich": ""
    },
    {
        "start": 2723.839,
        "end": 2742.8,
        "text": "I stay focused. I remind myself to stay calm. I complete important work. I review my task list. I note finished tasks. I note pending tasks. I plan for",
        "textdich": ""
    },
    {
        "start": 2738.64,
        "end": 2758.56,
        "text": "tomorrow. I write reminders. I organize my files. I clean my desk. I close programs. I shut down the computer. I pack my bag. I stand up slowly. I say",
        "textdich": ""
    },
    {
        "start": 2754.88,
        "end": 2761.52,
        "text": "goodbye politely. I thank my co-workers.",
        "textdich": ""
    },
    {
        "start": 2758.56,
        "end": 2773.44,
        "text": "I leave the office calmly. I walk outside. I feel relief. I breathe fresh air. I go home quietly. I think about my",
        "textdich": ""
    },
    {
        "start": 2769.119,
        "end": 2785.839,
        "text": "day. I feel satisfied. I reach home. I remove my shoes. I wash my hands. I sit down. I rest my body. I eat dinner",
        "textdich": ""
    },
    {
        "start": 2781.2,
        "end": 2792.56,
        "text": "slowly. I relax my mind. I prepare for sleep. I feel peaceful.",
        "textdich": ""
    },
    {
        "start": 2789.2,
        "end": 2802.16,
        "text": "I end the day with calm thoughts. I continue my routine with patience and I keep my language simple and strong. I",
        "textdich": ""
    },
    {
        "start": 2798.56,
        "end": 2814.64,
        "text": "wake up early once again. I open my eyes calmly. I stay still for a moment. I breathe slowly. I clear my thoughts. I",
        "textdich": ""
    },
    {
        "start": 2810.319,
        "end": 2821.92,
        "text": "sit up on the bed. I stretch my arms. I stretch my legs. I feel balanced.",
        "textdich": ""
    },
    {
        "start": 2818.8,
        "end": 2826.8,
        "text": "I stand up gently. I walk to the bathroom.",
        "textdich": ""
    },
    {
        "start": 2823.44,
        "end": 2830.319,
        "text": "I wash my face with cool water.",
        "textdich": ""
    },
    {
        "start": 2826.8,
        "end": 2836.48,
        "text": "I brush my teeth carefully. I rinse my mouth well.",
        "textdich": ""
    },
    {
        "start": 2832.24,
        "end": 2841.599,
        "text": "I look in the mirror. I feel confident.",
        "textdich": ""
    },
    {
        "start": 2836.48,
        "end": 2846.8,
        "text": "I take a shower. I relax my body. I feel clean and fresh.",
        "textdich": ""
    },
    {
        "start": 2843.839,
        "end": 2849.359,
        "text": "I dry myself completely.",
        "textdich": ""
    },
    {
        "start": 2846.8,
        "end": 2852.64,
        "text": "I choose my clothes.",
        "textdich": ""
    },
    {
        "start": 2849.359,
        "end": 2864.48,
        "text": "I wear neat work clothes. I check my appearance. I feel ready to leave. I walk to the kitchen. I prepare a simple",
        "textdich": ""
    },
    {
        "start": 2859.52,
        "end": 2869.04,
        "text": "breakfast. I eat calmly. I chew slowly.",
        "textdich": ""
    },
    {
        "start": 2864.48,
        "end": 2880.319,
        "text": "I drink water. I drink tea. I feel awake and active. I clean the table. I wash the dishes. I dry the dishes. I put them",
        "textdich": ""
    },
    {
        "start": 2876.319,
        "end": 2891.44,
        "text": "away. I pack my lunchbox. I pack my work bag. I check my phone quickly. I check the time carefully. I take my keys. I",
        "textdich": ""
    },
    {
        "start": 2887.68,
        "end": 2895.52,
        "text": "leave the house. I lock the door firmly.",
        "textdich": ""
    },
    {
        "start": 2891.44,
        "end": 2901.599,
        "text": "I step outside. I feel the fresh air. I start my commute calmly.",
        "textdich": ""
    },
    {
        "start": 2897.76,
        "end": 2911.839,
        "text": "I walk to the stop. I wait in line. I stay patient. I take the bus. I find a seat. I sit quietly.",
        "textdich": ""
    },
    {
        "start": 2909.04,
        "end": 2922.48,
        "text": "I look outside the window. I think about my goals. I plan my tasks. I arrive near my workplace. I get off the bus. I walk",
        "textdich": ""
    },
    {
        "start": 2920.0,
        "end": 2937.119,
        "text": "to the office building. I enter the building calmly. I greet people politely. I say good morning clearly. I smile gently. I walk toward my desk. I",
        "textdich": ""
    },
    {
        "start": 2933.119,
        "end": 2950.72,
        "text": "place my bag down. I sit comfortably. I adjust my chair. I organize my desk. I turn on the computer. I log in carefully. I open my email inbox. I read",
        "textdich": ""
    },
    {
        "start": 2947.599,
        "end": 2958.48,
        "text": "messages one by one. I understand the requests. I reply with clear sentences.",
        "textdich": ""
    },
    {
        "start": 2955.119,
        "end": 2970.4,
        "text": "I keep my words simple. I stay polite and professional. I send my replies. I open my work folders. I review my tasks",
        "textdich": ""
    },
    {
        "start": 2966.319,
        "end": 2974.0,
        "text": "for the day. I write a clear task list.",
        "textdich": ""
    },
    {
        "start": 2970.4,
        "end": 2983.359,
        "text": "I set priorities wisely. I begin my first task. I read the instructions carefully. I understand what is needed.",
        "textdich": ""
    },
    {
        "start": 2980.0,
        "end": 2990.48,
        "text": "I start working step by step. I type slowly and clearly. I check my spelling.",
        "textdich": ""
    },
    {
        "start": 2986.88,
        "end": 3005.2,
        "text": "I save my work often. I review what I write. I correct small mistakes. I continue working calmly. I stay focused on the screen. I avoid unnecessary",
        "textdich": ""
    },
    {
        "start": 3000.8,
        "end": 3017.04,
        "text": "noise. I manage my time well. I receive a message. I read it carefully. I understand the meaning. I reply calmly.",
        "textdich": ""
    },
    {
        "start": 3013.68,
        "end": 3024.24,
        "text": "I return to my task. I receive a phone call. I answer politely.",
        "textdich": ""
    },
    {
        "start": 3020.48,
        "end": 3038.24,
        "text": "I listen carefully to the voice. I speak clearly and slowly. I confirm the details. I thank the caller. I end the call. I write notes for later. I",
        "textdich": ""
    },
    {
        "start": 3036.079,
        "end": 3041.839,
        "text": "remember the instructions.",
        "textdich": ""
    },
    {
        "start": 3038.24,
        "end": 3046.16,
        "text": "I continue my work. I attend a meeting.",
        "textdich": ""
    },
    {
        "start": 3041.839,
        "end": 3059.76,
        "text": "I join on time. I sit quietly. I listen to others. I take notes carefully. I share a short update. I keep my words clear. I stay respectful.",
        "textdich": ""
    },
    {
        "start": 3056.64,
        "end": 3069.92,
        "text": "I leave the meeting calmly. I return to my desk. I apply new information. I update my work. I feel productive.",
        "textdich": ""
    },
    {
        "start": 3067.599,
        "end": 3073.119,
        "text": "I complete one task.",
        "textdich": ""
    },
    {
        "start": 3069.92,
        "end": 3082.24,
        "text": "I mark it as done. I move to the next task. I repeat the same process. I read.",
        "textdich": ""
    },
    {
        "start": 3077.359,
        "end": 3092.4,
        "text": "I work. I check. I fix. I save. I feel progress building. I face a small challenge. I do not panic. I stay calm.",
        "textdich": ""
    },
    {
        "start": 3089.28,
        "end": 3104.16,
        "text": "I think carefully. I try a simple solution. I test it slowly. I review the result. I adjust my work. I solve the",
        "textdich": ""
    },
    {
        "start": 3100.319,
        "end": 3112.319,
        "text": "problem. I feel confident again. I learn something useful. I gain experience.",
        "textdich": ""
    },
    {
        "start": 3108.16,
        "end": 3116.319,
        "text": "I take a short break. I stand up slowly.",
        "textdich": ""
    },
    {
        "start": 3112.319,
        "end": 3127.68,
        "text": "I stretch my arms. I stretch my back. I relax my shoulders. I drink water. I breathe deeply. I return to my desk. I",
        "textdich": ""
    },
    {
        "start": 3123.76,
        "end": 3141.2,
        "text": "sit down again. I refocus my mind. I continue working steadily. I answer more emails. I send updates clearly. I confirm tasks politely. I stay",
        "textdich": ""
    },
    {
        "start": 3137.599,
        "end": 3154.88,
        "text": "organized. I check deadlines. I manage my workload carefully. I work at a steady pace. I help a co-worker. I listen patiently. I explain clearly. I",
        "textdich": ""
    },
    {
        "start": 3151.44,
        "end": 3166.16,
        "text": "share useful information. I return to my own tasks. I prepare a report. I review the data. I check the numbers. I correct",
        "textdich": ""
    },
    {
        "start": 3162.559,
        "end": 3177.04,
        "text": "errors. I improve clarity. I finalize the document. I save the file. I send the file. I wait for feedback calmly. I",
        "textdich": ""
    },
    {
        "start": 3174.16,
        "end": 3189.359,
        "text": "continue other work. I check the time again. I notice the afternoon passing. I feel a little tired. I stay focused. I",
        "textdich": ""
    },
    {
        "start": 3185.76,
        "end": 3199.359,
        "text": "remind myself to stay calm. I complete important tasks first. I leave small tasks for later. I review my task list.",
        "textdich": ""
    },
    {
        "start": 3196.16,
        "end": 3213.04,
        "text": "I mark completed items. I note pending items. I plan for tomorrow. I write reminders. I organize my folders. I clean my desk carefully. I close all",
        "textdich": ""
    },
    {
        "start": 3209.839,
        "end": 3228.24,
        "text": "programs. I shut down the computer. I pack my bag neatly. I stand up slowly. I say goodbye politely. I thank my co-workers. I leave the office calmly.",
        "textdich": ""
    },
    {
        "start": 3224.24,
        "end": 3241.359,
        "text": "I walk outside. I feel relaxed. I breathe fresh air. I go home quietly. I think about my workday. I feel satisfied.",
        "textdich": ""
    },
    {
        "start": 3236.8,
        "end": 3245.76,
        "text": "I reach home safely. I remove my shoes.",
        "textdich": ""
    },
    {
        "start": 3241.359,
        "end": 3250.319,
        "text": "I wash my hands. I sit down comfortably.",
        "textdich": ""
    },
    {
        "start": 3245.76,
        "end": 3261.76,
        "text": "I rest my body. I eat dinner slowly. I relax my mind. I prepare for sleep. I feel peaceful. I end the day with calm and positive thoughts.",
        "textdich": ""
    }
]