[
    {
        "start": 0.48,
        "end": 11.28,
        "text": "Welcome everyone. Today I am not here to teach you English like a teacher with a book in hand. Today I am here to talk to",
        "textdich": ""
    },
    {
        "start": 8.559,
        "end": 21.039,
        "text": "you like a friend who once stood exactly where you are standing now, silent, confused, full of ideas but unable to",
        "textdich": ""
    },
    {
        "start": 17.6,
        "end": 31.599,
        "text": "speak. And my name is Ariel and this is bookish English. A place where we don't just learn words, we build voices.",
        "textdich": ""
    },
    {
        "start": 28.4,
        "end": 33.6,
        "text": "Let me ask you something very honest.",
        "textdich": ""
    },
    {
        "start": 31.599,
        "end": 45.68,
        "text": "Have you ever felt that English is inside your head but never comes out of your mouth? You understand videos. You read posts. You know what others are",
        "textdich": ""
    },
    {
        "start": 42.96,
        "end": 58.8,
        "text": "saying. But when it's your turn to speak, everything stops. Your lips feel heavy. Your tongue feels slow. Your heart beats fast. and suddenly you feel",
        "textdich": ""
    },
    {
        "start": 57.12,
        "end": 62.079,
        "text": "small.",
        "textdich": ""
    },
    {
        "start": 58.8,
        "end": 65.68,
        "text": "I know this feeling because I lived it.",
        "textdich": ""
    },
    {
        "start": 62.079,
        "end": 73.04,
        "text": "I watched English videos for years. I learned grammar rules. I saved vocabulary lists.",
        "textdich": ""
    },
    {
        "start": 70.96,
        "end": 87.28,
        "text": "People said my English knowledge was good. But inside I knew the truth. I couldn't speak. And one day I realized something shocking. Nobody ever taught",
        "textdich": ""
    },
    {
        "start": 84.0,
        "end": 96.96,
        "text": "me how to train my mouth to talk. They taught me what English is, but not how English feels when it leaves your lips.",
        "textdich": ""
    },
    {
        "start": 93.759,
        "end": 100.079,
        "text": "That was the day everything changed.",
        "textdich": ""
    },
    {
        "start": 96.96,
        "end": 108.56,
        "text": "Because English is not only a subject, it is a physical skill just like dancing, singing, or playing a sport.",
        "textdich": ""
    },
    {
        "start": 106.56,
        "end": 117.759,
        "text": "You can read about swimming all your life, but if you never enter the water, your body will never learn. In the same",
        "textdich": ""
    },
    {
        "start": 114.479,
        "end": 126.159,
        "text": "way, you can watch English all day, but if your mouth is not trained, your voice will never move freely.",
        "textdich": ""
    },
    {
        "start": 123.84,
        "end": 134.08,
        "text": "Most learners think their problem is grammar or confidence, but that is not the real problem.",
        "textdich": ""
    },
    {
        "start": 131.599,
        "end": 140.48,
        "text": "The real problem is that your mouth is still living in your native language.",
        "textdich": ""
    },
    {
        "start": 136.8,
        "end": 149.76,
        "text": "Your tongue, your lips, your jaw, they have practiced one sound system since childhood. And suddenly you ask them to",
        "textdich": ""
    },
    {
        "start": 146.72,
        "end": 160.0,
        "text": "switch to English without training. Of course they resist. Of course they feel uncomfortable. That discomfort is not",
        "textdich": ""
    },
    {
        "start": 155.68,
        "end": 162.56,
        "text": "failure. It is simply untrained muscles.",
        "textdich": ""
    },
    {
        "start": 160.0,
        "end": 174.239,
        "text": "When I understood this, I stopped blaming myself. I stopped saying I am bad at English. I started saying my mouth is just untrained.",
        "textdich": ""
    },
    {
        "start": 171.84,
        "end": 179.519,
        "text": "And the moment you stop blaming and start training, progress begins.",
        "textdich": ""
    },
    {
        "start": 178.0,
        "end": 195.2,
        "text": "Let me tell you something very important. You do not need perfect grammar to speak. You do not need a fancy accent. You do not need expensive courses.",
        "textdich": ""
    },
    {
        "start": 190.879,
        "end": 199.04,
        "text": "What you need is daily mouth movement.",
        "textdich": ""
    },
    {
        "start": 195.2,
        "end": 202.239,
        "text": "Small, focused, real speaking practice.",
        "textdich": ""
    },
    {
        "start": 199.04,
        "end": 210.319,
        "text": "5 minutes a day can change your life if those five minutes are active, not passive.",
        "textdich": ""
    },
    {
        "start": 206.72,
        "end": 213.519,
        "text": "When I first started, I felt ridiculous.",
        "textdich": ""
    },
    {
        "start": 210.319,
        "end": 226.959,
        "text": "I spoke to the mirror. I exaggerated sounds. I repeated simple sentences again and again. I sounded like a beginner. And yes, my voice shook. But",
        "textdich": ""
    },
    {
        "start": 223.519,
        "end": 235.68,
        "text": "every day my mouth became lighter. Every day words came faster. Every day fear became smaller.",
        "textdich": ""
    },
    {
        "start": 233.04,
        "end": 239.519,
        "text": "And one morning I noticed something magical.",
        "textdich": ""
    },
    {
        "start": 237.439,
        "end": 248.159,
        "text": "English came out without asking permission from my brain. That is fluency.",
        "textdich": ""
    },
    {
        "start": 244.72,
        "end": 253.439,
        "text": "Fluency is when your mouth moves before fear arrives.",
        "textdich": ""
    },
    {
        "start": 250.319,
        "end": 265.84,
        "text": "And this is what I want for you on bookish English. I don't want you to just listen to me. I want you to speak with me. I want you to move your mouth",
        "textdich": ""
    },
    {
        "start": 262.56,
        "end": 272.479,
        "text": "while watching. Because silence never builds confidence. Only sound does.",
        "textdich": ""
    },
    {
        "start": 269.759,
        "end": 285.44,
        "text": "Training your mouth means accepting that you will sound imperfect at first. But that imperfection is not weakness. It is proof that you are practicing.",
        "textdich": ""
    },
    {
        "start": 282.4,
        "end": 300.479,
        "text": "Babies don't speak perfectly. They babble. They repeat. They make strange sounds and nobody laughs at them. We clap for them. So why are you so hard on",
        "textdich": ""
    },
    {
        "start": 297.44,
        "end": 309.52,
        "text": "yourself? You are allowed to sound like a learner. That is the price of becoming a speaker. When you train your mouth,",
        "textdich": ""
    },
    {
        "start": 306.56,
        "end": 319.36,
        "text": "something else happens too. Your brain relaxes because your brain realizes it doesn't need to translate everything. It",
        "textdich": ""
    },
    {
        "start": 316.56,
        "end": 329.759,
        "text": "trusts your mouth. And when brain and mouth work together, English becomes natural. You stop searching for words.",
        "textdich": ""
    },
    {
        "start": 326.24,
        "end": 343.12,
        "text": "You stop freezing. You start expressing and expression is the real goal of language. Not exams, not marks, not rules. Expression,",
        "textdich": ""
    },
    {
        "start": 339.84,
        "end": 353.44,
        "text": "the ability to say what you feel when you feel it without fear. That is why this journey is not about English only.",
        "textdich": ""
    },
    {
        "start": 350.479,
        "end": 367.6,
        "text": "It is about confidence. It is about identity. It is about becoming the version of yourself who is not afraid to speak. I want you to imagine something.",
        "textdich": ""
    },
    {
        "start": 363.68,
        "end": 380.639,
        "text": "Imagine yourself 6 months from now. You are speaking calmly. You are not rushing. You are not apologizing for your English. You are understood.",
        "textdich": ""
    },
    {
        "start": 377.28,
        "end": 386.88,
        "text": "You are respected. And you smile because you remember the days when you were silent.",
        "textdich": ""
    },
    {
        "start": 384.319,
        "end": 398.319,
        "text": "That future is possible but only if you train your mouth today, not tomorrow, not someday, today.",
        "textdich": ""
    },
    {
        "start": 395.12,
        "end": 410.479,
        "text": "Even one sentence spoken out loud is a step forward. So as we begin this journey together on bookish English, promise me one thing.",
        "textdich": ""
    },
    {
        "start": 407.199,
        "end": 423.52,
        "text": "Do not be a silent viewer. Be a speaker in training. Speak with me. Pause the video, repeat sentences, move your lips, feel the sounds.",
        "textdich": ""
    },
    {
        "start": 421.52,
        "end": 434.08,
        "text": "Because English will never come from watching alone. It comes from doing. In the next part, I will show you exactly",
        "textdich": ""
    },
    {
        "start": 431.039,
        "end": 443.52,
        "text": "how to start training your mouth daily with simple exercises that anyone can do at home without pressure and without",
        "textdich": ""
    },
    {
        "start": 440.479,
        "end": 456.08,
        "text": "fear. Now let us continue this journey together and go deeper into the real work. The work that actually changes your voice and your confidence because",
        "textdich": ""
    },
    {
        "start": 452.479,
        "end": 465.68,
        "text": "motivation alone is not enough. You need a clear path. And this part is about building that path step by step so your",
        "textdich": ""
    },
    {
        "start": 462.4,
        "end": 472.08,
        "text": "mouth slowly learns a new habit and your fear slowly loses its power.",
        "textdich": ""
    },
    {
        "start": 469.599,
        "end": 483.12,
        "text": "The first thing I want you to understand is that your mouth is like a sleepy machine. It has been moving in one pattern for many years. Your native",
        "textdich": ""
    },
    {
        "start": 480.08,
        "end": 493.44,
        "text": "language has its own rhythm, speed, and shape. English has a different rhythm, a different music. When you suddenly try",
        "textdich": ""
    },
    {
        "start": 490.24,
        "end": 500.24,
        "text": "to speak English, your mouth feels tired because it is doing a new kind of work.",
        "textdich": ""
    },
    {
        "start": 496.8,
        "end": 504.56,
        "text": "This tiredness is not a problem. It is progress.",
        "textdich": ""
    },
    {
        "start": 501.84,
        "end": 516.399,
        "text": "Just like your legs feel tired when you start walking after a long time, your mouth feels tired when you start speaking English. That tired feeling",
        "textdich": ""
    },
    {
        "start": 513.519,
        "end": 529.839,
        "text": "means your muscles are waking up. So never stop because of that. Instead, smile and say, \"Yes, this is working.\" Now let me show you how to train your",
        "textdich": ""
    },
    {
        "start": 526.32,
        "end": 542.08,
        "text": "mouth in a very simple daily way without pressure. Every day you need to do three things only. Move your mouth, hear real",
        "textdich": ""
    },
    {
        "start": 537.76,
        "end": 546.32,
        "text": "English, and speak without fear.",
        "textdich": ""
    },
    {
        "start": 542.08,
        "end": 551.68,
        "text": "That's it. No heavy rules, no long lists.",
        "textdich": ""
    },
    {
        "start": 547.92,
        "end": 557.839,
        "text": "First, moving your mouth. Before speaking, your mouth needs to warm up.",
        "textdich": ""
    },
    {
        "start": 555.12,
        "end": 572.16,
        "text": "You don't need anything special. Just stand or sit comfortably. Open your mouth wide and close it slowly a few times. Move your tongue left and right.",
        "textdich": ""
    },
    {
        "start": 568.24,
        "end": 584.399,
        "text": "Smile widely and then relax. This may sound childish, but it works. You are telling your mouth, \"Get ready. We are switching to English mode.",
        "textdich": ""
    },
    {
        "start": 580.959,
        "end": 594.08,
        "text": "Then choose one simple sentence, not a difficult sentence. Something easy and real like I am learning to speak English",
        "textdich": ""
    },
    {
        "start": 590.48,
        "end": 603.36,
        "text": "or I am not afraid to speak anymore. Say this sentence slowly. Feel every word.",
        "textdich": ""
    },
    {
        "start": 598.48,
        "end": 614.959,
        "text": "Don't rush. Say it again and again. Look in the mirror if you can. Not to judge yourself, but to get comfortable seeing yourself speak English.",
        "textdich": ""
    },
    {
        "start": 612.56,
        "end": 623.92,
        "text": "Many learners are afraid of their own English face. They feel shy seeing their lips move differently.",
        "textdich": ""
    },
    {
        "start": 620.959,
        "end": 638.48,
        "text": "That fear disappears only when you face it. The mirror is not your enemy. It is your friend. It shows you that you are trying and trying is powerful.",
        "textdich": ""
    },
    {
        "start": 634.64,
        "end": 651.2,
        "text": "After that, listen to real English, not grammar explanations, real spoken English. It can be a short video, a short clip, even one sentence",
        "textdich": ""
    },
    {
        "start": 647.44,
        "end": 658.079,
        "text": "from a movie. Listen carefully, then repeat it immediately.",
        "textdich": ""
    },
    {
        "start": 653.6,
        "end": 661.36,
        "text": "Don't wait, don't think, just repeat.",
        "textdich": ""
    },
    {
        "start": 658.079,
        "end": 671.12,
        "text": "Even if it's not perfect, this is called shadow speaking. You are walking behind the speaker like a shadow. This trains",
        "textdich": ""
    },
    {
        "start": 668.16,
        "end": 683.2,
        "text": "your mouth to follow English speed and flow. At first, you will feel lost. Your tongue will trip. That's normal. Keep",
        "textdich": ""
    },
    {
        "start": 679.36,
        "end": 687.76,
        "text": "going. Your mouth learns by copying, not by thinking.",
        "textdich": ""
    },
    {
        "start": 685.04,
        "end": 696.72,
        "text": "Babies don't ask why this sound is like this. They copy. You should do the same.",
        "textdich": ""
    },
    {
        "start": 693.12,
        "end": 702.24,
        "text": "Now the most important part, speaking without fear.",
        "textdich": ""
    },
    {
        "start": 698.88,
        "end": 707.36,
        "text": "Fear kills fluency faster than lack of vocabulary.",
        "textdich": ""
    },
    {
        "start": 704.16,
        "end": 714.88,
        "text": "Many learners know words but don't use them because they are afraid of mistakes.",
        "textdich": ""
    },
    {
        "start": 711.36,
        "end": 719.68,
        "text": "Let me tell you something very honestly.",
        "textdich": ""
    },
    {
        "start": 714.88,
        "end": 722.56,
        "text": "Mistakes are not the enemy. Silence is.",
        "textdich": ""
    },
    {
        "start": 719.68,
        "end": 724.8,
        "text": "When you stay silent, you don't grow.",
        "textdich": ""
    },
    {
        "start": 722.56,
        "end": 738.48,
        "text": "When you speak and make mistakes, you grow fast. People who laugh at mistakes never learned anything deeply. Strong learners respect effort.",
        "textdich": ""
    },
    {
        "start": 734.399,
        "end": 741.6,
        "text": "And even if someone laughs, so what?",
        "textdich": ""
    },
    {
        "start": 738.48,
        "end": 746.639,
        "text": "Your future is bigger than one moment of embarrassment.",
        "textdich": ""
    },
    {
        "start": 743.44,
        "end": 752.16,
        "text": "Every fluent speaker you admire once sounded terrible. They just didn't quit.",
        "textdich": ""
    },
    {
        "start": 750.16,
        "end": 760.56,
        "text": "They kept speaking when it felt uncomfortable. And that is the difference between speakers and watchers.",
        "textdich": ""
    },
    {
        "start": 757.839,
        "end": 770.88,
        "text": "On bookish English, I want to create speakers, not silent fans. So, I want you to practice speaking alone at first.",
        "textdich": ""
    },
    {
        "start": 767.2,
        "end": 773.68,
        "text": "Talk to yourself. Talk while walking.",
        "textdich": ""
    },
    {
        "start": 770.88,
        "end": 785.76,
        "text": "Describe what you see. Say simple things. I am walking. The sky is blue. I feel nervous, but I am speaking. This",
        "textdich": ""
    },
    {
        "start": 781.279,
        "end": 788.8,
        "text": "may feel strange, but it builds courage.",
        "textdich": ""
    },
    {
        "start": 785.76,
        "end": 795.6,
        "text": "When you can speak alone without fear, speaking with others becomes easier.",
        "textdich": ""
    },
    {
        "start": 792.16,
        "end": 799.76,
        "text": "Confidence is built in private, not in public.",
        "textdich": ""
    },
    {
        "start": 797.519,
        "end": 808.079,
        "text": "One more important thing you must understand is consistency, not intensity.",
        "textdich": ""
    },
    {
        "start": 804.88,
        "end": 817.6,
        "text": "You don't need one hour a day. You need five minutes every day. Five honest minutes where your mouth moves and your",
        "textdich": ""
    },
    {
        "start": 814.16,
        "end": 829.519,
        "text": "voice comes out. If you practice 1 hour today and then stop for a week, nothing changes. But if you practice 5 minutes",
        "textdich": ""
    },
    {
        "start": 824.959,
        "end": 833.2,
        "text": "every day, your mouth slowly rewires.",
        "textdich": ""
    },
    {
        "start": 829.519,
        "end": 836.56,
        "text": "Habits are stronger than motivation.",
        "textdich": ""
    },
    {
        "start": 833.2,
        "end": 847.279,
        "text": "Even on days you feel tired, speak one sentence. Even on bad days, move your mouth once that keeps the chain alive.",
        "textdich": ""
    },
    {
        "start": 844.48,
        "end": 851.68,
        "text": "And when the chain is alive, progress continues.",
        "textdich": ""
    },
    {
        "start": 848.88,
        "end": 861.92,
        "text": "Let me share something personal. When I was learning, there were days I hated my voice. I felt my English sounded ugly. I",
        "textdich": ""
    },
    {
        "start": 858.16,
        "end": 865.04,
        "text": "wanted to quit. But I made one rule.",
        "textdich": ""
    },
    {
        "start": 861.92,
        "end": 878.88,
        "text": "Never stop speaking completely. Even if I felt bad, I spoke one sentence. That rule saved me because stopping completely is dangerous. It makes fear",
        "textdich": ""
    },
    {
        "start": 875.839,
        "end": 884.24,
        "text": "stronger. Small action makes fear weaker.",
        "textdich": ""
    },
    {
        "start": 880.56,
        "end": 890.16,
        "text": "Over time, my voice changed. Not suddenly, slowly.",
        "textdich": ""
    },
    {
        "start": 887.76,
        "end": 900.639,
        "text": "But one day I noticed I was speaking without planning every word. That moment is unforgettable and that moment will",
        "textdich": ""
    },
    {
        "start": 896.639,
        "end": 903.279,
        "text": "come for you too if you stay consistent.",
        "textdich": ""
    },
    {
        "start": 900.639,
        "end": 914.8,
        "text": "Another key point is accepting your accent. Your accent is not a disease. It is part of your identity. You don't need",
        "textdich": ""
    },
    {
        "start": 910.8,
        "end": 917.279,
        "text": "to erase it. You just need clarity.",
        "textdich": ""
    },
    {
        "start": 914.8,
        "end": 930.399,
        "text": "People don't care about accent as much as you think. They care if they understand you. Focus on being clear, not fake. Don't try to sound like",
        "textdich": ""
    },
    {
        "start": 926.8,
        "end": 942.639,
        "text": "someone else. Sound like you but in English. That authenticity builds confidence and confidence makes people listen.",
        "textdich": ""
    },
    {
        "start": 940.0,
        "end": 952.88,
        "text": "As we continue this journey, remember this. English is not judging you. People are not waiting for you to fail. Most of",
        "textdich": ""
    },
    {
        "start": 949.68,
        "end": 965.04,
        "text": "the pressure is inside your head. Once you step out of that mental prison, speaking becomes lighter. You deserve to speak. You deserve to express. Your",
        "textdich": ""
    },
    {
        "start": 962.16,
        "end": 977.6,
        "text": "ideas matter. Even if your English is not perfect and perfection is not required for communication, courage is. So, keep training your",
        "textdich": ""
    },
    {
        "start": 973.68,
        "end": 982.24,
        "text": "mouth, keep making sounds, keep showing up.",
        "textdich": ""
    },
    {
        "start": 979.44,
        "end": 991.68,
        "text": "In the next part, I will take you even deeper and show you how to build natural flow and rhythm so your English stops",
        "textdich": ""
    },
    {
        "start": 988.88,
        "end": 1003.519,
        "text": "sounding broken and starts sounding smooth. Let us move forward in this journey and now talk about something that separates basic speakers from",
        "textdich": ""
    },
    {
        "start": 1000.32,
        "end": 1016.56,
        "text": "confident speakers and that thing is flow. Because many learners can say words but they cannot connect them. And this is where English starts to feel",
        "textdich": ""
    },
    {
        "start": 1012.48,
        "end": 1026.88,
        "text": "heavy and broken. When you speak word by word, your brain works too hard. Your mouth stops again and again and your",
        "textdich": ""
    },
    {
        "start": 1023.6,
        "end": 1038.319,
        "text": "listener feels the gaps. But when you learn flow, English becomes like a smooth road instead of a road full of stones.",
        "textdich": ""
    },
    {
        "start": 1035.039,
        "end": 1052.0,
        "text": "Flow means speaking in small groups of words, not one by one. It means letting sounds touch each other. It means trusting your mouth to move forward",
        "textdich": ""
    },
    {
        "start": 1048.559,
        "end": 1059.6,
        "text": "without stopping after every word. And this skill is not magic. It is trained.",
        "textdich": ""
    },
    {
        "start": 1056.24,
        "end": 1072.559,
        "text": "When I first discovered this, my English changed quickly. Before that, I used to say I am learning English. Every word",
        "textdich": ""
    },
    {
        "start": 1067.36,
        "end": 1075.28,
        "text": "separate, very slow, very stressful.",
        "textdich": ""
    },
    {
        "start": 1072.559,
        "end": 1083.2,
        "text": "But when I started saying I am learning English in one breath something clicked.",
        "textdich": ""
    },
    {
        "start": 1080.08,
        "end": 1090.72,
        "text": "My mouth felt lighter. My brain felt calmer and people understood me more easily.",
        "textdich": ""
    },
    {
        "start": 1087.76,
        "end": 1092.88,
        "text": "That is the power of flow.",
        "textdich": ""
    },
    {
        "start": 1090.72,
        "end": 1101.2,
        "text": "You don't need long sentences to practice this. Short sentences are perfect.",
        "textdich": ""
    },
    {
        "start": 1097.44,
        "end": 1113.2,
        "text": "For example, I want to try. Say it slowly first, then say it again a little faster, then say it smoothly. I want to",
        "textdich": ""
    },
    {
        "start": 1108.72,
        "end": 1119.36,
        "text": "try. Notice how want to becomes w to naturally. You don't need to force it.",
        "textdich": ""
    },
    {
        "start": 1116.96,
        "end": 1122.96,
        "text": "Just let it happen.",
        "textdich": ""
    },
    {
        "start": 1119.36,
        "end": 1132.88,
        "text": "English likes shortcuts. Native speakers use them all the time. Not because they are lazy but because it is natural.",
        "textdich": ""
    },
    {
        "start": 1130.08,
        "end": 1138.559,
        "text": "When you fight this natural flow, English feels unnatural.",
        "textdich": ""
    },
    {
        "start": 1135.919,
        "end": 1152.08,
        "text": "When you accept it, English feels friendly. Another example is let me know. Not let me know but let me know.",
        "textdich": ""
    },
    {
        "start": 1148.72,
        "end": 1166.0,
        "text": "One sound line. Practice these small phrases again and again. Not hundreds, just a few every day. Repetition with awareness is the secret. And please",
        "textdich": ""
    },
    {
        "start": 1161.76,
        "end": 1179.76,
        "text": "remember this. Flow is not speed. Many learners think speaking fast means speaking well. That is wrong. Speaking smoothly means speaking well. You can",
        "textdich": ""
    },
    {
        "start": 1176.0,
        "end": 1191.12,
        "text": "speak slowly and still have flow. Flow is about connection, not speed. So don't rush. Let your mouth learn the path",
        "textdich": ""
    },
    {
        "start": 1186.559,
        "end": 1193.76,
        "text": "first. Speed will come later on its own.",
        "textdich": ""
    },
    {
        "start": 1191.12,
        "end": 1198.88,
        "text": "Now let us talk about listening because listening and speaking are best friends.",
        "textdich": ""
    },
    {
        "start": 1196.799,
        "end": 1211.36,
        "text": "You cannot train your mouth without feeding it good sounds. But many learners listen passively. They play a video and just watch. That helps",
        "textdich": ""
    },
    {
        "start": 1207.679,
        "end": 1219.2,
        "text": "understanding but not speaking. To train your mouth, you must listen actively.",
        "textdich": ""
    },
    {
        "start": 1215.919,
        "end": 1232.799,
        "text": "Choose short clips. 10 seconds is enough. Listen carefully. Notice how words connect. Notice where the speaker pauses. Notice the music in their voice.",
        "textdich": ""
    },
    {
        "start": 1230.159,
        "end": 1235.919,
        "text": "Then repeat immediately.",
        "textdich": ""
    },
    {
        "start": 1232.799,
        "end": 1251.36,
        "text": "Don't wait till the end. Pause and speak. Your goal is not to understand every word. Your goal is to copy the sound. Sound first meaning later. This",
        "textdich": ""
    },
    {
        "start": 1247.76,
        "end": 1258.72,
        "text": "is very important. Many learners wait to understand everything before speaking.",
        "textdich": ""
    },
    {
        "start": 1254.72,
        "end": 1261.84,
        "text": "That delay kills fluency.",
        "textdich": ""
    },
    {
        "start": 1258.72,
        "end": 1272.799,
        "text": "Babies speak sounds before understanding meaning fully. And that is why they become fluent. Trust the process. Copy",
        "textdich": ""
    },
    {
        "start": 1269.039,
        "end": 1282.159,
        "text": "now, understand later, your brain will catch up. Another powerful habit is recording yourself.",
        "textdich": ""
    },
    {
        "start": 1278.88,
        "end": 1289.12,
        "text": "I know many of you hate this idea. You don't like your voice. You feel embarrassed.",
        "textdich": ""
    },
    {
        "start": 1286.0,
        "end": 1293.919,
        "text": "But recording is one of the fastest ways to improve.",
        "textdich": ""
    },
    {
        "start": 1291.039,
        "end": 1304.559,
        "text": "When you listen to yourself, you become aware, not to judge, but to adjust. You hear where you pause too much. You hear",
        "textdich": ""
    },
    {
        "start": 1301.679,
        "end": 1313.44,
        "text": "where your voice drops. You hear where you are actually doing better than you thought. Many learners think they sound",
        "textdich": ""
    },
    {
        "start": 1310.24,
        "end": 1324.799,
        "text": "terrible, but when they listen, they realize it is not that bad. This builds confidence and confidence is fuel for",
        "textdich": ""
    },
    {
        "start": 1320.48,
        "end": 1339.12,
        "text": "speaking. So use your phone. Record one minute. One minute only. Speak about anything. Your day, your feelings, your practice.",
        "textdich": ""
    },
    {
        "start": 1334.0,
        "end": 1340.96,
        "text": "Then listen once. Smile and move on.",
        "textdich": ""
    },
    {
        "start": 1339.12,
        "end": 1344.159,
        "text": "Don't overanalyze.",
        "textdich": ""
    },
    {
        "start": 1340.96,
        "end": 1346.799,
        "text": "Just notice and continue.",
        "textdich": ""
    },
    {
        "start": 1344.159,
        "end": 1355.2,
        "text": "Over time, your recordings will become smoother. That progress will motivate you more than any comment from others.",
        "textdich": ""
    },
    {
        "start": 1353.039,
        "end": 1367.12,
        "text": "Let us also talk about thinking in English because translation slows you down. When you think in your native language and then translate, your brain",
        "textdich": ""
    },
    {
        "start": 1363.84,
        "end": 1381.919,
        "text": "works double time. That is why you freeze. To reduce translation, start using simple English thoughts. Not complex ideas,",
        "textdich": ""
    },
    {
        "start": 1376.64,
        "end": 1388.08,
        "text": "simple ones. I am tired. I am hungry. I like this. I don't like that.",
        "textdich": ""
    },
    {
        "start": 1385.6,
        "end": 1393.679,
        "text": "Say these sentences during the day in your head or out loud.",
        "textdich": ""
    },
    {
        "start": 1390.88,
        "end": 1398.96,
        "text": "Slowly, English becomes a direct thought, not a translation.",
        "textdich": ""
    },
    {
        "start": 1396.96,
        "end": 1410.24,
        "text": "This is not something that happens in one day, but with daily practice, it happens naturally. Be patient with yourself.",
        "textdich": ""
    },
    {
        "start": 1406.96,
        "end": 1419.84,
        "text": "Fluency is a long friendship, not a one-day meeting. Another important thing I want to share is about mistakes in",
        "textdich": ""
    },
    {
        "start": 1416.32,
        "end": 1429.84,
        "text": "front of others. At some point, you must speak with real people. That step is scary but necessary.",
        "textdich": ""
    },
    {
        "start": 1425.76,
        "end": 1443.039,
        "text": "Choose safe people first. Friends, supportive classmates, online language partners. Don't jump into judgmental spaces. Build courage gradually. And",
        "textdich": ""
    },
    {
        "start": 1440.08,
        "end": 1454.08,
        "text": "when you make mistakes, don't apologize too much. Apologizing makes you feel smaller. Instead, continue speaking.",
        "textdich": ""
    },
    {
        "start": 1451.679,
        "end": 1468.08,
        "text": "Most people don't care about small mistakes. They care about connection. If you stop every time you make a mistake, conversation dies. If you continue,",
        "textdich": ""
    },
    {
        "start": 1464.4,
        "end": 1476.799,
        "text": "conversation lives. Remember, communication is about message, not perfection.",
        "textdich": ""
    },
    {
        "start": 1473.679,
        "end": 1484.32,
        "text": "As Ariel from Bookish English, I want to tell you something deeply.",
        "textdich": ""
    },
    {
        "start": 1479.279,
        "end": 1487.76,
        "text": "Your voice matters. Your ideas matter.",
        "textdich": ""
    },
    {
        "start": 1484.32,
        "end": 1490.88,
        "text": "English is just a tool to share them.",
        "textdich": ""
    },
    {
        "start": 1487.76,
        "end": 1493.36,
        "text": "Don't make English bigger than yourself.",
        "textdich": ""
    },
    {
        "start": 1490.88,
        "end": 1499.2,
        "text": "You are bigger than this language. You are learning it. It is not judging you.",
        "textdich": ""
    },
    {
        "start": 1496.64,
        "end": 1503.76,
        "text": "So treat it like a friend, not a monster.",
        "textdich": ""
    },
    {
        "start": 1500.72,
        "end": 1512.559,
        "text": "Speak even when your voice shakes. Speak even when your sentence is simple. Speak even when your grammar is not perfect.",
        "textdich": ""
    },
    {
        "start": 1509.84,
        "end": 1522.4,
        "text": "Because every time you speak, you train your mouth. And every time you train your mouth, fear loses strength. We are",
        "textdich": ""
    },
    {
        "start": 1519.36,
        "end": 1531.12,
        "text": "not chasing native level perfection. We are building confident communication and that is enough to change your life. In",
        "textdich": ""
    },
    {
        "start": 1528.64,
        "end": 1540.96,
        "text": "the next part of this journey, I will show you how to build confidence step by step so your fear stops controlling your",
        "textdich": ""
    },
    {
        "start": 1537.84,
        "end": 1551.52,
        "text": "voice and your English becomes part of who you are. Let us continue and now talk about the deepest wall that stops",
        "textdich": ""
    },
    {
        "start": 1547.039,
        "end": 1554.32,
        "text": "most learners. And that wall is fear.",
        "textdich": ""
    },
    {
        "start": 1551.52,
        "end": 1564.08,
        "text": "Because even with practice, even with good habits, fear can quietly sit inside your chest and block your voice at the",
        "textdich": ""
    },
    {
        "start": 1560.799,
        "end": 1575.76,
        "text": "worst moments. Fear is not loud at first. It whispers. It says, \"What if I say it wrong? What if they don't understand me? What if they judge my",
        "textdich": ""
    },
    {
        "start": 1574.0,
        "end": 1580.0,
        "text": "accent?",
        "textdich": ""
    },
    {
        "start": 1575.76,
        "end": 1582.559,
        "text": "And slowly this whisper becomes a habit.",
        "textdich": ""
    },
    {
        "start": 1580.0,
        "end": 1589.2,
        "text": "You start choosing silence because silence feels safe.",
        "textdich": ""
    },
    {
        "start": 1585.279,
        "end": 1591.919,
        "text": "But silence is a dangerous comfort.",
        "textdich": ""
    },
    {
        "start": 1589.2,
        "end": 1597.52,
        "text": "It protects you today and steals your future tomorrow.",
        "textdich": ""
    },
    {
        "start": 1594.32,
        "end": 1604.48,
        "text": "When I was learning, fear was my biggest enemy. Not grammar, not vocabulary.",
        "textdich": ""
    },
    {
        "start": 1601.52,
        "end": 1611.919,
        "text": "I could speak alone in my room, but in front of people, my throat closed.",
        "textdich": ""
    },
    {
        "start": 1608.24,
        "end": 1613.919,
        "text": "And I realized something very important.",
        "textdich": ""
    },
    {
        "start": 1611.919,
        "end": 1622.88,
        "text": "Confidence is not something you wait for. Confidence is something you build by acting even when you feel afraid.",
        "textdich": ""
    },
    {
        "start": 1620.559,
        "end": 1630.64,
        "text": "Waiting to feel confident before speaking is like waiting to be strong before going to the gym.",
        "textdich": ""
    },
    {
        "start": 1627.919,
        "end": 1637.76,
        "text": "Strength comes after training, not before. So, how do you train confidence?",
        "textdich": ""
    },
    {
        "start": 1635.44,
        "end": 1646.08,
        "text": "You train it the same way you train your mouth. Slowly, daily, intentionally.",
        "textdich": ""
    },
    {
        "start": 1643.36,
        "end": 1650.159,
        "text": "The first rule is to change how you talk to yourself.",
        "textdich": ""
    },
    {
        "start": 1647.84,
        "end": 1662.24,
        "text": "Many learners are very cruel to themselves. They say, \"My English is bad. I sound stupid. I will never be fluent.\" Every time you say this, your",
        "textdich": ""
    },
    {
        "start": 1659.36,
        "end": 1676.96,
        "text": "brain believes it and your mouth obeys it. Words are powerful. So start using different words. Say, \"My English is improving. I am learning. I am brave",
        "textdich": ""
    },
    {
        "start": 1673.44,
        "end": 1687.2,
        "text": "because I speak.\" These sentences may feel fake at first, but repetition makes them real. Your brain listens to you",
        "textdich": ""
    },
    {
        "start": 1683.52,
        "end": 1692.0,
        "text": "more than it listens to others. So speak kindly to yourself.",
        "textdich": ""
    },
    {
        "start": 1689.76,
        "end": 1703.36,
        "text": "The second rule is to lower the pressure. Many learners think every sentence must be perfect. That pressure kills fluency.",
        "textdich": ""
    },
    {
        "start": 1700.64,
        "end": 1714.399,
        "text": "Instead, give yourself permission to speak badly. Yes, badly. Because bad speaking is better than no speaking.",
        "textdich": ""
    },
    {
        "start": 1711.52,
        "end": 1726.399,
        "text": "When you allow yourself to be imperfect, your mouth relaxes. And when your mouth relaxes, words flow more easily. Fluency",
        "textdich": ""
    },
    {
        "start": 1722.32,
        "end": 1729.12,
        "text": "grows in relaxed spaces, not tense ones.",
        "textdich": ""
    },
    {
        "start": 1726.399,
        "end": 1736.159,
        "text": "So next time you speak, don't aim for perfect. Aim for clear and honest.",
        "textdich": ""
    },
    {
        "start": 1733.44,
        "end": 1740.08,
        "text": "That is enough.",
        "textdich": ""
    },
    {
        "start": 1736.159,
        "end": 1746.72,
        "text": "The third rule is small exposure. You don't jump into a deep ocean on day one.",
        "textdich": ""
    },
    {
        "start": 1743.52,
        "end": 1752.559,
        "text": "You enter slowly. Start speaking in lowrisk situations.",
        "textdich": ""
    },
    {
        "start": 1749.12,
        "end": 1763.6,
        "text": "Speak with yourself, then with one trusted person, then with a small group, then in public. Each step builds courage.",
        "textdich": ""
    },
    {
        "start": 1761.12,
        "end": 1773.279,
        "text": "Don't compare your step one with someone else's step 10. Everyone has their own timeline. respect yours.",
        "textdich": ""
    },
    {
        "start": 1770.72,
        "end": 1780.08,
        "text": "The fourth rule is celebrating small wins. Many learners ignore progress.",
        "textdich": ""
    },
    {
        "start": 1777.36,
        "end": 1785.84,
        "text": "They only see what is missing. But progress is built from small moments.",
        "textdich": ""
    },
    {
        "start": 1783.76,
        "end": 1797.76,
        "text": "The first time you speak without freezing, the first time you finish a sentence, the first time someone understands you without asking again.",
        "textdich": ""
    },
    {
        "start": 1794.08,
        "end": 1799.44,
        "text": "These moments matter. Celebrate them.",
        "textdich": ""
    },
    {
        "start": 1797.76,
        "end": 1802.96,
        "text": "Smile.",
        "textdich": ""
    },
    {
        "start": 1799.44,
        "end": 1813.6,
        "text": "Say, \"I did it.\" This positive emotion trains your brain to enjoy speaking instead of fearing it.",
        "textdich": ""
    },
    {
        "start": 1809.44,
        "end": 1822.0,
        "text": "Enjoyment accelerates learning. Fear slows it down. Another powerful confidence tool is preparation.",
        "textdich": ""
    },
    {
        "start": 1819.52,
        "end": 1826.64,
        "text": "Fear often comes from feeling unprepared.",
        "textdich": ""
    },
    {
        "start": 1823.679,
        "end": 1838.32,
        "text": "So prepare simple phrases for common situations, introductions, opinions, questions. Practice them until they feel natural.",
        "textdich": ""
    },
    {
        "start": 1836.08,
        "end": 1848.88,
        "text": "When your brain knows it has something ready, it relaxes. And when it relaxes, your mouth works better. This is not",
        "textdich": ""
    },
    {
        "start": 1845.679,
        "end": 1859.279,
        "text": "memorizing scripts. This is building safety nets. Over time, you won't need them. But in the beginning they help a",
        "textdich": ""
    },
    {
        "start": 1855.36,
        "end": 1868.159,
        "text": "lot. Let me also talk about comparison because comparison destroys confidence silently. You watch fluent speakers",
        "textdich": ""
    },
    {
        "start": 1865.12,
        "end": 1879.039,
        "text": "online and think I can never speak like that. But you are seeing the result not the journey. You don't see their",
        "textdich": ""
    },
    {
        "start": 1874.64,
        "end": 1881.039,
        "text": "mistakes, their fear, their early days.",
        "textdich": ""
    },
    {
        "start": 1879.039,
        "end": 1895.36,
        "text": "Comparing your beginning to someone else's middle is unfair. Focus on your own path. Compare yourself only to yesterday's version of you. If today you",
        "textdich": ""
    },
    {
        "start": 1892.24,
        "end": 1899.84,
        "text": "spoke one sentence more than yesterday, you are winning.",
        "textdich": ""
    },
    {
        "start": 1897.36,
        "end": 1902.88,
        "text": "That is real progress.",
        "textdich": ""
    },
    {
        "start": 1899.84,
        "end": 1912.08,
        "text": "As Ariel from Bookish English, I want you to understand that confidence is not loud. It is quiet and steady. It grows",
        "textdich": ""
    },
    {
        "start": 1909.44,
        "end": 1921.519,
        "text": "when you show up daily, even when nobody is watching. It grows when you speak, even when your voice shakes. It grows",
        "textdich": ""
    },
    {
        "start": 1918.96,
        "end": 1933.919,
        "text": "when you forgive yourself for mistakes and keep going. And one day, without warning, you will notice that fear is not controlling you anymore. You will",
        "textdich": ""
    },
    {
        "start": 1930.96,
        "end": 1941.519,
        "text": "still feel nervous sometimes, but it won't stop you. And that is confidence.",
        "textdich": ""
    },
    {
        "start": 1937.919,
        "end": 1952.88,
        "text": "Not the absence of fear but the decision to speak despite it. This journey is not about becoming someone else. It is about",
        "textdich": ""
    },
    {
        "start": 1949.12,
        "end": 1955.44,
        "text": "becoming more of yourself in English.",
        "textdich": ""
    },
    {
        "start": 1952.88,
        "end": 1968.08,
        "text": "Your personality does not disappear when you speak English. It comes out in a new form and that form deserves space. So",
        "textdich": ""
    },
    {
        "start": 1963.919,
        "end": 1980.399,
        "text": "give it space, give it sound, give it time, keep training your mouth, keep calming your mind, keep choosing courage over comfort.",
        "textdich": ""
    },
    {
        "start": 1977.76,
        "end": 1989.12,
        "text": "In the next part of this journey, we will talk about turning practice into a lifestyle. So English becomes part of",
        "textdich": ""
    },
    {
        "start": 1986.0,
        "end": 1998.0,
        "text": "your daily life, not something you do only when you study. Let us continue this journey and now focus on something",
        "textdich": ""
    },
    {
        "start": 1994.96,
        "end": 2007.279,
        "text": "that truly changes everything. Turning practice into a lifestyle. Because when English becomes part of your daily life,",
        "textdich": ""
    },
    {
        "start": 2004.159,
        "end": 2015.12,
        "text": "it stops feeling like a subject and starts feeling like a natural skill you use without effort.",
        "textdich": ""
    },
    {
        "start": 2012.559,
        "end": 2026.0,
        "text": "Many learners practice only when they sit with a book or a video and the moment they close it, English disappears.",
        "textdich": ""
    },
    {
        "start": 2022.159,
        "end": 2029.039,
        "text": "That is why progress feels slow.",
        "textdich": ""
    },
    {
        "start": 2026.0,
        "end": 2040.399,
        "text": "Language grows when it lives with you, not when it visits you. Sometimes when I understood this, my learning speed doubled.",
        "textdich": ""
    },
    {
        "start": 2037.36,
        "end": 2050.48,
        "text": "I stopped asking when should I practice English and started asking how can I live in English a little more today.",
        "textdich": ""
    },
    {
        "start": 2047.679,
        "end": 2060.079,
        "text": "Living in English does not mean changing your whole life. It means adding small English moments into what you already",
        "textdich": ""
    },
    {
        "start": 2056.72,
        "end": 2068.96,
        "text": "do. When you wake up, say a simple sentence out loud like, \"Today will be a good day.\" When you brush your teeth,",
        "textdich": ""
    },
    {
        "start": 2065.76,
        "end": 2073.04,
        "text": "describe what you are doing in English.",
        "textdich": ""
    },
    {
        "start": 2068.96,
        "end": 2083.44,
        "text": "When you walk, name things you see. This may sound simple, but simplicity builds fluency. You are teaching your brain",
        "textdich": ""
    },
    {
        "start": 2079.52,
        "end": 2094.879,
        "text": "that English is not special or scary. It is normal. It belongs here. The more normal English feels, the less fear it",
        "textdich": ""
    },
    {
        "start": 2091.119,
        "end": 2106.079,
        "text": "creates. Another powerful habit is inner speech. Many people think inner speech must be perfect number. Your inner",
        "textdich": ""
    },
    {
        "start": 2102.16,
        "end": 2110.16,
        "text": "English can be broken, simple, and slow.",
        "textdich": ""
    },
    {
        "start": 2106.079,
        "end": 2113.2,
        "text": "That is fine. The goal is not beauty.",
        "textdich": ""
    },
    {
        "start": 2110.16,
        "end": 2116.0,
        "text": "The goal is presence.",
        "textdich": ""
    },
    {
        "start": 2113.2,
        "end": 2122.16,
        "text": "Think small thoughts in English. I need water. I am tired. I like this song.",
        "textdich": ""
    },
    {
        "start": 2120.0,
        "end": 2132.32,
        "text": "These thoughts train your brain to access English directly. Over time, your inner voice becomes faster and clearer.",
        "textdich": ""
    },
    {
        "start": 2129.599,
        "end": 2138.4,
        "text": "And when your inner voice improves, your outer voice follows.",
        "textdich": ""
    },
    {
        "start": 2134.8,
        "end": 2141.92,
        "text": "This is how fluency grows quietly.",
        "textdich": ""
    },
    {
        "start": 2138.4,
        "end": 2147.28,
        "text": "Let us also talk about routines because routines remove decisionmaking.",
        "textdich": ""
    },
    {
        "start": 2145.04,
        "end": 2161.119,
        "text": "If you decide every day whether to practice, some days you will choose not to. But if you attach English to an existing routine, it becomes automatic.",
        "textdich": ""
    },
    {
        "start": 2157.76,
        "end": 2174.24,
        "text": "For example, after breakfast, one minute of speaking. Before sleep, 1 minute of shadowing. While walking, one minute of self-t talk.",
        "textdich": ""
    },
    {
        "start": 2170.72,
        "end": 2185.2,
        "text": "That is 3 minutes without stress. And three minutes daily is more powerful than one hour once a week. Your mouth learns through repetition,",
        "textdich": ""
    },
    {
        "start": 2182.72,
        "end": 2187.52,
        "text": "not through pressure.",
        "textdich": ""
    },
    {
        "start": 2185.2,
        "end": 2198.24,
        "text": "Another important part of lifestyle learning is choosing input wisely. Not all English content helps speaking. Long",
        "textdich": ""
    },
    {
        "start": 2195.119,
        "end": 2204.32,
        "text": "explanations are useful sometimes, but too much of them makes you passive.",
        "textdich": ""
    },
    {
        "start": 2201.119,
        "end": 2217.92,
        "text": "Balance is important. For every video you watch, speak something, even one sentence, even one word. Never let English enter without leaving your",
        "textdich": ""
    },
    {
        "start": 2214.0,
        "end": 2220.72,
        "text": "mouth. That balance keeps you active.",
        "textdich": ""
    },
    {
        "start": 2217.92,
        "end": 2224.32,
        "text": "You are not a collector of information.",
        "textdich": ""
    },
    {
        "start": 2220.72,
        "end": 2234.079,
        "text": "You are a builder of skill. Let me also talk about patience because impatience quietly kills motivation.",
        "textdich": ""
    },
    {
        "start": 2230.64,
        "end": 2247.44,
        "text": "Many learners expect fast results. When results are slow, they quit. But language growth is not like turning on a light. It is like sunrise.",
        "textdich": ""
    },
    {
        "start": 2243.52,
        "end": 2253.119,
        "text": "Slowly, quietly, and then suddenly everything is bright.",
        "textdich": ""
    },
    {
        "start": 2249.76,
        "end": 2256.4,
        "text": "Some days you will feel no improvement.",
        "textdich": ""
    },
    {
        "start": 2253.119,
        "end": 2259.28,
        "text": "That does not mean nothing is happening.",
        "textdich": ""
    },
    {
        "start": 2256.4,
        "end": 2267.92,
        "text": "Your brain is still adjusting. Your mouth is still learning. Trust the process.",
        "textdich": ""
    },
    {
        "start": 2264.0,
        "end": 2272.8,
        "text": "Fluency rewards those who stay.",
        "textdich": ""
    },
    {
        "start": 2267.92,
        "end": 2274.8,
        "text": "Another key point is rest. Yes, rest.",
        "textdich": ""
    },
    {
        "start": 2272.8,
        "end": 2288.88,
        "text": "Speaking practice is physical and mental. Some days your mouth will feel tired. That is okay. Rest does not mean stopping completely. It means lighter",
        "textdich": ""
    },
    {
        "start": 2284.96,
        "end": 2297.839,
        "text": "practice. Speak fewer sentences. Speak more slowly. Keep the habit alive but reduce intensity.",
        "textdich": ""
    },
    {
        "start": 2295.04,
        "end": 2304.16,
        "text": "Consistency is more important than intensity.",
        "textdich": ""
    },
    {
        "start": 2299.359,
        "end": 2307.839,
        "text": "And finally let us talk about identity.",
        "textdich": ""
    },
    {
        "start": 2304.16,
        "end": 2316.72,
        "text": "At some point you must stop saying I am learning English and start saying I speak English.",
        "textdich": ""
    },
    {
        "start": 2313.119,
        "end": 2330.72,
        "text": "This shift is powerful. When you see yourself as a speaker, your behavior changes. You speak more. You hesitate less. You forgive mistakes faster.",
        "textdich": ""
    },
    {
        "start": 2327.599,
        "end": 2344.56,
        "text": "Identity shapes action. Action shapes skill. Skillshapes confidence. So choose your identity wisely. You are not a silent learner. You are a developing",
        "textdich": ""
    },
    {
        "start": 2340.96,
        "end": 2349.839,
        "text": "speaker. And every day you speak that identity becomes stronger.",
        "textdich": ""
    },
    {
        "start": 2347.28,
        "end": 2357.44,
        "text": "As Ariel from Bookish English, I want you to remember this.",
        "textdich": ""
    },
    {
        "start": 2352.48,
        "end": 2364.48,
        "text": "Fluency is not a gift. It is a habit built quietly, daily, imperfectly.",
        "textdich": ""
    },
    {
        "start": 2361.68,
        "end": 2377.359,
        "text": "You don't need to impress anyone. You need to express yourself. That is enough. When English becomes part of your lifestyle, it stops asking for",
        "textdich": ""
    },
    {
        "start": 2372.4,
        "end": 2379.76,
        "text": "effort. It flows because it belongs.",
        "textdich": ""
    },
    {
        "start": 2377.359,
        "end": 2388.16,
        "text": "In the next part of this journey, we will talk about staying motivated during low days and how to keep going when",
        "textdich": ""
    },
    {
        "start": 2385.04,
        "end": 2398.0,
        "text": "excitement fades because long journeys need strong roots. Let us keep moving forward. And now talk about the days",
        "textdich": ""
    },
    {
        "start": 2394.24,
        "end": 2408.16,
        "text": "nobody prepares you for. The low days, the quiet days, the days when motivation disappears and you start questioning everything",
        "textdich": ""
    },
    {
        "start": 2405.68,
        "end": 2421.599,
        "text": "because these days decide whether you become fluent or stay stuck. Many learners think the journey will feel exciting all the time. That is not true.",
        "textdich": ""
    },
    {
        "start": 2418.4,
        "end": 2425.28,
        "text": "Some days you will feel inspired.",
        "textdich": ""
    },
    {
        "start": 2421.599,
        "end": 2433.28,
        "text": "Other days you will feel tired, bored or disappointed and that is completely normal.",
        "textdich": ""
    },
    {
        "start": 2429.76,
        "end": 2440.72,
        "text": "Fluency is not built on excitement. It is built on discipline and kindness toward yourself.",
        "textdich": ""
    },
    {
        "start": 2437.68,
        "end": 2453.359,
        "text": "On low days your mind will say this is not working. I am not improving. I should stop. But remember this progress is not always loud. Sometimes",
        "textdich": ""
    },
    {
        "start": 2451.28,
        "end": 2456.079,
        "text": "it is silent.",
        "textdich": ""
    },
    {
        "start": 2453.359,
        "end": 2468.319,
        "text": "Sometimes it is happening deep inside where you cannot see it yet. Just because you don't feel improvement does not mean it is not there.",
        "textdich": ""
    },
    {
        "start": 2464.48,
        "end": 2480.72,
        "text": "Think of planting a seed. For days nothing appears. But underground roots are growing. Speaking works the same way. Your mouth and brain are building",
        "textdich": ""
    },
    {
        "start": 2478.4,
        "end": 2484.88,
        "text": "connections quietly.",
        "textdich": ""
    },
    {
        "start": 2480.72,
        "end": 2495.839,
        "text": "So on low days, do not quit. Change the rule. On good days, you can practice more. On bad days, you practice less.",
        "textdich": ""
    },
    {
        "start": 2492.8,
        "end": 2499.599,
        "text": "But you never stop completely.",
        "textdich": ""
    },
    {
        "start": 2495.839,
        "end": 2511.2,
        "text": "Even one sentence is enough. Even one sound is enough. That keeps the habit alive. And habits are stronger than moods.",
        "textdich": ""
    },
    {
        "start": 2508.319,
        "end": 2518.96,
        "text": "Another powerful tool for low days is remembering your why. Why did you start?",
        "textdich": ""
    },
    {
        "start": 2515.119,
        "end": 2528.24,
        "text": "Not for grammar. Not for exams. You started because you wanted to express yourself. You wanted confidence. You wanted freedom. You wanted",
        "textdich": ""
    },
    {
        "start": 2526.48,
        "end": 2531.28,
        "text": "opportunities.",
        "textdich": ""
    },
    {
        "start": 2528.24,
        "end": 2544.079,
        "text": "Write your reason somewhere. Read it when you feel low. Emotions come and go but your reason stays. Let it guide you.",
        "textdich": ""
    },
    {
        "start": 2540.079,
        "end": 2552.88,
        "text": "Also understand this motivation is unreliable. It comes and goes. Systems are reliable.",
        "textdich": ""
    },
    {
        "start": 2549.92,
        "end": 2562.16,
        "text": "That is why small daily routines matter so much. When motivation disappears, routines carry you forward. You don't",
        "textdich": ""
    },
    {
        "start": 2559.68,
        "end": 2567.359,
        "text": "need to feel like practicing. You just need to start.",
        "textdich": ""
    },
    {
        "start": 2564.48,
        "end": 2572.48,
        "text": "Action creates motivation, not the other way around.",
        "textdich": ""
    },
    {
        "start": 2569.839,
        "end": 2576.88,
        "text": "Start speaking and motivation often follows.",
        "textdich": ""
    },
    {
        "start": 2574.16,
        "end": 2582.24,
        "text": "Another thing that helps during low days is changing the style of practice.",
        "textdich": ""
    },
    {
        "start": 2580.4,
        "end": 2595.52,
        "text": "If you are bored with repeating sentences, tell a short story. If you are tired of listening, just talk about your feelings. Variety refreshes the",
        "textdich": ""
    },
    {
        "start": 2591.76,
        "end": 2602.88,
        "text": "mind. English is flexible. Use it in ways that feel human, not mechanical.",
        "textdich": ""
    },
    {
        "start": 2599.44,
        "end": 2606.4,
        "text": "Also, stop measuring yourself every day.",
        "textdich": ""
    },
    {
        "start": 2602.88,
        "end": 2618.56,
        "text": "Measuring too often creates stress. Give yourself time. Review your progress after weeks, not hours. You will be surprised how far you have come.",
        "textdich": ""
    },
    {
        "start": 2615.839,
        "end": 2629.28,
        "text": "Let me also talk about mistakes again because on low days mistakes feel heavier. You notice them more. You judge",
        "textdich": ""
    },
    {
        "start": 2625.28,
        "end": 2638.64,
        "text": "yourself more. When this happens, remind yourself of one truth. Mistakes mean you are practicing at the edge of your",
        "textdich": ""
    },
    {
        "start": 2635.2,
        "end": 2641.119,
        "text": "ability. That is where growth happens.",
        "textdich": ""
    },
    {
        "start": 2638.64,
        "end": 2654.64,
        "text": "If you never make mistakes, you are staying too safe. So mistakes are not a sign of failure. They are a sign of courage. Speak and let mistakes pass",
        "textdich": ""
    },
    {
        "start": 2651.2,
        "end": 2661.599,
        "text": "like clouds. Don't chase them. Don't fight them. Just keep going.",
        "textdich": ""
    },
    {
        "start": 2658.56,
        "end": 2666.319,
        "text": "Another thing that kills motivation is loneliness.",
        "textdich": ""
    },
    {
        "start": 2663.28,
        "end": 2677.76,
        "text": "Learning alone for a long time can feel heavy. Try to connect with others, even one person. Share your journey. Speak",
        "textdich": ""
    },
    {
        "start": 2674.48,
        "end": 2685.04,
        "text": "together. Support makes the journey lighter. You don't need many people.",
        "textdich": ""
    },
    {
        "start": 2681.359,
        "end": 2690.8,
        "text": "Just one who understands. And remember, you are not alone.",
        "textdich": ""
    },
    {
        "start": 2687.92,
        "end": 2695.359,
        "text": "Many people are walking the same path quietly.",
        "textdich": ""
    },
    {
        "start": 2692.319,
        "end": 2704.16,
        "text": "On bookish English, you are part of a community that values effort, not perfection.",
        "textdich": ""
    },
    {
        "start": 2700.24,
        "end": 2710.88,
        "text": "When you feel low, remind yourself that you belong here.",
        "textdich": ""
    },
    {
        "start": 2706.56,
        "end": 2714.4,
        "text": "This journey is yours and it is valid.",
        "textdich": ""
    },
    {
        "start": 2710.88,
        "end": 2717.28,
        "text": "Let us also talk about selfrespect.",
        "textdich": ""
    },
    {
        "start": 2714.4,
        "end": 2728.319,
        "text": "When you practice daily, even for a few minutes, you start respecting yourself more. You trust yourself more. That",
        "textdich": ""
    },
    {
        "start": 2723.839,
        "end": 2741.44,
        "text": "trust becomes confidence. Confidence is not loud behavior. It is inner stability. It is knowing that even if you feel low today, you will show up",
        "textdich": ""
    },
    {
        "start": 2737.839,
        "end": 2746.319,
        "text": "tomorrow. That reliability builds strength.",
        "textdich": ""
    },
    {
        "start": 2743.359,
        "end": 2758.88,
        "text": "Over time, English stops being the center of the struggle. It becomes a tool you carry with you. Fear becomes smaller. Your voice becomes familiar.",
        "textdich": ""
    },
    {
        "start": 2756.079,
        "end": 2766.0,
        "text": "And one day you will notice something beautiful. You will speak without thinking about speaking.",
        "textdich": ""
    },
    {
        "start": 2763.92,
        "end": 2768.88,
        "text": "That is fluency.",
        "textdich": ""
    },
    {
        "start": 2766.0,
        "end": 2775.76,
        "text": "Not because you reached perfection, but because you stopped fighting yourself.",
        "textdich": ""
    },
    {
        "start": 2772.24,
        "end": 2785.44,
        "text": "This journey asks for patience, honesty, and courage. Not talent, not intelligence, just showing up.",
        "textdich": ""
    },
    {
        "start": 2782.16,
        "end": 2792.64,
        "text": "So when low days come, slow down, but don't stop. Speak softly, but speak.",
        "textdich": ""
    },
    {
        "start": 2789.76,
        "end": 2798.56,
        "text": "Whisper if you must, but don't choose silence.",
        "textdich": ""
    },
    {
        "start": 2794.48,
        "end": 2803.52,
        "text": "Silence makes fear grow. Sound makes courage grow.",
        "textdich": ""
    },
    {
        "start": 2800.88,
        "end": 2814.24,
        "text": "As Ariel from Bookish English, I want you to hear this clearly. You are doing better than you think. Every small effort counts.",
        "textdich": ""
    },
    {
        "start": 2811.44,
        "end": 2816.88,
        "text": "Every sentence matters.",
        "textdich": ""
    },
    {
        "start": 2814.24,
        "end": 2830.079,
        "text": "Every day you practice, you move forward. Even if it doesn't feel like it, trust the process, trust yourself, and keep walking.",
        "textdich": ""
    },
    {
        "start": 2827.599,
        "end": 2840.24,
        "text": "In the next part of this journey, we will bring everything together and talk about becoming a confident English speaker in the real world, in",
        "textdich": ""
    },
    {
        "start": 2838.4,
        "end": 2845.04,
        "text": "conversations, in life.",
        "textdich": ""
    },
    {
        "start": 2842.16,
        "end": 2857.359,
        "text": "Let us take the next step and now bring this journey into the real world because learning in your room is powerful. But using English outside is where",
        "textdich": ""
    },
    {
        "start": 2854.0,
        "end": 2860.8,
        "text": "everything becomes real and meaningful.",
        "textdich": ""
    },
    {
        "start": 2857.359,
        "end": 2866.96,
        "text": "And this step often feels the scariest, yet it is the most rewarding.",
        "textdich": ""
    },
    {
        "start": 2864.56,
        "end": 2880.4,
        "text": "Many learners stay in practice mode forever. They repeat sentences, watch videos, talk to themselves, but they delay real conversations.",
        "textdich": ""
    },
    {
        "start": 2876.56,
        "end": 2887.68,
        "text": "They say, \"I am not ready yet.\" But the truth is nobody ever feels fully ready.",
        "textdich": ""
    },
    {
        "start": 2884.56,
        "end": 2895.839,
        "text": "Readiness comes after action, not before it. The real world is not a test. It is a playground.",
        "textdich": ""
    },
    {
        "start": 2893.52,
        "end": 2903.839,
        "text": "People are not waiting to judge your grammar. They are waiting to understand your message.",
        "textdich": ""
    },
    {
        "start": 2900.96,
        "end": 2909.76,
        "text": "So the first thing you must change is how you see conversations.",
        "textdich": ""
    },
    {
        "start": 2906.64,
        "end": 2913.04,
        "text": "A conversation is not a performance.",
        "textdich": ""
    },
    {
        "start": 2909.76,
        "end": 2924.48,
        "text": "It is an exchange. You are not there to impress. You are there to connect. When you focus on connection, pressure reduces.",
        "textdich": ""
    },
    {
        "start": 2921.359,
        "end": 2927.92,
        "text": "Start with simple conversations.",
        "textdich": ""
    },
    {
        "start": 2924.48,
        "end": 2934.88,
        "text": "Don't jump into deep debates. Begin with greetings, small talk, simple opinions.",
        "textdich": ""
    },
    {
        "start": 2931.52,
        "end": 2946.72,
        "text": "How are you? What do you do? I like this. I think so. These small interactions train your confidence muscles. Each successful interaction, no",
        "textdich": ""
    },
    {
        "start": 2943.92,
        "end": 2955.599,
        "text": "matter how small, sends a message to your brain. I can do this. And that message is powerful.",
        "textdich": ""
    },
    {
        "start": 2953.359,
        "end": 2965.28,
        "text": "Another important thing is listening more than speaking at first. Listening reduces pressure. It gives you time. It",
        "textdich": ""
    },
    {
        "start": 2962.559,
        "end": 2979.599,
        "text": "helps you understand rhythm and natural responses. And when you do speak, keep it simple. Long sentences are not required. Clear sentences are enough.",
        "textdich": ""
    },
    {
        "start": 2976.319,
        "end": 2985.76,
        "text": "Fluency is not about length. It is about ease. If you forget a word, don't stop.",
        "textdich": ""
    },
    {
        "start": 2984.16,
        "end": 2988.96,
        "text": "Paraphrase.",
        "textdich": ""
    },
    {
        "start": 2985.76,
        "end": 3001.839,
        "text": "Use simpler words. Communication is flexible. You don't need perfect words to express real ideas. That flexibility is a sign of a real speaker.",
        "textdich": ""
    },
    {
        "start": 2999.68,
        "end": 3006.559,
        "text": "Also, learn to be comfortable with pauses.",
        "textdich": ""
    },
    {
        "start": 3003.599,
        "end": 3021.04,
        "text": "Silence in conversation is not always bad. You don't need to fill every second. Take a breath, think, then speak. Pauses make you sound thoughtful,",
        "textdich": ""
    },
    {
        "start": 3017.52,
        "end": 3029.68,
        "text": "not weak. Many learners panic during pauses and rush. Rushing creates mistakes.",
        "textdich": ""
    },
    {
        "start": 3026.0,
        "end": 3032.559,
        "text": "Calm pauses create clarity.",
        "textdich": ""
    },
    {
        "start": 3029.68,
        "end": 3037.2,
        "text": "Another realworld skill is asking for help confidently.",
        "textdich": ""
    },
    {
        "start": 3034.559,
        "end": 3047.28,
        "text": "If you don't understand something, say, \"Can you repeat please?\" or \"What does that mean?\" There is no shame in this.",
        "textdich": ""
    },
    {
        "start": 3043.839,
        "end": 3053.52,
        "text": "Native speakers do it too. Asking questions shows engagement.",
        "textdich": ""
    },
    {
        "start": 3050.16,
        "end": 3056.0,
        "text": "It keeps the conversation alive.",
        "textdich": ""
    },
    {
        "start": 3053.52,
        "end": 3064.24,
        "text": "Never pretend to understand when you don't. That builds confusion and fear.",
        "textdich": ""
    },
    {
        "start": 3060.64,
        "end": 3066.72,
        "text": "Honesty builds confidence.",
        "textdich": ""
    },
    {
        "start": 3064.24,
        "end": 3073.76,
        "text": "Let us also talk about rejection or misunderstanding because it will happen.",
        "textdich": ""
    },
    {
        "start": 3070.559,
        "end": 3077.359,
        "text": "Sometimes people won't understand you.",
        "textdich": ""
    },
    {
        "start": 3073.76,
        "end": 3079.839,
        "text": "Sometimes they will ask you to repeat.",
        "textdich": ""
    },
    {
        "start": 3077.359,
        "end": 3084.4,
        "text": "Sometimes conversations will feel awkward.",
        "textdich": ""
    },
    {
        "start": 3081.44,
        "end": 3098.24,
        "text": "This is normal. It happens even in your native language. Don't take it personally. One moment does not define your ability. Learn from it and move on.",
        "textdich": ""
    },
    {
        "start": 3094.64,
        "end": 3100.8,
        "text": "Every uncomfortable moment is training.",
        "textdich": ""
    },
    {
        "start": 3098.24,
        "end": 3115.04,
        "text": "Every misunderstanding teaches you something. Growth is hidden inside these moments. Another powerful habit is reflecting after conversations.",
        "textdich": ""
    },
    {
        "start": 3111.2,
        "end": 3118.48,
        "text": "Not to criticize but to learn.",
        "textdich": ""
    },
    {
        "start": 3115.04,
        "end": 3128.72,
        "text": "Ask yourself, \"What went well? What can I improve?\" Then practice one thing next time. Small adjustments create big",
        "textdich": ""
    },
    {
        "start": 3125.04,
        "end": 3134.319,
        "text": "results over time. Also, remember to be patient with yourself in public.",
        "textdich": ""
    },
    {
        "start": 3131.76,
        "end": 3144.0,
        "text": "Speaking with others uses more energy than practicing alone. Your brain is processing sounds, emotions, reactions.",
        "textdich": ""
    },
    {
        "start": 3141.92,
        "end": 3148.559,
        "text": "It is normal to feel tired after conversations.",
        "textdich": ""
    },
    {
        "start": 3145.839,
        "end": 3159.76,
        "text": "That tiredness means you are stretching your ability. Rest and recover. Don't quit. And most importantly, keep your",
        "textdich": ""
    },
    {
        "start": 3156.4,
        "end": 3171.2,
        "text": "identity strong. You are a speaker in progress, not a beginner who knows nothing. You have skills. You have experience.",
        "textdich": ""
    },
    {
        "start": 3167.44,
        "end": 3183.44,
        "text": "Respect that confidence grows when you respect your own journey. As Ariel from Bookish English, I want you to understand that English is not outside",
        "textdich": ""
    },
    {
        "start": 3179.76,
        "end": 3186.96,
        "text": "of you. It is becoming part of you.",
        "textdich": ""
    },
    {
        "start": 3183.44,
        "end": 3196.559,
        "text": "Every conversation adds a layer. Every attempt shapes your voice. You are not chasing a finish line. You are building",
        "textdich": ""
    },
    {
        "start": 3193.2,
        "end": 3200.24,
        "text": "a relationship with this language.",
        "textdich": ""
    },
    {
        "start": 3196.559,
        "end": 3205.92,
        "text": "And relationships grow with time, patience, and honesty.",
        "textdich": ""
    },
    {
        "start": 3203.04,
        "end": 3221.92,
        "text": "There will be good conversations and bad ones. Both are useful. Both are teachers. So step into the real world with curiosity, not fear. Speak to learn",
        "textdich": ""
    },
    {
        "start": 3217.52,
        "end": 3228.72,
        "text": "not to prove. And remember, courage is not loud confidence.",
        "textdich": ""
    },
    {
        "start": 3224.48,
        "end": 3232.72,
        "text": "It is quiet action taken again and again.",
        "textdich": ""
    },
    {
        "start": 3230.48,
        "end": 3242.96,
        "text": "In the next and final part of this journey, we will close this chapter with a powerful mindset shift so you never fall back into silence again.",
        "textdich": ""
    }
]