[
    {
        "start": 2.0,
        "end": 9.12,
        "text": "How I learned English?",
        "textdich": ""
    },
    {
        "start": 5.839,
        "end": 19.359,
        "text": "Growing up in a small town in Delhi, I always had a big dreams. One of my biggest dream was to learn English.",
        "textdich": ""
    },
    {
        "start": 16.16,
        "end": 29.599,
        "text": "I admired people who could speak English fluently. They seemed confident, knowledgeable, and worldly.",
        "textdich": ""
    },
    {
        "start": 26.56,
        "end": 42.399,
        "text": "I wanted to be like them. But my journey to learning English was not easy. It took a lot of hard work, determination and patience.",
        "textdich": ""
    },
    {
        "start": 39.36,
        "end": 52.879,
        "text": "My early days in my small town, not many people spoke English. We mostly communicated in our local language, Hindi.",
        "textdich": ""
    },
    {
        "start": 50.079,
        "end": 61.039,
        "text": "My school offered English classes, but they were not very advanced. We learned basic words and sentences. But there was",
        "textdich": ""
    },
    {
        "start": 58.399,
        "end": 66.159,
        "text": "a little opportunity to practice speaking.",
        "textdich": ""
    },
    {
        "start": 63.28,
        "end": 74.159,
        "text": "I remember feeling frustrated because I wanted to learn more, but I didn't know how.",
        "textdich": ""
    },
    {
        "start": 71.28,
        "end": 82.479,
        "text": "My inspiration came from a teacher named Mrs. Sharma. She was our English teacher in middle school. Mrs. Sharma had a",
        "textdich": ""
    },
    {
        "start": 80.159,
        "end": 88.479,
        "text": "passion for English and she made her classes interesting.",
        "textdich": ""
    },
    {
        "start": 85.68,
        "end": 96.4,
        "text": "She told us stories in English, played English songs and showed us English movies with subtitles.",
        "textdich": ""
    },
    {
        "start": 94.24,
        "end": 105.92,
        "text": "Sharma told us about the importance of learning English. She said it could open many doors for us in the future. Whether",
        "textdich": ""
    },
    {
        "start": 102.56,
        "end": 118.0,
        "text": "we wanted to travel, study abroad or get good jobs, English was essential. her words stayed with me and I decided that I would do whatever it took to",
        "textdich": ""
    },
    {
        "start": 115.439,
        "end": 120.24,
        "text": "learn English.",
        "textdich": ""
    },
    {
        "start": 118.0,
        "end": 132.8,
        "text": "I made a habit of learning five new English words every day. I would write them down in a notebook along with their meanings and example sentences.",
        "textdich": ""
    },
    {
        "start": 130.16,
        "end": 141.84,
        "text": "Then I would try to use those words in my conversations. At first it was challenging. I often forgot the words or",
        "textdich": ""
    },
    {
        "start": 139.04,
        "end": 149.84,
        "text": "use them incorrectly. But I didn't give up. Slowly my vocabulary started to improve.",
        "textdich": ""
    },
    {
        "start": 147.44,
        "end": 156.0,
        "text": "Reading books one of the most effective ways I found to learn English.",
        "textdich": ""
    },
    {
        "start": 153.84,
        "end": 164.72,
        "text": "I loved reading stories about different places and cultures. Reading not only improved my vocabulary but also helped",
        "textdich": ""
    },
    {
        "start": 161.92,
        "end": 169.92,
        "text": "me understand sentence structures and grammar.",
        "textdich": ""
    },
    {
        "start": 167.2,
        "end": 176.56,
        "text": "Another fun way I learned English was by watching movies and listening to stories.",
        "textdich": ""
    },
    {
        "start": 174.319,
        "end": 185.76,
        "text": "One of the biggest challenges I faced was practicing speaking. I was shy and afraid of making mistakes. But I knew",
        "textdich": ""
    },
    {
        "start": 182.959,
        "end": 190.959,
        "text": "that speaking was essential if I wanted to be fluent.",
        "textdich": ""
    },
    {
        "start": 188.8,
        "end": 201.12,
        "text": "So I started practicing in front of mirror. I would talk to myself in English, pretending to have conversations. This helped me become",
        "textdich": ""
    },
    {
        "start": 197.36,
        "end": 204.0,
        "text": "more comfortable with speaking.",
        "textdich": ""
    },
    {
        "start": 201.12,
        "end": 212.239,
        "text": "Learning a new language is not easy. And there were moments when I wanted to give up. But I reminded myself of my dream",
        "textdich": ""
    },
    {
        "start": 209.68,
        "end": 216.959,
        "text": "and the reason why I wanted to learn English.",
        "textdich": ""
    },
    {
        "start": 214.48,
        "end": 226.72,
        "text": "I also had the support of my family and friends. They encouraged me and celebrated my progress. no matter how small.",
        "textdich": ""
    },
    {
        "start": 224.56,
        "end": 235.44,
        "text": "One of the biggest challenges I faced was the fear of making mistakes. I was afraid that people would laugh at me or",
        "textdich": ""
    },
    {
        "start": 232.64,
        "end": 242.64,
        "text": "think I was not smart. But I realized that making mistakes is a part of learning.",
        "textdich": ""
    },
    {
        "start": 240.159,
        "end": 251.2,
        "text": "Mistake was a lesson and it helped me improve. I learned to laugh at mistakes and keep trying.",
        "textdich": ""
    },
    {
        "start": 248.4,
        "end": 256.079,
        "text": "I finally achieved my dream of speaking English fluently.",
        "textdich": ""
    },
    {
        "start": 254.08,
        "end": 266.56,
        "text": "I could have conversation with native speakers, read books without a dictionary and understand English stories without subtitles.",
        "textdich": ""
    },
    {
        "start": 264.16,
        "end": 275.04,
        "text": "It was a proud moment for me and it opened many doors. I got a scholarship to study abroad and I was able to travel",
        "textdich": ""
    },
    {
        "start": 272.56,
        "end": 277.04,
        "text": "and meet people from different cultures.",
        "textdich": ""
    },
    {
        "start": 275.04,
        "end": 281.759,
        "text": "English had truly become a part of my life.",
        "textdich": ""
    },
    {
        "start": 279.28,
        "end": 291.6,
        "text": "Even though I had achieved my goal, I knew that learning a language is a lifelong journey. There is always something new to learn. I continue to",
        "textdich": ""
    },
    {
        "start": 288.639,
        "end": 297.52,
        "text": "read, watch movies, and take courses to improve my English.",
        "textdich": ""
    },
    {
        "start": 294.88,
        "end": 304.479,
        "text": "I also help others who were learning English, sharing my experiences and tips.",
        "textdich": ""
    },
    {
        "start": 302.16,
        "end": 315.199,
        "text": "As I became more confident in my English skills, I started helping others who were learning the language. I volunteered to teach English at a local",
        "textdich": ""
    },
    {
        "start": 312.16,
        "end": 317.919,
        "text": "community center.",
        "textdich": ""
    },
    {
        "start": 315.199,
        "end": 324.8,
        "text": "It was a rewarding experience and it helped me reinforce my own knowledge.",
        "textdich": ""
    },
    {
        "start": 322.24,
        "end": 331.199,
        "text": "Teaching others made me realize how much I had learned and how far I had come.",
        "textdich": ""
    },
    {
        "start": 329.52,
        "end": 343.52,
        "text": "Learning English had a significant impact on my life. It opened up many opportunities that I wouldn't have had otherwise. I was able to apply for",
        "textdich": ""
    },
    {
        "start": 339.52,
        "end": 346.479,
        "text": "scholarships and study abroad.",
        "textdich": ""
    },
    {
        "start": 343.52,
        "end": 354.88,
        "text": "Conclusion: Learning English was one of the best decision I ever made. It was not an easy journey, but it was worth",
        "textdich": ""
    },
    {
        "start": 352.0,
        "end": 360.72,
        "text": "it. It taught me the value of hard work, perseverance, and determination.",
        "textdich": ""
    },
    {
        "start": 358.639,
        "end": 368.639,
        "text": "It also opened up a world of opportunities and allowed me to achieve my dreams.",
        "textdich": ""
    },
    {
        "start": 366.24,
        "end": 378.319,
        "text": "If I could give one piece of advice to anyone learning a new language, it would be to never give up. With patience and",
        "textdich": ""
    },
    {
        "start": 373.84,
        "end": 381.6,
        "text": "dedication, anything is possible.",
        "textdich": ""
    },
    {
        "start": 378.319,
        "end": 389.44,
        "text": "I hope my story inspires you to pursue your dreams, no matter how challenging they may seem. Learning English has",
        "textdich": ""
    },
    {
        "start": 386.319,
        "end": 397.12,
        "text": "enriched my life in many ways and I am confident it can do the same for you.",
        "textdich": ""
    },
    {
        "start": 394.319,
        "end": 402.639,
        "text": "Remember, every small step you take brings you closer to your goal. Keep learning and keep practicing.",
        "textdich": ""
    }
]